[{"company": "Gimmonix Technologies", "job": "Product manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": "Product managerWe Are GimmonixGimmonix is a veteran travel technology company at the forefront of solving some of the most complex challenges in the travel industry and hotel distribution. In the past years we’ve been focused on PLG and Network Effect centric solutions. We’re looking for a driven candidate to join our team as a product manager. As a global company, our teams operate from various locations combining hybrid and full-remote positions.Ideally, you are a self-starter, reformed developer and a natural leader, who enjoys orchestrating feature launches through team management. The Product Manager should also come with plenty of hands-on experience and take an active part in outlining, designing, and optimizing the various products being worked on in the department.Your responsibilities will includeWithin this role you will be responsible for a full cycle of product development of the platform and its supporting applications.Identify market needs and opportunities working with existing customers, prospects, and partnersPartner with R&D, Customer success, Sales, and other stakeholders to drive market adoption and revenue growthConsolidate, rationalize, and prioritize market requirements for product planning and roadmapsWrite PRD documents, flow charts and work on requirements delivery to engineering teamsCollaborate closely with engineering leaders and their teams through all stages of product developmentChampion the team, customers and partners around a cohesive product roadmapWhat you bring to teamBe a part of an innovative environment and impact the business growth of the companyHave led or participated in launch of new products and their market validation (PMF)Working knowledge of Travel APIs with emphasis on Hotel/Hospitality vertical3+ years working in Travel tech centric companies2+ years of product management experience in high complexity productAbility to manage feature development in fast-paced, agile environmentWell acknowledged with SDLC processes and Agile methodologiesFamiliarity with business issues, ability to quickly learn, and ability to be comfortable with ambiguity, unsolved problems, and uncertaintyExcellent oral and written communication, negotiation, and interpersonal skillsFluent EnglishTechnical experience with Data Infrastructure solutions with API based services - an advantage.Experience with PLG, PMF validation and Network Effects - an advantageTravel (EMEA) may be required for on site meeting with partners and customersJob Type: Full-timeיכולת לנסוע לעבודה באופן קבוע/לעבור לגור במקום אחר:Tel Aviv-Jaffa, מחוז תל אביב: להסתמך על נסיעות באופן קבוע או לעבור לגור במקום אחר לפני תחילת העבודה (נדרש)Show more Report"}, {"company": "Confidential", "job": "Director of Brand Management", "city": "Tel Aviv-Yafo", "date": "22d", "rating": "", "link": "", "description": "You’ll be managing the dedicated business unit managers with full ownership of P&L, drive the growth of the team and business and be responsible for developing, defining, and overseeing the store managers day to day activity. Main responsibility:Laed brand managers team and work cross functionally with multiple departments on product features and goals.Create and oversee store managers business KPI’s.Working with your brand managers to establish efficient and integrated workflows and working processes: monthly KPIs, inventory planning, strategic development of the brand etc.Inspiring, steering and developing your team a 360° point of view, this includes new product development, new channel launches, content & creative development, performance marketing and supply-chain & logistics optimizationScaling your brand(s) by driving profitable growth and developing expansion strategiesAnalyzing market trends and customer needs and defining product range development and extensionPartnering with internal/external stakeholders to develop a go-to-market strategy and facilitate successful product launches and international expansionAnalyzing PPC and other marketing campaigns; optimizing conversion, click-through-rate and advertising cost of saleEnsure all activities are in compliance with applicable rules, regulations, policies and proceduresAdditional responsibilities as requestedQualifications:5+ years of experience in a highly analytical role where you led a business unit, had P&L responsibility, engaged in strategic decision-making and drove revenue and margin growth (General Manager, Founder, Product Owner)Bachelor’s degree in Business, Marketing, or a related fieldEffective leadership and coaching skillsExcellent communication and relationship skillsDetail-oriented with strong analytical abilitiesExcellent mathematical, writing, verbal and computer skillsAbility to adapt to new tasks with little noticeStrong desire to winDeep understanding of project management and driving growth initiatives across multiple cross-functional teams such as marketing, content, supply chain and technologyDemonstrated ability to problem solve as well as create and execute growth / optimization initiatives through data-driven decision makingPositive energy, collaborative attitude, “no excuses, only solutions” mindset and ability to work comfortably in a diverse and international environmentAdvantage: Exposure to managing a portfolio of products or digital brands, preferably on Amazon or ShopifyJob Type: Full-timeSalary: 12,345.00₪ - 100,000.00₪ per monthAbility to commute/relocate:תל אביב -יפו, מחוז תל אביב: Reliably commute or planning to relocate before starting work (Preferred)Report"}, {"company": "Gimmonix Technologies", "job": "Head of Account Management", "city": "Tel Aviv-Yafo", "date": "27d", "rating": "", "link": "", "description": "Job DescriptionOur Growth team at Gimmonix takes our business and products across the world. The team delivers significant revenue making a direct and meaningful impact to Gimmonix’s bottom-line and customers. The Head of Account Management is responsible for leading the Account Managers and team, who nurture existing clients by attending their requests and proactively upselling and cross selling our Solutions.Your roleYou'll have global scope and will work closely with clients technology and product management teams to develop a coherent strategy that is aligned with our brand and clients ’ objectives.You will be the voice of the customer, advocating for clients' needs. leading clients growth within our Solutions, defining and establishing the methodology of account management lifecycle.Looking for someone who’s demonstrated: strong data-driven business decisions, great team leadership and tried ability to deliver results under strict timelines. Your initiatives will expand the breadth of business, identify and develop business opportunities; lead collaboration with partners; spearhead internal cross-functional project development; and deliver on financial goals.ResponsibilitiesLeading and nurshiring new opportunities with existing clientele base, and managing Account Management team in a variety of areas such as client satisfaction, client retention and churn prevention,, account management, leading enterprise client projectsEvaluate opportunities, prioritize initiatives that encourage and lead to client usage growth of our Solutions Develop a plan for improving customer experience and drive initiatives with clients to increase business; take care of all solutions within the company to increase the connections between our network of clients.Identify potential improvements in the solutions that will lead to a higher conversion rate.Empower your team to incubate benefits that increase customer demand, are exciting for their customersDefine team and individual KPIs in the line with targetsUse data to identify, evaluate, and manage strategic business opportunities with significant potential incremental revenueOngoing communication of business performance and team progress on initiativesCo-develop a strategy with each supplier and stay aligned on goals, initiatives and targets to strengthen our external relationshipsCollaborate closely with product management, Customer support, Business Development and marketing teams .Lead deal development including prospecting, negotiating, and project development with current clients.Skills and Qualifications5-7 Years of Sales/Account Management experience in the travel industry with at least 2 years leading a team.Experience building a business from scratchExperience with travel technologyNative or close-to-native Hebrew and fluent English knowledge on a business levelExperience in an analytical role in an ecommerce, technology company, consulting, or product management preferredExtensive experience in identifying and prioritizing high-impact improvement opportunitiesExcellent communication, influencing and relationship building skillsDemonstrated ability to work through complex business problems and partner with internal clients with a consultative approach.Strong analytical/modeling skills with ability to convert raw data into actionable business insightsExcellent verbal, written and data visualization skills are a must-have.Ability to communicate in a clear and effective mannerAbility to prioritize among conflicting demands in a fluid environmentAbility to commute/relocate:Tel Aviv-Jaffa, מחוז תל אביב: Reliably commute or planning to relocate before starting work (Required)Show more Report"}, {"company": "LANDMARK COMPANIES LLC", "job": "Equity & Debt Real Estate Professional", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": "Job Description· Evaluating new investment opportunities, including funds, institutional investors, private investors and direct investments to companies’ projects· Performing due diligence evaluations of potential partners, lenders, funds, and private investors· Performing industry research, including competitor analysis for improvement company’s portfolio· Evaluate new opportunities by reviewing offering memoranda for new funds and participating in external manager meetings· Assisting company’s portfolio with business development, future funding and other strategic initiatives by raising equity· Conducting market analysis and equity opportunity identification via academic research, customer interviews, conferences, incubators· Assist in the underwriting of co-investment opportunities, including working with financial models, evaluating commercial diligence materials, engaging with industry experts· Support the team’s market mapping, initial screening and subsequent deep due diligence of potential investments· Support development of diligence materials, valuation/exit models, and Investment Memo/Scorecard to assess market sizing, talent assessment, product-market fit, key metrics/financials, capital structure, valuation modeling and exit scenarios, risks, etc.· Liaise with team members to support diligence and support the Associate team to complete the investment process· Support company’s portfolio around product strategy, talent sourcing, business development, regional market and global expansion and support for future financing· Help gather and manage portfolio performance, metrics, and financials on a Quarterly basis· Support capital raising for the firm and company’s portfolio follow-on round growth financingsDesired Skills and Experience:· 2-4 years of previous work experience, ideally with a background in venture capital, private equity, investment banking, and/or FinTech operating roles.· Strong Excel modeling and PowerPoint presentation development skills· Alignment with Fin’s values in working in collaborative teams, high integrity, merit-driven and no ego/entitlement.· B.A. or B.S. in related fieldsPay: From 25,000.00₪ per monthAbility to commute/relocate:Tel Aviv-Jaffa, מחוז תל אביב: Reliably commute or planning to relocate before starting work (Required)Show more Report"}, {"company": "Pfizer", "job": "Pharmaceutical Health Representative CV - Internal Medicine", "city": "Herzliya", "date": "24h", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_940e0573&cb=1678900349831&jobListingId=1008528444530&jrtk=3-1-1grj44ipmgahm801-1grj3ulg5gsp0800-1268c2f76e5a085a-", "description": "Pfizer Israel is looking for a Talented and Motivated Pharmaceutical Health Representative.\nIsrael (Jerusalem area)\nContract Type: Permanent\nRole summary\nThe Pharmaceutical Health Representative is responsible for calling on practicing physicians, hospitals, managed care (kupot) and other health-related organizations/personnel within an assigned territory. He / She must provide the most current information pertaining to Pfizer Israel products and their approved indications in a manner which will ensure the appropriate use of these products and achieve the business potential of the territory. Accomplishment of these goals must comply with the terms and conditions outlined in the Representatives Pledge of Ethics, Pfizer’s Policy on Business Conduct as well as sampling policies.\nRole responsibilities\nInvest time and effort to achieve the established goals for the territory such as sales, market share, doctor calls, etc.\nDemonstrate extensive product knowledge and excellent Selling skills\nAbility to work in a cross functional team, high coordination and communication abilities\nMaintain the required technical expertise including competitive product knowledge and computer capabilities\nEnsure clear concise and accurate communication of product information using proper medical terminology\nPlan and organize daily sales call activities to optimize the use of time and maximize the achievement of sales and market share objectives\nPrepare, analyze and send sales/patients scanning monthly reports (as requested by DM) in his/her territory\nRecognize changes in the work environment, develop and implement alternative plans to achieve objectives, modify call plan/business plan activities accordingly\nDemonstrate persistence to accomplish objectives despite disappointments and/or rejection of original efforts\nMake daily decisions based on logical and factual information after weighing alternatives and their consequences\nCreate and maintain a positive impression with customers\nProject a professional image as demonstrated by neat physical appearance and appropriate manner of speech\nMaintain timely communication with supervisor and other members of the sales team\nFully comply with the terms and conditions prescribed in the Sales Representatives\nQualifications\nUndergraduate degree or equivalent in science, medicine or pharmacy\nFluent in Hebrew. Working knowledge of English.\nAt least three years sales experience in the pharmaceutical sector (working with Cardiologists- advantage)\nMedical background\nStrong communication and presentation skills\nHigh self-learning ability\nExcellent PC Skills\nAbility to work within an international environment.\nResults driven\nStrong planning and prioritizing skills\nFlexible Competitive\nSelf-motivated\nReliable\nHigh ethical standards\nTeam player\nOther Info\nRequired Driving license\nPurpose\nBreakthroughs that change patients' lives... At Pfizer we are a patient centric company, guided by our four values: courage, joy, equity and excellence. Our breakthrough culture lends itself to our dedication to transforming millions of lives.\nDigital Transformation Strategy\nOne bold way we are achieving our purpose is through our company wide digital transformation strategy. We are leading the way in adopting new data, modelling and automated solutions to further digitize and accelerate drug discovery and development with the aim of enhancing health outcomes and the patient experience.\nFlexibility\nWe aim to create a trusting, flexible workplace culture which encourages employees to achieve work life harmony, attracts talent and enables everyone to be their best working self. Let’s start the conversation!\nEqual Employment Opportunity\nWe believe that a diverse and inclusive workforce is crucial to building a successful business. As an employer, Pfizer is committed to celebrating this, in all its forms – allowing for us to be as diverse as the patients and communities we serve. Together, we continue to build a culture that encourages, supports and empowers our employees.\nSales\n#LI-PFEReport"}, {"company": "United Nations", "job": "FIELD PROGRAMME SUPPORT OFFICER", "city": "Jerusalem", "date": "24h", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=106&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_94e84171&cb=1678900350916&jobListingId=1008530652409&jrtk=3-1-1grj44js32i79001-1grj3ulg5gsp0800-0e6056645ab2e917-", "description": "UNRWA, the largest United Nations operation in the Middle East with over 30,000 staff working across five areas of operation, is looking for highly committed personnel wishing to make a change.\n\nIf you are looking for a rewarding opportunity to make a tangible difference for one of the most vulnerable communities in the world, UNRWA would like to hear from you.\n\nThe Field Programme Support Officer reports to the Deputy Director of UNRWA Affairs (Programmes), or Deputy Director of UNRWA Affairs (Operations), as applicable; and to Chief, Evaluation Division for technical guidance on evaluation activities.\nResponsibilities\n- Supports programme, project and emergency appeal planning processes and provides input, within the context of relevant Agency strategic planning frameworks, into field level strategic plans and annual operational plans; builds Field capacity to assess, deliver, monitor, report on and evaluate Field interventions.\n\nManages the application of Programme Cycle Management (PCM) in his/her respective field; provides support to Programme Chiefs in carrying out all phases of PCM with due focus on project management; facilitates results-based programme plans built on evidence from evaluations and assessments and using theories of change and logical frameworks; incorporates efficient use of inputs, outcome, output and activity indicators; oversees the reporting and analysis of results data through the Agency Results Based Monitoring system, contributing to quarterly Field level management reviews, semi-annual Agency-wide results reviews and annual Agency-wide and Field specific results reporting.\nAssists the DDUA/P or DDUA/O in coordination of all programmes in the field, including health, education, relief and social services and microfinance, through an integrated and cohesive programme management framework.\nProvides guidance to the Field Office to enhance quality of project design and management and ensure effective results through capacity and skill development; manages PCM and other training courses.\nIntegrates cross-cutting themes (gender, protection, livelihoods social inclusion) with field-specific programme planning process.\nManages decentralized evaluations at the field level and supports centralized evaluations Agency-wide.\nCompetencies\nUN Core Values of Integrity, Professionalism and Respect for Diversity, and Core Competencies of Communication, Working with People and Drive for Results apply by default. Default managerial competencies may apply.\n\nCreating and InnovatingRelating and NetworkingPlanning and OrganizingFormulating Strategies and ConceptsDelivering results\nFor guidance on how to prepare for competency-based interviews: https://careers.un.org/lbw/home.aspx?viewtype=AYI\nEducation\nAdvanced university degree (Master’s or equivalent) from an accredited educational institution in programme management, public or business administration, social sciences, or a related discipline.\nWork Experience\nAt least eight years of progressively responsible and relevant experience in programme or project management, results-based management of humanitarian and development assistance programmes and monitoring and evaluation is required.\n\nA minimum of four years of relevant international work experience at a senior level is required.\n\nunless already serving as an international staff member in the UN Common System, at least two continuous years of relevant international experience outside UNRWA, and outside the country(s) of citizenship is required.\nLanguages\nExcellent command of written and spoken English is required.\nAssessment\nEvaluation of qualified candidates may include an assessment exercise which may be followed by competency-based interview.\nSpecial Notice\nType of Contract and duration: 2 years, with the possibility of further extension.\n\nThe duty station is Jerusalem, working for the West Bank Field Office.\n\nThe incumbent may be required to travel to UNRWA area of operations.\n\nApplicants have to complete the Personal History Profile (PHP) in inspira in order to be considered. The PHP should be completed with full relevant work experience as per the requirements in the Job Opening, in order to be considered.\n\nA roster may be created from the selection exercise, and successful candidates may become eligible for an appointment to the same post or a similar post.\n\nUNRWA welcomes applications from qualified candidates with disabilities.\n\nEquivalency:\nA first level university degree in combination with two additional years of qualifying experience may be accepted in lieu of an advanced university degree.\nNB: Work experience alone or formal qualifications with no relevant work experience are not considered an acceptable combination.\n\nUNRWA is funded almost entirely by voluntary contributions from UN member states, regional bodies, business foundations and individual contributions. The mission of UNRWA is to help Palestine refugees achieve their full potential in human development under the difficult circumstances in which they live.\n\nFor more details on UNRWA, please visit: https://www.unrwa.org/\nUnited Nations Considerations\nStaff members are subject to the authority of the Commissioner-General of UNRWA and to assignment by him or her.\n\n\nUNRWA is committed to achieving gender parity at all levels of staffing under the current UN-wide gender agenda and strongly encourages applications from qualified applicants from under-represented groups.\n\nAt UNRWA, the paramount consideration in the recruitment and employment of staff is the necessity of securing the highest standards of efficiency, competence and integrity, with due regard to geographic diversity. All employment decisions are made on the basis of qualifications and organizational needs. UNRWA is committed to creating a diverse and inclusive environment of mutual respect. Reasonable accommodation for applicants with disabilities may be provided to support participation in the recruitment process when requested and indicated in the application.\n\nUNRWA Considerations\n\nUNRWA staff are expected to uphold the highest standards of efficiency, competence, neutrality, impartiality and integrity. This includes respect for and commitment to human rights, diversity and non-violent means of dealing with all kinds of conflict. Only persons who fully and unconditionally commit to these values should consider applying for UNRWA jobs. Candidates will not be considered for employment with UNRWA if they have committed violations of international human rights law, violations of international humanitarian law, sexual exploitation, sexual abuse, or sexual harassment, or if there are reasonable grounds to believe that they have been involved in the commission of any of these acts. Candidates who have committed crimes other than minor traffic offences may not be considered for employment. The Agency may disqualify applicants who have separated for reason of misconduct, who left a UN Agency while misconduct processes were pending, or who appear on the UN Sanctions List.\nUNRWA is a non-smoking work environment.\n\nApplicants are urged to follow carefully all instructions available in the online recruitment platform, inspira. For more detailed guidance, applicants may refer to the Manual for the Applicant, which can be accessed by clicking on “Manuals” hyper-link on the upper right side of the inspira account-holder homepage.\n\nThe evaluation of applicants will be conducted on the basis of the information submitted in the application according to the evaluation criteria of the job opening and the applicable internal legislations of the United Nations including the Charter of the United Nations, resolutions of the General Assembly, the Staff Regulations and Rules, administrative issuances and guidelines. Applicants must provide complete and accurate information pertaining to their personal profile and qualifications according to the instructions provided in inspira to be considered for the current job opening. No amendment, addition, deletion, revision or modification shall be made to applications that have been submitted. Candidates under serious consideration for selection will be subject to reference checks to verify the information provided in the application.\n\nJob openings advertised on the Careers Portal will be removed at 11:59 p.m. (New York time) on the deadline date.Show more Report"}, {"company": "Roche", "job": "Head of Operations - Roche Diagnostics Israel", "city": "Hod HaSharon", "date": "1 day ago", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=107&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_35a07fc8&cb=1678900352602&jobListingId=1008526402321&jrtk=3-1-1grj44lg0k633801-1grj3ulg5gsp0800-c1b1c01c93cfe940-", "description": "The Position\nHead of Operations\nAre you driving by purpose, looking for an innovative, agile working environment in the healthcare sector with an impact on the society and patients? Then you have come to the right place!\nWho we are:\nRoche is ranked among the world's foremost corporations providing innovative healthcare solutions, continuously investing in medical research and development.\nAt Roche, more than 100,000 people across 100 countries are pushing back the frontiers of healthcare. Working together, we’ve become one of the world’s leading research-focused healthcare groups. Our success is built on innovation, curiosity and diversity.\nRoche is an Equal Opportunity Employer.\nThe position is for 3 years.\nROLE\nDirectly reporting to the Country Manager of Roche Diagnostics Israel, this role will be located in Hod Hasharon, Israel, and will undertake the responsibility to manage a team of approx. 8-10 employees covering Order Management, Supply Chain, Customer experience, Quality and Regulatory.\nMember of the local Leadership Team, you will drive the affiliate’s results, influencing and aligning the organization towards key initiatives, in order to reach the financial and strategic business goals of delivering patient care in Israel.\nYou will lead the teams by empowering them through agile ways of working to leverage the voice of customers.\nYou will inspire your teams to be true business partners, to go beyond the core role into cross-functional collaboration, learning and adjusting, to enable true value creation; all these while working on business processes optimization to simplify & gain efficiencies through digitalization and automation of processes.\nRESPONSIBILITIES\nResponsible together with the Country Manager for the achievement of operational profitability compatible with or in excess of company objectives.\nGuaranteeing the proper level of inventories in the Country;\nManaging the operations with the 3PL and the efficiency of customer service;\nComply and apply all quality regulations and procedures from local and global perspective;\nManage and provide metrics to improve the quality of customer service, from order taking to post market surveys;\nProperly anticipate demands, partner with customers and automate interactions between our system and the customers communication systems;\nResponsible to manage a team with high quality service by providing first level customer support for invoices, proof of deliveries and other activities;\nProvide all necessary financial insights to the Sales and Marketing teams to support adequate decision making incl. ethical business behavior and compliance.\nProvide controlling service to the organization based on financial guidelines from regional/global organization and local regulations.\n Co-own business decisions from the finance side, monitoring the results through genuine business collaborating.\nLead the local Operations organization toward embracing and implementing agile principles.\nManage the performance, development & succession of the department according to Roche practices/values.\nYOUR PROFILE\nRelevant operation experience of 7+ years in a global matrix organization, with proven abilities to inspire the team toward embracing change, challenging ways of working and improving business processes.\nPost graduate education, preferably a Master Degree with major in BA/Management, Finance or Marketing or relevant certification (e.g. CFA/CPA) is a plus\nSomeone driven by purpose, looking for an innovative, agile working environment in the healthcare sector with an impact on society and patients!\nSomeone who is passionate about finance, people development and business partnering, while having a customer-centric approach.\nPositive mindset and focused on value adding activities, around the customer journey.\nProven desire and ability to work in an agile organization, embracing and leading change and new ways of working.\nSelf-driven and open-minded person of high integrity, with excellent interpersonal skills, paired with strong analytical mindset and a solution & result oriented attitude.\nAbility to easily manage complex situations and provide clarity.\nLeadership abilities; previous people management experience is a must, as well as experience in leading teams in a matrix / agile organization.\nExperience working cross functionally in international environments, able to connect quickly to other ‘geographies’ and to make use of the network’s best practices.\nFluency in English and Hebrew\nWho we are\nAt Roche, more than 100,000 people across 100 countries are pushing back the frontiers of healthcare. Working together, we’ve become one of the world’s leading research-focused healthcare groups. Our success is built on innovation, curiosity and diversity.\nRoche is an Equal Opportunity Employer.Show more Report"}, {"company": "Apiiro", "job": "Employee Experience Manager", "city": "Tel Aviv-Yafo", "date": "3d", "rating": "4.9", "link": "", "description": "What we're about\n\nWe're an experienced and diverse team focused on solving one of the biggest challenges CIOs and CISOs have - allowing development teams to move fast without compromising on security controls and risk management. We're looking for smart and fun people to join us and make a significant part in shaping out technology, product, and culture.\n\nWhat you're About\n\nFirst and foremost, you LOVE people.\n\nYou are passionate about creating an outstanding Employee Experience and you know how to put our employees' well-being first! You are super creative and a great team player with excellent interpersonal and communication skills (both Hebrew and English).\n\nYou have been leading global employee experience programs in Hi-tech companies for at least 5 years. You pay attention to the smallest details and love seeing the bigger picture. You enjoy collaborating with different stakeholders across the organization and always come with a positive can-do attitude.\n\nYou are an experienced event producer, whether it's parties, trips, or international kickoffs. You know how to create the greatest swag and presents that will put a smile on every team member's face.\n\nYou have the ability to manage projects in an organized manner, prioritize tasks, and efficiently harness various resources.\n\nBeing a social media ninja is a huge advantage for us\n\n\nWhat you will do\n\nYour role focuses on managing, promoting and implementing our unique culture globally while supporting the full employee lifecycle & experience, through in-person as well as virtual events and experiences.\nYou will plan, manage and lead yearly global experience plans, including all employee experience activities in the company, starting from the onboarding process, happy hours, company celebrations, employee milestones, holidays and basically every get together at Apiiro!\nYou will play an instrumental role in employees' well- being throughout their life cycle in the company\nOversee and execute on internal communication to insure that our culture and motivation continues to drive business success\nYou will partner with cross functional teams to create and manage our employer branding, while fostering effective work relationships.\nYou will create, manage and control your domain's budget, and analyze budget vs. actual controls.Show more Report"}, {"company": "DoorLoop", "job": "Senior Data Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=109&ao=1110586&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_79283b22&cb=1678900355663&jobListingId=1008440987692&cpc=14D5209370AEC984&jrtk=3-1-1grj44ogdk6eo801-1grj3ulg5gsp0800-54ca41fb4a28cc75--6NYlbfkN0Bg8kaLZpGmonnt516iCDBz1BXXYWwUs3o81vaiU99V9TLG472jvwa0fELsyMFCbJIwFfNgDGDlDNBAZocAjRsGInWfsqI9DliyMkOIGBt6VFBNKJzzVXp24PE5wDbwrWxBpc4fD0-ClI7yXJVx1azSBMNPQwI6rbbkQ0RxWJ8tAPxpRQmsfPPhcGDSxMc-9L5XEzfkuk1nVPY7VfhdyHfbbXb57F1N13EkcmwIBW39vtwmm0JHPbNECWf4hO79fPT3OguhVJCzya18Y_wfXnA5iCYXtIdhytLyvL3qnJ73xFBDTk9HHZnm-asEkvgKv6prc136ZYEM7ZAKAr7A-5gjfz1XzWkUYFJgkYjGa3HYg7onQB_3XqmoiOuZWVEzW7aLrAAJP4sSynH4EcQ-BB8oAaM_fuSITm_gHC1buTGwz7YN4orfC8vzoWmERfBb_-1y_p3FmlX2qohgwejOPf25xfdcv9t7OQe7cJ12aXD1dOp6PJv4klFAUqJsf9eNt79dMwfMWzgmnSs3KzM5l5vDDUqOnPvGQkxUNilhdzWNvmIm60qbsPmEfodDYq9DU9IghhQYnh4ad4fD4wY3U-Q9cunTHKSRSdR3EYxhBVN26A%3D%3D", "description": "About DoorLoopCertified as a Great Place to Work®, DoorLoop is a property management software used by landlords and property managers in over 100 countries.As a software company with $30M in funding, 3 offices worldwide (Miami, London, Israel), and tens of thousands of units being managed, we are one of the fastest growing tech companies.If you want to work with a team that values transparency, feedback, and growth, DoorLoop is for you.The RoleWe are looking for a super talented Senior Data Analyst to join our team in Tel-Aviv. If you are excited about what you are about to read, we invite you to apply!We are looking for someone who has a good understanding of relational databases, hands-on experience in SQL and/or Python, and data visualization tools such as Tableau and Power BI. You will be working closely with the product, marketing, customer success, and engineering teams, to improve conversions, LTV, churn, product A/B tests, and more. You will collect and analyze the data and help answer the toughest issues each team is facing in order to drive insights..Some additional qualities about you and this role:You will identify, analyze, and interpret trends or patterns in complex data sets to drive actionable insights.You will define and implement KPIs across different teams: product, business, marketing, and customer success.You will implement product features, measure their performance, and provide recommendations.Gain a deeper understanding of how customers use our product, and advise us on how to improve.You will translate product/business requirements, and create a clear visualization which \"tells the story\" using a BI tool or other platformQualifications & Requirements4+ years of experience as a Data/Business Analyst.B.S in one of the following: Industrial Engineering, Statistics, Mathematics, Economics, or a related field.An ability to understand complex business models and simplifyExperience in product analysis including working with BI events and performing A/B tests.High level of SQL is a must.Experience in BI visualization tools such as Tableau, Amplitude, or similar and performing A/B tests.Experience in data modeling, ETL development, and data warehousingTeam player, effective interpersonal skills, and good vibes. Ability to manage relationships with key partners and the ability to work independently.Experience in a fast-paced, dynamic work environment.Bonus PointsExperience in Python is a plus, but not a must.Experience working with Salesforce is a plus, but not a must.Benefits & PerksUnlimited paid time off with unlimited personal, vacation, and sick days.Annual company retreat in the US with our Miami team (all expenses paid).Career development with unlimited access to Udemy's courses and other growth opportunities.Monthly investment classes from our co-founders on how to invest your money in a diversified portfolio of real estate, stocks, crypto, NFT, & more.No micromanagement - We believe responsible people thrive on freedom.Great equipment - Ergonomic chairs, Mac or PC laptops, dual monitors, standup desks, and more.No rules - No dress code, policies, or handbooks. Just do great work & have fun!Job Type: Full-timeAbility to commute/relocate:תל אביב -יפו, מחוז תל אביב: Reliably commute or planning to relocate before starting work (Required)Show more Report"}, {"company": "lusha", "job": "Business Development Representative TLV", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=110&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_cdd69967&cb=1678900357694&jobListingId=1008343100065&jrtk=3-1-1grj44qffkblv801-1grj3ulg5gsp0800-a3efbc56254488a8-", "description": "Description\nWe’re looking for a Business Development Representative (BDR) to join our Sales Team to work towards our collective goal to empower businesses to succeed through data. The BDR will play a critical role in nurturing users of the Lusha platform, engaging and qualifying outbound sales inquiries and generating a consistent pipeline. The BDR manages the first touchpoint of the sale, and sets the tone for the sales cycle. We’re interested in hiring entrepreneurial team players who thrive in an environment where hustle, growth and authenticity are valued. If this sounds like your dream job and you’re looking to grow while pushing your boundaries in a dynamic environment, Lusha is the place for you.\nYou will:\nProactively reach out to users of the Lusha platform on an outbound basis to nurture, drive adoption, and qualify sales opportunities.\nWork closely with the Account Executive team to devise account strategy.\nDemonstrate the value of Lusha offerings through phone calls, email, LinkedIn, and other social mediums.\nAct as the subject matter expert on Lusha product offerings.\nSet walk-through sessions and demos for the Lusha sales team when a lead reaches a qualified stage.\nYou are:\nWilling to go the extra mile: Bring a memorable experience and extraordinary value to your clients.\nPassionate about making an impact: Do what you do with passion, think about the sale and what’s the best for it.\nSelf-motivated, proactive and entrepreneurial: We work in a fast-paced environment, with agile methodologies where you will be challenged every day to bring the best solution for your customers and think of new solutions.\nGreat communicator: The role requires capabilities to explain in different ways the same solution to different people .\nA storyteller - Stories constitute the single most powerful weapon in a salesperson’s arsenal.\nReady, able and willing to receive feedback: The BDR has tremendous growth potential and should be coachable and eager to learn.\nWhat do you bring to the table?\nIntellectual curiosity to understand customer pain points and needs.\nStrong and professional communication skills - written, verbal, presentation.\nAbility to persuade, lead, and confidently handle objections.\nStrong sense of urgency for reaching goals and key deliverables.\nSelf-starter mentality: act without being told what to do. Brings new ideas to the company.\nFlexibility - things change around here. FAST.\nHigh integrity, energy, and dedication.\nWhy Lusha?\nLusha connects you to your most relevant potential customers by creating simple, self-served products that provide access to meaningful and insightful B2B data. We offer ways to leverage data as an enabler for better, smarter and faster conversions at every stage of the customer lifecycle. Lusha was named Top 100 G2 Best Software Company and Top 100 Fastest-Growing product in 2020. Based in the center of Tel Aviv, Israel, Lusha is a fast-growing startup that offers its 300+ employees the opportunity to take an active role in shaping the future of the company. As one of our first hires at the US HQ in Boston, MA, you will be a founding member of the sales team, working with teammates across the globe. While all of us are dedicated to that mission, we surely know how to have a good time.\nOn the people's side, we believe in creating a caring and fun environment where our employees can be individuals and at the same time, belong to something bigger – the Lushian family. Because ultimately, that’s the key to driving growth for our employees, our company, and our customers. So, if you are customer & impact-focused, thrive in a fast-paced environment, and love working in a place that doesn’t really feel like work, this is your opportunity to become a Lushian and feel the vibes.Report"}, {"company": "Deloitte", "job": "Marketing and Business Development Marketer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=111&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0ef68246&cb=1678900366035&jobListingId=1008212208645&jrtk=3-1-1grj452kkklu4801-1grj3ulg5gsp0800-f1abb0cdcefcf7b3-", "description": "Description\n\nDeloitte Marketing and Business Development team is hiring for a unique role and searching for a talented marketer to support Deloitte technological businesses!\n\nAbout the role:\n\n Work with senior executives on marketing strategy, plans, and execution\n Create marketing content, including communications, newsletters, posts, and more (English and Hebrew)\n Plan and lead marketing projects, including events, webinars, roundtables, workshops, and more\n Build, foster, and scale meaningful relationships with leading Israeli players\n Create business development materials including client proposals, department eminence, marketing presentations, and more\n\nRequirements\n 2-3 years of experience working in a marketing role (advantage working in technologic companies)\n Experience in marketing positions at B2B companies (advantage)\n Bachelor's degree / educational background in a relevant field\n Excellent verbal and written communication skills in English and Hebrew (Fluency in both required)\n Exceptional organizational and multi-tasking capabilities\n High level of professionalism and ability to work with senior executives\n Team player with great interpersonal skills\n Proficiency in Excel, PowerPoint, and other Microsoft applications\n\nAt Deloitte, we believe that an inclusive mindset and diverse workforce are two of our greatest competitive strengths. That’s why we continue to reinforce our commitment to foster inclusionShow more Report"}, {"company": "Nexar", "job": "Technical Product Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": "Nexar is building the first over-the-top vehicle-to-vehicle network on the planet, to predict and prevent collisions. We use AI, machine vision, sensor fusion, real-time networking, and quite a few other buzzwords, to create a new, delightful, and really safe, driving experience, powered by your smartphone, with the potential of saving the 1,300,000 people who die on the road every year.On the way, we capture and understand driving the world’s roads probably better than anyone else, with drivers from dozens of countries using Nexar for their commute or as part of their job. Nexar offers its business partners data applications providing insights from the road by leveraging the knowledge extracted by performing deep analytics through deep learning at an extremely large scale (with billions of images captured per week). Nexar’s network provides crowd-sourced intelligence of how the road the world around the road looks like and how it’s changing day to day.We are looking for a talented, experienced Technical Product Manager to own and lead the full lifecycle of data applications, and the underlying data platform that powers these data applications for our automotive OEM partners.In this role, you will partner closely with engineers, designers, business leaders and our customers - to execute and deliver on Nexar’s product strategy, through entrepreneurial thinking, professionalism, teamwork, constant learning, and an appetite for success.ResponsibilitiesTechnical Product Management - Ideating, launching and iterating on Nexar’s data applications and data platform.Customer Development - Collecting, managing and responding to feedback; participating in discussions in key customer accounts; working closely with the sales and marketing teams to better understand applicability.Customer Research - Participating/guiding customer research on new areas of exploration; collecting data about our competitor’s capabilities; developing an informed point of view in regards to technology trends.Product Definition - Working very closely with engineering, research and testing teams in order to document user stories and precisely define capabilities; prioritising stories and maintaining a roadmap.Experimentation - Developing, testing and measuring hypotheses.Process Improvement - Actively implementing new ways to improve the products and processes at our growing companyRequirementsProven technical product management experience in a related B2B field, either enterprise software, packaged software, SaaS or on-demand.Track record of ownership and results, from inception to ongoing research and support, including roadmap prioritisation and delivery.Analytical understanding of business considerations and competitive landscape.Deep understanding of the technical trade-offs, architecture and unit economics of complex products and platforms, especially at a very large scale of data processing (comfortable thinking in Petabytes).Experience defining effective technical capabilities into products or solutions to address customer needs.Experience developing human-facing B2B products in areas of mobility, automotive, and mapping.Experience creating and maintaining a developer program and a family of APIs.A creative, flexible thinker - with a sense of structure. Comfortable with being out of your comfort zone.Ideally with a degree in computer science, electrical engineering or a related field.Curious. Energetic. Excellent communicator. Opinionated. Never violent.Things move fast and change fast. Keep up.Job Type: Full-timeSalary: Up to 45,000.00₪ per monthShow more Report"}, {"company": "NetHR", "job": "Business development", "city": "Raanana", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=1110586&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f79213ff&cb=1678900370157&jobListingId=1008430216898&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj456jbmfqk801-1grj3ulg5gsp0800-4fa53282caf64f7b--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNAZH0JiOdG3yc4INQKmbs5T8ANjfD1dgenyiYhglfWtyKD6dqMnHeS5MfFPZB-nsUYhuse64s3HCgb4RCgFkoTDr2oBvQ7QyZEUcdFJs9EyHuNtPABHoahqAzNlYgnYuRzMQdE8L1Txeck3WJqe2UXxCQ8VXY_J8HeL_1Zq4dBLdhb6YHkyCOvROje1PWNcJ5_HbCWgHSWDVvVhnrybGNHkhXX-rL_9PdxIKpZwdKXS4TiXEI5hmmog0xXnuzVm8qVif1PNdZlmrdCqYCDYi0AdyGbYlbm1tbcFeCgtOLWU1_wBDwtkrYrFqdlQGqL-RhakZw1GaNje9mRD3OqTb0xHwZw6lQXwvnPU0P3Vp9nJCTs48mkKFsrjDW4cIc726fa06BYD3WGPqv63kwIbey3GDTIFH-f3rCDzC_5bwV0gUzTtw9kcBf_UORF8ALcASi_UgN76rnyg6sKk2GWiWoHYn5auU3sELns0veHnD1_W25TVb-Gpa4IqgepZxm3JGMLW_JU7B-CfTufeK6kQOB-lmOiNHtJdlMWkvOwzYvBy1DgAUOg6djWb6dXkjv2VWa33ou2Yl3zNoL_ylIlD0SDFFe2Y5dXxrg4DoHFUhjABkB853ZXxo3wgPUKuDeaxKyxV7DmYMlvrqwjSdFUxI1GX-NQVlNXUgaw%3D", "description": "חברת תקשורת בינלאומית מחפשת Bizdev לתפקיד מול שווקי מזרח אירופה ואפריקה ניסיון בתפקיד בכיר בעולם הטלקום- חובה ניסיון במכירות והוצאה לפועל של תוכניות – חובהShow more Report"}, {"company": "Munters", "job": "Head of CS & Support", "city": "Petah Tikva", "date": "7d", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=114&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c4b222bd&cb=1678900371336&jobListingId=1008514612393&jrtk=3-1-1grj457ot2dhb001-1grj3ulg5gsp0800-c7630227c753715e-", "description": "Did you know that we facilitate over half of the world’s lithium battery production? And that 1 out of 7 meals worldwide have been produced in facilities equipped with our climate control? Munters has been a pioneer of sustainable air treatment solutions since 1955. Today our technology is more relevant than ever and is mission-critical for the production of medicine to the running of data centers. Together we work to support our customers in creating a healthier planet. Come work for us and be a part of this exciting journey.\nGlobal Service & Customer Success Manager\nJob Description:\nSet up and lead the Munters Global Service Division. Build global teams of customer support specialists and processes to ensure clients receive assistance with the technical aspects of products or services.\nDevelop and implement customer support processes in MIS and in the business units to increase customer satisfaction.\nAssess support statistics and prepare detailed reports on the findings in cooperation with regional local teams.\nDefine, along with the business units, how many service technicians are required and be responsible for their training.\nAid in product design and product development.\nRun product demonstrations both on customers’ sites and remotely.\nDrive digitalization internally in Customer Support.\nImplement training resources, assets, and abilities to the new global service structure.\nBridge the gap between sales, customer support, and customers.\nEnsure customers get fast time-to-value.\nAnalyze customer data to improve customer experience.\nBuild customer loyalty and reduce churn.\nImprove onboarding processes.\nEvaluate and improve tutorials and other communication infrastructure.\nHandle and resolve customer requests and complaints.\nResponsibilities:\nService business experience with digital transportation background.\nIn depth understanding of running Service & Customer Success remotely (digitally).\nExperience with providing standard services (installation & commissioning).\nExperience working in a global industry, understanding of global markets, customer behavior and expectations.\nVery driven, and not afraid of driving a transformation (build up a new way of working).\nFlexible, open minded, someone who is able to identify service disruptions and work closely with existing team to ensure the availability of products and services.\nQualifications:\nB.A degree in a relevant field\nAt least 10 years of relevant work experience\nExcellent written and verbal communication skills\nAbility to multi-task, organize, and prioritize work\nFluent in English\nHow is it working at Munters? Meet your future colleagues.Report"}, {"company": "MultiPass", "job": "Business Development Manager (Israel)", "city": "Israel", "date": "9d", "rating": "3.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=115&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d5c88f50&cb=1678900372494&jobListingId=1008511642736&jrtk=3-1-1grj458tlmfr0801-1grj3ulg5gsp0800-4f77a76a033b82f3-", "description": "As our customer numbers continue to grow, we are looking for a Business Development Manager based in Israel. We expect you to know the Israeli financial market like the back of your hand and understand the needs of local companies with cross-border business activity.\n\nYou’ll be tasked with establishing and strengthening relationships with new customers and building a network of partners locally.\n\nResponsibilities:\n\nPromoting MultiPass offering to potential customers and other financial institutions;\nSeeking out and winning new customer relationships to drive revenue and margin growth;\nIdentifying new opportunities for growth;\nExecuting a plan based on the existing strategy, tailoring and refining it to convert prospects to customers;\nParticipating in conferences / expos on behalf of MultiPass.\n\nRequirements:\n\nProven track record of business-2-business sales the designated geographical area;\nStrong payments/banking industry background with an understanding of the payments ecosystem;\nExperience across the industry;\nFocus on new business development rather than account management;\nAccountability mindset;\nFlexibility for international travel.\nBenefits:\n\nFlexible working hours with great work-life balance;\nCompetitive compensation package including performance-related bonuses;\nA perfect environment for professional growth and opportunities;\nA friendly team of internationally based colleagues.Report"}, {"company": "VMware", "job": "Senior Success 360 (S360) Customer Success Manager - Opportunity for Working Remotely , Jerusalem", "city": "Jerusalem", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6c113733&cb=1678900374271&jobListingId=1008447390448&jrtk=3-1-1grj45alck25h801-1grj3ulg5gsp0800-4d6cc3aee947b773-", "description": "Senior Success 360 Customer Success Manager\nWhy will you enjoy this new opportunity?\nDo you enjoy helping Global and Enterprise organizations achieve their business outcomes through their technology investments? If you do, we have the perfect job opportunity for you!\nAs a Success 360 Customer Success Manager, you will serve as a trusted advisor, driving a cross-functional, unified customer experience for our customers during their transformational journey with VMWare.\nUpon joining our Customer Success team, you will play a critical role in delivering the Success 360 offering for enterprise customers by enabling them to rapidly and successfully onboard, adopt and realize business value with harmonized digital and in-person engagements across the entire customer journey.\nIn the Customer Success Manager role, you will interact daily with your assigned customers, helping them to achieve onboarding and activation milestones in driving product consumption. You will also jointly develop Success Plans with each customer to align their technology objectives to business outcomes.\nAs a Customer Success Manager, you be able to create a long-term relationship with your assigned customers as you develop an understanding of the customer’s desired business outcomes, focusing on maximizing value realization across their VMware portfolio.\nSuccess in the Role: What are the performance outcomes over the first 6-12 months you will work toward completing?\nDuring the first year, you will onboard into the Customer Success role and work with your assigned customers.\nUpon joining the Customer Success 360 team, you will be guided through a well-organized four-week onboarding plan that will be prepared for you.\nAfter onboarding, you will be assigned your first S360 accounts and work to establish ongoing cadence for account meetings with the customer, the account team and internal resources to understand the customer’s current and planned VMware production adoption and use cases.\nOne month after engaging with your customers, you will be able to articulate customer key business objectives and desired outcomes and begin crafting a joint Success Plan with the customer.\nYou will establish ongoing cadence for account meetings with the customer, and orchestrate internal resources to progress toward achieving key milestones.\nYou will create your Success Plan in Gainsight and record all customer activity and milestones throughout the customer journey.\nWithin 3 months of your joining date, you will be able to present your achievements in a Quarterly Business Review using the internal tools and deliverables that we will provide to you.\nYou will collaborate with internal resources to understand customer use cases and identify opportunities for prescribing Adoption Guidance and Workshops to further adoption and consumption.\nYou will proactively monitor customer health, identify expansion opportunities and mitigate renewal risk.\nDuring months 6-12, you will continue to drive business priorities within your assigned accounts and contribute to improving the overall Success 360 practice.\nYou will develop best practices to identify and proactively solve potential process or executional challenges.\nYou will ensure best-in-class execution; Develop and implement changes in both the customer's and VMware's operations systems that directly add value.\nThe Work: What type of work will you be doing? What assignments, requirements, or skills will you be performing on a regular basis?\nAs part of the s360 Customer Manager team, you will be working throughout the S360 subscription period with several assigned and strategic customers. The activities you will perform are all aligned with the purpose of helping our customers achieve their desired business outcomes through VMware technology. You will orchestrate the adoption and consumption of the VMware technologies the customer has purchased.\nYou will also be collaborating with the broader VMware account team and specialists as you perform the following:\nYou will have a track record of experience in customer success, in an enterprise software or SaaS organization, with a proven track record of successfully managing complex customer relationship in technology.\nYou will develop excellent understanding of VMware and associated technologies.\nYou will keep track of business and technology trends seen in market and hold one or more industry certifications in areas of interest.\nYou will possess robust inter-personal skills and ability to build relationships with internal and client stakeholders (including business and up to C-suite).\nYou will have experience developing and driving business cases that outline value to customers.\nYou will develop best practices to identify and proactively solve potential process or executional challenges.\nYou will demonstrate ability to manage multiple customer accounts, projects and deadlines simultaneously.\nWhat is the leadership like for this role? What is the structure and culture of the team like?\nThe Global Success 360 team is focused on driving strategic customer outcomes, while enabling our customers to derive maximum value from their VMware solutions. We provide a unified governance model to ensure we are acting as One VMware on behalf of our customers.\nWe strive to have a diverse and unified team, one which is focused on our customers and their success while contributing to a positive team culture. We are an open team who share best practice and collaboration amongst our colleagues. We give back to each other and our communities and welcome innovation and creativity at all levels, to be a meaningful contributor in our countries and societies.\nWhere is this role located?\nFlexible: The role is considered remote (based in Germany) and working from your home office unless otherwise specified by your future manager. You may be required to travel to VMware planned events and to meet with your customers and account teams (up to 25%).\nWhat are the benefits and perks of working at VMware?\nYou will be supported with a competitive and comprehensive benefits package. Below are some highlights, or you can view the complete benefits package by visiting www.benefits.vmware.com.\nMedical Coverage, Retirement, and Parental Leave Plans for All Family Types\nGenerous Time Off Programs\n40 hours of paid time to volunteer in your community\nRethink's Neurodiversity program to support parents raising children with learning or behavior challenges, or developmental disabilities\nFinancial contributions to your ongoing development (conference participation, trainings, course work, etc.)\nWellness reimbursement and online fitness and wellbeing classes\nCategory : Services and Consulting\nSubcategory: Customer Success\nExperience: Manager and Professional\nFull Time/ Part Time: Full Time\nPosted Date: 2023-02-02\nVMware Company Overview: At VMware, we believe that software has the power to unlock new opportunities for people and our planet. We look beyond the barriers of compromise to engineer new ways to make technologies work together seamlessly. Our cloud, mobility, and security software form a flexible, consistent digital foundation for securely delivering the apps, services and experiences that are transforming business innovation around the globe. At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Shape what’s possible today at http://careers.vmware.com.\n\nEqual Employment Opportunity Statement: VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. Vmware will provide reasonable accommodation to employees who have protected disabilities consistent with local law.Show more Report"}, {"company": "Unitronics", "job": "Product Manager", "city": "Central", "date": "30d+", "rating": "2.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=117&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_25399241&cb=1678900375944&jobListingId=1007491550047&jrtk=3-1-1grj45c9bhaps801-1grj3ulg5gsp0800-862e9ea14c3fa869-", "description": "Unitronics, a global company specializes in developing controllers and automated solutions is looking for its IIoT Cloud platform an experienced Product Manager.\n\n\nKey Responsibilities:\n\nResponsible for all product aspects throughout the product lifecycle.\nWork closely with development and QA teams to ensure on-time deliveries of product releases\nProduce relevant documentation such as specifications and mock-ups\n\n\nRequired Skills and Experience:\n\n3 years of product management experience, including all steps of the product life cycle management from product vision to definition, execution, enablement and rollout\nAt least 3 years as product manager of software with SaaS delivery & business model\nProven technical expertise and know-how in web, mobile and IoT fields\nExperience working in Agile teams as a product Owner\nExcellent written and verbal communication skills in English\nStrong Technical Background\nExcellent teamwork skillsShow more Report"}, {"company": "Intland Software", "job": "R&D Student", "city": "Herzliya", "date": "7d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=118&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6b80707c&cb=1678900377444&jobListingId=1008516748477&jrtk=3-1-1grj45do22dhb001-1grj3ulg5gsp0800-fbfe06dd9a6eced4-", "description": "Our world is transforming, and PTC is leading the way. Our software brings the physical and digital worlds together, enabling companies to improve operations, create better products, and empower people in all aspects of their business.\nOur people make all the difference in our success. Today, we are a global team of nearly 7,000 and our main objective is to create opportunities for our team members to explore, learn, and grow – all while seeing their ideas come to life and celebrating the differences that make us who we are and the work we do possible.\nPTC, a global provider of CAD, PLM, IoT and AR solutions, is looking for a 3rd year Computer Science (and Mathematics) student to join our development center in Herzliya, Israel.\nRequirements:\nStrong knowledge in C/C++.\nStrong Mathematical background an advantage\nLife at PTC is about more than working with today’s most cutting-edge technologies to transform the physical world. It’s about showing up as you are and working alongside some of today’s most talented industry leaders to transform the world around you.\nIf you share our passion for problem-solving through innovation, you’ll likely become just as passionate about the PTC experience as we are. Are you ready to explore your next career move with us?Report"}, {"company": "Coralogix", "job": "Business Development Representative", "city": "Tel Aviv-Yafo", "date": "3d", "rating": "4.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=119&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0b8ca392&cb=1678900379167&jobListingId=1008523708836&jrtk=3-1-1grj45fdjncfu801-1grj3ulg5gsp0800-cefffb7beeb8a149-", "description": "Coralogix is rebuilding the path to observability using a real-time streaming analytics pipeline that provides monitoring, visualization, and alerting capabilities without the burden of indexing.\nBy enabling users to define different data pipelines per use case, we provide deep Observability and Security insights, at an infinite scale, for less than half the cost.\nWe are looking for individuals who want to accelerate their careers in sales and make an immediate impact on our European Sales Team. The BDR will play a key role in partnering with Account Executives to generate new business and support our rapid growth in the European market.\n﻿RESPONSIBILITIES\nResearch accounts within our defined target market and identifies key players (coach, champion, economic buyer) to generate interest through discovery calls, Linkedin, and email campaigns.\nConduct high-level discovery calls with Account Executives in target and prospect accounts.\nFollow-up on inbound marketing leads from trade shows, trial sign-ups, webinars, etc.\n\nRequirements\n1+ years prior BDR experience within SaaS start-ups with a proven track record of success and exceeding quotas\nPrior experience in generating new leads, conducting cold calling, and customizing emails to a specific persona/ICP\nExperience with lead generation tools such as LinkedIn Sales Navigator, Zoominfo, Salesforce, and Outreach\nExperience working in a high input and time-sensitive environment.\nWilling to work Monday-Friday\nFluent English speaker\nBonus Points: Experience selling to DevOps/Site Reliability engineersShow more Report"}, {"company": "אנטריפוינט", "job": "Project Manager", "city": "Tel Aviv-Yafo", "date": "9d", "rating": "3.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=120&ao=1110586&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_801217a8&cb=1678900380598&jobListingId=1008511844401&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj45gpbkf0k801-1grj3ulg5gsp0800-dbb167c29171c285--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tGRBbjy15RxGaEEw7KZU_HI5a6udzcwmkmD884u2NoxjUyN-AaOEC3eWW8AIMk4gcimgyjQGXQFYwYHaGbzv0qI51dh7A-XJ5GF_Go8HvScjpHiEpDbyEwKi5TYSZ2PBLm7Q2UmJkD21SfDcHEFAIExhHFZcPCZ9me2I9-0jCZ_q3aJJbb4uiuPHG0Wn6j68AdfYtTh3zGCcVmGgH9zD9OncYVe_G8jOgcqEhHDbS6qWo_2fIa23Jzcg7X8v1v9Jm1O0sMLL3IRigJMydkFMPwwKHwAWiZqz4U1bDenwNqOzscHMTV2uJqDOaUBWIXkAzVaPhOsvILIl6DgSMMeVJlJttpzJn4bQDVEwYITfG2qvsTm3UtzIGZ7KY1Y5eduq2Qfj8NH1kbHwoeqWAFCI81NeSpQ7T7-b1i3Nnk5fw58wdok94UBiPjkpfhM4War-UtVHAVHTLG9-q6xf9F1_gGtmArjdmzihG4SXM4yJVDDCaZn9uutUy4oNEwYLc5L3sdFWQGG9nKqceBdcP8rqF45JsY0iqgC5bsYFm9IevoWpao-2iObHLtDHQaEWOlwHEfM-0Tm4-eZcCeT2ZLM84RsETqqhhCc4oQYiGrIw8egQmgNwiTkL1Bk5dXAgEyf-FY1JrgEAYI1uYUUd2UF5C3jjF4QcNQ7OBi82poVuCS9ZW0Fo8HLmrlo%3D", "description": "A global insurance company is hiring! Our Project manager is part of a PjM department that leads cross-organization projects. Managing the scope, the building process of the project, the planning phase, creating an integrated work plan, promoting the stages of analysis, development, and testing. Create and executes project’s work plans and make appropriate revisions to meet changing needs The project manager manages several projects in parallel while handling and managing constraints and frequent changes per projects prioritization in a dynamic work environment.\n\nProblem Solving - proactive function who must deal with different problems and conflicts solving types The role requires integration with all of the relevant interfaces – product managers, other project managers, the R&D and testing teams, and internal customers & business partners. Ensure awareness of project status across the organization, get and keep things on track At least 3 years of project management experience with a proven track record of driving results in hi-tech organizations - Must Assertive independent leader & a team player Quick learner& Self-starter with an out-of-the-box thinking approach Strong organizational skills, negotiate and continually manage expectations under time-constrained circumstances Demonstrates ability to build strong, influential relationships English at a high level, including verbal expression abilities and drafting s in English Experience using project management systems (Asana/Monday)Report"}, {"company": "Kramer", "job": "Global Sales Chief of staff", "city": "Central", "date": "30d+", "rating": "5.0", "link": "", "description": "Who are we?\nKramer is a leading player and pioneer in the Pro AV industry. Kramer our audio-visual experiences power creativity, collaboration, and engagement.\nAt Kramer, we make award-winning, innovative, and reliable Pro AV hardware, software, and cloud-based solutions. Enterprise companies, schools, universities, governments, and military end-users trust and rely upon Kramer technologies in more than 100 countries across six continents worldwide.\nFrom AVSM to advanced cloud-based communication, collaboration and control solutions, Kramer creates audio visual experiences that are more engaging, more inclusive and more connected than ever before.\nAbout the role\nWe are looking for a passionate and experienced Global Sales Chief of staff to work closely with Kramer`s VP of Global Sales.\nThe ideal candidate is independent and self- learner, who loves to work with diverse teams and to find creative ways to conceptualize goals, translate goals into multi-faceted processes, and to drive execution and to serve as a thought partner and strategic advisor to VP Global Sales.\nTo succeed in this senior role, you’ll need to have great people skills, extensive business acumen and high ability to manage operations and projects.\nResponsibilities\nLead cross-functional strategic initiatives, facilitate special projects, and ensure action items are executed on behalf of the VP Global Sales\nOperate at a tactical, strategic, and operational level, handling the oversight of projects.\nAct as an extension of the VP Global Sales and as an information funnel, filter, and facilitator with internal and external stakeholders\nPromote team integration as well as cross-functional communication and collaboration\nManage key relationships and build a process to track and nurture key stakeholders, investors, and clients\nTrack high priority initiatives for the VP Global Sales to identify any/potential obstacles\nServe as a thought partner and strategic advisor to VP Global Sales, standing in on meetings, challenging ideas, offering a fresh perspective, and following up on action items with the team accordingly\nRequirements\nPerfect English, solid Hebrew\n5+ years’ experience working for a global tech companies in senior roles, ideally in a sales management.\nGreat at matrix management, influence, and a communication skill.\nTrusted, reliable, and highly available.\nOrganized and methodical.\nA strong data & analytical background. Great at solving problems through data, research and thinking out of the box.\nA++ player - smart, energetic, and hungry to do whatever it takes to succeed in this challenging role.\nEntrepreneurial - ambitious, self-starter, able to dive into any area of the business or product, look at the big picture and identify opportunities and issues.\nGet things done attitude - always finds a way to make things happen, scrappy and efficient with limited resources.\nExecutive presence - confident in managing up and relaying feedback to top executives.\nFlexibility - this role may require travel from time to time.\nUnderstanding of customer-centric products, operations, business development, and marketing.\nWBXBiVHYVjReport"}, {"company": "Pernod Ricard", "job": "Business Development Executive", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=122&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4b2ece4b&cb=1678900383863&jobListingId=1008351680788&jrtk=3-1-1grj45k0fnce9801-1grj3ulg5gsp0800-44f1ac4ff7dc6ade-", "description": "Key duties and Responsibilities:\nDevelop and maintain professional customer relationships within a defined territory\nTrain retail staff on Pernod Ricard brands selling story, category management and visibility standards (Golden rules)\nShare industry trends and growth opportunities\nIdentify key potential outlets to increase distribution and execution level for our strategic brands\nAchieve coverage of designated stores in line with journey plan and coverage target\nMaximize opportunities to increase SOS and incremental secondary display\nMonitor and report on in-store range compliance\nIdentify potential stores for branding and improving visibility through dedicated investment plan\nAudit in-store availability and report to the distributor- follow up on its evolution\nMonitor and report on counterfeit and parallel trade products\nAttend weekly/monthly Company meetings for brand plans and performance updates\nMonitor and report competitors' activity\nScope and perimeter:\nNumber of persons to supervise - none\nMain interlocutors outside the Group Pernod Ricard: Israeli distributors, Israeli retailers, consumers, local partners\nPerimeter of the job:\nX Local: 85% X International: 15%\nProfile\nEducation (Minimum academic level necessary):\nBusiness school or similar\nProfessional Experience (required by a new incumbent):\n3 to 6 years of experience in sales or spirits in Israel\nStrong experience in building relationships with a customer/distributor, good communication skills\nProject management (organization, planning)\nStrong integration and understanding of international business\nStrong negotiation skills\nLanguages & Other Specific Skills:\nEnglish: fluent\nMain applications on PC\nSoft skills:\nSense of ethics, entrepreneurial, resourceful, and transparent\nOpen minded, used to work in different cultural environments\nAssertive, self-starter\nResult oriented\nJob Posting End Date:\nTarget Hire Date:\n2023-02-15-08:00\nTarget End Date:Show more Report"}, {"company": "Teva Pharmaceuticals", "job": "Customer Experience", "city": "Tel Aviv-Yafo", "date": "22d", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=123&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a1a77b65&cb=1678900385467&jobListingId=1008484999283&jrtk=3-1-1grj45li7klu1801-1grj3ulg5gsp0800-0829ccc2bb6f3647-", "description": "Customer Experience\nDate: Feb 21, 2023\nLocation:\nTel Aviv, Israel, 1\nCompany: Teva Pharmaceuticals\nJob Id: 45908\nWho are we?\nTeva is a global pharmaceutical leader and the world's largest generic medicines producer, committed to improving health and increasing access to quality health solutions worldwide. Our employees are at the core of our success, with colleagues in over 80 countries delivering the world's largest medicine cabinet to 200 million people every day. We offer a uniquely diverse portfolio of products and solutions for patients and we've built a promising pipeline centered around our core therapeutic areas. We are continually developing patient-centric solutions and significantly growing both our generic and specialty medicines business through investment in research and development, marketing, business development and innovation. This is how we improve health and enable people to live better, healthier lives. Join us on our journey of growth!\nJob Description\nResponsible for managing all Teva pharma projects/opportunities in CRM.\nFilter in of technical requests under his ownership to ensure qualitative service provided to the customers in a timely manner.\nResponsible for filter in and submitting of technical requests.\nFilter out and response to customers on SR under ownership to ensure qualitative service provided to the customers.\nClose follow-up on pending service requests, in order to get a complete and accurate answer.\nCoordinate between the BUs and customers on technical requests on a daily basis.\nStreamlining and following all processes in order to obtain an optimal support/service.\nBuilding trustworthy relationships with customers, considering the various cultural backgrounds.\nFilter out and response to customers on SR under ownership.\nBack up of other team members according to predefined decision.\nCoordinating and participating TCs with customers.\nDealing with complicated issues such as complaints, long pending SRs, sensitive customers etc.\nInitiate & lead new high level ideas to be used as a service/ marketing tool to further improve the service and create an ongoing service discussion with customers.\nResponsible for sending customer notifications.\nEngage Teva pharma contacts to register and use Teva api Connect (customer portal), Provide ongoing support and training to Teva users.\nQualifications\n\nKNOWLEDGE:\nBSc in life sciences / chemistry / biology or other relevant field - must\nPrevious experience in QA/QC/RA/R&D – must\nFluent English-must, other languages- advantage\nMS office skills (e.g., excel and power point)\n\nSKILLS/QUALIFICATIONS:\nHighly motivated\nCustomer focused\nProactively thinking\nAnalytical thinking\nA team player\nFunction\nSales Support\nSub Function\nCustomer Service Support\nReports To\n\nSr Dir Commercial Operations\n\nAlready Working @TEVA?\n\nIf you are a current Teva employee, please apply using the internal career site available on \"Employee Central\". By doing so, your application will be treated with priority. You will also be able to see opportunities that are open exclusively to Teva employees. Use the following link to search and apply: Internal Career Site\nThe internal career site is available from your home network as well. If you have trouble accessing your EC account, please contact your local HR/IT partner.\nTeva’s Equal Employment Opportunity Commitment\nTeva Pharmaceuticals is committed to equal opportunity in employment. It is Teva's global policy that equal employment opportunity be provided without regard to age, race, creed, color, religion, sex, disability, pregnancy, medical condition, sexual orientation, gender identity or expression, ancestry, veteran status, national or ethnic origin or any other legally recognized status entitled to protection under applicable laws.Show more Report"}, {"company": "Rookout", "job": "Sales Development Representative", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=124&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b0ab7f2c&cb=1678900388211&jobListingId=1008428131166&jrtk=3-1-1grj45o97kf3p801-1grj3ulg5gsp0800-8dfdf04b7ec5328f-", "description": "About The Position\nDo you get a kick out of helping businesses succeed? Then you just might be our next Rooketeer! Join our highly-talented dynamic team as we pursue our vision of helping developers deliver better software.\nWith Rookout, developers can review parts of their live code on demand, even while it is running. We simplify and accelerate the data collection process and save hours (or days, or even weeks) of dev and DevOps work.\nAs our Sales Development Rep, you'll get to choose who will be the company's next clients. You will run the entire top of the funnel from choosing the strategic accounts thru speaking with C-level decision-makers and delivering those meetings to the sales reps.\nThis role gives you an opportunity to join a sales team in a growing company and grow your career.\n\nResponsibilities\nThe Sales Development Rep (SDR) works with outbound and inbound demand generation to uncover and craft new opportunities that result in closed business.\nConnecting with prospects in a variety of ways\nDocumenting daily activities\nCollaborate with our Sales and Marketing teams to strategize on named accounts.\nRepresenting Rookout with integrity and professionalism at all times in all written and oral communications\n\nRequirements\nA minimum 1 year of outbound and inbound sales experience in the SaaS/software industry is preferred\nSelling to R&D, Engineering executives and professionals preferred\nClear and polished written communication skills\nExcellent speaking/ listening skills and ability to engage prospects\nFearless attitude and hunter mentality - willing to take intelligent risks\nStrategic planning abilities\nB2B sales experience\nMethodological and organized\nWhat we offer:\nThe anticipated salary range for this role is between $45K-$65K + Variable. Actual starting pay may vary based on a range of factors which can include experience, skills, and scope\nHealth, Dental, and vision insurance are paid fully by the company for the employee\n401k\nCompany stock optionsReport"}, {"company": "Spotlock", "job": "Business Development Representative (part/full time, hybrid)", "city": "Israel", "date": "8d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=125&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6e72f421&cb=1678900389482&jobListingId=1008513537278&jrtk=3-1-1grj45pg4klvj801-1grj3ulg5gsp0800-23df0458d789f60e-", "description": "Company Description\nSpotlock is a VC-backed, early-stage startup, that develops a game-changing platform for the construction industry.\nWe are growing and looking to add talented and passionate people to our team. This is a unique opportunity to join a promising startup in its early days and work closely with the founding team in crafting the go-to-market strategy.\n\nJob Description\nYou will work with the founding team on developing new markets:\nConduct online research - identify key players, research accounts, generate interest, develop relationships with important stakeholders, and document interactions with prospects in Hubspot.\nInitiate contact with prospects through phone calls, email, and LinkedIn.\nIdentify the needs and challenges of the prospective customer, determine their interest, and schedule discovery meetings.\nWork closely with the founding team to analyze insights and develop go-to-market strategies.\n\nQualifications\nNative level of written and spoken English with excellent communication skills - a must.\nAbility to make outbound calls and send out targeted emails on a daily basis.\nStrong proficiency in cold calling with a proven track record of success.\nDesire to work in a very dynamic and agile startup environment.\nAdditional Information\nWe follow a hybrid working model that combines working from home or at the office, with flexible hours.Show more Report"}, {"company": "8fig", "job": "Product ops", "city": "Tel Aviv-Yafo", "date": "10d", "rating": "", "link": "", "description": "8fig is a growth platform built to propel e-Commerce brands to new heights with cash flow planning technology and continuous, uncapped capital. Founded by supply chain experts, our growing data-driven, client-obsessed team is driven by our purpose to democratize online retail and scale eCommerce sellers to 8-figures in revenue.\nWe are seeking an experienced and motivated Ops Manager. As an Ops Manager, you will be responsible for managing the end-to-end lifecycle of software development projects, from planning to execution and delivery. You will work closely with cross-functional teams, including software engineers, product managers, quality assurance analysts, and designers. You will be the primary point of contact for clients, ensuring that project requirements are met, timelines are adhered to, and project deliverables are of the highest quality.\nKey Responsibilities:\nKeep projects on track, solve bottlenecks, re-prioritize efforts, and analyze their impact\nDevelop project plans, including timelines, budgets, and resource allocation, and manage the project to ensure adherence to the plan.\nDefine project scope, KPIs and objectives, and communicate project status to all stakeholders, including clients, team members, and management.\nIdentify project risks and develop mitigation strategies to ensure that projects are delivered on time and within budget.\nCoordinate and lead cross-functional teams to deliver high-quality products and services that meet or exceed client expectations.\nManage project documentation, including project plans, project charters, requirements documents, status reports, and other project-related artifacts.\nDevelop a deep understanding of customer needs and market trends to inform product strategy and roadmap\nLead cross-functional teams to design, develop, and launch new products and features\nDefine and track key performance metrics to measure the success of products\n\nRequirements:\n\n\nBachelor's degree in computer science, engineering, business administration, or a related field.\nExcellent interpersonal skills\nAbility to work in a fast-paced, dynamic environment\nStrong analytical and problem-solving skills\nStrong attention to detail and ability to work with ambiguity\nExtra Points:\nExperience selling products on Amazon,Shopify,BigCommerce…\nExperience with data intensive products, Machine learning\nStrong public speaking skills, including confidence and stage presence\nIf you're still nodding your head in agreement and this seems like a good fit, don't hesitate to reach out—we're looking for you!Show more Report"}, {"company": "Novo Nordisk", "job": "Internal Communication Manager", "city": "Kfar Saba", "date": "1 day ago", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=127&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_114989d1&cb=1678900392126&jobListingId=1008526211167&jrtk=3-1-1grj45s2ekf3s801-1grj3ulg5gsp0800-dcc8b25dfb46f0a8-", "description": "Are you skilled in translating raw ideas into effective storytelling of our products, missions, and visions? Do you enjoy working in close collaboration with different key stakeholders? If you want to utilize your potential in content writing, social media management, media relations, developing an internal communication strategy, and corporate publishing, then apply and join us as Internal Communication Manager within the Novo Nordisk affiliate in Israel.\n\n\nThe Position\n\nNovo Nordisk Israel is looking for an Internal Communication Manager. In this role, you will drive the Internal Communication across Novo Nordisk Israel, Design and drive the communication strategy supporting business goals, and Strength Novo Nordisk's corporate reputation. You will be responsible for supporting the realization of the vision, strategy, and execution of relevant internal communication strategy. Proactively build and protect Novo Nordisk Israel's reputation and support Novo Nordisk Israel in becoming a sustainable employer to engage employees and to create and sustain a high-performance organization.\n\nResponsibilities\n\nDevelop and execute the communication strategy of the affiliate aligned with business priorities.\nCoordinate, structure, and plan internal communications, building a communication plan through the channels available in Novo Nordisk.\nBe part of the crisis management committee to assure proper internal communication.\nEnsure a strong company reputation and Be part of Novo Nordisk Global GCN (Global Communications Network).\nWork according to Business Ethics procedures and Work according to local law, Novo Nordisk Way, and Novo Nordisk policies & guidelines.\n\nQualifications\n\nTo be eligible for the role, you hold a bachelor’s or MBA / MA degree in communications or social sciences or political sciences, or digital & media from a university or well-recognized institute. You have 5+ years of experience in a relevant industry in a similar role with a proven track record in communication and the ability to translate business priorities into the most efficient and effective communication plan and execute the plan. You have the ability to collaborate and communicate with different stakeholders, Leadership teams, employees, customers, vendors, consultants, and cross-functional project teams.\n\nCompetencies:\n\nExcellent written and verbal communication skills, including communication across functions and strong presentation skills.\nStrong interpersonal skills, ability to lead without authority strong networking, and Out of box thinking, always eager to launch and implement new ideas.\nHave excellent project management skills and the ability to execute hands-on tasks.\nStrong strategic capabilities with demonstrated experience in analyzing complex situations into a change management communication plan.\nTeam player who can work both in a team, cross-functionally, as well as independently.\nExperience in working with media relations in a private company, public institution, or Public Relation agency.\nExperience in working in HR departments or Pharma Experience - an advantage.\nFluent in spoken and written English and Hebrew.\nProficient in PowerPoint Presentations or Canva.\n\n\nAbout the Department\n\nYou will be part of the People & Organisation department which contains an HR Business Partner, Training & Development Specialist, and Sustainability and Wellbeing Lead and you will report to Senior People & Organisation Director. Our core purpose is to be a sustainable employer and to enable Novo Nordisk to attract, retain and reward the right people in the right place through sustainable, competitive, flexible, and compliant reward practices.\n\n\nWorking at Novo Nordisk\nWe are a proud life-science company, and life is our reason to exist. We’re inspired by life in all its forms and shapes, ups and downs, opportunities, and challenges. For employees at Novo Nordisk, life means many things – from the building blocks of life that form the basis of ground-breaking scientific research, to our rich personal lives that motivate and energise us to perform our best at work. Ultimately, life is why we’re all here - to ensure that people can lead a life independent of chronic disease.\n\n\nContact\n\nIf you believe you are qualified, and are willing to take the challenge, please send your CV directly via our online application tool.\nWe thank all applicants for their interest, however, only those candidates selected for inter-views will be contacted\n\n\nDeadline\n\nApply before 01/04/202\n\nWe commit to an inclusive recruitment process and equality of opportunity for all our job applicants.\n\n\nAt Novo Nordisk we recognize that it is no longer good enough to aspire to be the best company in the world. We need to aspire to be the best company for the world and we know that this is only possible with talented employees with diverse perspectives, backgrounds and cultures. We are therefore committed to creating an inclusive culture that celebrates the diversity of our employees, the patients we serve and communities we operate in. Together, we’re life changing.Show more Report"}, {"company": "SciPlay", "job": "VIP Experience Manager", "city": "Israel", "date": "24h", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=128&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d1d791a0&cb=1678900393303&jobListingId=1008528301532&jrtk=3-1-1grj45t83g2on801-1grj3ulg5gsp0800-9b61fc1516b9912a-", "description": "DESCRIPTION\nThe VIP Experience Manager is responsible for the day-to-day work with all SciPlay game teams and stakeholders to develop and implement VIP assets to drive the mutual goals and objectives of the product and VIP operations teams.\nKEY RESPONSIBILITIES\nSciPlay is a leading developer and publisher of digital games on mobile and web platforms, providing highly entertaining free-to-play games that millions of people play every day for their authenticity, engagement and fun.\nSciPlay currently offers nine core games, including social casino games Jackpot Party Casino, Gold Fish Casino Slots, Hot Shot Casino and Quick Hit Slots, and casual games MONOPOLY Slots, Bingo Showdown, 88 Fortunes Slots, Backgammon Live, and Solitaire Pet Adventure with offices all over the world!\nThis individual will work centrally under the VIP operations to advance the projects with game team stakeholders to ensure that VIP assets, communication tools, and player rewards within the core products are of the highest quality and align with SciPlay and the VIP Operations Teams goals. This person works closely with game team product managers, GMs, developers, monetization, and Live Ops teams for each core game and is a crucial contributor in driving the future VIP Game roadmap. This role will report to the Director of VIP. They will collaborate on new initiatives to amplify VIP assets within each product while learning and leveraging our strengths against other social gaming competitors in the marketplace.\nEssential Job Functions:\nCollaborate with game team stakeholders to develop and implement VIP assets to drive the mutual goals and objectives of the product and VIP operations teams.\nProactively identify opportunities for VIP operations program improvements and continued development within SciPlay products.\nPartner with game team stakeholders to oversee the design, development, and implementation of VIP program initiatives within SciPlay products\nRegularly meet with VIP Team Managers and VIP Account Managers to continually identify areas of growth and opportunity for the VIP program within the products and initiate those efforts with game team stakeholders.\nCoordinate with VIP Account Managers, Retention Manager, and VIP Team Managers to collect player feedback about new assets, features, and content and present findings to game team stakeholders.\nPartner with VIP Data Analyst to collect and evaluate the KPI impact of new product assets from VIP players and provide actionable insights to continue to drive the VIP program forward consistent with game team business objectives\nContinually communicate with Design Team to identify features, rewards, and benefits available to VIP players on competitor products in the social casino marketplace.\nHelping Manage a queue of inbound and outbound VIP player communication in support channels (and on Facebook) for SciPlay products where a VIP Account Manager is not yet established\nMonitor and update VIP Team leadership regularly on new program efforts in the product development pipelines for each core product.\nContinually communicate with CS Team leadership to understand general player sentiment regarding new feature releases, product updates, and changes to existing game mechanics.\nAssist VIP Operation s Team leadership in the training and onboarding of Account Managers to provide insight regarding game team processes, available VIP assets, projects on the future roadmap, and VIP communication/admin tools.\nResponsible for creating at least 1 VIP contest per week, where players are challenged in the game, and prizes are awarded to the top winners.\nCreate a 1 VIP giveaway which challenges players to drive in the-game KPIs, and prizes are awarded to random winners.\nCoordinate at least 1 community contest per week.\nBoth of these should help drive opt-in growth month-over-month\nCreate a VIP Appreciation program in-game for games where one is not yet established.\nCoordinate sending and drafting of 1 newsletter per month with Account Manager (due to events, this will need to be completed together)\nPrepare post-event analysis for stakeholders within 7 days of event conclusion, including revenue analysis.\nHealth check: feedback from players, any issues experienced with event mechanics and event processes (opt-ins, payouts, communications)\nProvide monthly wrap-up of events presented during the first VIP Weekly Sync of the month.\nCreate a monthly schedule of planned events presented during the final VIP Weekly Sync of the month.\n\nREQUIREMENTS\nEducation\nBachelors degree in related field.\nYears of Related Experience\nYears of experience 5 to 8 years\nWe are SciPlay! We make games!\nThe roots of our company are simple and strong: Our founder, Aaron “Shurm” Schurman, fell head over heels for casino games and had a vision to create the most entertaining free-to-play casino games for gamers around the world. We’ve grown into a company that makes games we are truly proud of and that are enjoyed by millions of players every day. Our history is extensive, but we’re just getting started. In 1998, we got our start as Phantom EFX and in 2019, we reintroduced ourselves as SciPlay and went public on the Nasdaq.\nAt SciPlay, we are programmed to think untraditionally. From our yearly development conferences, shindigs, and new game launches, we believe in doing what you love and doing it well. We take great pride in our ability to create authentic experiences for players and we are excited to continue investing in our workforce, technology, and our data-driven approach, all with the mission of delighting our players long into the future. We believe that if we continue to stay passionate, set ambitious goals, live our values and play together, we will become the #1 social casino and casual gaming company in the world.\nA few of our highlighted perks and benefits:Competitive salariesPaid Family LeavePaid Volunteer TimeAnnual bonuses, matching 401k, stock options, and other benefitsGame Room featuring current generation consoles, numerous game titles, and various table games.Fully Stocked Kitchen with Beverages and SnacksOpen Office Concept with Ergonomic Seating and Standing DesksSummer HoursHybrid Office (Currently 1 Day In / 4 Days Remote)\nWe don’t consider the above list “Culture” though. Culture at SciPlay is MUCH MORE than just that including, but not limited to:Culture League Dedicated to Employee Engagement and FunEmployee Resource GroupsMental Health ResourcesCareer RoadmapsAnnual Company RetreatsLearning & Development OpportunitiesManagement TrainingLeadership Book ClubsEmpathic LeadershipWork Life Balance\nCompany Values:\n#beYOU\n#playTOGETHER\n#embraceCULTURE\n#levelUP\n#getRESULTS\n#justWIN\nRead More About Our Values Here:\nhttps://www.sciplay.com/about-sciplay/sciplay-core-values/\n Don’t meet every single requirement? Studies have shown that women and people of color are less likely to apply to jobs unless they meet every single qualification. At SciPlay we are dedicated to building a diverse, inclusive and authentic workplace, so if you’re excited about this role but your past experience doesn’t align perfectly with every qualification in the job description, we encourage you to apply anyways. You may be just the right candidate for this or other roles we have! #beYOU\nSciPlayers are humble. In the live environment of mobile game development, there’s no room for egos and the loudest voice doesn’t get their way here. We are diverse in our backgrounds and our experience, both professionally and personally, and we believe our differences are key to unlocking our super powers.\nSciPlay Corporation and its affiliates (collectively, SciPlay) are committed to creating a workforce of credibility and dependability. As a prerequisite to employment with SciPlay (to the extent permitted by law), you shall be asked to consent to SciPlay conducting a due diligence/background investigation on you. This job description should not be interpreted as all-inclusive; it is intended to identify major responsibilities and requirements of the job. The employee in this position may be requested to perform other job-related tasks and responsibilities than those stated above. SciPlay is an Equal Opportunity Employer and does not discriminate against applicants due to race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class. If you’d like more information about your equal employment opportunity rights as an applicant under the law, please click here EEOC Poster.\n#LI-ME1 #LI-Hybrid #LI-RemoteReport"}, {"company": "אר.ויי.בי. פלסמנט אגנסי בע\"מ", "job": "International Sales Development Representative -SDR", "city": "Israel", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=129&ao=1110586&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_84d91c24&cb=1678900394490&jobListingId=1008431356421&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj45ud9m6rv801-1grj3ulg5gsp0800-f8eba598d44f82ea--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNAfQ2-UsambsOBdIi4VUREUCUzrjMnocVkuIzc5JSyv3JKqAvZvfkIaUjJ1fjNjD9sM09EApmX173C16B7374l_w4mDHCGquErBWLGTAtsYXF9CqRnQe8Db64U17eEBqIuCLeiqaXyw0hjkbsU0Np0AudS-Eg06a97j2FO4m9PJ4Jc5ERFZxgdycIPEdvIsl_3JbxNTDBPuxBgotb3C_fsZBOoXKnVDWO9U4jItfcgjYxTaVC1S5QOCb8oOcKpSSKI8oE2EBA2nnCzf9OWw9KszQxH_M4FG4nVfwvQYd-GE_5GDx4Op2LL3KiAzO5OnWdtwDTGaR6U1LZDB2rtYfUMIwc_woO-8UNL6C7t7g4fst7NdPQ_jLPqtirv1S2J8vM98Y6sPW7IliekgB_OBZvbpyUySCBedTFzwpI3wk6Sa8Ud7j6Ndc9Zsb-OjHAKELOQLuh4UIW_EtZUXoV7n8obLapupXztPhGyzad5XMuN_TH4KlZ6T5r0fDUXTvZvzkHqfWp4MdSPBAxvOh-Sy9hDzFuTya9DMyCrmsXRm1bDt32qTEWpg0vAp4M1SLCK5_htqkJy7l0wWZ53QeKYXDIAH2CnlAKhceM9Kt0aYqKr_l7uuVGLqMqtYc1YmoshbYlPQ333Bvzvzce6taWk6pm2xTja9sMbKHIs%3D", "description": "We are a global company with machine-learning-based products in the mobile marketing field. We have offices and representations in Russia, India, Indonesia, and headquarters in Rehovot, and are looking for an international outbound SDR to join our global BD team. Our team works closely with some of the world's best mobile apps in different verticals such as gaming, fintech, and e-commerce, helping their growth efforts in user acquisition and retargeting, providing them with data-driven insights from our custom predictive ML models, which process over 2 million transactions a second! Responsibilities: Initiate custom reach outs based on our data-driven prospects system Qualify new business leads and sales opportunities, manage, nurture, and grow interested prospects across territories.\n\nSearch and report market trends. Work closely with CSM & product teams to accelerate business processes. Participate in conferences and commercial business events (You might need to travel from time to time) Requirements: Very High level of English. Mother tongue-great advantage!\n\nAnalytical mindset! Experience in lead generation/ outbound sales/ business development of data-driven products Great passion for sales enablement and for learning a complex ML-based product Other languages such as Russian, Chinese, Korean and more- will be a great advantage Proactivity, High energy, persistence, Results - drivenShow more Report"}, {"company": "AstraZeneca", "job": "Medical affairs learning and development", "city": "Kfar Saba", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=130&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b5a00d2b&cb=1678900395760&jobListingId=1008388899076&jrtk=3-1-1grj45vkkk6et801-1grj3ulg5gsp0800-e9d1768f3c83f784-", "description": "Medical affairs learning and development\nAt AstraZeneca we embrace a company culture that is personal and welcoming. It was built by our employees, is maintained by them, and is stronger because of them. It brings out the best in every one-off us and provides the framework for how we want to grow. As an organization, we are committed to delivering consistently high ethical standards of practice worldwide. We are driven by the desire to develop innovative medicines that bring hope and improve lives.\nThe position\nThe Medical affairs learning and development supports the Medical department on strategic and tactical level driven by business acumen and ecosystem knowledge. This function will support the transition of Medical Affairs into a pro-active co-creating and strategic partner for both our organization and external stakeholders.\nThe Medical affairs learning and development has to develop, maintain and deploy training and capability building programs for all positions within the Medical Department, including the onboarding of new colleagues, to meet key performance objectives.\nThe Medical affairs learning and development will collaborate directly with Medical Excellence peers and country medical teams to understand internal and external environment and dynamics at the regional and local level and related competency gaps.\nResponsibilities\nDevelop and support change management plans and associated organizational effectiveness initiatives, on ‘KPI thinking and acting’\nDevelop, maintain and deploy training and capability building programs for Medical, incl. onboarding of new colleagues:\nFocus on Medical 2.0 capabilities and behaviors\nIncl. quality and compliance standards, SOPs, processes and tools\nco-creation and co-execution of innovative solutions and propositions across the portfolio with internal and external partners on national and international level\nEnhance the omni channel and digital capabilities and platforms in collaboration with IBEX\nMonitor existing and upcoming competency gaps based on external and internal demands and translate them in training and development plans\nSupport the Medical leadership team to drive alignment and coordination of goals, priorities, and efforts across Medical Affairs, and with other groups globally.\nBe responsible for the Medical Excellence Budget.\nThe Medical Excellence Manager will report into the Medical Director AZIL.\n\n\nMust Have\n2+ years' experience of working on a L&D Manager٫ Training Manager or other relevant position\nVast experience in conducting trainings / coaching\nSignificant experience with effective learning and development methods\nProject management skills\nExperience as middle or senior management\nEntrepreneurial: combines organizational, operational, business excellence, relationship with understanding of Medical strategic priorities to act at a higher level\nProven ability to interact widely and effectively within the company across regions, functions and cultures\nAbility to set and manage priorities, resources, performance targets and project initiatives in a multinational matrix environment\nGood execution ability and self-motivation\nExcellent communications (incl. very good presentation skills) and relationship building capacity and ability to listen, understand and integrate competence needs into learning and training programs and plans\nAffinity to digital (new media & technologies) / digital, data and design-thinking\nAdditional Capabilities\nCompleted degree in life sciences or comparable: Medical Doctor, pharmaceutical or biomedical degree or equivalent by experience\nWorking experience in the pharmaceutical industry relevant for this function (e.g. Medical Affairs, Sales & Marketing Management, Market Access, public affairs, Learning & Development and/or a health care analytics/services organization within the pharmaceutical industry)\nGood problem solving and conflict resolution skills\nNext Steps – Apply today!\nTo be considered for this exciting opportunity, please complete the full application on our website at your earliest convenience – it is the only way that our Recruiter and Hiring Manager can know that you feel well qualified for this opportunity. If you know someone who would be a great fit, please share this posting with them.\nAstraZeneca is an equal opportunity employer. AstraZeneca will consider all qualified applicants for employment without discrimination on grounds of disability, sex or sexual orientation, pregnancy or maternity leave status, race or national or ethnic origin, age, religion or belief, gender identity or re-assignment, marital or civil partnership status, protected veteran status (if applicable) or any other characteristic protected by law.Show more Report"}]