[{"company": "אורגד מאגרים בע''מ", "job": "Chip Architect", "city": "Southern", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=101&ao=1110586&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ff95c0e3&cb=1678899922559&jobListingId=1007233305133&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj3nhhrjcb9801-1grj3ias7i38u800-2c1a5984f2d4a64e--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBZsODucnGrJLWj5MeRYhhBQWbIM2Fu4452kic8zLEsH3LNY2Br28VklcO2krxVESWfzoo7-NHecT4GzAEBvG8aUh7aRihQ1y-ChRj7ixRvN5gHq11Eei7EbS5xRzFHf-9QUPtR43gJ-q80MCCKL9RUGQ_ljYX811RrXG_4kWesff4BOaYrXe-gBSEmurlDCAdUfzV3rjNFtyUhWD4pHDG5K3CfL-nIlgZzSEoUyP_JQD3IeNXwEMBTELqz6cL4PmqrWkvSrir4Rq-Q0HM0E7Z1LZbGcVv4S5MB11TBOAmpnX4k_BK5XEDPWods0K9GYewUF04UW6CpCFAIBcv-LzYz6XLe7alJd1M4ANbs7-C0JmW69eTUAEsCOCB0IJZLxOzrTYlZDZ5aIN4U_6pYJUtYrf0q1JMZIjPmBhbK-BbTe5pXqjSGQn8WUJagsSYrgcZ-U-X-l_Qog5OL76scKn-6Qu1Z6HiH0PdwhV5OmKB7nXrRG7y-IA6Fm_AYH6wvEm45Q1PdilVE6Tp1Kau37qnJqwfImLlh0XXzBrhBEIowgHBvaXyDeuzdJ0S-_j2izE6q6mFWHpMluoKIRzlpCC2ilKA2wb9q-MQi0PszicukhnQk5d_IUzzH4O0d0YCB4kQ6uYvrtcnmGWY9br6VoJd-", "description": "§ Define the architecture of complex, high performance VLSI products for Analytics & AI acceleration § Work closely with the SW/Algorithms team to achieve best overall system performance § Work closely with the VLSI implementation team to achieve cost effective solutions § 7+ years experience in chip design § 3+ years experience in VLSI architecture definition § Electronics Engineering or Computer Engineering degree from a leading institutionShow more Report"}, {"company": "Apple", "job": "SoC Fabric Performance Architect", "city": "Herzliya", "date": "14d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_015eb32e&cb=1678899923568&jobListingId=1008500818011&jrtk=3-1-1grj3nigom6rr801-1grj3ias7i38u800-024cf1936d103501-", "description": "Summary\nPosted: Feb 22, 2022\nRole Number:200347751\nPassion and dedication to your job and there's no telling what you could accomplish Dynamic, resourceful people and inspiring, innovative technologies are the norm here. We are seeking for a highly motivated, hands-on Architect who is passionate about performance engineering and performance modeling of sophisticated SoC features. You will join a team of extraordinary engineers and interacting daily with software and hardware engineering teams across Apple. In this role, you will be a member of the Platform Architecture (PA) team, responsible to shape the architecture of Apple's future System-on-Chips (SoC) for performance. The position calls for performance modeling via C++ simulation its results data mining combined with analytical analysis. The position requires close collaboration with the design teams and PA peers. We are looking for experienced and talented engineers with a passion to explore new fabrics hardware concepts and model them to demonstrate their value and impact.\nKey Qualifications\nProven hands-on software development skills (C++ highly preferred)\nExperience with SoC (micro)architecture performance modeling - highly preferred\nProficient in scripting languages such as Python – highly preferred\nExperience with SoC Design or pre/post Si validation - highly preferred\nKnowledge with common performance benchmarks and workloads - preferred\nPassionate to learn and make an impact\nPedantic, self-organized/driven and able to define priorities\nDescription\nYou will part of the architecture team defining and verifying Apple’s next generation SoC hardware solutions. Your work will be highly visible and critical to delivering the best in class performance and power efficiency in Apple’s future products. You will be expected for effective collaborate with other Si architectures, performance modeling, designers and validation engineers:  SoC System level initial analytical analysis  C++ performance coding/modeling for studies with supporting Phyton scripts  Careful results data mining and conclusions presentation to a wide experienced forum  Documenting architectural specification with the chip architect/designers  Close collaboration with chip architects, performance modeling peers, design, and design verification teams  Improve Apple’s modeling platform by suggesting and developing APIs, tools test benches that can be used throughout the company.\nEducation & Experience\nBS.c in Electrical Engineering or Computer Engineering required, MS.c in EE or CE preferred\nAdditional Requirements\nWe live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are striving for is the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk.Show more Report"}, {"company": "Apple", "job": "Display system Architect - Platform Architecture", "city": "Haifa", "date": "24h", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=103&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_22cc0d6e&cb=1678899924668&jobListingId=1008529617231&jrtk=3-1-1grj3njj5khog801-1grj3ias7i38u800-85e093a57b24f863-", "description": "Summary\nPosted: Dec 12, 2022\nRole Number:200449091\nDo you love crafting elegant solutions to highly complex challenges? Are you a big-picture forward-thinking who understands how each element affects all the others? At Apple, our Architecture group is responsible for connecting our hardware and software into one unified system. Join this team, and you’ll collaborate with engineers across Apple to design how all of our technologies work in unison. You’ll drive development of our renowned system-on-a-chip architecture and develop algorithms for platform power, performance, and thermal management. You’ll develop forward-looking prototype systems as well as build and deploy software development tools that will be distributed to the Apple engineering community. Join this team, and you’ll help build the seamless technology experiences we’re known for worldwide. In this highly visible role, you will be interfacing with software, display and system engineers to support display sub-system architecture, integration, calibration, and software programming of the SOC display systems across Apple’s iOS and macOS products from architecture definition to product release.\nKey Qualifications\n5+ years experience in display system engineering in the mobile space\nStrong understanding of SoC architecture\nFamiliarity with display technologies, including pixel pipelines, link interfaces (LVDS, DP, eDP, MIPI, HDMI, etc.), display timing controllers and pixel technologies (LCD, OLED)\nAbility to debug hardware, software and integrated displays\nProgramming experience such as C/C++, scripting in Python/Perl/Lua preferred\nDescription\nAs a member of the Platform Architecture team, you will be responsible for supporting end-to-end display systems for Apple’s products. Responsibilities include: - Define and document display system architecture, including programming and system integration guidelines, in close collaboration with SOC and display architecture teams, software teams, display engineering teams - Support and guide the SOC display sub-system through hardware design, silicon and product bring-up. - Document and support display tuning: display timing definitions, image quality tuning, panel calibration - Troubleshoot and debug new display system architectures\nEducation & Experience\nB.Sc.EE is required\nAdditional RequirementsShow more Report"}, {"company": "Arm France", "job": "Principal Field Application Engineer / Solution Architect", "city": "Raanana", "date": "1 day ago", "rating": "", "link": "", "description": "Job Overview:Are you an experienced engineer who loves to continually learn and keep up with the latest developments in microprocessor and System-On-Chip development technologies?We have an exciting new opportunity for you!You will collaborate with the most innovative, global, chip design companies to help them design SoCs, which will power the Consumer, Infrastructure, Industrial and Automotive electronic products of the future, using leading-edge Arm IP components.Responsibilities:You will engage in architectural discussions, as part of the sales and support processes, with global and local companies.You will demonstrate system design expertise and architectural planning for products in early design stages.You will provide appropriate product recommendations to meet customer design specification.You will participate in defining new products or services to meet the needs of Arm customers and maintain a high standard of technical knowledge in relation to Arm and its products, services, and competitors.You will need to build professional relationships with the engineers, architects, and decision-makers on the customer side, and work closely with R&D group and product management teams within Arm.Critical Success Factors:Good understanding of SoC design and system level architectureHigh level of knowledge of Arm product and service suiteDevelopment of strong, positive relationships with Partner managers, Marketing, Engineering, and Applications Engineering teamsDevelopment of excellent relationship with customersAbility to measure and analyse customer design requirements and offer relevant Arm products and solutionsRequired Skills and Experience:University degree (or equivalent) in Electrical/Electronic Engineering or Computer ScienceExperience in designing and/or supporting complex ASICs, IP products and EDA technologiesKnowledge in microprocessors, physical IPs, SoC design, operating systemsUnderstanding of the hardware and software design process including relevant toolsDemonstrable experience of problem solving and debug skillsSome experience of Technical Support, Field Application Engineer, or customer interactionDynamic, self-starting individual with the ability to excite and instil confidence in customers about Arm and Arm’s technologyGood organizational skills and strong team playerExcellent interpersonal and communication skills at all levelsGood presentation skills, able to clearly express technical conceptsHardworking, open minded, reliable, innovativeAble to work and communicate at a detailed or a high level, as situation requiresExcellent spoken and written English language skillsAbility to work in a multinational environmentWilling to undertake travel worldwide as needed“Nice To Have” Skills and Experience:C/C++, assembler coding or other programming skillsKnowledge of GPU or graphics processing systemDetailed knowledge of the Arm ArchitectureKnowledge of one or more AMBA bus protocolsKnowledge of PCIe, CXL, CCIXIn Return:In this particular role, your will be working with some our key clients from Israel and international well known brands.This is a unique position that will allow strong technical individuals to develop in a more customer facing and sales environment, and therefor give a boost in their career.Equal Opportunities at ArmArm is an equal opportunity employer, committed to providing an environment of mutual respect where equal opportunities are available to all applicants and colleagues. We are a diverse organization of dedicated and innovative individuals, and don’t discriminate on the basis of any characteristic.Hybrid Working at ArmArm’s hybrid approach to working is centered around flexibility, where we split our time between the office and other locations to get our work done. We empower groups/teams to determine their hybrid working pattern, with an expected minimum attendance in the office of 20% per month, depending on the work, level of experience and team’s needs. In some cases, the flexibility we can offer is limited by local legal, regulatory, tax, or other considerations, and where this is the case, we will collaborate with you to find the best solution.Job Types: Full-time, PermanentSalary: From 506,000.00₪ per yearShow more Report"}, {"company": "Apple", "job": "USB-C Hardware Architect", "city": "Israel", "date": "8d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f8701358&cb=1678899927515&jobListingId=1008512022186&jrtk=3-1-1grj3nmbt2dh3001-1grj3ias7i38u800-dc977c36ab1ae46e-", "description": "Summary\nPosted: Aug 29, 2022\nRole Number:200410095\nWhy Apple? At Apple, we believe our products begin with our people. By hiring a diverse team, we drive creative thought. By giving that team everything, they need, we drive innovation. By hiring incredible engineers, we drive precision. And through our collaborative process, we build memorable experiences for our customers. These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a hands-on development team that sets the standard in cultivating excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products? Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products very quickly. Bring passion and dedication to your job and there's no telling what we can accomplish together. In this role, you will join the Planform Architecture team that is responsible for future connectivity over USB-C, focused on USB4 development for Apple products. In this position you will become an expert in the related high-speed standards, defining the design requirements while working closely with other peers, design and verification teams.\nKey Qualifications\n5+ years of experience\nSolid background in verification / ASIC design\nPrevious experience in (micro)architecture – preferred\nExperience with high-speed designs (PCIe/USB/Ethernet) – preferred\nExperience with mixed signals designs – preferred\nExcellent communication skills\nAbility to work independently\nPassionate to learn and make an impact\nDescription\nAs part of the Platform Architecture organization, our team’s mission is to define the silicon capabilities for supporting external connectivity through USB-C in Apple’s products. We collaborate with the software and system organizations to define innovative solutions that provide an excellent user experience for Apple customers. We work together with different silicon teams throughout the entire design cycle to create state-of-the-art silicon products. This key position will help us fulfill our mission with the following core responsibilities: - Definition of hardware behavior, performance, and structure - Documenting architectural specifications - Assist in architectural analysis for different scenarios and problematic test cases - Deep understanding of the standard requirements and providing directions for design teams - Close collaboration with chip and block level architects, performance modeling teams, design, and design verification teams\nEducation & Experience\nBS, MS or PhD in Computer or Electrical Engineering\nAdditional RequirementsShow more Report"}, {"company": "Zscaler", "job": "Cloud Architect, Cloud Operations", "city": "Ramat Gan", "date": "30d+", "rating": "4.4", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=106&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a43517c6&cb=1678899928859&jobListingId=1008427448294&jrtk=3-1-1grj3nnm7mfri801-1grj3ias7i38u800-559bc08ffcd76510-", "description": "Company Description\nZscaler (NASDAQ: ZS) accelerates digital transformation so that customers can be more agile, efficient, resilient, and secure. The Zscaler Zero Trust Exchange is the company’s cloud-native platform that protects thousands of customers from cyberattacks and data loss by securely connecting users, devices, and applications in any location.\nWith more than 10 years of experience developing, operating, and scaling the cloud, Zscaler serves thousands of enterprise customers around the world, including 450 of the Forbes Global 2000 organizations. In addition to protecting customers from damaging threats, such as ransomware and data exfiltration, it helps them slash costs, reduce complexity, and improve the user experience by eliminating stacks of latency-creating gateway appliances.\nZscaler was founded in 2007 with a mission to make the cloud a safe place to do business and a more enjoyable experience for enterprise users. Zscaler’s purpose-built security platform puts a company’s defenses and controls where the connections occur—the internet—so that every connection is fast and secure, no matter how or where users connect or where their applications and workloads reside.\n\nJob Description\nJob Description\nDesign and deploy various customer facing Linux and BSD based systems infrastructures\nCreate and deploy scalable monitoring systems for massively growing global infrastructure\nArchitect and implement various cloud management automations\nContribute to OS packaging and distribution\nWrite, augment and maintain Ops documentations\nResolve NOC escalations and help prevent reiteration of those incidents by creating NOC processes, procedures and automations\nLinux/UNIX system engineering (create and support highly scalable compute solutions)\nMake recommendations on integration strategies, platforms, and application infrastructure required to successfully implement desired solutions providing best practice advice to other teams to optimize Zscaler Cloud effectiveness.\nAct as a subject matter expert on DevOps best practices with Cloud Development Groups, Configuration Management and NOC\nWork as a member of a cross-functional project team contributing to the technology-based solutions and consult on concept feasibility\n\nQualifications\nQualifications\n12+ years of experience in a Linux/UNIX System Administration or lead DevOps role\nBachelor's degree in Computer Science, a related technical field involving computer systems engineering, or equivalent practical experience.\nExperience programming in at least one of the following languages: Go, Python, or Perl\nPreferred Qualifications/Your Background:\nComfort and experience with Ops environment growing at a rapid scale\nExpertise in designing, analyzing, and troubleshooting large-scale distributed systems\nAbility to debug, optimize code, and automate routine tasks.\nHands on experience with immutable infrastructure and using infrastructure as code tools like Puppet, Chef, Ansible or similar\nKnowledge of Virtualization, OpenStack, Cloud Architecture and Services, Automated Deployments, API, Docker and Kubernetes\nStrong background in Linux/Unix system administration\nExcellent scripting skills and experience (Bash & Python/Perl) (Python preferred)\nExperience maintaining and deploying systems and software in diverse environments\nStrong understanding of web security and protocols HTTP, SSL/TLS, DNS, SQL Network fundamentals DHCP, ARP, Subnetting, Routing, NAT, Firewalls, IPv4 and IPv6\nRich DevOps skills across CI/CD, SCM, Static Code Analyzer, Builds and Releases, Continuous Integration Tools and frameworks (e.g. SVN, GIT, Jenkin, BitBucket, etc)\nKnowledge of advanced networking technologies and services including SDN, NFV, SDWAN, MPLS, BGP routing, switching, VXLANs, and architectures is a definite plus\nAbility to deliver results and work cross-functionally. Ability to engage/influence audiences and identify expansion engagements\nAdditional Information\nWhat You Can Expect From Us:\nAn environment where you will be working on cutting edge technologies and architectures\nA fun, passionate and collaborative workplace\nCompetitive salary and benefits, including equity\nThe pace and excitement of working for a Silicon Valley Unicorn\nWhy Zscaler?\n Zscaler is the world’s leading software-as-a-service security platform\nWe deliver best of breed security services with unprecedented scale\nWe protect 15 million users, in 3,250 organizations, across 185+ countries\nBlue Chip Customers (200 of Global 2,000 in our portfolio)\nGlassdoor rating of 4.7/5.0 + 98% CEO Approval = Exceptional place to work!\nPeople who excel at Zscaler are smart, motivated and share our values. Ask yourself: Do you want to team with the best talent in the industry? Do you want to work on disruptive technology? Do you thrive in a fluid work environment? Do you appreciate a company culture that enables individual and group success and celebrates achievement?\nIf you said yes, we’d love to talk to you about joining our award-winning team!\nLearn more at zscaler.com or follow us on Twitter @zscaler. Additional information about Zscaler (NASDAQ : ZS ) is available at http://www.zscaler.com. All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability.\n\n#LI-MM8\n#LI-REMOTE\nWhy Zscaler?\n\nPeople who excel at Zscaler are smart, motivated and share our values. Ask yourself: Do you want to team with the best talent in the industry? Do you want to work on disruptive technology? Do you thrive in a fluid work environment? Do you appreciate a company culture that enables individual and group success and celebrates achievement? If you said yes, we’d love to talk to you about joining our award-winning team.\n\nAdditional information about Zscaler (NASDAQ: ZS ) is available at https://www.zscaler.com.\nZscaler is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.\nZscaler is committed to providing reasonable support (called accommodations or adjustments) in our recruiting processes for candidates who are differently abled, have long term conditions, mental health conditions or sincerely held religious beliefs, or who are neurodivergent or require pregnancy-related support. If you need support, please contact us by sending an email to accommodations@zscaler.com. This email address is used specifically for accommodation requests only, and resumes, CV's, or questions other than accommodations will not be replied to or accepted.Show more Report"}, {"company": "Arm", "job": "Principal Field Application Engineer / Solution Architect", "city": "Raanana", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=107&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_85b0f350&cb=1678899929987&jobListingId=1008395414151&jrtk=3-1-1grj3nopfncd4801-1grj3ias7i38u800-e0ea96ccb64cf620-", "description": "Job Overview:\nAre you an experienced engineer who loves to continually learn and keep up with the latest developments in microprocessor and System-On-Chip development technologies?\nWe have an exciting new opportunity for you!\nYou will collaborate with the most innovative, global, chip design companies to help them design SoCs, which will power the Consumer, Infrastructure, Industrial and Automotive electronic products of the future, using leading-edge Arm IP components.\nResponsibilities:\nYou will engage in architectural discussions, as part of the sales and support processes, with global and local companies.\nYou will demonstrate system design expertise and architectural planning for products in early design stages.\nYou will provide appropriate product recommendations to meet customer design specification.\nYou will participate in defining new products or services to meet the needs of Arm customers and maintain a high standard of technical knowledge in relation to Arm and its products, services, and competitors.\nYou will need to build professional relationships with the engineers, architects, and decision-makers on the customer side, and work closely with R&D group and product management teams within Arm.\nCritical Success Factors:\nGood understanding of SoC design and system level architecture\nHigh level of knowledge of Arm product and service suite\nDevelopment of strong, positive relationships with Partner managers, Marketing, Engineering, and Applications Engineering teams\nDevelopment of excellent relationship with customers\nAbility to measure and analyse customer design requirements and offer relevant Arm products and solutions\nRequired Skills and Experience:\nUniversity degree (or equivalent) in Electrical/Electronic Engineering or Computer Science\nExperience in designing and/or supporting complex ASICs, IP products and EDA technologies\nKnowledge in microprocessors, physical IPs, SoC design, operating systems\nUnderstanding of the hardware and software design process including relevant tools\nDemonstrable experience of problem solving and debug skills\nSome experience of Technical Support, Field Application Engineer, or customer interaction\nDynamic, self-starting individual with the ability to excite and instill confidence in customers about Arm and Arm’s technology\nGood organizational skills and strong team player\nExcellent interpersonal and communication skills at all levels\nGood presentation skills, able to clearly express technical concepts\nHardworking, open minded, reliable, innovative\nAble to work and communicate at a detailed or a high level, as situation requires\nExcellent spoken and written English language skills\nAbility to work in a multinational environment\nWilling to undertake travel worldwide as needed\n“Nice To Have” Skills and Experience:\nC/C++, assembler coding or other programming skills\nKnowledge of GPU or graphics processing system\nDetailed knowledge of the Arm Architecture\nKnowledge of one or more AMBA bus protocols\nKnowledge of PCIe, CXL, CCIX\nIn Return:\nArm is an equal opportunity employer, committed to providing an environment of mutual respect where equal opportunities are available to all applicants and colleagues. We are a diverse organization of dedicated and innovative individuals, and don’t discriminate on the basis of any characteristic.\n#LI-JB1\nEqual Opportunities at Arm\nArm is an equal opportunity employer, committed to providing an environment of mutual respect where equal opportunities are available to all applicants and colleagues. We are a diverse organization of dedicated and innovative individuals, and don’t discriminate on the basis of any characteristic.\nHybrid Working at Arm\nArm’s hybrid approach to working is centred around flexibility, where we split our time between the office and other locations to get our work done. We empower groups/teams to determine their hybrid working pattern, with an expected minimum attendance in the office of 20% per month, depending on the work, level of experience and team’s needs. In some cases, the flexibility we can offer is limited by local legal, regulatory, tax, or other considerations, and where this is the case, we will collaborate with you to find the best solution.Show more Report"}, {"company": "אורגד מאגרים בע\\\"מ", "job": "VLSI Architect", "city": "Central", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=108&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7b9b4aee&cb=1678899931134&jobListingId=1005682247307&jrtk=3-1-1grj3npsnkuie801-1grj3ias7i38u800-939f6ac5b24e291d-", "description": "מיקום המשרה: השרון\nלחברת תקשורת מעולה, עם תפקידים סופר מאתגרים, דרוש/ה תותח/ית על ובכלל\nדרישות:\nChip architect/micro-chip architect for the architecture team\n\nJob description\nTeam member in the architecture group\nDefine next generation high-speed, high-performance complex System-On-Chip pipeline architectures\nSupport the Design group by delivering SPECs and conducting the implementation\n\nMust\nBSC/MSC in Electrical/Computer engineering\n5-10 years of experience in VLSI /ASIC Design and Micro Architecture of complex blocks\n(…Experienced in High Speed Networking (such as: LAN Switch, NPU, NIC, Traffic Manager, Fabric Switch, etShow more Report"}, {"company": "Synopsys", "job": "Technical Solutions Sales Manager - Digital Implementation", "city": "Herzliya", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=109&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_752e561c&cb=1678899932292&jobListingId=1008348136060&jrtk=3-1-1grj3nqvr2jqc001-1grj3ias7i38u800-efca2fb8de22e7aa-", "description": "42432BR\nISRAEL - Herzelia, ISRAEL-Haifa\nJob Description and Requirements\nOur Go To Market Group is all about delivering high-value solutions to our customers while driving growth. This is an exciting opportunity to be part of the technical sales team that supports the industry-leading solutions across the EDA software spectrum.\nThe primary focus of the Technical Solutions Sales Manager (TSSM) is to drive business growth for Synopsys EDA tool suite with a specific focus on the Digital Implementation Platform. As a SNPS TSSM you will be responsible to define and implement growth strategies in tight collaboration with Account Managers and with the support of field engineering. As a Digital Implementation TSSM, you will also collaborate with TSSM’s in the Verification and Custom Design and AMS domains to define a Synopsys centric solution to address the customer challenges.\nAs part of your daily job:\nYou’ll be creating and fostering relationships with key decision makers on the customer side and conducting qualification/discovery meetings with the goal of understanding how Synopsys Digital Implementation platform fits the customer needs.\nYou will collaborate with the field engineering to drive the technical campaigns for pointed solutions to the customers\nWith the help of field engineering, you will also be responsible to represent the needs of our customers to the Digital Implementation Technical Marketing team and to Product management.\nSynopsys Digital Implementation platform is anchored by industry leading Design Compiler, Fusion Compiler, RTL Architect, PrimeTime and PrimePower\n\nKey Qualifications:\nBS/MS EE, CS, CE or related discipline and 7+ years of experience.\nGood understanding of the Digital Implementation (RTL to GDSII) flows and methodologies.\nExcellent interpersonal, presentation and communication skills with a passion for driving business in a challenging and rewarding environment\nAbility to work in a fast-paced innovation rich environment\nPassion for business growth and for cross-functional collaborations\nPrevious experience in technical sales is a plus\nAt Synopsys, we’re at the heart of the innovations that change the way we work and play. Self-driving cars. Artificial Intelligence. The cloud. 5G. The Internet of Things. These breakthroughs are ushering in the Era of Smart Everything. And we’re powering it all with the world’s most advanced technologies for chip design and software security. If you share our passion for innovation, we want to meet you. Our Silicon Design & Verification business is all about building high-performance silicon chips—faster. We’re the world’s leading provider of solutions for designing and verifying advanced silicon chips. We enable our customers to optimize chips for power, cost, and performance—eliminating months off their project schedules\n\nSynopsys has adopted a COVID-19 vaccination policy to safeguard the health and well-being of our employees and visitors. As a condition of employment, all employees based in the U.S. are required to be fully vaccinated for COVID-19, unless a reasonable accommodation is approved or as otherwise required by law.\n\nInclusion and Diversity are important to us. Synopsys considers all applicants for employment without regard to race, color, religion, national origin, gender, sexual orientation, gender identity, age, military veteran status, or disability.\nJob Category\nSales\nCountry\nIsrael\nJob Subcategory\nProduct Solution\nHire Type\nEmployeeShow more Report"}, {"company": "אורגד מאגרים בע\\\"מ", "job": "Video Chip Architect", "city": "Central", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=110&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_add046d7&cb=1678899933405&jobListingId=1005682245962&jrtk=3-1-1grj3ns2ok619801-1grj3ias7i38u800-2333162ad183f19b-", "description": "מיקום המשרה: השרון\nלחברה מובילה, בינלאומית, בחזית הטכנולוגית, דרוש/ה Video Chip Architect\nSenior Chip Architect to lead the definition of ISP & Video device\nדרישות:\nBSc in Electrical Engineering, MSc an advantage.\n3 years of hands-on work in VLSI design.\n2 years of hands-on work in chip architecture definitions.\n2 years of hands-on work in ISP and Video.\nDeep knowledge in Imaging and VideoShow more Report"}, {"company": "GuardKnox", "job": "Embedded Software Architect", "city": "Ramla", "date": "30d+", "rating": "4.2", "link": "", "description": "Who Are We?\nGuardKnox offers high-performance computing and firmware solutions that empower automotive manufacturers and main suppliers to develop modern automotive E/E architectures and deliver the next generation of Software Defined Vehicles.\nGuardKnox’s solutions provide the necessary innovation for the automotive market to enable drivers with customization and personalized vehicle experience - essentially bringing about the ‘Smartphonization’ of vehicles. Our technology serves the needs of automotive for dynamic and adaptive technological capabilities in the evolving automotive market.\nOur pioneering approach to software-defined and service-oriented vehicles gives our customers the tools to meet the demands of today’s drivers – and to keep meeting them tomorrow. We call it The Freedom to Evolve.\nAn integral part of GuardKnox R&D is the embedded software team. This team is responsible for the core software stack which powers GuardKnox embedded solutions. The Software Architect will be responsible for building a robust Embedded SW architecture to meet all customer requirements in high performance, high reliability with minimum risk, cost, and effort. The embedded software development activities run on all layers, starting from bare metal and up to the application.\nThe position requires a highly self-motivated SW Architect engineer, independent and out of the box thinker. You will have the opportunity to be involved from early stages of architecture & design planning, through development and testing, up to integration within GuardKnox hardware products, cloud infrastructures, and field deployment.\nRequirements:\n\nBachelors’ degree in Engineering, Computer Science, or related discipline from a familiar institute.\n10+ years of software development experience - MUST.\nStrong coding skills in C++ programming languages – MUST\nStrong development experience in C++, Linux, and real-time operating systems (RTOS; Integrity/VxWorks/QNX/LynxOS/Linux Embedded) – Must\nStrong SW architecture designing experience in embedded software. e.g. RTOS selection, designing power/clock management system followed to RTOS manner.\nUse of UML modeling tools such as Enterprise Architect or Magic Draw is a plus\nExperience with software design (OOD) and design patterns; Strong design and analytical skills – must\nKnowledge in networking – TCP/IP – must\nExperience with Socket programming; Concurrent and asynchronous programming;\nExperience with Version Control tools.\nExcellent analytical skills.\nStrong written and verbal communication skills\nPreferred Qualifications\n2+ years of software team leading experience in an international environment.\nGood understanding of Agile-Scrum, Unit Testing, and Code Review methodologies - preferred\nExperience with virtualization technologies and hypervisors – preferred\nKnowledge in automotive applications and networking protocols (CAN, CAN-FD, etc.) - preferred\nKnowledge in DDS/CORBA/gRPC/Apache Thrift - preferred\nCyber security background - preferred\nExperience in kernel space programming – preferred\nExperience with On-Chip/Target debugger – preferred\nExperience in Linux BSP and driver development (boot loaders, kernel, distributions, etc.) - preferred\nExperience with modern multi-core ARM devices - preferred\nExperience in safety-critical systems - preferred\nResponsibilities Include:\n\nAs an Architect you will define, design and implement (Hands-On is required) highly concurrent and efficient software components (components-based development).\nYou will be leading work around architecture, design and documentation of interfaces, and other design documentation. Furthermore, you will also support and coach the teams to follow architectural decisions taken on their daily work.\nYou will be a part of the overall product quality work by defining needed guidelines for design and coding, together with teams.\nWrite detailed Functional and Architecture specs.\nIn close cooperation with the team Lead, coordinate the embedded software team in terms of both system architectures designing and implementation.\nInteract with the product owners, system architect to gather requirements, architect solutions, provide means to deploy and support our software.\nLead technical projects and provide guidance to junior engineers.\nDesign and implement dynamic software loading system over the network.\nWork on proof of concepts and advance development projects.\nPerform research and analysis for current and future architectures.Show more Report"}, {"company": "JobInfo", "job": "Chip Architect", "city": "Central", "date": "30d+", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=112&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_39ca91b1&cb=1678899936022&jobListingId=1008276640417&jrtk=3-1-1grj3numbncfu801-1grj3ias7i38u800-fc46244ba5b2a132-", "description": "Job Description:\nJOB DESCRIPTION\nMember of the Chip architecture team.Definition of our next generation Packet Processor & Datapath Architecture for high-performance complex SoC Ethernet Switch. Our innovative packet processors are designed into the most advanced data centers by tier-1 vendors.Architecture & micro-architecture definition for the Switch sub-systems and blocks.Support the development group by delivering specs.\nAdditional Positions:\nArchitect, ASIC designer/VLSI\nCategory:\nHardware\nJob Qualifications:\nQUALIFICATIONS\nBSc/MSc/PhD in Electrical/Computer Engineering or a related field.\n\n5+ years of experience in VLSI/Chip/ASIC architecture, micro-architecture and design of complex blocks.\n\nExperienced in high speed networking (such as: Ethernet Switch, NPU, NIC, Traffic Manager, Fabric Switch, etc…).\n\nExcellent communication skills in English - written and verbal.\n\nGood team player - Excellent communication and good team working skills; the ability to work with people at all levels.\n\nIndependent and self-learning.\nCompany Occupation:\nHigh Tech, Networking/datacom/telecom\nCompany Size:\n500+Report"}, {"company": "אורגד מאגרים בע\\\"מ", "job": "SoC/DSP Architect", "city": "Central", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a5707477&cb=1678899937117&jobListingId=1005682245978&jrtk=3-1-1grj3nvomp6cn801-1grj3ias7i38u800-91bb13bd6a52431a-", "description": "מיקום המשרה: השרון\nלחברת תקשורת, בחזית הטכנולוגיה, דרוש/ה\nSenior Chip Architect to lead the definition of SoC for audio signal processing.\nדרישות:\nBSc in Electrical Engineering, MSc an advantage.\n3 years of hands-on work in VLSI design.\n2 years of hands-on work in chip architecture definitions.\n2 years of hands-on work in signal processing.\nExperience in Signal processing, knowledge in Video and AudioReport"}, {"company": "Arm", "job": "Principal Hardware Security Architect", "city": "Raanana", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=114&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0c11d66d&cb=1678899938864&jobListingId=1008395415714&jrtk=3-1-1grj3o1fe34pl001-1grj3ias7i38u800-e17b6b5b72647143-", "description": "As Principal Hardware Security Architect, you will be a part of Security Architecture team based in Ra’anana, Israel. You will be responsible for writing architectural specifications and analysing and reviewing security related products for the Mobile, Infrastructure, Automotive and IoT markets.\nYou will join a small team of motivated and professional security and system architects who all share a passion for maintaining Arm’s leadership position and making an impact on the future Arm technologies. If you share a similar passion, we want to hear from you!\nWe are offering a hybrid approach to home and office working to provide an adaptable experience for all employees. We expect 2 or more days per week in office to build productive interaction with peers, but are flexible about home working.\nResponsibilities:\nDevelop security related system architectures that address the needs of Arm’s target market segments in Client, Automotive, Infrastructure and IoT, standardize key concepts but leave space for partner differentiation\nPerform security reviews of existing Arm and external designs\nWork with product teams and other Arm architecture teams to define the next generation security related products\nProvide mentorship on system architecture and requirements to Arm engineering teams\nRepresent Arm in technical discussions with customers\nRequired Skills and Experience :\nB.Sc. in Computer Engineering, Computer Science, Electrical Engineering. Other degrees will also be considered with relevant experience\nAnother engineering / science degree (in different field) is an advantage\nExcellent and experienced Hardware Security Systems Architect\nproven experience in designing chip level HW architectures and specification documents for hardware systems (SoC)\nProven design/verification experience\nCreative, dynamic thinker, open minded and strong problem-solving skills\nFast learner of new technologies and standards\nGreat teammate with ability to work in a collaborative environment\nExcellent verbal, written and interpersonal communication skills\nExcellent written and spoken English communication\n“Nice To Have” Skills and Experience :\nExperience with Arm processors, CPU architecture and SoC subsystems\nExperience with deeply embedded systems, embedded software, low level drivers and hardware interfaces\nFamiliarity with cryptography, data security, network security, security standards, SoC security\nExperience in developing and analysing complex systems\nM.Sc. in a releveant field\nArm is an equal opportunity employer, committed to providing an environment of mutual respect where equal opportunities are available to all applicants and colleagues. We are a diverse organization of dedicated and innovative individuals, and don’t discriminate on the basis of any characteristic.\n#LI-JB1\nEqual Opportunities at Arm\nArm is an equal opportunity employer, committed to providing an environment of mutual respect where equal opportunities are available to all applicants and colleagues. We are a diverse organization of dedicated and innovative individuals, and don’t discriminate on the basis of any characteristic.\nHybrid Working at Arm\nArm’s hybrid approach to working is centred around flexibility, where we split our time between the office and other locations to get our work done. We empower groups/teams to determine their hybrid working pattern, with an expected minimum attendance in the office of 20% per month, depending on the work, level of experience and team’s needs. In some cases, the flexibility we can offer is limited by local legal, regulatory, tax, or other considerations, and where this is the case, we will collaborate with you to find the best solution.Report"}, {"company": "אורגד מאגרים בע\\\"מ", "job": "Chip Architect Manager", "city": "Central", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=115&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_659c7f93&cb=1678899940179&jobListingId=1005682247274&jrtk=3-1-1grj3o2nnk61r801-1grj3ias7i38u800-569ec2f572871408-", "description": "מיקום המשרה: השרון\nלחברת תקשורת, נסחרת ומובילה, דורש/ה מהנדס/ת סופר מבריק/ה להובלת צוות ארכיטקטורה\nדרישות:\nManages the architecture team\n:Responsible for detailed and complete chip definitions\nDefinition of new in-house designed IP\nSOC integration\nProgramming model\nPerformance analysis\nIP (Hard and Soft) benchmarking and selection\nWorks closely with IC, System, Software and Marketing teams to define and achieve a successful and timely project\nChip’s interface definition\n\n:Technical knowledge\nAt least 10 years of hands-on work in VLSI design and architecture definition\nExperience in designing multimedia devices that combine Audio, Video, Graphics and Imaging\nExperience in designing multi-CPU platforms (DSPs and Microprocessors) and standard SOC buses such as AHB and AXI\nExperience in designing power optimized solutions\nExperience in modeling platform-performanceShow more Report"}, {"company": "Cadence Design Systems", "job": "Software Architect", "city": "Petah Tikva", "date": "30d+", "rating": "4.4", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_bbee63b6&cb=1678899941340&jobListingId=1008268485860&jrtk=3-1-1grj3o3s7k276801-1grj3ias7i38u800-637ceaa14d62d4f2-", "description": "At Cadence, we hire and develop leaders and innovators who want to make an impact on the world of technology.\nAt Cadence, we hire and develop leaders and innovators who want to make an impact on the world of technology.\nWe are looking for a Senior Software Architect for one of Cadence’s fast-growing, cutting-edge products in the domain of Hardware-Software verification. The role includes technical leadership and responsibility for entire product’s architecture and development, working in a global eco-system collaborating with different functions and organizations, as well as senior industry technical leaders.\nThe ideal candidate is an experienced senior software architect, hands-on, with analytical and problem-solving skills, HW functional verification expertise, and proven track record in building cutting-edge, large-scale software products.\nPerspec is the portable stimulus, system-on-chip (SoC) verification state of the art solution. It includes a new modeling language, constraints solver, smart GUI, analysis methods, debug tools, and more.\nThe role includes:\nLeading SW architecture across all product modules while working closely with the team leads.\nWorking with customers in order to find the best solution to meet their needs.\nDefining requirements based on customers’ needs.\nDesigning the visionary roadmap of the product while collaborating with the product marketing and field leaders.\nRequirements:\nB.Sc. (or above) in Computer Science Computer Engineering or Electrical Engineering or a related technical discipline.\nProfound understanding and proven experience in developing hardware verification tools.\nStrong SW professional with at least 15 years of experience working on complex SW projects, developing in C, C++, java or similar\nAbility to architect an end to end solution.\nExperience with B2B products and direct interaction with global customers.\nOutstanding communication and presentation skills.\nAbility to learn fast, with high tolerance for ambiguity\nExperience in defining complex large-scale systems\nVisionary and innovative attitude\nAdvantage:\nExperience with UVM/SV/PSS/e\nExperience with embedded and microprocessor architectures\nExperience in Software Product management\nExperience with IP/SoC verification aspects, tools, and methodology\nCAD development experience\nWe’re doing work that matters. Help us solve what others can’t.\nWe’re doing work that matters. Help us solve what others can’t.Show more Report"}, {"company": "JobInfo", "job": "SOC Architect", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=117&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1e9354ab&cb=1678899942782&jobListingId=1008356271000&jrtk=3-1-1grj3o59ck276801-1grj3ias7i38u800-54efa8ddf6942d5a-", "description": "Job Description:\nFor a startup that is reimagining high-performance computing, with offices in the center and in the North\nAdditional Positions:\nArchitect, ASIC designer/VLSI\nLocation:\nNorthern Israel, Haifa area, Tel Aviv - Center\nCategory:\nHardware\nJob Qualifications:\n\" 8+ years of experience working on complex, large-scale SOC architectures\n\" Knowledge and experience with one or more of the following: Microprocessor subsystems, Memory subsystem design and Cache coherency, On-chip interconnect, Debug methodology.\n\" Good understanding of ASIC design flow\n\n\" Experience with ARM, RISC-V, and/or MIPS CPU: advantage\n\" Experience with PCle, DDR, and/or CXL: advantage\n\" Knowledge in high-speed design: advantage\n\" Good understanding of SOC security aspects: advantage\n\" Excellent communication skills within and across teams and at the executive level\nCompany Occupation:\nHigh Tech\nCompany Size:\nLarge (150+)Show more Report"}, {"company": "Vayyar", "job": "Junior Internal Solutions Software Engineer", "city": "Yehud", "date": "30d+", "rating": "4.3", "link": "", "description": "Vayyar’s 4D imaging platforms are leading the way to a safer world. Not just a single product but bringing our knowledge into many domains.This journey takes us into many activities from chip design, through algorithms and embedded software to cloud and analytics.At the Vayyar internal solutions team, we build solutions to meet Vayyar's unique challenges.Developing products for internal use that help streamline and accelerate the work within our company.By embracing openness, transparency, and diversity, we aim to deliver maximum value in the best way we can.Work together with our peers and users to create a spirit of sharing and collaboration through our development work.Join us and you will architect, design, improve and implement tools enabling us to make our products a reality.In this role, you will have the unique opportunity to own and improve tooling and systems with a wide organizational impact.RequirementsComputer Science graduateHigh GradesHeld Student position for at least a yearExperience from the student position (not from the degree) with either of the following: python, java, C#, C++, go, rustPassion for product quality and attention to detailsExceptional problem solving and debugging skills.Independent, highly motivated, with good interpersonal skills.Advantage:Experience with end-to-end application development (application architecture, performance implications, integration with databases or web-based technologies)Experience with PostgreSQL or MongoDBExperience with Azure or AWSFamiliar with Matlab developmentFamiliar with CI/CD tools and processesJob Type: Full-timeShow more Report"}, {"company": "JobInfo", "job": "Lead SoC Architect", "city": "Israel", "date": "30d+", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=119&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f9eec62b&cb=1678899944854&jobListingId=1008296909849&jrtk=3-1-1grj3o79vk61t801-1grj3ias7i38u800-1a905bc754b7db72-", "description": "Job Description:\nFor a startup developing hardware components for use in datacenters, with offices in the Sharon\n\nWe are looking for an outstanding lead architect to join the architecture and system engineering team and to create and define a SoC and system architecture for a new type of SoC processing big data. The architect will be responsible for the hardware specifications and flow specifications of complicated modules in the chip and in the full system solution. The architect will work closely with the chip design, firmware and software teams. This is a rare opportunity to influence future processor architectures.\n\nJob Description\n\u0081œ Definition and specification of subsystems in the SoC which includes multi-core massively parallel processor, accelerators, network on chip and networking blocks.\n\u0081œ Breaking down the sub-system architecture into microarchitectural blocks, firmware, and SW components.\n\u0081œ Understanding the system in which the SoC is integrated to and designing the SoC to perfectly fit into the datacentre system.\n\nJob Description\nWorking with the chief architect on a full definition of an SoC which includes multi-core massively parallel processor, network on chip and networking blocks.\nUnderstanding the system in which the SoC is integrated and designing the SoC to perfectly fit into the datacenter system.\nDefine HW and system specification and break down the system architecture into microarchitectural blocks, firmware, and SW components.\nAdditional Positions:\nArchitect, System architect\nLocation:\nHybrid, Northen Sharon\nCategory:\nHardware\nJob Qualifications:\nBSc or higher degree in Electrical Engineering, Computer Science or Computer Engineering.Graduated with honors.\n\u0081œ 6+ years of experience as a system architect for large, high-end ASIC SoCs.\n\u0081œ Experience with multidisciplinary HW/SW systems.\n\u0081œ Team player with good communication skills\n\u0081œ Experience in defining requirements and architectures for advanced high-end systems.\n\u0081œ Advantage: Deep understanding of datacenter systems\n\u0081œ Advantage: Background in networks and protocols (e.g. Ethernet, IP, DDr4/5).\nCompany Occupation:\nHigh Tech\nCompany Size:\nStartUpShow more Report"}, {"company": "proteanTecs", "job": "Software Tech Lead", "city": "Haifa", "date": "30d+", "rating": "4.0", "link": "", "description": "About Us\nproteanTecs is a dynamic fast-paced start-up company, transforming the way the reliability of electronics is achieved. In a world where machines are gaining immense responsibility over our lives, sudden failure is not an option.\nWe have developed a cloud-based platform, which combines data created in chip-embedded Agents (IPs), with machine learning, to predict faults before they become failures. Our solutions provide unprecedented insights throughout the value chain, from Chip Vendors to System Vendors and Digital Service Providers.\nThe company was founded by seasoned industry veterans, including three former founders of Mellanox Technologies, with deep knowledge and experience in the electronics industry, and is backed by worldwide leading investors.\nWe encourage you to apply for this exciting opportunity and play a leading role at Israel's most promising startup. (By Globes - הסטארט-אפים המבטיחים של 2022 – גלובס (globes.co.il))\nproteanTecs, a trailblazer in the field of advanced electronics deep data analytics, is looking for an experienced Software Tech Lead to join our rapidly growing software development team to lead the technical direction of software development projects, working closely with cross-functional teams to ensure those project goals are met. We are looking for candidates with a strong background in software engineering, with a focus on building scalable, reliable, and maintainable systems.\nRequirements:\n\nBachelor's or Master's degree in Computer Science, Software Engineering, or a related field\n5+ years of experience in software development, with a focus on building scalable, reliable, and maintainable systems using Java and the Spring framework\nStrong experience in leading technical features\\projects and driving the technical direction of software development\nExcellent communication and collaboration skills\nExperience with agile software development methodologies\nProficiency in Java and the Spring framework\nGood experience with at least one of the cloud vendors: AWS, GCP, or Azure\nExperience with streaming or messaging services (like Kafka, RabbitMQ, or Flink)\nStrong experience with RDBMS databases\nExperience with Docker & Kubernetes\nProficiency in Python is a bonus, but not required\nResponsibilities:\n\nDrive the technical direction of software development projects\nCollaborate with a team of software engineers in the design and development of software solutions\nArchitect and design scalable, reliable, and maintainable software systems\nConduct proof of concepts (POCs) to explore new technologies and approaches\nDrive improvement of design processes, code, and product quality\nMonitor and suggest solutions to reduce technical debt\nStay up-to-date with industry trends and technologies and apply this knowledge to improve our software development processes\nCoach and mentor software engineers to help them grow in their careers and improve their technical skills\nPersonal skills:\n\nAs a Technical Leader at proteanTecs, you will have the opportunity to demonstrate your excellent communication skills by collaborating with team members and stakeholders at all levels of the organization. You will also have the opportunity to work effectively in a fast-paced, dynamic environment and handle multiple projects concurrently, skills that will be crucial to your success in this role.Show more Report"}, {"company": "JobInfo", "job": "Principal Hardware Security Architect", "city": "Central", "date": "30d+", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=121&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b419cd8e&cb=1678899947144&jobListingId=1008285276455&jrtk=3-1-1grj3o9hqncdu801-1grj3ias7i38u800-783c33dc6f83504d-", "description": "Job Description:\nFor a global semiconductor and software design company based in the Sharon area\nAdditional Positions:\nArchitect\nCategory:\nHardware\nJob Qualifications:\nB.Sc. in Computer Engineering, Computer Science, Electrical Engineering. Other degrees will also be considered with relevant experience\nAnother engineering / science degree (in different field) is an advantage\nExcellent and experienced Hardware Security Systems Architect\nproven experience in designing chip level HW architectures and specification documents for hardware systems (SoC)\nProven design/verification experience\nCreative, dynamic thinker, open minded and strong problem-solving skills\nFast learner of new technologies and standards\nGreat teammate with ability to work in a collaborative environment\nExcellent verbal, written and interpersonal communication skills\nExcellent written and spoken English communication\nCompany Occupation:\nData security, High Tech, Internet related\nCompany Size:\n500+Show more Report"}, {"company": "Oski Technology", "job": "Senior CPU Architect", "city": "Israel", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=122&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_92cd76e6&cb=1678899948532&jobListingId=1008267533232&jrtk=3-1-1grj3oastjigk801-1grj3ias7i38u800-d82c0ece2c77c26a-", "description": "We are now looking for a Senior CPU Architect!\nWe are seeking senior CPU Architects to create next generation CPU cores in support of a diverse array of NVIDIA products. If you love improving CPU performance through innovative CPU microarchitectural ideas; modeling them to determine merit; and then seeing them through implementation and bring up; then you should talk to us.\nWhat you'll be doing:\nDevelop cycle-accurate architectural performance and power models for the CPU core of a complex high performance system-on-a-chip.\nUse models to analyze architectural tradeoffs related to CPU Performance and Power, identifying performance bottlenecks on deep learning (DL) workloads, high-performance computing (HPC) workloads, as well as industry standard benchmarks like SPECInt and SPECFp.\nPropose micro-architectural alternatives that fit within area, timing and power constraints for the design.\nWork with the performance verification team to validate the model, and to root cause disconnects between model projections and design (RTL).\nWhat we need to see:\nMaster's degree with a focus on CPU microarchitecture, or equivalent experience.\n6+ years of relevant experience.\nA deep understanding of the state of the art of CPU microarchitecture and architecture.\nA track record of CPU microarchitectural innovation with experience in one or more of the following broad areas.\nFront End CPU Uarch (Fetch, Decode, Branch Prediction).\nMidcore CPU uarch (Rename, Allocate, Scheduler, Integer/Vector Exec).\nMemory Subsystem CPU Uarch (MMU/TLB, Address Gen, Load/Store Units, L1, L2 caches, Prefetch).\nA history of generating innovative microarchitectural ideas to improve performance ; actively doing the performance modeling and debug to demonstrate the merit and limitations of these ideas; enabling the realization of the ideas with close engagement with design.verification/postSi bringup teams.\nClose collaboration with the lead microarchitect of the core to cooperatively solve issues and help realize the overall perf/area/power targets of the CPU core.\nA strong ability to communicate and advocate the merits and drawbacks of the microarchitectural ideas to fellow microarchitects, and implementation leads in a variety of mediums, both verbally and through presentations and documents.\nAn enthusiasm, energy and drive in leading their part of the microarchitecture of the machine where they lead by doing.\nWays to stand out of the crowd:\n PhD in a relevant CPU microarchitecture area.\nAt least 4 years of industry experience in a core CPU microarchitecture.\nWith competitive salaries and a generous benefits package, NVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking and hardworking people in the world working for us.Report"}, {"company": "NVIDIA", "job": "Senior CPU Architect", "city": "Israel", "date": "30d+", "rating": "4.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=123&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ae057c98&cb=1678899950344&jobListingId=1008267388327&jrtk=3-1-1grj3ockgkbmp801-1grj3ias7i38u800-49f0e0b5be0b3abe-", "description": "We are now looking for a Senior CPU Architect!\nWe are seeking senior CPU Architects to create next generation CPU cores in support of a diverse array of NVIDIA products. If you love improving CPU performance through innovative CPU microarchitectural ideas; modeling them to determine merit; and then seeing them through implementation and bring up; then you should talk to us.\nWhat you'll be doing:\nDevelop cycle-accurate architectural performance and power models for the CPU core of a complex high performance system-on-a-chip.\nUse models to analyze architectural tradeoffs related to CPU Performance and Power, identifying performance bottlenecks on deep learning (DL) workloads, high-performance computing (HPC) workloads, as well as industry standard benchmarks like SPECInt and SPECFp.\nPropose micro-architectural alternatives that fit within area, timing and power constraints for the design.\nWork with the performance verification team to validate the model, and to root cause disconnects between model projections and design (RTL).\nWhat we need to see:\nMaster's degree with a focus on CPU microarchitecture, or equivalent experience.\n6+ years of relevant experience.\nA deep understanding of the state of the art of CPU microarchitecture and architecture.\nA track record of CPU microarchitectural innovation with experience in one or more of the following broad areas.\nFront End CPU Uarch (Fetch, Decode, Branch Prediction).\nMidcore CPU uarch (Rename, Allocate, Scheduler, Integer/Vector Exec).\nMemory Subsystem CPU Uarch (MMU/TLB, Address Gen, Load/Store Units, L1, L2 caches, Prefetch).\nA history of generating innovative microarchitectural ideas to improve performance ; actively doing the performance modeling and debug to demonstrate the merit and limitations of these ideas; enabling the realization of the ideas with close engagement with design.verification/postSi bringup teams.\nClose collaboration with the lead microarchitect of the core to cooperatively solve issues and help realize the overall perf/area/power targets of the CPU core.\nA strong ability to communicate and advocate the merits and drawbacks of the microarchitectural ideas to fellow microarchitects, and implementation leads in a variety of mediums, both verbally and through presentations and documents.\nAn enthusiasm, energy and drive in leading their part of the microarchitecture of the machine where they lead by doing.\nWays to stand out of the crowd:\n PhD in a relevant CPU microarchitecture area.\nAt least 4 years of industry experience in a core CPU microarchitecture.\nWith competitive salaries and a generous benefits package, NVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking and hardworking people in the world working for us.Show more Report"}, {"company": "", "job": "Principal Hardware Security Architect", "city": "Raanana", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=124&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c7464722&cb=1678899951460&jobListingId=1008217751825&jrtk=3-1-1grj3odo9nceu801-1grj3ias7i38u800-8862ffba65120e37-", "description": "As Principal Hardware Security Architect, you will be a part of Security Architecture team based in Ra’anana, Israel. You will be responsible for writing architectural specifications and analyzing and reviewing security related products for the Mobile, Infrastructure, Automotive and IoT markets.\n\nYou will join a small team of motivated and professional security and system architects who all share a passion for maintaining Arm’s leadership position and making an impact on the future Arm technologies. If you share a similar passion, we want to hear from you!\n\nWe are offering a hybrid approach to home and office working to provide an adaptable experience for all employees. We expect 2 or more days per week in office to build productive interaction with peers, but are flexible about home working.\n\nResponsibilities:\nDevelop security related system architectures that address the needs of Arm’s target market segments in Client, Automotive, Infrastructure and IoT, standardize key concepts but leave space for partner differentiation\nPerform security reviews of existing Arm and external designs\nWork with product teams and other Arm architecture teams to define the next generation security related products\nProvide guidance on system architecture and requirements to Arm engineering teams\nRepresent Arm in technical discussions with customers\nRequired Skills and Experience :\nB.Sc. in Computer Engineering, Computer Science, Electrical Engineering. Other degrees will also be considered with relevant experience\nM.Sc. is an advantage\nAnother engineering / science degree (in different field) is an advantage\nExcellent and experienced Hardware Security Systems Architect\n5+ years of experience in designing chip level HW architectures and specification documents for hardware systems (SoC)\nProven design/verification experience\nCreative, dynamic thinker, open minded and strong problem-solving skills\nFast learner of new technologies and standards\nTeam player with ability to work in a collaborative environment\nExcellent verbal, written and interpersonal communication skills\nExcellent written and spoken English communication\n“Nice To Have” Skills and Experience :\nExperience with Arm processors, CPU architecture and SoC subsystems\nExperience with deeply embedded systems, embedded software, low level drivers and hardware interfaces\nFamiliarity with cryptography, data security, network security, security standards, SoC security\nExperience in developing and analyzing complex systems\n\nArm is an equal opportunity employer, committed to providing an environment of mutual respect where equal opportunities are available to all applicants and colleagues. We are a diverse organization of dedicated and innovative individuals, and don’t discriminate on the basis of any characteristic.Show more Report"}]