[{"company": "CrowdStrike", "job": "Sr. Data Analyst - EASM, Israel", "city": "Tel Aviv-Yafo", "date": "27d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=101&ao=1110586&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9236282c&cb=1678899722963&jobListingId=1008474161609&cpc=663B5FE45D73772E&jrtk=3-1-1grj3hekhp2md801-1grj3bp2uhaol800-92fa3d746e7cd967--6NYlbfkN0BJMW_X9OCLkZ04_weh8WkR-IGNb1MhigwTP7XGwrJOFwZb96yIISkY_qENr62JHCGUCwODXE_Z1C9yCnPYeMWnhHT6BJpJwdl_Zg7EDZghHCbCfwjtYZP3qbdwWIatLi8Jhy8tum7mIXby9h-DxirksY-09TZVT01QgJTf8ZXm6WzHjT7M8XJ25etS7t4hwv6XtNSglSCimDPDMpQsEYJcN4LYfm6Q9VlskumurOfdteyB37jOBfOKNviE1XQ-WWP60c3u7Cbc7t1PwZ7ceNKdIEavpzg6L6_LDJTSyj_yTAzk7SQuhA3ALtbrNZeUQ3dc-q62rCL4-X6J0FbGtUke4fJcSVqfsN92Imk4He3z87OnIwgYRTjJOotsgGQj0aUe533q3IJGRA65RAc1iaxroozYdRaLaLTgjnlSUsdqBTKjRhSekaGHgZJQYx5EO69UBvXcfQLw-X1TXC-wlh4kgU7C9c5UH_dLtSrZVcWlUkqJ7dew7SxhwvcytMEML95z3ChxAUFsYz1OndwPF-EY1tAddiVbVOFex2HoKPHrosgh2RHTSO0x0x_YBBED_BQKrt0IOb1lZbGj4uHPoOquCJNqfQR_g_4wDtFBP2odhsBApBqLtRwd4TYiglUEnX9pD_l5EEBvzpyzCKckCjXp-0hwmF2F6U6yeinYaFzetEffu0Ww5frvylsz1JcI4OqO324cLM3xVQ%3D%3D", "description": "#WeAreCrowdStrike and our mission is to stop breaches. As a global leader in cybersecurity, our team changed the game. Since our inception, our market leading cloud-native platform has offered unparalleled protection against the most sophisticated cyberattacks. We’re looking for people with limitless passion, a relentless focus on innovation and a fanatical commitment to the customer to join us in shaping the future of cybersecurity. Consistently recognized as a top workplace, CrowdStrike is committed to cultivating an inclusive, remote-first culture that offers people the autonomy and flexibility to balance the needs of work and life while taking their career to the next level. Interested in working for a company that sets the standard and leads with integrity? Join us on a mission that matters - one team, one fight.\nAbout the Role:\nCrowdStrike is seeking an experienced Senior Data Analyst to join our team. The successful candidate will work with a world-class team of engineers to analyze vast amounts of data and make discoveries.\nAbout the team:\nYou will be joining to the EASM Engineering team a.k.a. CrowdStrike Falcon Surface\nFalcon Surface pinpoints unknown, exposed internet-facing assets so security teams can best secure their digital perimeter. It enables security teams to detect, prioritize, and manage all of their exposed internet-facing assets that are centralized or remote across on-premise environments, subsidiary, cloud and third-party vendors with no agents or deployment required.\nMore information about Falcon Surface\nhttps://www.crowdstrike.com/products/security-and-it-operations/falcon-surface\n\nDescription:\nAs part of the EASM Engineering team a.k.a. Falcon Surface, you will be involved in continuous data improvement, identify online assets, and take part in defining the latest product requirements and changes.\nYou will be a team member that gathers and delivers data and intelligence to help organizations.\nInterviewing process: online\nKey responsibilities:\nEnhance the accuracy of data by contributing to our platform’s asset association techniques\nExtract insights from large databases, as well as identify anomalies in large datasets\nContribute to the classification and security scanning capabilities of CrowdStrike’s Falcon platform\nCollaborate with several teams to help define cross-platform security features\nConduct web research for solutions and identifications of common web services\nParticipate in the architectural security reviews of immensely scaled CrowdStrike products\nJob requirements:\n5+ years of experience as a data analyst\nKnowledge of computer networking and web technologies like cloud computing, applications, and servers\nScripting skills, with Python preferred\nExperience working with a database\nExperience with Linux or Unix-like operating systems\nSelf-starting learner with the ability to adapt to multiple requirements\nDemonstrable critical thinking skills\nExcellent communication and team collaboration skills\nAbility to write coherent reports with key takeaways and suggestions\nFluency in English\nAdditional preferences:\nExperience working with ElasticSearch and Kibana is preferred but not required\nExperience working with data analytics in the cybersecurity landscape is preferred but not required\nIf you're passionate about cybersecurity and have a strong background in data science or data analysis, we encourage you to apply for this exciting opportunity to join CrowdStrike as a Senior Data Analyst.\n#LI-DS1\n#LI-YA1\n#LI-MZ1\nBenefits of Working at CrowdStrike:\nRemote-first culture\nMarket leader in compensation and equity awards\nCompetitive vacation and flexible working arrangements\nComprehensive and inclusive health benefits\nPhysical and mental wellness programs\nPaid parental leave, including adoption\nA variety of professional development and mentorship opportunities\nOffices with stocked kitchens when you need to fuel innovation and collaboration\nWe are committed to fostering a culture of belonging where everyone feels seen, heard, valued for who they are and empowered to succeed. Our approach to cultivating a diverse, equitable, and inclusive culture is rooted in listening, learning and collective action. By embracing the diversity of our people, we achieve our best work and fuel innovation - generating the best possible outcomes for our customers and the communities they serve.\nCrowdStrike is an Equal Opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected veteran status, or any other characteristic protected by applicable federal, state, or local law.Show more Report"}, {"company": "DoorLoop", "job": "Senior Data Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=1110586&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_83e78549&cb=1678899724039&jobListingId=1008440987692&cpc=BA15C3E50D27FFE8&jrtk=3-1-1grj3hflvihkr801-1grj3bp2uhaol800-54ca41fb4a28cc75--6NYlbfkN0Bg8kaLZpGmonnt516iCDBz1BXXYWwUs3o81vaiU99V9TLG472jvwa0fELsyMFCbJIwFfNgDGDlDNBAZocAjRsGInWfsqI9DliyMkOIGBt6VFBNKJzzVXp24PE5wDbwrWxBpc4fD0-ClI7yXJVx1azSBMNPQwI6rbbkQ0RxWJ8tAPxpRQmsfPPhcGDSxMc-9L4uHDI3XM0uqG6kmtQ9qJcUW_mei_GGjIJ37Yo8diBJ_eKRXqdW5cKKf_0AgN3sxEgHWX-QJUCgJ8Z8B5N3O7bUQ_imLW34Pl7gSM3YQSMkMPz5HkJmQSE5RCjsgdh0z-FD9xirpLsqRbO-hzzIxLj1VdUT--Igirif02hOgJEcudVsqsQC2RdlFQZkxVP-4IiUECdXgU1DiF3Rn4eqnOkO-JXEQZsJrkYVtVD-BsDm_VDDv5pL7mRhsAe1KVQpooTPf0xr4shT0AJ_ZUi_nyiNi-XRRhFp_CWkyk6WekNWQO8ft01u7QPMcJbPYqQ_00uNtfjNoZ_JJ2BuLnPX52944ntmP530hF226S22_nTuANJSHZsl1xLcb_jvlP-2JbLt2DHi3uJfGRrUw3IqSTFPCuYvpLBENDpV4I1x9-GpJA%3D%3D", "description": "About DoorLoopCertified as a Great Place to Work®, DoorLoop is a property management software used by landlords and property managers in over 100 countries.As a software company with $30M in funding, 3 offices worldwide (Miami, London, Israel), and tens of thousands of units being managed, we are one of the fastest growing tech companies.If you want to work with a team that values transparency, feedback, and growth, DoorLoop is for you.The RoleWe are looking for a super talented Senior Data Analyst to join our team in Tel-Aviv. If you are excited about what you are about to read, we invite you to apply!We are looking for someone who has a good understanding of relational databases, hands-on experience in SQL and/or Python, and data visualization tools such as Tableau and Power BI. You will be working closely with the product, marketing, customer success, and engineering teams, to improve conversions, LTV, churn, product A/B tests, and more. You will collect and analyze the data and help answer the toughest issues each team is facing in order to drive insights..Some additional qualities about you and this role:You will identify, analyze, and interpret trends or patterns in complex data sets to drive actionable insights.You will define and implement KPIs across different teams: product, business, marketing, and customer success.You will implement product features, measure their performance, and provide recommendations.Gain a deeper understanding of how customers use our product, and advise us on how to improve.You will translate product/business requirements, and create a clear visualization which \"tells the story\" using a BI tool or other platformQualifications & Requirements4+ years of experience as a Data/Business Analyst.B.S in one of the following: Industrial Engineering, Statistics, Mathematics, Economics, or a related field.An ability to understand complex business models and simplifyExperience in product analysis including working with BI events and performing A/B tests.High level of SQL is a must.Experience in BI visualization tools such as Tableau, Amplitude, or similar and performing A/B tests.Experience in data modeling, ETL development, and data warehousingTeam player, effective interpersonal skills, and good vibes. Ability to manage relationships with key partners and the ability to work independently.Experience in a fast-paced, dynamic work environment.Bonus PointsExperience in Python is a plus, but not a must.Experience working with Salesforce is a plus, but not a must.Benefits & PerksUnlimited paid time off with unlimited personal, vacation, and sick days.Annual company retreat in the US with our Miami team (all expenses paid).Career development with unlimited access to Udemy's courses and other growth opportunities.Monthly investment classes from our co-founders on how to invest your money in a diversified portfolio of real estate, stocks, crypto, NFT, & more.No micromanagement - We believe responsible people thrive on freedom.Great equipment - Ergonomic chairs, Mac or PC laptops, dual monitors, standup desks, and more.No rules - No dress code, policies, or handbooks. Just do great work & have fun!Job Type: Full-timeAbility to commute/relocate:תל אביב -יפו, מחוז תל אביב: Reliably commute or planning to relocate before starting work (Required)Show more Report"}, {"company": "חיבורים", "job": "Data Analyst לחברת סטארט אפ", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=103&ao=1110586&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b3b27979&cb=1678899725658&jobListingId=1008452058011&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj3hh8kj479801-1grj3bp2uhaol800-e5057a5dcd4bcdea--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNCSxNFK3B17GFLjAII83y_JYkZTnLSoqWY0iWqXHY12qfkW2NHGmZJz1BAO7gVIEAESAu8qinmMiWubjdy-mnma9nMxyRVtZD_4KTSjqPEV0vfV6961jzIOZym6CwV7JyiJZVtmmR2d1sCmlo4jetYbZC_--ziUyl5Llpg74KPZ6Po2x5Hn8VoQ6xI46JWH_90zbaenOp0NNs9XBVlRSoaMjXx77-ms7IsNxyCufOAFCuQU8872nF3B0Ue256-CCryLwmhwHfqa0v_wM-vgogvZbnu96dEtrmlemweNxLnzPjne_BjcR33w9N2v-H6x6YWGC_Jc6nyPEkGiZkP0g_Am1XkuQmZI8ubQHfn_PKou0wuNNqbSRTe_zr4AIj0W78bP7noKeFz0TulAszTQ6oMDvQ_g_0GRIJvc0-PDzdakFxgwMTaXJeQc9piU3jsDrpRyjF5C5ciwNEueqiz7j0Lz9FaAhSb8FT89rgmtGzuduKUlEudfbwGF5lk-y4coBZaiprKCSGoNkaQFZEUbf49s1sTNlnULZjI6nhWWCU9whoQKxzbmxJaZzA9qwb6vDqH4LqRLIipFhXjHkSPPWztqEOD5Xt2KCvZbCZSX2ZIiaj7SrnZ0ZcO_x-YQXFJl2kspZnBHjvqVtU26Os_1VZJz5Uw3kJIGqi4%3D", "description": "Compiling, analyzing, and reporting data. Investigation of data anomalies. Analyze large datasets, and provide useful actionable recommendations. Provide supporting data for prioritizing new features and initiatives.\n\nAnalyze product behavior and performance for configuration tuning per customer. Finding influencing factors and estimate their effect on the KPIs. Bachelor degree in Industrial Engineering, Statistics, Mathematics, Economics, ora related field Good numerical reasoning skills Expert level in Excel High level of spoken and written English. Team player with excellent communication and interpersonal skillsReport"}, {"company": "Plarium", "job": "Junior Survey Researcher", "city": "Herzliya", "date": "16d", "rating": "4.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=104&ao=1136043&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_64f8309e&cb=1678899727857&jobListingId=1008493539271&jrtk=3-1-1grj3hjd8mfpe801-1grj3bp2uhaol800-d2410d82e3b060b0-", "description": "About the department\nAbout Research department-The research department is responsible for the\n\nanalysis of players research, competitive offering\n\nand market trends.\nResponsibilities\nAs a Junior Survey Analyst, the new team member will perform\ncustomer research, based on questionnaires for product and marketing departments.\nThe researcher will present the findings to the internal\ncustomer and deliver a structured report.\nWhat we expectQuestionnaire writing experience -Must!!!Perform statistical analysis of surveys.Qualitative research as well; playtests, interviews,\ndiaries, etc.\nPresenting reports to all levels of managementWork with a wide range of internal clients\nDesiredAdvantage – Experience in Gaming companiesExperience with data analysis: Excel, SPSS, R,\nPython\nExperience with Power PointAdvantage: Background in academic research\nWhat we offer our Employees\nYour wellbeing: Flexible, hybrid work experience with talented professionals. Also, high work life balance derived from our people-oriented approach\nYour health: top notch health insurance to employees and immediate family. Furthermore, gym membership or a variety or workout options\nYour future: personal and professional tools to assist with your development and journey\nYour contribution: A variety of social and charitable initiatives, that we take pride in\nYour home away from home: A newly renovated office that includes breakfast every morning, a barista to give you your coffee during your workday, an in house gym and workout studio to balance all the delicious food and if you are a musician a fully equipped music room to play around in\nAnd an opportunity to work with the best of the best locally and globally in the gaming fieldReport"}, {"company": "SQLink", "job": "Data Analyst לחברת תקשורת מובילה", "city": "Tel Aviv-Yafo", "date": "3d", "rating": "3.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=1110586&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_49b865a7&cb=1678899729148&jobListingId=1008523595169&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj3hkl8klt1801-1grj3bp2uhaol800-238823863999af6b--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tGRBbjy15RxGaEEw7KZU_HKuBVxwnK2mazmK7baW_0w6QdWCshfrgikjjXoEQJyrsaPTxMAIWJZ276XUt5xlbO2uGilr1PbHhepvUl7c1nbtYiT6KQQLzQ-RnclDy1qydEvbNObl-oK0pEwTwFLWahfqwDqIYa9Yb4JDzM07QLrybm5PsG6mET2M3fNhDmehC_akv6BLOJnKeB59r544C26uyIP_86jtEUOS4JrhAQuATtVr7_IccHm6G6oSXNlGdhY42vcvxPwJyOrKMs9x1mX_YGQivFTUgEppwdfEvT-uAlMD6VPx-9yj5-Ok6O9f6sB0mkdxLBYm8d_c4UUVBsPp2ktHVmtoUFK0dKW6G3hYR7s-a3V9a5RCfe1VetJ6gLsTiCR0lHolv-2WqemDSpfBmNclirwmGQpQ_wjKKczDtCAFv5UNsoCAImcgFY_wAOngOwsKBshtlF7anAccPJTQCp6lVg8zZwdjC60HoTQ5IqQYWVDMh1s_7H-2isFKDTlgNi9fULkXd6CbG6NjSsh1tMmgsYWTXnPv5tzp3A0ZLiG0ln3zNIJg-Txls5H1nwzzJmtj2F2Fbd35JSrpjLloXvkI2_N9i39EmTkdzsU1fznPJciQNVgT2oVu8vTSp9-QQhuby44R6HjuseqAW-XtQ2R69wa6hJaxFXdI3jFdO6miJgLzutS47dvUb-yvYA%3D%3D", "description": "חברה מבוססת וחדשנית באזור המרכז מגייסת Data Analyst. במסגרת התפקיד, ניתוח נתונים, זיהוי מגמות והזדמנויות חדשות ב-Data, הגדרת מטרות עסקיות, עבודה עם כלי אנליזה, ועוד! הזדמנות להיות חלק בחברה מצליחה ולהשתלב בתפקיד בעל אתגר מקצועי. - SQL ברמה גבוהה - ידע ב-Python - תואר רלוונטי - עבודה עם כלי אנליזה וויזואליזציית נתונים: BOXI, PWBIShow more Report"}, {"company": "Nym Health", "job": "Medical Data Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.0", "link": "", "description": "At Nym, we’re passionate about simplifying healthcare by automating the accurate interpretation of clinical language.\nOur interdisciplinary team has developed an innovative technology that can understand clinical language and provides an entirely new way of analyzing and decoding medical records into clear, concise, and actionable information. This ultimately ensures clinical and administrative teams can spend more time focused on patient care.\nAt Nym, the future is bright. Our engine currently processes over five million charts annually in more than 150 emergency department and urgent care settings across the US. We are backed by top-tier VCs and growing rapidly, with offices in NYC and Tel Aviv.\nCome join us!\nRole and Responsibilities:\nNym is looking for a Medical Data Analyst to join our growing Implementation group, reporting to our Squad Lead. The ideal candidate will be responsible for ensuring the successful implementation of new clients and analyzing both historical and real-time client data while supporting the on-going configuration of Nym’s CLU engine according to the client’s needs and specifications.\nAs a Medical Data Analyst, you will:\nAnalyze and understand clients’ business objectives and needs while customizing Nym’s CLU engine accordingly.\nEnsure the successful integration of Nym’s products for the client.\nSupport Nym’s clients throughout the technical integration process, including identifying bugs and recommending fixes and improvements.\nWork with our multidisciplinary R&D team (Software Engineers, Linguists and Medical Doctors, Product team, and Customer Success team.\nProvide technical solutions for alerts and incoming escalated tickets from our customers, including extensive troubleshooting and root cause assessment.\nFind workarounds and solutions for technical challenges – doing whatever it takes for the customer to get the best service out of our product.\nPerform configuration changes, deployments, and product expansions for our customers.\nDevelop automation tools and scripts to make your work more efficient.\nRequirements:\n\nHands-on SQL or Pandas skills.\nFamiliarity with medical terminology.\nAbility to work as part of a team in a fast-growing start-up.\nHigh performer in challenging situations.\nFluent in English – both written and spoken.\nPython knowledge and experience- Strong advantage.Report"}, {"company": "Finaro", "job": "BizOps Analyst - Student", "city": "Herzliya", "date": "30d+", "rating": "4.6", "link": "", "description": "Finaro is a global cross-border payment and banking solutions provider empowering international commerce through brilliantly simple payments.\nOur passionate team, exceptional tech capabilities, product innovation, and customer-centric approach drive us to simplify complexity and create multidimensional solutions that generate growth and give our customers peace of mind. At Finaro we manage critical internet-scale finance transaction services. Stability is a core value, and the BizOps analyst’s main responsibility is to deliver information-based analytics to achieve stability.\nAs part of our continued growth, we are looking for a BizOps Analyst student (60%).\nIn this role, you will operate Finaro’s core systems, analyze data lakes, build new monitoring methods and deliver better visibility and stability to Finaro’s information services.\nResponsibilities:\nDevelop methods with IT and business units to support the information system’s stability.\nMonitor business applications’ health using a variety of technologies.\nBecome an application expert and support business issues and bugs around it\nBuild Kibana (ELK) base dashboards and SQL-based reports.\nAnalyze systems malfunctions in real-time using multiple analyzing and Big data tools.\nProduce Root Cause Analysis post incidents and manage the process of proper fixes and future mitigation.\nManage real-time incidents, communicate with IT operators, Business users, and management, act as a focal point and lead the incident to proper resolution in the most responsible manner.\nRequirements:\n\nAnalyst - Strong analytical skills with the ability to collect, organize and analyze significant amounts of information with accuracy.\nStrong problem-solving skills and attention to details\nSQL - mandatory. Firm knowledge in SQL coding.\nKibana – knowledge in Kibana analysis, create reports/dashboards - advantage\nResilient – be able to sustain critical incidents.\nPossess excellent organizational and interpersonal communication skills.\nWorking in a Production environment – a strong advantage\nB.Sc. in Industrial Engineering/math/information system or other quantitative fieldsShow more Report"}, {"company": "Rewire", "job": "Data Analyst Engineering Entry-level Full-time Details", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=108&ao=1136043&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_601c7fdc&cb=1678899733902&jobListingId=1008283064863&jrtk=3-1-1grj3hp9gm6rr801-1grj3bp2uhaol800-3a90945e160c43f3-", "description": "Rewire is a young and dynamic start-up creating an International Financial Services Platform for migrants. Rewire provides a game-changing, all-in-one, transparent, cost-effective, and simple solution. The BI team supports the firm's growth plans and enhances its position as a market leader.\nWe are looking for a business analyst who lives and breathes data to join our BI team and become our Israel business unit department analyst!\nSomeone eager to learn and with a true passion for the data industry. Can see beyond numbers, ask the right business questions and is curious to investigate and gain insights, ready to solve problems and identify trends and opportunities. As a Data Analyst, you will directly impact the company’s business performance by delivering valuable insights and analysis.\nYou will:\nWork closely with multiple departments, translate complex data into actionable insights, and identify areas of optimization and growth.\nProvide analytical support for management’s decision-making.\nDesign and create BI dashboards, reports, and ad-hoc analyses to provide insights and business performance monitoring.\nWeekly cadence of Biz readings both wide and deep dive to support our Biz decisions.\nReal time view to help us monitor our IL activity and performance.\nSupport Biz model creations and potential Biz opportunities.\nWork closely with the Marketing, Community team and CX team to process and provide insights to customer behavior and preference.\nCreating and maintaining with the Community team, Product and Marketing competitive analysis framework to monitor our position in the market, possible threats and opportunities.\nMaintain our unit economics view and management.\nREQUIREMENTS\nB.Sc. in Industry & Management, Mathematics, Statistics, Economics or equivalent\n2-3 years experience working as a data-analyst or business analyst.\nExperience working with BI visualization platforms (Looker, PBI, Tableau etc.)\nBasic sql knowledge.\nAble to model and transform data and present data in a useful business context.\nBusiness oriented view.\nAbility to translate business requirements into technical requirements.\nStrong \"storyteller\" that can leverage data and analytics in a business environment to influence decision making\nIndependent\nExcellent communication skills with fluent English - MUST\nAdvantage:\nHands-on experience with Looker.\nExperience working in the fintech industry.\nKnowledge of statistics and experience using statistical packages for analyzingShow more Report"}, {"company": "Datagen", "job": "Data Analyst", "city": "Tel Aviv-Yafo", "date": "3d", "rating": "4.0", "link": "", "description": "At Datagen, we’re simulating the world for producing high-performance synthetic data to develop the next generation of computer vision AI applications. We work with some of the most innovative companies in the world in domains like automotive, AR/VR, home security, robotics, retail, and more. We’re looking for talented people who want to take a key part in pushing forward this amazing new technology.\nWe are looking for an experienced Data Analyst to join our team. As a Data Analyst, you will work closely with the different teams to proactively find and act on existing opportunities, using the most powerful resource - data. You should have a strong analytical background, high proficiency in SQL and data visualization, and a strong understanding of business processes. You can tell the story behind complicated numbers in a simple way, and use quantitative analysis methods to do so exceptionally.\n\nIn this role, you will:\n\nExtract and analyze datasets using BI tools to drive key business decisions.\nBuild reports, dashboards, and metrics, in addition to monitoring the integrity and validity of the data reported.\nUse Snowflake to build ad-hoc queries to investigate the underlying data and provide on the go answers.\nSee beyond numbers and help to inform, influence, support, and execute our business decisions.\nIdentify data anomalies and make recommendations to support new and existing business processes.\nUncover actionable insights and make recommendations that will influence the company's strategic and tactical decisions.\nMonitor key metrics, identify business trends and forecasts.\n\nFor this role, you must have:\n\n3+ years of experience as a Business/Data Analyst or a similar role (preferably with a B2B).\nBachelor’s degree in a quantitative field (e.g. engineering, sciences, math, statistics, business, or economics).\nFully proficient in SQL and MS Excel, with high-level analytical and problem-solving skills, and exceptional attention to detail.\nStrong data reporting and visualization experience (e.g. Tableau,Qlik Sense, PowerBI).\nExperience in analyzing data to draw business-relevant conclusions and actionable insights to a range of stakeholders.\nAbility to work independently as well as in a team and manage multiple tasks simultaneously.\nStrong written and verbal communication skills in English.\n\nEven better if you have:\n\nExperience with Tableau.\nExperience with Snowflake or other cloud-based services.\nExperience with Python, R, or any other scripting language.\nDatagen is committed to being an equal-opportunity employer. All applicants will be considered without regard to race, color, gender, sexual orientation, religion, disability, or any other characteristic protected by law.Show more Report"}, {"company": "Ingima", "job": "Data Analyst", "city": "Raanana", "date": "2d", "rating": "3.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=110&ao=1110586&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_8d894ae3&cb=1678899737168&jobListingId=1008525852491&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj3hsg2jm57801-1grj3bp2uhaol800-8f714cf22edf7a8e--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tGRBbjy15RxGdG2GQysKyHDEIcoXvHl9O50tv3NEsNCTVeJmfwicpsIeQGSIXPnrXAVsjK2nZOVd0-muHCtm4gXfoZC79YF15iychy9cLDa-aekVWSOUVC2ZkNXxz-A7r3LcVIP67d696QpjN0y3b9nXIt91Q8_wkzW6PBeUwTZnUac2bNJhteEhvgap1WaWbsPBw_uHDB8E0ehOt5mJo4g9WQsmEpdom8iTrMuqHmSmt-MLNAw1t_d5lK08bGedN2hAPNvdFc82F0wLQ5mB60igfQbO6YRLPxhKx2SntFjlYEJhl9a8BwTm1cQiYlENyPyBDLXyPNefby6UMgCeBv0X9ZjSK2lsKWefYX4fSGZs_OSa6hlWlVVhsh9CG0mF5oIVQy46B2wCaswqtaOFnuhxHpFwJvU1UMlKLo8apNTEMUC7BNG3Rzf5YeuS2zXOZqb_kGpZ-s4mDGxcKR2xFD-d_0Y17bi8_qi3wI3rqWW4p1fQSWMyJqhPotI1qo-qU5_-Eef-fQ4qNqtHjetEVvmPsJe6X1IiJw4XLGnPvvsYWPz88Hd6TTFnxe_Z89UkwhIB8ceoO6_9oE5llO0u1z4mav3tppWchU1eSGm2ufsuVKMB9eWQkA4kn80foTDYDf5tjga3cTfMp64-4AmwnCDhHFNE-cQqBwPbFBTG7rn_mzzm5swTT4c%3D", "description": "העובד/ת י/תשמש כאנליסט/ית בצוות אנליזה וניהול המידע באגף מערכות מידע, בכפיפות לר\"צ אנליזה וניהול המידע. האנליסט/ית י/תהיה אחראי/ת על שליפות מידע וניתוח הנתונים עבור המנהלים הבכירים במטה ובארגון מכלל החטיבות (רפואה, תפעול, סיעוד ושירות/שיווק), וכן הוספת תובנות עסקיות מתוך ראייה תהליכית רחבה. העובד/ת י/תהווה אוטוריטה מקצועית בנושא כריית הנתונים (נאמן מידע) במחלקת דאטה ואנליטיקה עבור כלל האנליסטים בארגון. הגדרת דרישות עסקיות מול לקוחות והפקת מידע רלוונטי בהתאם לדרישות, מתוך הבנה לעומק של התהליכים העסקיים הקיימים בארגון, וכן ראייה רחבה לצורך מענה מיטבי ומדויק.\n\nניתוח נתונים בהתאם לדרישה וכן פרו-אקטיבי על ידי כריית נתונים, ניתוחם ויצירת תובנות עסקיות ללקוח היכרות מיטבית עם מחסן הנתונים וביזור המידע בארגון לכלל האנליסטים בארגון יישום והטמעת מתודולוגיות עבודה ובקרה על שלמות המידע שימוש נרחב בכלי SSBI השכלה אקדמאית במדעי המחשב / בהנדסת תוכנה/ הנדסת תעו\"נ / מתמטיקה / הנדסאי תוכנה - חובה ניסיון קודם של שנתיים לפחות כ-DATA ANALYST - חובה ידע וניסיון מוכח ב- SQL ברמה גבוהה (כולל שאילתות מורכבות, פונקציות שונות) - חובה ידע וניסיון מוכח ב-Excel ברמה גבוהה (VLOOKUP, נוסחאות מורכבות וכו') - חובה הכרות עם כלי תחקור שונים (PowerBI, Qlik וכו') - יתרון ידע וניסיון ב-Python - יתרוןShow more Report"}, {"company": "MalamTeam3", "job": "Business data analyst", "city": "Tel Aviv-Yafo", "date": "27d", "rating": "3.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=111&ao=1110586&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0ea3e6dd&cb=1678899738628&jobListingId=1008475909124&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj3htttk25d801-1grj3bp2uhaol800-225ba89e87d45367--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNCafcKOCh7xil9QVsxtDpwCG97ACljwkYsvcgMyMmktwkMWaZdvEyWFkBwT_93fQ9crX0MX4g3SclxcnCESPQ9-godjtzGF1OXURQpipN_TIL83HkiR9zZpupkH81ZLf7uxTH2G540k-3igcV8IaKiszYKi3zZNsoQeuCA1nfR11BRtam1uUi0DftLveQkK83bSnsKWh5yYJfYchMk6XpaX-hluOk70tO4ds0jaFvEKq1ivzihGgUJrjbe1ZNJIAN_cznMq2Cv27yvn92fq7sLOz1I0wGpppAZfRy4EXxAGsBSIqJkTxbdsRmERMy7ozWkV8TYsn9GChjrJoi2WHcnVjiQq4rYPGATmuFqQt0qxh-QukYKmhiE0gQFjWbYKJbEt5Tl1G4f4w9SQPQeXC5fvvU_Mjraod1KeefFGwOu9ZfT-7aIxfppqyD6nMLXQoMlRzF4mbHKuK6NkBK4YfVzpr8bJiHdS1V_gOp-ai2mMb3HNnb9_1fTeVsez5owzAqHwRIPELM50rUemrGJkiA77AExaAQmiwHSJmVJOXihZXkAPMUDyF1BO9igsms4GvjVBasHZlMoQE43hcZjPuijb2q5yhXz33TAOBIgOcz8Xuz2Bz8UuDMZXr_WU2mgSaCZwiwv4CCt9uu9UMYsQfill5yC2r6_2PXw%3D", "description": "ארגון פיננסי מוביל בתחומו במרכז מחפש Business data analyst למחלקת ה-Bi. התפקיד כולל פיתוח והפקת דוחות ב-Bo ובאקסל, שליפת נתוני שאילתות מידע מורכבות מבסיסי נתונים שונים. כמו כן, פיתוח דשבורדים למשתמשים העסקיים ואפיון צרכים של משתמשי הדוחות. - ניסיון של שנתיים לפחות ב-SQL - ניסיון של שנתיים לפחות בניתוח נתונים - ניסיון של שנתיים לפחות באקסל ברמה גבוהה ובoffice -ניסיון של שנתיים לפחות בעבודה עם בסיסי נתונים טבלאיים (יתרון לteradata)Show more Report"}, {"company": "", "job": "אנליסט | אנליסט נתונים Data Analyst", "city": "Petah Tikva", "date": "2d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=112&ao=1136043&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4fae1431&cb=1678899739866&jobListingId=1008523942322&jrtk=3-1-1grj3hv4hk61p801-1grj3bp2uhaol800-56a8343c0bef39be-", "description": "לחברת מי עדן דרוש אנליסט/ית נתונים!!!מקום העבודה:מטה החברה - פתח תקווהדרישות התפקיד:תואר ראשון באחד התחומים הבאים: כלכלה / מנהל עסקים / תעשיה וניהול חובה· שליטה גבוהה באקסל, power point, ניסיון בעבודה עם בסיסי נתונים גדולים חובה· ניסיון בעבודה עם כלי bi - יתרון להיכרות עם מערכו, power bi , tableau· יכולת אנליטית והסקת מסקנות ממספר רב של מאגרי מידע .· עבודה ולמידה עצמאית ומאומצת - חובה· אנגלית ברמה גבוההשעות עבודה:משרה מלאה א'-ה'שעות: 08:00-17:00נדרשת נכונות לשעות נוספות במידת הצורךלפרטים נוספים ושליחת קוח|** לפנייה למשרה יש להגיש מועמדות **|Report"}, {"company": "Horizon Technologies", "job": "DATA ANALYST", "city": "Ramat Gan", "date": "30d+", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=1136043&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6a188e72&cb=1678899741372&jobListingId=1008348401229&jrtk=3-1-1grj3i0jek61k801-1grj3bp2uhaol800-b9947844f7dd57e9-", "description": "DATA ANALYST?? אנחנו מחפשים אותך!!!\n\nכאנאליסט תעזור ותתמוך בבניה וניהול מוצרי הליבה הדיגיטליים, תוך תמיכה בהמשכיות עסקית ,צמיחת החברה וסיפוק מענה לצרכי הלקוחות.\n\n\nתחומי אחריות:\n\nניתוח אנליטי שוטף של שכבות מידע (פאנלים) אנליטיות ומכלול מקורות המידע\n\nעבודה מול מערכות מידע בהגדרת הדרישות של שכבות מידע חדשות, אפיון וביצוע בדיקות לווידוא שלמות ואיכות נתונים\n\nשימוש בכלים טכנולוגיים שונים לחקר נתונים ויצירת תובנות אנליטיות, דוחות ודשבורדים\nעבודה מול אגפים עסקיים – ליווי, הכוונה ושיתוף בתוצרים ובתובנותShow more Report"}, {"company": "Sensi.ai", "job": "Data Analyst", "city": "Tel Aviv-Yafo", "date": "16d", "rating": "5.0", "link": "", "description": "About the role:\nThis role contains a critical component in AI-driven machine learning. We are looking for a precise and object-oriented individual in the quantitive field of data classification to join our team.\nOur insight is to train AI/ML algorithms to provide our clients with precise predictions.\nAs a data analyst, you will annotate, create and analyze various complicated datasets and draw intelligent conclusions to support our mission.\nRequirements:\n\nExperience of 2+ years with writing SQL queries\nExperience of 2+ years with Python (Pandas, NumPy)\nExperience in data tagging\nExperienced in work with 3rd party service providers\nGoals-oriented team player\nStrong analytical skills and knowledge of analytical strategiesShow more Report"}, {"company": "nSure.ai", "job": "Product Data Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "", "description": "nSure.ai is an advanced payment fraud prevention platform for sellers of digital goods, gaming, crypto, and fintech. Its bespoke ML models help merchants to realize their true business potential, increase revenue, decrease costs, minimize churn, and mitigate fraud expenses.\nAs a Product Data Analyst, you will proactively guide business growth based on data analysis and statistical research, and have a significant impact on decision making. Conduct end-to-end data analysis that includes requirement specification and data collection, pre-processing, analysis, in addition to owning ongoing deliverables and presentations.\nYou will explore and investigate creative solutions for a variety of unprecedented challenges with the objective of constantly improving performance. Develop processes and tools to monitor and analyze model performance and data accuracy as well as define KPIs to measure product and initiative performances.\nYou will take ownership by working independently as well as leading large projects with significant potential impact, through collaboration with internal stakeholders to ensure delivery of the intended outcomes.\n#LI-Hybrid\nRequirements:\n\nWhat you'll need to be a successful Product Analyst at nSure.ai:\nBachelor’s degree in Economics, Statistics, Industrial engineering or a related field.\n2+ years of experience as a product analyst - a must.\nDetail oriented.\nLoves working with numbers.\nSQL & Python experience\nPassionate about understanding how the business works, curious and eager to stay on top of changes in a fast paced business environment.\nProactive, independent and communicative.\nFast learner, natural curiosity and intellectual horsepower to deeply understand new topics and pick up new skills in a very short time.\nStrategic problem solver\nCreative, someone who is able to come up with different interpretations for the same data.\nLoves the startup spirit and would like to join the ride.Show more Report"}, {"company": "AlignTech", "job": "Data Analyst", "city": "Petah Tikva", "date": "1 day ago", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=1136043&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_96456ff3&cb=1678899749424&jobListingId=1008526257358&jrtk=3-1-1grj3i8euncdr801-1grj3bp2uhaol800-7f5fce202a8c0c49-", "description": "Join a team that is changing millions of lives.\nTransforming smiles. Transforming lives. Transforming an industry.\nAt Align Technology, we believe a great smile can transform a person’s life, so we create technology that gives people the confidence to take on whatever’s next. We revolutionized the orthodontic industry with the introduction of the Invisalign system, and we have never lost sight of that spirit of innovation. Our teams are constantly pushing the boundaries of what’s possible.\nReady to join us?\nAbout this opportunity\nThis role focus on learning from our install base, helping us improving our quality and customer experience.\nThe Data Analyst will turn data into information, information into insight and insight into business decisions. He/she will develop analysis and reporting capabilities, monitor performance and quality control plans to identify improvements.\nInterpreting data, analyzing results using statistical techniques\nDeveloping and implementing data analyses and data collection systems\nIn this role, you will…\nInterpret data, analyze results related to our install base\nUse statistical methods to analyze data and generate useful business reports\nIdentify, analyze, and interpret trends or patterns in complex data sets\nAcquire data from primary or secondary data sources working closely with BI team\nCreate dashboard and ad hoc reports to the customer satisfaction team\nFilter and “clean” data by working closely with the professional services team for NPI projects\nWork with management to prioritize business and information needs\nDefine new data collection and analysis process to improve our visibility to our Install base\nForecasting and preparations for long terms for service and business aspects\nImprove customers utilization by review trends and changes\nImplement new method and tools such as machine learning, Azure, etc, and look for opportunities for new technologies\nIn this role, you’ll need …\nProven working experience as a data analyst or business data analyst 1 years\nBSc in Mathematics, Economics, Computer Science, Information Management or Statistics or similar.\nKnowledge of and experience with reporting packages (Business Objects etc), databases (SQL etc), programming (XML, JavaScript, or ETL frameworks)\nKnowledge of statistics and experience using statistical packages for analyzing datasets (Excel, SPSS, SAS etc)\nStrong analytical skillswith the ability to collect, organize, analyze, and disseminate information with attention to detail and accuracy\nStrong communication skills, working with global teams and clearly presenting data and findings\nStrong technical knowledge and understanding of our platforms and flows\nKnowledge in Power BI/ Tableau or any other data visualization SW\nSW Develop skills – advantage\nExperience with Big Data – advantage\nFamiliar with Databricks / AWS services – advantage\nKnowledge of Python/spark – advantage\nSound like a good fit?\nGreat! Click the Apply link below to let us know you are interested. Not the right fit? Don’t worry, there are lots more opportunities. Please consider sharing this opportunity with others in your network.\nAbout Align\nInvisalign clear aligners, iTero Intraoral scanners, and OrthoCAD digital services that help dental professionals achieve the clinical results they expect and deliver effective, cutting-edge dental options to their patients.Show more Report"}, {"company": "ONE ZERO Digital Bank", "job": "QA Data Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.5", "link": "", "description": "One Zero is looking for an individual with a strong attention to detail and a passion for customer service to join our dynamic team as a Quality Assurance (QA) Data Analyst. The successful candidate will be responsible for executing manual tests, analyzing results, reporting observations, and collaborating with cross-functional teams such as Back Office and Engineering to improve our internal products. The role will evolve as the candidate grows with the company.\n\nRequirements:\n\n2+ years of recent experience in data qualityStrong attention to detail and ability to analyze edge casesProficient in SQL, including complex queriesExtensive experience with REST APIs and advanced querying of search enginesStrong technical skills and knowledge of computers and smartphonesIn-depth understanding of end-to-end processes and the data flow through themMultitasking and excellent time management skillsStrong communication skills, both verbal and writtenLogical and critical thinking skillsIndependent and solution-oriented approach\nResponsibilities:\n\nConduct and supervise manual tests for customer insightsIdentify and track defects from discovery to resolutionPerform data analysis using SQL on data and insightsProvide primary support for all QA aspects of releases, testing for internal clients, and coordinating QA resources internally and externallyWork with data warehouse architects, data scientists, and backend developers in developing and executing test scenariosAssist the Customer Success team with investigationsParticipate in daily stand-up meetings and document processes\nAdvantages:\n\nFintech experience, particularly in the banking domainShow more Report"}, {"company": "One1", "job": "Data Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=118&ao=1136043&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6b6d8872&cb=1678899752321&jobListingId=1008411843849&jrtk=3-1-1grj3ib9pk24q801-1grj3bp2uhaol800-797c8f6b1c2dcb40-", "description": "BI/BIG DATA\nתל אביב\n38628\nאנחנו מגייסים עם מעל שלוש שנות ניסיון לצוות ה-BI שלנו! אנחנו מגייסים\nאנחנו מגייסים עם מעל שלוש שנות ניסיון לצוות ה-BI שלנו!\n\nאנחנו מגייסים דאטה אנליסט.ית עם הבנה עסקית ויכולת ניתוח גבוהה\nהתפקיד כולל איפיון צרכי משתמשים וכתיבת מסמכים עסקיים וטכנולוגיים.\nבניית אלגוריתם עסקי וסטטיסטי תפקיד המשלב עבודה עצמאית\n\nדרישות התפקיד:\nמינימום שנתיים ניסיון מעשי בפיתוח והרצה של מודלים סטטיסטים\n-SQL ברמה גבוהה - לפחות 3 שנות ניסיון\n-3 שנות ניסיון עם מערכת BI (יתרון ל- Tableau, Power BI)Show more Report"}, {"company": "Octopol", "job": "Data Analyst", "city": "Raanana", "date": "30d+", "rating": "3.6", "link": "", "description": "Octopol is a pioneer company that integrates statistics modules and algorithms with a passion to sports, mainly soccer.\nWe are looking for a data analyst to join our research department. The data analyst function will support several stakeholders in Octopol.Working with the research team and be the one to look and understand the bigger picture.Learning the data gathering mechanism.Face and solve business problems by analyzing data and provide insights to the business, covering a range of topics.Develop complex logic flows to identify predefined events and generate desired insights.Support the researchers on their projects.Responsible for conducting both recurring and ad hoc analysis for business stake holders.Research and integrate new tools and methods to enrich datasets.\nRequirements:\n\nRequirements+2 years of experience as Data Analyst.High hands-on SQL skills (MySQL, SQL server)background in programming (R or Python).knowledge in statistics.\n Added bonuses if you have:interest in FinTech, Algo Trading – a big advantage.interest in sports (soccer in particular)Show more Report"}, {"company": "accessiBe", "job": "Data Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.7", "link": "", "description": "accessiBe is the market leader in web accessibility, making websites accessible to people with disabilities. As we grow, we are looking for a Data Analyst to join our Growth Division. As the first analyst in our company, you will be responsible for defining and executing various analysis projects, assisting different teams in the Growth, Sales, and Marketing department, identifying trends, presenting business opportunities, and evaluating other activities according to our business KPIs.\nWant to make a real impact? Click here and find out how!\n\nClick here to learn more about accessiBe's #companyculture\n\nWhat you'll be doing:\nBuild and maintain reports, dashboards, and KPIs to monitor performance.\nWork closely with different departments to understand their data needs, and present solutions.\nUse data from different marketing and sales platforms to perform complex analysis projects\nFind technical solutions for cross-platform data deficiencies, and own implementation and execution\nRequirements:\n\n3-5 years of experience in Data analysis, preferably in a SAAS company - A must\nFamiliarity with B2B and sales-related metrics\nHigh familiarity with Salesforce - A must\nFamiliarity with different marketing platforms such as Google Ads, Google Analytics, Facebook etc - A strong advantage\nStrong technical orientation, ability to work with technical teams on data-related tasks\nSelf-learner, Self-starter, problem-solver\nExcellent written and verbal communication skillsShow more Report"}, {"company": "Identiq", "job": "Fraud Data Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.8", "link": "", "description": "We are looking for experienced Fraud & Data experts to join Identiq’s Analytics team!\nIdentiq’s Fraud Analytics team is key to the success of Identiq and our customers. In this role, you will be best positioned to impact our product and how our customers benefit from it.\nIf you are excited about data and love to have a significant impact wherever you are, then come help us transform how fraud risk management is done around the world!\nRequirements:\n\n2+ years experience working with and analyzing large, complex data sets\n2+ years experience in fraud and risk management - an advantage\nHands-on experience with SQL and R/Python\nA customer-oriented, collaborative and proactive attitude\nVery high proficiency in English - verbal and written\nExperience in working with Sales teams - an advantage\nWillingness to travel abroad occasionally\nAbility to work in flexible hours\nResponsibilities:\n\nIn the first 6 months, your main mission is to successfully show the value of our product by running evaluation analyses with our strategic clients.\nIn your role, you will be working with customers, development, and customer success teams, to guarantee the successful onboarding and fraud prevention benefits of Identiq’s customers while providing insight to the Identiq product and development teams.\nDuring this time, your day-to-day will include the following challenges:\nPerform comprehensive analysis in order to demonstrate the benefits of the Identiq network to our strategic customers.\nWork with the Risk teams of our strategic customers to help them fully onboard into the network and make sure their use of it is optimal\nFind creative solutions to complex problems, involving a deep understanding of both technical, business, and analytical objectives\nIdentify, prioritize, track, and communicate data issues internally and externally\nCollaborate with a team of A-player analysts and engineers to help develop the next generation of Identiq’s solutions\nAs Identiq moves into later product stages, our team’s mission will expand to supporting other analytic domains according to company needs (research, client support, etc), and your knowledge and drive will guide our product’s evolution.\nAbout Us:\n\nIdentiq is a fast-growing startup set to change the fraud prevention and identity verification market. Unlike traditional identity verification vendors, the Identiq protocol can validate users’ identities without exposing any personal data whatsoever, guaranteeing absolute end-user privacy. The largest companies in the world are joining us these days to form the first fully anonymous global identity verification network. Imagine companies being able to treat new customers as if they have been knowing them for years while creating a better user experience.\nWhy join Identiq?:\n\nWe are creating the world’s first network for Anonymous User Verification, a brand new paradigm in the fraud-fighting space\nYou’ll get the chance to work with a highly experienced and knowledgeable team, dedicated to helping foster your personal and professional growth\nWe strive to do what is right, even if it’s not what is easy, and we absolutely love itShow more Report"}, {"company": "Healthy.io", "job": "Data Analyst- Maternity Leave Replacement", "city": "Tel Aviv-Yafo", "date": "22d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=122&ao=1136043&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_27163349&cb=1678899759079&jobListingId=1008483203800&jrtk=3-1-1grj3ihquk61u801-1grj3bp2uhaol800-e724e70f55b7418e-", "description": "About the position\nHealthy.io is the first company to successfully turn the smartphone camera into a clinical-grade medical device, enabling faster treatment and improved care for patients worldwide. Our products combine computer vision and machine learning technology with best-in-class UX design to create new clinical pathways through smartphone-powered urinalysis, digitized wound management, and beyond.\nHeadquartered in Tel Aviv with 250 employees across London and Boston, we are growing fast as we serve more and more patients across ever-expanding areas of healthcare.\nWe are seeking a data analyst to join our research group and assist in the development of cloud and edge device solutions. The ideal candidate will provide data insights to support the optimization of our products and user experience, as well as manage our in-house annotation team. We are looking for a team player with strong analytical and problem-solving skills.\nImportantly, successful candidates should be able to handle viewing and analyzing medical images.\nRequirements\n2+ years of experience as an analyst of user-facing products or similar roles.\n2+ years of hands-on experience writing SQL queries and working databases\n1+ year of hands-on experience with data visualization tools\nCapable of developing quantitative KPIs to support product decisions\nAbility to understand complex data and turn it into actionable insights\nStrong written communication and story-telling skills in English\nCapacity to multitask and prioritize effectively, working cross-function with other teams, and thriving in a high-pressure environment\nPreferred Qualifications\nExperience with Tableau\nExperience with the product life-cycle / working with Product teams\nExperience with BigQuery\nExperience scripting in Python\nRole & Responsibilities\nBe the focal point for all data-related tasks within the Research Group\nOwn the communication with the annotation team and manage their workflow\nWork closely with other members of the group to create dashboards and reports across our products\nPerform ad-hoc performance analysis of new algorithms to support product and business decisionsReport"}, {"company": "Finonex", "job": "Product Data Analyst", "city": "Herzliya", "date": "30d+", "rating": "3.8", "link": "", "description": "We are growing and looking for a brilliant Data Analyst to join our fast-growing company and Data department.\nAs part of this position, you will work closely with multiple business units/products which are from Finonex's internal innovation home or post Acquisitions products.\nYou will support all analytical needs of these units, such as: defining the analytical layer, marketing & product analytics needs, and mostly on business questions.\nRequirements:\n\n3+ years of experience as a business analyst (online industry advantage)\nVast knowledge and hands experience in SQL including complex queries from multiple data sources- Must\nExpert level with reporting platforms and data visualization - Must (Pyramid strong advantage)\nExcellent analytical skills\nHigh presentation and communication skills\nFluent in English communication, written and verbal.\nOn this role you will:\n\nSupport several different units and products by nature\nData analyst focal for Business units & engineering related teams\nProactively provide insights that will lead the business growth\nAbility to module and simulate new features & opportunities estimated impact\nBuild and maintain reporting and dashboards\nManage multiple tasks at a time in fast-paced\nConduct deep dive analysis with actionable recommendations and conclusions\nWill be nice that you have:\n\nExpert level in working with Big data tools (advantage)\nExperience with GA and Product analytics tools (Mixpanel/ Amplitude/Heap)\nExperience in the online industryReport"}, {"company": "Tectu", "job": "Data & BI Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=124&ao=1136043&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_126091ac&cb=1678899762668&jobListingId=1008401770511&jrtk=3-1-1grj3ilchklui801-1grj3bp2uhaol800-9521be01e6a16bea-", "description": "Tel Aviv, Israel\n\nJob Type:\n\nPart Time\n\nAbout the Company\nAt Tectu, you can make a real impact! As a Data & BI Analyst you will play a lead role in delivering data and business strategies, solutions and processes to support the data oriented projects. The ideal candidate is passionate about delivering cutting edge solutions to support the changing business needs and technology landscape. You will be working closely with others on our Product and Engineering teams to define and deliver these solutions.\nIf you are data obsessed, passionate about technology, self-motivated and a disciplined freelancer, we would love to speak with you. The ideal candidate has both a willingness and desire to work in a dynamic environment, is able to apply Agile methodologies in day-to-day activities, and who enjoys working both independently with little oversight and in a team environment.\nAbout the Role\nAt Tectu, we work with various customers, providing advanced tech solutions to solve different problems and needs. As a Data & BI analyst at Tectu, your day will most likely vary according to which projects you’re involved in, but generally you’ll be performing the following activities:\nIdentifying or diagnosing a problem to analyze\nCollecting appropriate data from various sources\nCleaning and preparing the data for analysis\nAnalyzing the data for insights, patterns, or trends\nInterpreting the results of the analysis with reports and dashboards\nCollaborating with stakeholders and presenting key findings\nResponsibilities:\nBe an integral part of the team defining data strategy and capabilities roadmap for various customers\nWork closely with data engineers to effectively plan and build data engineering tools, data warehouses and data lakes\nProvide core contributions to multiple products, projects, solutions and processes through all stages of the development lifecycle\nPerform analysis to assess quality and meaning of data\nUse statistical tools to identify, analyze, and interpret patterns and trends in complex data sets that could be helpful for the diagnosis and prediction\nUse data visualization tools (e.g. Tableau, PowerBI, Looker, Qlik) to build dashboards and drive insights\nAnalyze local, national, and global trends that impact both the organization and the industry\nPrepare reports for the management stating trends, patterns, and predictions using relevant data\nQualifications\nRequirements:\n5+ years of experience as a Business Intelligence Analyst and Data Analyst\n2+ years of experience in advanced analytic related multivariate and A/B testing, digital revenue attribution, cohort analysis, lifetime value analysis, media mix optimization, customer segmentation, and marketing effectiveness\n3+ years of experience working with data visualization tools, such as Tableau, PowerBI, Looker, QlikSense, etc\nStrong mathematical skills to help collect, measure, organize and analyze data\nStrong analytical skills and SQL proficiency\nTechnical proficiency regarding database / DWH design development, data models, techniques for data mining, and segmentation.\nProficiency in statistics and statistical packages to be used for data set analysis\nAdept at using data processing platforms like Spark & Presto\nKnowledge of how to create and apply the most accurate algorithms to datasets in order to find solutions\nAccuracy and attention to detail\nAdept at queries, writing reports, and data visualization\nSoft Skills:\nStrong work ethic and strong core values (honesty, integrity, creativity)\nSense of urgency, ownership mindset, and customer focus\nInnovative problem solver who takes initiative never stops thinking about ways to improve\nAbility to self-learn new skills and technologies\nAdvantage:\nBSc in highly-quantitative field (Analytics, Computer Science, Industrial Eng, Mathematics, EE) is preferred\nData driven mindset\nAble to create and communicate the 'big picture' in a clear way.\nFamiliar with best practices of the data and software engineering lifecycle\nKnowledge of programming languages like Python, R, MATLAB, or otherReport"}, {"company": "Wix", "job": "Performance Analyst", "city": "Tel Aviv-Yafo", "date": "10d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=125&ao=1136043&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_648d59a6&cb=1678899764446&jobListingId=1008509563844&jrtk=3-1-1grj3in4bncfv801-1grj3bp2uhaol800-c622c305ab3cde28-", "description": "We are:\n\nWix’s Acquisition team. We’re a dynamic, dedicated and fun group that plays a crucial role in Wix’s online marketing efforts to introduce new users to Wix’s incredible suite of products. Our efforts attract over 200 million active users and we continue to add 2 million new users every month. We’re looking for a passionate Online Performance Analyst who can help us leverage data analytics and shape and enhance our online advertising strategy.\n\nYou are:\n\nAn analytical expert with a head for numbers, and you're not afraid to dive into data to uncover insights. Your goal-oriented approach and ability to work independently make you a valuable asset to any team. You’re passionate about the power of analytics and believe that data should inform decision-making processes. Your ability to identify and pursue new business opportunities sets you apart from others in your field.\n\nBonus points if you’re an expert in Excel.\n\nAs a PPC Analyst, you will:\nManage PPC advertising campaigns on Google AdWords, Facebook, and other platforms, translating the outcomes into easy-to-understand results\nAnalyze results and optimize performance according to various KPIs\nCultivate fresh ideas and discover new opportunities based on big data analysis\nStay up-to-date with the latest Google AdWords/Facebook Advertising features and integrate applicable ones into the team’s strategy\nDraw on the data to spearhead relevant initiatives that support business objectives\nApply NowShow more Report"}, {"company": "Similarweb", "job": "Data Analyst - Advisory Services", "city": "Tel Aviv-Yafo", "date": "22d", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=126&ao=1136043&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ac64affc&cb=1678899766687&jobListingId=1008483242429&jrtk=3-1-1grj3ipa7k619801-1grj3bp2uhaol800-06a6560bdbfd2026-", "description": "Similarweb is the leading digital intelligence platform used by over 3500 global customers. Our wide range of solutions power the digital strategies of companies like Google, eBay, and Adidas.\n\nWe help our customers succeed in today's digital world by giving them access to data-driven insights, competitive benchmarks, strategic analysis, and more.\n\nIn 2021, we went public on the New York Stock Exchange, and we haven't stopped growing since!\n\nWe are looking for a Data Analyst !\n\nWhat does the day to day of a Data Analyst (Advisory Services) at Similarweb look like:\n\nApply your expertise in quantitative analysis and data mining to turn data into insights.\nConduct research and develop tools which will help answering client's' business questions by using Similarweb's raw data sets and algorithms.\nCreate custom reports according to strategic clients business needs.\nPartner with Engineering teams to establish an infrastructure to scale solutions.\nPartner with Advisory Services team of Consultants to answer strategic business questions and deliver custom data products seamlessly\n\nWhat will I bring to the team?\n\nAt least 2 years experience with SQL for data analysis - Must\nExperience in Python scripting - Must\nExcellent verbal and communication skills (in English) - Must\nHadoop/Spark/AWS Infrastructure experience - Big Advantage\nProficiency in Online Marketing/Online Services- Advantage\nAt least 2 years work experience in Online/Tech Company - Advantage\nTeam player, autodidact, fast learner with excellent analytical, research and business skills.\n\nWhy you'll love being a Similarwebber:\n\nYou'll actually love the product you work with: Our customers aren't our only raving fans. When we asked our employees why they chose to come work at Similarweb, 99% of them said \"the product.\" Imagine how exciting your job is when you get to work with the most powerful digital intelligence platform in the world.\n\nYou'll find a home for your big ideas: We encourage an open dialogue and empower employees to bring their ideas to the table. You'll find the resources you need to take initiative and create meaningful change within the organization.\n\nWe offer competitive perks & benefits: We take your well-being seriously, and offer competitive compensation packages to all employees. We also put a strong emphasis on community, with regular team outings and happy hours.\n\nYou can grow your career in any direction you choose: Interested in becoming a VP or want to transition into a different department? Whether it's Career Week, personalized coaching, or our ongoing learning solutions, you'll find all the tools and opportunities you need to develop your career right here.\n\nDiversity isn't just a buzzword: People want to work in a place where they can be themselves. We strive to create a workplace that is reflective of the communities we serve, where everyone is empowered to bring their full, authentic selves to work. We are committed to inclusivity across race, gender, ethnicity, culture, sexual orientation, age, religion, spirituality, identity and experience. We believe our culture of equality and mutual respect also helps us better understand and serve our customers in a world that is becoming more global, more diverse, and more digital every day.Show more Report"}, {"company": "InspHire", "job": "Product Data Analyst", "city": "Herzliya", "date": "30d+", "rating": "5.0", "link": "", "description": "We are looking for a product data analyst to join an international game development company founded in 2009, dedicated to creating the best mobile and social experience for hardcore and casual gamers worldwide. With over 250 million registered users, this company is consistently ranked among top game developers.\nThe company employs more than 1,500 individuals worldwide and is headquartered in Herzliya Israel, with eight offices and development studios across Europe and the United States. The company's games are available on iOS, Android, and all major social networks.\nThe Business Performance department is responsible for enhancing the business success of the company by ensuring excellence in the performance on all business aspects including marketing, games & product design, retention, monetization, etc. The department builds, operate, and optimize the processes across the entire company through the top of the art analytical capabilities & product understanding.\nResponsibilities\n• Leverage data to understand the company's products in depth, identify areas of opportunity, and execute projects to drive growth and engagement of the company's users\n• Work closely with the product teams to analyze existing features and ensure a successful implementation of new features.\n• Use data to fine-tune and balance the game’s economy, providing economy analysis and drive metrics for revenue optimization\n• Evaluating and measuring A/B testing results and trends among players\n• Build and maintain reports, dashboards, and metrics to monitor the performance of products\n• Be an expert on industry trends and the competitor landscape to evolve the company's thinking\nWhat we expect\n• 2+ years of experience in product analytics in the Online/Gaming industry\n• BA/B.Sc. in Statistics / Math / Engineering / Economics or other quantitative fields\n• Strong SQL with experience in querying large, complex data sets.\n• Strong Excel skill\n• Advanced knowledge in statistical tools and models- advantage\n• Proven experience leading data driven projects from definition\n• High level of analytical and problem-solving skills with strong attention to details\nDesired\n• Experience working with Qlikview – advantage\n• English: Advanced\n• Core competencies: Professionalism, Responsibility, Collaboration and Teamwork, Initiative and Creativity\nPersonal Requirements:\n• Ability to collaborate with colleagues across different disciplines and locations to achieve results\n• Passion for gaming\n• High level of verbal and written English.Show more Report"}, {"company": "Credorax", "job": "BizOps Analyst", "city": "Herzliya", "date": "30d+", "rating": "4.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=128&ao=1136043&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_49d5ceda&cb=1678899770616&jobListingId=1008328375499&jrtk=3-1-1grj3it3ijfmj801-1grj3bp2uhaol800-0c5b6b8dc30970ab-", "description": "Location: Sapir Street 6, Herzliya, Israel\nAre you brilliant?\nFinaro is reimagining the payment industry.\nIf you value friendship, learning, and getting things done; if you consider yourself creative, enthusiastic and passionate about solving problems – We want to meet you!\nFinaro is a global cross-border payment and banking solutions provider empowering international commerce through brilliantly simple payments\nOur passionate team, exceptional tech capabilities, product innovation, and customer-centric approach drive us to simplify complexity and create multidimensional solutions that generate growth and give our customers peace of mind.\nWe work with some of the biggest industry giants including Plus500, WOLT, Kiwi.com, Air Baltic, Payrexx, Revolut, Go2Mobile and Hero Gaming. With a growing global staff of 350 employees, main offices in Israel and Malta, and presence all across Europe, in China, Hong Kong, and North America, the future looks fantastic.\nThe future looks Finaro.\nDescription\nFinaro is a global cross-border payment and banking solutions provider empowering international commerce through brilliantly simple payments.\nOur passionate team, exceptional tech capabilities, product innovation, and customer-centric approach drive us to simplify complexity and create multidimensional solutions that generate growth and give our customers peace of mind. At Finaro we manage critical internet-scale finance transaction services. Stability is a core value, and the BizOps analyst’s main responsibility is to deliver information-based analytics to achieve stability.\nAs part of our continued growth, we are looking for a BizOps Analyst student (60%).\nIn this role, you will operate Finaro’s core systems, analyze data lakes, build new monitoring methods and deliver better visibility and stability to Finaro’s information services.\nResponsibilities:\nDevelop methods with IT and business units to support the information system’s stability.\nMonitor business applications’ health using a variety of technologies.\nBecome an application expert and support business issues and bugs around it\nBuild Kibana (ELK) base dashboards and SQL-based reports.\nAnalyze systems malfunctions in real-time using multiple analyzing and Big data tools.\nProduce Root Cause Analysis post incidents and manage the process of proper fixes and future mitigation.\nManage real-time incidents, communicate with IT operators, Business users, and management, act as a focal point and lead the incident to proper resolution in the most responsible manner.\nRequirements\nAnalyst - Strong analytical skills with the ability to collect, organize and analyze significant amounts of information with accuracy.\nStrong problem-solving skills and attention to details\nSQL - mandatory. Firm knowledge in SQL coding.\nKibana – knowledge in Kibana analysis, create reports/dashboards - advantage\nResilient – be able to sustain critical incidents.\nPossess excellent organizational and interpersonal communication skills.\nWorking in a Production environment – a strong advantage\nB.Sc. in Industrial Engineering/math/information system or other quantitative fieldsShow more Report"}, {"company": "Beach Bum", "job": "Data Analyst", "city": "Raanana", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=129&ao=1136043&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c9a9f8d4&cb=1678899771745&jobListingId=1008151028899&jrtk=3-1-1grj3iu82jorq801-1grj3bp2uhaol800-2b171b7950f6bad9-", "description": "You're invited to Join Beach Bum, the greatest gaming family that brings a new twist to classic games by introducing them to the world of online casual games.\n\nJob Description:\nBe the data and analytical lead on all kinds of projects, while working closely with Product & CRM teams.\n\nExtract and analyze large and multi-dimensional datasets in gaming environment using a variety of BI tools.\n\nDesign, execute, measure and optimize the core business models.\n\nDevelop and run quantitative analysis, reports and more with the end goal of supporting our monetization efforts.\n\nIdentify business gaps and suggest solutions to impact the business KPIs.\nRequirements:\n1-2 Years’ experience as a data analyst\n\nBachelor of Science (B.Sc.), Industrial engineering and management\n\nVery strong analytical capabilities\n\nFully proficient in SQL – must\n\nSuper strong Excel skills - must\n\nExperience with Tableau – advantage\n\nEnglish at a high level\n\nTeam player, responsible and trustworthy\n\nAbility to see the \"big picture” and prioritize among many requestsShow more Report"}, {"company": "Intango", "job": "Business Analyst", "city": "Tel Aviv-Yafo", "date": "16d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=130&ao=1136043&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_191b7166&cb=1678899772993&jobListingId=1008495381181&jrtk=3-1-1grj3ivdtpkep801-1grj3bp2uhaol800-4c29c117af2124c8-", "description": "Intango IL\nAbout The Position\nWe are looking for a bright Business Analyst to join our talented and fun team!\nIntango develops an industry leading and advanced online advertising platform, offering a variety of solutions to serve customers and business partners worldwide.\nYou will join our Business Analysis team, provide analysis in various fields according to different and changing business needs, and will take an active part in leading our business strategy based on analysis-based recommendations.\nYou Will\nAnalyze data and provide actionable insights for both product and business users.\nTake part in planning and executing business projects from the analysis aspects - analyze POCs, work closely with all stakeholders (Business, Product, R&D, etc.) to understand use cases or stories.\nPerform ad-hoc analysis to support concrete business decisions.\nDesign and manage dynamic dashboards\nConduct meetings and presentations to share ideas and findings.\nSee beyond numbers, and leverage data and analytics’ influence on business decision-making and strategies.\n\nRequirements\nWe’ll need:\n 1+ years of Analysis experience in a tech or online company, preferably in online advertising.\n Excellent Excel proficiency including Power Query functions.\n Experience with BI and data visualization tools (Power BI / Tableau)\n Fluent English (Oral and written)\n BA degree in Economics / Statistics / Business Administration or related fields.\n Familiarity with SQL – an advantage.\n\nThe person we're looking for\nThe person we’re looking for:\nHighly proactive with a “Can do” mentality, fast learner and independent.\nStrong analytical skills, creative and curious.\nExcellent team player with strong communication and collaboration skills.\nStrong business acumen and passion to create an impact on business results.\nOrganized and detail oriented, yet agile and easily adaptive to changing conditions.\nAble to meet deadlines and work in a fast-paced environment with changing priorities, exceptional time management and organization skills.\n\nImportant to know:\nWe work in a hybrid model – 3 fixed days from the office, and 2 days you can choose to WFH or from the office.Report"}]