[{"company": "Noviopus", "job": "UI/UX Designer", "city": "Rishon LeẔiyyon", "date": "30d+", "rating": "", "link": "", "description": "An HR Tech startup that is developing the next generation of recruitment and finding a job system.We are looking for a UI/UX designer to design our web applications.The job is open for new or inexperienced designers as well.Need a skilled designer in creating designed web pages.Need to be creative and with a good understanding of user experience to create wireframes and designs.Job Types: Full-time, Part-time, VolunteerShow more Report"}, {"company": "KMS Lighthouse", "job": "Product Designer", "city": "Petah Tikva", "date": "30d+", "rating": "4.5", "link": "", "description": "KMS Lighthouse is looking for a Product Designer to join our expanding Israeli-based team. The product team at KMS Lighthouse is at the heart of the company. You should have an eye for clean and artful design, possess superior UI skills, and be able to translate high-level requirements into interaction flows and artifacts and transform them into beautiful, intuitive, and functional user interfaces.\nRequirements:\n\nUI and UX design experience for digital products or services\nExperience working with Figma\nDemonstrable UI design skills with a strong portfolio\nSolid experience in creating, storyboards, user flows, process flows, and site maps\nExcellent visual design skills with sensitivity to user-system interaction\nAbility to present your designs and sell your solutions to various stakeholders\nAbility to solve problems creatively and effectively\nUp-to-date with the latest UI trends, techniques, and technologies\nExperience working in an Agile/Scrum development process\nResponsibilities:\n\nCollaborate with product management and engineering to define and implement innovative solutions for the product direction, visuals, and experience\nExecute all visual design stages from concept to final hand-off to engineering\nConceptualize original ideas that bring simplicity and user-friendliness to complex design roadblocks\nCreate, storyboards, user flows, process flows and site maps to effectively communicate interaction and design ideas\nEstablish and promote design guidelines, best practices, and standards\nInvestigating user experience design requirements for our suite of digital assetsShow more Report"}, {"company": "SAR Technologies", "job": "Product designer", "city": "Herzliya", "date": "19d", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=103&ao=1136043&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e6adc93c&cb=1678899880448&jobListingId=1008489520921&jrtk=3-1-1grj3m8d6kbmh801-1grj3gsk82a83000-6d9cea7fa4805ddc-", "description": "Finonex is looking for a talented product designer to join our team in our office in Herzliya, Israel.\nAs a product designer, you will be responsible for designing and creating our product's user experience, user interfaces, and other visual elements. You will work closely with our product and development team to ensure that our visual design is aligned with our product and brand strategy.\nWe are looking for a customer centric, creative, passionate, pixel-perfect with an eye for quality, product designer.\nOur work model is hybrid, combining remote and on-site work\n\nIn this role you will:\nResponsible for user experience and visual design concepts across our products and platforms.\nDesign and implement challenging interfaces for web and mobile environments.\nCreate wireframe, high end mockups and prototyping to launch and beyond.\nShape and design features and be involved at any stage of the product design as necessary.\nAct as the user-advocate, subjecting early-stage designs to usability testing or expert review, and offering suggestions from a user perspective.\nDeliver measurable results to platform user experience and customer satisfaction.\nConduct a full design cycle from collecting inspiration through creating a pixel-perfect UI for all states and scenarios, and deliver to development including all possible scenarios and create product flows\nCollaborate daily with Product Managers and Software Developers to define, design, and deliver great products.\nAdvocate for the prioritization of design centered changes, refinements, and improvements\nLead brainstorms sessions and always look for improvements. Be initiative, suggest solutions and find problems\nUse design to go beyond jobs-to-be-done to delight and bring in brand experiences.\nLead with customer obsession, guide towards strong user experience and strategically leverage user research.\nYou have:\n+3 years of experience in designing customer-facing digital products, web and mobile.\nDeep understanding of UI and UX principles, practices and tools.\nStrong working knowledge and proven portfolio- a portfolio review will be required for all candidate interviews\nAbility to craft a basic prototype, manage tasks according to set priorities, multi-task and meet deadlines.\nOut of the box thinking, eye for design and high creativity.\nGood communication skills, able to take feedback from anyone in any rank.\nIndependent worker but with strong team player qualities\n Pixel-perfect with attention to the smallest of details\nProficiency in Figma, Sketch or similar software\nHighly motivated and fast learner with multitasking abilities.\nAbility to understand and translate high-level business concepts and product vision into your work with all stakeholders.\nCan do approach.\nIdeally a bachelor’s degree in Product Design, Human-Computer Interaction Design, or other relevant fields\nWill be nice that you have:\nWork experience in a trading On-line companies h\nWork experience in SAS platforms\nBezalel Academy of Art and Design or Shenkar College graduate- AdvantageShow more Report"}, {"company": "UI", "job": "UX Designer [junior]", "city": "Netanya", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=104&ao=1136043&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ebda77af&cb=1678899881902&jobListingId=1005994922600&jrtk=3-1-1grj3m9r9k24s801-1grj3gsk82a83000-96891cd954d37173-", "description": "If you’ve got a knack for problem solving and you’re passionate about human behaviour and technology - we need to talk :) Our team is looking for a UX designer to join our group of leading talents.\nWithin the scope of this role, you’ll have a chance to work on a variety of projects - from fast pacing startups to complex system in large organizations. You’ll collaborate closely with Development and UI professionals from early stages of the product requirements and up to a working prototype - while always considering user and business goals.\n\n\nWhat you bring to the table\nAbility for good analysis and attention to detail\nCreativity and original way of thought\nAbility to learn quickly\nMaster's degree in relevant fields (human engineering / cognitive psychology / industrial psychology, industrial engineering and management)\nSuperb human relations, including management and customer-facing capabilities.\nAbility to work well on your own as well as in a teamShow more Report"}, {"company": "ironSource", "job": "Product Designer", "city": "Tel Aviv-Yafo", "date": "3d", "rating": "4.3", "link": "", "description": "Grow Product Studio is looking for an UX/UI Product Designer to help shape and craft our complex platform systems into products that are simple and intuitive. You will design end-to-end user experiences and optimizations – from early prototypes to final implementation and you will also contribute to the development of our product style guidelines and design system.\nSo if you breathe UX/UI - let’s meet!\nRequirements:\n\nBachelor’s degree in Visual Communication from Bezalel, Shenkar, HIT, or Wizo\n3+ years of experience designing a complex system/platform\nYou have experience collaborating closely with R&D\nProven knowledge of Figma (design and prototyping), Sketch, and Adobe Illustrator\nExperience with user research and user testing\n***Submissions without a portfolio will not be considered***\nRole:\n\nBrainstorm and design new features and take concepts through to production\nDesign pixel-perfect complex system/platform user interfaces\nBuild, communicate, and present design ideas and be responsible for the product’s design language\nCollaborate with other designers, as well as product managers, developers, sales and marketing, and other stakeholders to deliver the best design solutions and help deliver outstanding user experiences and sales materials\nProduce all assets needed for the development teams and make sure that the work is delivered as it was designed\n\nBusiness Unit:\n\nDesign & Creative\n\nAdvantages:\n\nYou have a positive attitude and great social skills with a willingness to put aside ego for the sake of what's best for the team\nYou possess the ability to adapt, switch gears, and thrive in a fast-paced environment\nYou have excellent organizational skills and ability to prioritize and meet deadlines\nExperience creating and build a design system library\nYou have a high level of written and spoken English\nGreat people skills, fun person to be aroundShow more Report"}, {"company": "Xtra-Mile", "job": "Graphic Designer", "city": "Raanana", "date": "17d", "rating": "4.5", "link": "", "description": "Xtra-Mile, a leading lifecycle marketing agency specializing in B2B, is seeking a creative and talented graphic designer to join our studio team\nResponsibilities:\nDesigning marketing campaigns starting with the creative stage all the way through to the final product.\nCreating banners and ads for the various media platforms\nDesigning bulk e-mails, invites, landing pages, websites, presentations, brochures, and other printed materials.\nRequirements:\n\nDigital marketing design experience - required\nFully proficient in Adobe (Illustrator, Photoshop, and InDesign) - required\nProficient in PowerPoint – a significant advantage\nProficient is joint design software (Figma XD) - a significant advantage\nAnimation software experience - a significant advantage\nAbility to think outside the box, fast grasp, and dynamic teamwork\nHigh working proficiency in EnglishShow more Report"}, {"company": "eToro", "job": "Growth Product Designer", "city": "Bnei Brak", "date": "7d", "rating": "3.7", "link": "", "description": "eToro is a leading social trading and investment platform that allows users to invest in various assets including stocks, commodities, and cryptocurrencies. Our mission is to democratize finance by making it accessible to everyone.\nJob Overview:\nWe are looking for a talented Growth Product Designer to join our design team. The ideal candidate is a creative problem solver with a strong background in user-centered design and a passion for growth. The Growth Product Designer will work closely with our product, engineering, and growth teams to design and optimize features that drive user acquisition, activation, retention, and revenue.\nResponsibilities:\nCollaborate with product managers, engineers, and growth specialists to identify growth opportunities and design solutions that optimize user acquisition, activation, retention, and revenue.\nConduct user research to understand user behavior and inform design decisions.\nCreate wireframes, prototypes, and high-fidelity designs that communicate the user experience and align with the eToro brand.\nConduct usability testing and A/B tests to validate designs and identify areas for improvement.\nWork closely with the engineering team to ensure designs are implemented accurately and efficiently.\nContinuously monitor and analyze user feedback, usage data, and industry trends to inform design iterations and optimizations.\nRequirements:\n\n3+ years of experience in product design, with a focus on growth or optimization.\nProficient in design tools such as Sketch, Figma, Adobe Creative Suite, etc.\nExperience with user research, usability testing, and A/B testing.\nStrong understanding of UX principles and design thinking.\nExcellent communication and collaboration skills.\nPassion for design and a desire to stay up-to-date with the latest design trends and technologies.\nPlease attach a link to your portfolio\nWhy eToro:\neToro offers a dynamic and exciting work environment, where creativity and innovation are encouraged. As a Growth Product Designer, you will have the opportunity to work on a cutting-edge product that is revolutionizing the world of finance. In addition, eToro offers competitive salary and benefits packages, as well as opportunities for growth and advancement within the company.\nSub Department:\n\nProductReport"}, {"company": "MAËLYS", "job": "Brand Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "", "description": "MAЁLYS is one of the fastest-growing D2C beauty brands in the world. We are breaking the mold of the body care industry with innovative targeted body care solutions for specific skin concerns, an intricate and unique combination of data and marketing, and a seriously sassy and bold brand voice.\nWe are a team of people who want to make lasting, impactful changes, who live (and love) to see results, who innovate with passion, and who love a good sense of humor. Is our vibe your vibe? Then keep reading…\nAs a Brand Designer, you will have the opportunity to channel your creativity by creating engaging designs for our digital content. You will be part of a growing brand and in a role where you can see your impact and immediate results.\nYour life at MAËLYS will look like…\nConduct a full design cycle, from collecting inspiration to creating a pixel-perfect UX/UI.\nExecute design and conceptual tasks as assigned with significant attention to detail.\nContribute to, and collaborate with fellow designers on design concepts and the brand experience.\nDevelop visual concepts for digital campaigns, product marketing, and customer marketing.\nYou will thrive in this role if you have…\n1-3 years of experience as a Creative/Marketing/Graphic Designer (preferably in a product / eCommerce company).\nA strong portfolio demonstrating design thinking and execution skills.\nExcellent knowledge of Figma.\nKnowledge in Adobe Creative Cloud - Photoshop, Illustrator, (After Effects - an advantage.)\nStrong understanding of typography and hierarchies.\nStrong design, color, and composition abilities.\nProficient in English.Show more Report"}, {"company": "Liniad", "job": "Game Designer", "city": "Herzliya", "date": "1 day ago", "rating": "2.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=109&ao=1136043&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d4e23a41&cb=1678899888414&jobListingId=1008526119652&jrtk=3-1-1grj3mg5mkblj801-1grj3gsk82a83000-da47d5517c29db29-", "description": "We are searching for a talented designer to join our ranks, what do we do here? we focus on creating fun and exciting games.\n\nWhat You Will Do\nBringing your vision to the game by creating assets, and game mechanics. You’ll be hands-on throughout the entire process, from concept to design, animation and finally launch.\nResponsible for managing an effective pipeline for look development, assets, characters and general design, both 2d and 3d elements.\nCraft high-level and detailed mockups to effectively communicate design ideas.\n\nIntegrating and implementing creative elements (art and visual effects) into the games.\n\nReview your own work as well as the work of associate Designers working for us.\nCommunicate/resolve any development issues that may occur to the team.\nWhat You Will Bring\nStrong skills in Photoshop, After Effects and Illustrator\nProven track record of both artistic and technical creativity.\nEnglish proficiency – A Must\nPrevious experience working in the gaming industry – Advantage.\nUnity work experience or the ability to undergo Unity training – Advantage.\nUnderstanding of Animation – Advantage.Show more Report"}, {"company": "8fig", "job": "Product Design", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": "8fig is a growth platform built to propel e-Commerce brands to new heights with cash flow planning technology and continuous, uncapped capital. Founded by supply chain experts, our growing data-driven, client-obsessed team is driven by our purpose to democratize online retail and scale eCommerce sellers to 8-figures in revenue.\nWe are seeking a highly experienced and talented Product Designer with at least 3 years of experience in user experience and interactive design. The ideal candidate possesses strategic thinking and a comprehensive understanding of the product development process, from research and prototyping to design and usability testing. Strong communication, organizational, and analytical skills are essential, as the candidate will be expected to continuously learn and focus on solving complex product problems.\nKey Responsibilities:\nConducting user research to understand the needs and pain points of the target audience.\nCreating user personas and journey maps to guide design decisions.\nDesigning wireframes, prototypes, and high-fidelity mockups.\nConducting usability testing to validate design solutions.\nCollaborating with cross-functional teams, including product management, engineering, and marketing.\nCommunicating design decisions and rationale effectively to stakeholders.\nStaying up-to-date with industry trends and best practices in UX design.\nProviding design guidance and mentorship to junior designers.\nParticipating in the entire product development process, from research to launch.\nContinuously iterating on designs based on user feedback and data analysis.\n\nRequirements:\n\n\n3+ years of experience working as a UX designer on SaaS products\nMaster of design tools such as Sketch and Figma\nStrong understanding of user-centered design principles and techniques\nStrong portfolio demonstrating a track record of creating intuitive and user-friendly software\nExcellent interpersonal skills\nExperience with A/B testing and working with data intensive products\nAbility to work in a fast-paced, dynamic environment\nStrong analytical and problem-solving skills\nStrong attention to detail and ability to work with ambiguity\nExtra Points:\nInterest and background in fintech\nExperience selling products on Amazon, Shopify, BigCommerce…\nStrong public speaking skills, including confidence and stage presence\nIf you're still nodding your head in agreement and this seems like a good fit, don't hesitate to reach out—we're looking for you!Show more Report"}, {"company": "Finonex", "job": "Product designer", "city": "Herzliya", "date": "19d", "rating": "", "link": "", "description": "About the role:Finonex is looking for a talented product designer to join our team in our office in Herzliya, Israel.As a product designer, you will be responsible for designing and creating our product's user experience, user interfaces, and other visual elements. You will work closely with our product and development team to ensure that our visual design is aligned with our product and brand strategy.We are looking for a customer centric, creative, passionate, pixel-perfect with an eye for quality, product designer.Our work model is hybrid, combining remote and on-site workIn this role you will:Responsible for user experience and visual design concepts across our products and platforms.Design and implement challenging interfaces for web and mobile environments.Create wireframe, high end mockups and prototyping to launch and beyond.Shape and design features and be involved at any stage of the product design as necessary.Act as the user-advocate, subjecting early-stage designs to usability testing or expert review, and offering suggestions from a user perspective.Deliver measurable results to platform user experience and customer satisfaction.Conduct a full design cycle from collecting inspiration through creating a pixel-perfect UI for all states and scenarios, and deliver to development including all possible scenarios and create product flowsCollaborate daily with Product Managers and Software Developers to define, design, and deliver great products.Advocate for the prioritization of design centered changes, refinements, and improvementsLead brainstorms sessions and always look for improvements. Be initiative, suggest solutions and find problemsUse design to go beyond jobs-to-be-done to delight and bring in brand experiences.Lead with customer obsession, guide towards strong user experience and strategically leverage user research.You have:+ years of experience in designing customer-facing digital products, web and mobile.Deep understanding of UI and UX principles, practices and tools.Strong working knowledge and proven portfolio- a portfolio review will be required for all candidate interviewsAbility to craft a basic prototype, manage tasks according to set priorities, multi-task and meet deadlines.Out of the box thinking, eye for design and high creativity.Good communication skills, able to take feedback from anyone in any rank.Independent worker but with strong team player qualitiesPixel-perfect with attention to the smallest of detailsProficiency in Figma, Sketch or similar softwareHighly motivated and fast learner with multitasking abilities.Ability to understand and translate high-level business concepts and product vision into your work with all stakeholders.Can do approach.Ideally a bachelor’s degree in Product Design, Human-Computer Interaction Design, or other relevant fieldsWill be nice that you have:Work experience in a trading On-line companiesWork experience in SAS platformsBezalel Academy of Art and Design or Shenkar College graduateJob Type: Full-timeShow more Report"}, {"company": "Appdome", "job": "Product Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=112&ao=1136043&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_31f3c9d9&cb=1678899897264&jobListingId=1008439770186&jrtk=3-1-1grj3mor0kcn2801-1grj3gsk82a83000-59517c7b28a193ff-", "description": "Tel- Aviv · Full-time · Intermediate\nAbout The Position\nWe are looking for a sharp and experienced Product Designer to join our team, to help us take our system to new heights and showcase our customer obsession with the best UI possible.\n﻿Responsibilities:\nCollaborating cross-functionally with product management and development teams to deliver high-level results, with attention to detail, craft, and a consistent look & feel product\nMaintaining and evolving our system design, in collaboration with our front-end developers, to ensure the UI is consistently implemented across our product console\nSolving complicated design issues and turning user stories and roadmap requirements into intuitive, clear and effective user flows and experiences\nFollowing features throughout their full life-cycle: from ideation to implementation, hands-on in every stage: wireframes, prototypes, design mocks, guidelines & documentation, last-minute changes, research, customer and stakeholders feedback, next phases and QA\nWorking closely with the development team:\nCreating UX specifications and guidelines\nExecution of UX/UI QA\nCreating and refining product style guide and component documentation\n\nRequirements\n2+ years of experience designing advanced analysis software services for professional and technological users, involving visualization of data and analytical solution\nUnderstanding the complexity and specificity of designing user experience and interface for B2B services, with various user and customer definitions and business goals\nSuccessfully taking ownership of your work inside a product pod and being capable of collaborating independently with product and R&D teams\nExperience working with complex desktop and web systems\nExpressing your ideas and opinions in a cohesive, communicative, and compelling way, and holding your ground in professional discussions\nBeing curious and always learning new things\nUnderstanding the importance of designing whole flows and solutions rather than individual screens or elements\nExperience working with Figma, Sketch, Zeplin, InVision, Axure, etc.\nNice to have’s:\nBachelor's degree in Visual Communication\nBeing fluent in English – both writing and speaking\nAnalytical and tech-savviness\nExcellent soft skills and people skills\nCSS or any other programming experience\nExperience with UX research (user interviews, collecting and analyzing data)Show more Report"}, {"company": "OpenWeb", "job": "Product Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=1136043&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_65a7e9bf&cb=1678899899213&jobListingId=1008393417921&jrtk=3-1-1grj3mqo0kblo801-1grj3gsk82a83000-563d82becb4e2885-", "description": "We create a safe space for communities to thrive.\nOpenWeb's mission is to improve the quality of conversations online, building a healthier web where content creators of all kinds are empowered to thrive. As a product company, OpenWeb partners with publishers and brands to build strong, direct relationships with their audiences.\n\nOpenWeb's technology empowers its partners to build vibrant communities rooted in healthy conversations and robust social experiences.\nOpenWeb works with more than 1,000 top-tier publishers, hosting more than 100 million active users each month.\n\nFounded in 2015, OpenWeb has nearly 300 employees in New York City, Tel Aviv, Kyiv, San Diego, Canada, London, and Paris and is backed by world-class investors including Georgian, Insight Partners, , Entrée Capital, The New York Times, Samsung Next, Dentsu, and ScaleUp. To date, the company has raised $393 million in funding and is currently valued at $1.5 billion.\n\nTo learn more about OpenWeb's platform visit OpenWeb.com, or follow @OpenWebHQ on LinkedIn and Twitter.\n\nHow You'll Contribute as our Product Designer:\n\nCollaborate with the design and development team to conceptualize and execute designs for web and mobile platforms.\nWork with product managers to understand projects' requirements and deliverables.\nContribute to UX design efforts by conducting user research and testing.\nUse Figma to create wireframes, prototypes, and visual designs for web and mobile platforms.\nTake a part in our Design System development and maintenance.\n\nThe Skills and Experience You Bring:\n\n2+ years of experience designing for web and mobile platforms.\nStrong portfolio of UX-UI design works.\nExcellent communication and problem-solving skills.\nAbility to work in a team environment.\nAttention to detail and ability to deliver high-quality work on tight deadlines.\nProficiency with Figma.\nEnthusiasm for staying up-to-date with emerging design trends and technologies.\nBasic familiarity with HTML, CSS, and other front-end technologies.\nDesire to continually learn and improve.\n\nBuild your skills with us as you build a better web for everyone. Join us!\n\nAlso, we care about your privacy! Please take a moment to review OpenWeb's Privacy Practices.Show more Report"}, {"company": "adklix", "job": "Designer", "city": "Raanana", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=114&ao=1136043&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0fb6b3ae&cb=1678899900963&jobListingId=1005649432572&jrtk=3-1-1grj3mseoma4m801-1grj3gsk82a83000-ae61e9c7bbb15128-", "description": "Responsibilities:\nWe are looking for graphic designers to assist with the development of templates for a wide range of industries. This will be a full-time position.\n\nRequirements:\n\nGreat design skills with a sense of design, composition and color\nAbility to work quickly and create many different looks\nProficiency in Photoshop, Illustrator, Draw or other design tools\nAbility to learn our composition and design platform (if you know these other products you will pick it up in minutes)\n\njobs@adklix.comReport"}, {"company": "", "job": "Product Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=115&ao=1110586&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_690e641a&cb=1678899902062&jobListingId=1008151106664&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj3mtfskcm5801-1grj3gsk82a83000-bda560c74bd9781b--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBvbVAMtoXUX9BnFgS3dzEfHBVW07oPmHK0whkffRzM8vg8twICdy-XnjtbEqd-yCgrlowkbx4khFIuajjDyzPJgJLgN3tAarNSx0tWcBGRANNQWJtvXSBlSwD6OH1xQpjR6Ngzoa25TBZYrlaFhQkUXJBobXga670QHMm8BXsR6e4brtUOJqUKZwUw0tlUmTFDbBZIU8Sd_H4o2gB5OH74KG5qvYQFKkoihv6vizfI1d7W7CF47N1tMoUpZbZvP5iHQzO_6sGeeti4AD_ZjhIqnLlX_NPvigUPDmc8rhGX0QC7q07oh8x2JOYPQgmcxAYN12UG_abWWNXK-y4RMMXN1IpuUjtjWFMfc-4H-ADkN_OrpJok4gE2ECRAPh_v6WMA-iZGpp8IklBuXY3n6JFmWCc7VNBjoBPaV-mIpxcCN_rMZr_4HjUJ6UjcxNpwmti_R-2ICYpt-3TXlVVUPjK1rPzyss7v0Tccb2XNbnkQ_eiQzMK0mL9NVgOKtiwpizvvNb3yR0MMPumaZotMRkBLYO7XavQcNIVdkjP2DwRgEbLcZf5Z0lniOZlRTRJ3PQ4gT0BVrbMUr3Q6eJdrJpTNaIv-0rErSVwb0DjqL95Lev2hOJxsPf3J-ohBn1Rqp3mHJ8TnxCnB-KQx8XOdMXdF", "description": "A well-funded software company- SaaS/B2B, is looking for a highly talented and experienced Product Designer At least 3 years of UX/UI design experience in a SaaS environment, B2B / B2C / B2B2C company. A deep understanding of UX principles based on behavioral psychology, cognitive biases, and visual perception. End to End accountability and ownership of tasks. An exceptional portfolio demonstrating strong product and visual design capabilities, experience in creating frictionless user experiences, concepts and customer journeys.\n\nExperience in wireframing and prototyping using tools like Figma/Zeppelin. An ability to explain complex concepts and ideas in a simple and clear way to people from various backgrounds. Enthusiastic about the small details and excited to keep pushing it until its pixel-perfect, but also able to balance the trade-offs and work in short iterations. Fluent English - speaking and writingShow more Report"}, {"company": "experis (כח אדם)", "job": "סטודנטים", "city": "Kfar Saba", "date": "28d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=1136043&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_dc2323ae&cb=1678899903275&jobListingId=1008472301465&jrtk=3-1-1grj3mum4khpv801-1grj3gsk82a83000-e9e127036e1b90f3-", "description": "אני פונה באופן לא רשמי, ורק מנסה לעזור, אולי אצליח לעזור למישהו/י למצוא עבודה חדשה..בחברת סיליקום מחפשים בוגר/סטודנט לקראת סיום הלימודים הנדסאי חשמל/אלקטרוניקה/מכטרוניקה מצטיין בלי ניסיון או לחלופין הנדסאי עם ניסיון רלוונטי לתפקיד pcb layout designer (עורך מעגלים מודפסים).משרה מלאה במחלקת הפיתוח בכפר סבא.למתאימים נא להעביר אליי קורות חיים, דיפלומה וגיליון ציונים למייל |** לפנייה למשרה יש להגיש מועמדות **|בהצלחה!Show more Report"}, {"company": "Apple", "job": "Electro Optical Designer Student - Imaging & Sensing Technology Group", "city": "Herzliya", "date": "12d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=117&ao=1136043&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d577846a&cb=1678899904400&jobListingId=1008507046379&jrtk=3-1-1grj3mvnjjijg801-1grj3gsk82a83000-838d28d601456fce-", "description": "Summary\nPosted: Oct 30, 2022\nRole Number:200439437\nThe Imaging and Sensing group at Apple develops depth sensing systems such as the revolutionary True Depth camera that powers FaceID, as well as other cameras in Apple products. This multi-disciplinary group of engineers is responsible for architecture, design, and development of these highly complex sensing systems for Apple products. The team is seeking a student specializing in optics, in order to support optical design and simulation tasks.\nKey Qualifications\nA student for Masters or PhD specializing in optics.\nExperience in building optical setups \\ operating optical instruments.\nExperience in Matlab simulations of optical systems.\nKnowledge of sequential Zemax – important advantage.\nProficient verbal and written English language skills.\nDescription\nIn this position you’ll get to work on a variety of projects that have core optical components: Optical simulations of cameras / laser systems. Designing optical concepts for future products. Developing methods for characterization and testing of novel optical components. Presenting plans and results to the multi-functional team.\nEducation & Experience\nM.Sc/Ph.d in Electrical Engineering\\ Physics, majoring Optical Engineering or related fields\nAdditional RequirementsReport"}, {"company": "vcita", "job": "Product Designer - WiseStamp", "city": "Tel Aviv-Yafo", "date": "16d", "rating": "4.6", "link": "", "description": "In a nutshell:\nWe are seeking a talented Product Designer with a strong background in user experience to join our team. The successful candidate will work closely with product managers and developers to deliver delightful design solutions that meet our customers' needs. As the only product designer in the company, you will take part in strategic problem-solving efforts and have a meaningful impact on the user experience.\n#LI-Hybrid\nRequirements:\n\nAt least 4+ years of experience in designing B2B SaaS products\nA portfolio of work that demonstrates a breadth of visual and interaction design skills\nProficiency in mockup tools such as Figma\nStrong understanding of user-centered design principles\nAbility to work well in a team environment\nAbility to clearly articulate and communicate design decisions\nPassion for creating innovative and user-friendly products\nResponsibilities:\n\n\nCollaborate with product managers to develop wireframes, mockups, and prototypes\nEstablish design systems to ensure consistency and efficiency\nWork with front-end developers to ensure that designs are implemented as intended\nLearn the business impact of your designs and suggest improvements\nParticipate in user testing to ensure that the designs meet the needs of our users\nStay up-to-date with the latest design trends and best practicesShow more Report"}, {"company": "Finonex", "job": "Platform Product Manager", "city": "Herzliya", "date": "19d", "rating": "", "link": "", "description": "About the role:Finonex is looking for a talented and passionate product manager to join our team in our office in Herzliya, Israel.As a product manager, you will be responsible for our web and mobile trading platform.You will work closely with cross-functional teams including engineering, marketing, and design to identify and prioritize opportunities for growth in our international markets and lead the development and execution of product strategies and initiatives that drive engagement and revenue.Our work model is hybrid, combining remote and on-site workIn this role you will:Ownership of product requirements, driving the product life cycle in an agile methodology.Define roadmap, take it from vision to reality and prioritize product requirements.Manage the full product life-cycle, from product definition through launch to maintenance - ideation, scope, specification, prioritization, design, implementation, quality assurance, launch, and iteration.Define and build metrics and OKRs and drive growth in multiple aspects of the product.Highly analytical with attention to detail, able to complete extensive market research.Analyze usage patterns and solve problems.Keep investigating for new tools and services that can help deliver better productsPlanning the features with a designer, to create the best UI & UX.You have:4+ years of experience in product management in B2C productExperience with defining and measuring product and usability KPI'sA great sense for user experience and designStrategic thinking with good planning skills.Ability to manage lifecycles of several products simultaneously.Technological orientation and understanding of the development cycle.Excellent English level with excellent verbal and written skills.Ability to explain complex requirements in simple terms, excellent communicator (both written and verbal).Experienced in driving collaboration across multiple disciplines - Product, UX, R&D, Marketing, CS and Sales.Self-driven and organized with the ability to effectively prioritize and execute multiple initiatives.Strong leadership, organizational and execution skills.Will be nice that you have:Work experience in a trading on-line companiesWork experience in SAS platformsJob Type: Full-timeShow more Report"}, {"company": "SAR Technologies", "job": "Platform product manager", "city": "Herzliya", "date": "19d", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=120&ao=1136043&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c7aff774&cb=1678899908105&jobListingId=1008489520861&jrtk=3-1-1grj3n3e5kcn1801-1grj3gsk82a83000-ee38b6c86cda5eab-", "description": "Finonex is looking for a talented and passionate Platform product manager to join our team in our office in Herzliya, Israel.\n As a product manager, you will be responsible for our web and mobile trading platform.\nYou will work closely with cross-functional teams including engineering, marketing, and design to identify and prioritize opportunities for growth in our international markets and lead the development and execution of product strategies and initiatives that drive engagement and revenue.\nOur work model is hybrid, combining remote and on-site work\nIn this role you will:\nOwnership of product requirements, driving the product life cycle in an agile methodology.\nDefine roadmap, take it from vision to reality and prioritize product requirements.\nManage the full product life-cycle, from product definition through launch to maintenance - ideation, scope, specification, prioritization, design, implementation, quality assurance, launch, and iteration.\nDefine and build metrics and OKRs and drive growth in multiple aspects of the product.\nHighly analytical with attention to detail, able to complete extensive market research.\nAnalyze usage patterns and solve problems.\nKeep investigating for new tools and services that can help deliver better products\nPlanning the features with a designer, to create the best UI & UX.\nYou have:\n4+ years of experience in product management in B2C product\nExperience with defining and measuring product and usability KPI's\nA great sense for user experience and design\nStrategic thinking with good planning skills.\nAbility to manage lifecycles of several products simultaneously.\nTechnological orientation and understanding of the development cycle.\nExcellent English level with excellent verbal and written skills.\nAbility to explain complex requirements in simple terms, excellent communicator (both written and verbal).\nExperienced in driving collaboration across multiple disciplines - Product, UX, R&D, Marketing, CS and Sales.\nSelf-driven and organized with the ability to effectively prioritize and execute multiple initiatives.\nStrong leadership, organizational and execution skills.\nWill be nice that you have:\nWork experience in a trading On-line companies\nWork experience in SAS platformsShow more Report"}, {"company": "UI", "job": "UI DESIGNER", "city": "Netanya", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=121&ao=1136043&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_61a919e2&cb=1678899909141&jobListingId=1007149338351&jrtk=3-1-1grj3n4efkbkm801-1grj3gsk82a83000-c329a5886c8fea23-", "description": "If design is baked into your DNA and you’re curious to explore new challenges in designing complex systems, you’re in the right place:) Our team is looking for an UI designer to join our group of visual magicians.\nAs a UI Designer, you'll be responsible for designing usable and delightful interfaces and interactions. You’ll cooperate closely with UX and development professionals up to the point of execution that takes a product from good, to great, to exceptional.\n\nWhat you bring to the table\nTalented UI / UX designers, motivated to develop and specialize in the field\nDegree in visual communication\nAdvantage for lovers of motion and illustration\nOr in short people who love people and pixelsShow more Report"}, {"company": "DataRails", "job": "Product Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.9", "link": "", "description": "Datarails is an Israeli based Fintech Startup in massive growth, and we're looking for a talented and experienced product designer to join the team!\nDatarails is a SaaS B2B solution that tackles one of the biggest challenges in financial departments: the overflowing amount of data that, up until now, was managed by tons of Excel sheets. All those financial reports, forecasts, expenses, analytics? DataRails takes all this data and integrates it into a one, simple, smart report. It consolidates the information, enables the finance professionals to follow it, manage it, and create the ever-needed order within the realm of finances. It’s cloud-based, so nothing gets lost, it’s brilliant, so almost every feature can be added.\n\nAbout The Role:\n\nWe are looking for a motivated UX Designer with a strong track in B2B SaaS data products.\nAs a UX designer in Datarails, you'll join our Product team and play a critical role in making our product user friendly, easy to use and one of a kind. The product department at Datarails is creating a groundbreaking product. And we mean it. We're literally taking over the world of finance.\nWhat You'll Do:\n\nDesign and implement features by creating user flows, wireframes, pixel-perfect designs (and animated prototype whenever needed)\nConduct the full design cycle - from functional design and interaction UX to visual UI and dev handoff\nRaise the bar for product quality by advocating for user-centered design and insights driven by research based on data, support tickets, competitor analysis, and usability sessions with real users\nApply global UI standards and design systems effectively, identify areas of improvement, and offer solutions\nCollaborate daily with Product Managers, software developers and UX/UI Designers in order to define, design, and deliver extraordinary products\nAsk questions to ensure a clear understanding of current and future tasks, and to help manage relative priorities\nHave full ownership over product design processes\nConceptualize original ideas that bring simplicity and user-friendliness to complex design challenges\nEstablish and promote design guidelines, best practices, and standards\nWork in a dynamic and high-paced environment that is creating scalable extraordinary products.\nWhat We Need:\n\n4+ years of demonstrated experience in product design in a product company, B2B company is an advantage\nExperience in designing complex systems\nExperience creating and working with design systems\nAbility to understand complicated concepts and translate them to an excellent user experience\nWorking knowledge of the ideation and creation of UI design deliverables: Sitemaps, user flows, wireframes, low-fidelity and high-fidelity layouts, prototypes.\nA strong portfolio, demonstrating excellent product thinking, visual design, and problem-solving\nExperience participating in product exploration, conceptualization, and validation processes\nProficiency with advanced design tools (Figma - preferable)\nExcellent communication skills\nYou’re highly resourceful and motivated, capable of taking on big projects independently\nAdvantage: Experience with the Finance Industry\nWhat We Offer:\n\nWe offer a supportive, agile and creative work environment with brilliant colleagues!\nCompetitive compensation, ongoing recognition, and most of all, a chance to learn, contribute and develop your skills.\nOpportunity to join an explosive industry, a successful and growing organization, and an unmatched leadership team, passionate about their employees!\nMost of all we will give you fun, enthusiasm, support, a passion for healthy living, and never a dull moment!\nEEO Statement:\n\nWe want to make sure everyone has an equal chance to participate and make a difference. Datarails is an equal opportunity employer and prioritizes building a diverse and inclusive workplace. We provide equal employment opportunities to all employees and applicants of any type and do not discriminate based on race, color, religion, national origin, gender, age, sexual orientation, physical or mental disability, genetic information or characteristic, gender identity and expression, veteran status, or other non-job related characteristics or other prohibited grounds specified in applicable federal, state, and local laws. Datarails’ policy is to comply with all applicable laws related to nondiscrimination and equal opportunity and will not tolerate discrimination or harassment based on any of these characteristics. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.Show more Report"}, {"company": "Bizzabo", "job": "Product Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.6", "link": "", "description": "Experience is at the forefront of everything we do. The job of a Product Designer in Bizzabo is to envision how people experience our product and bring that vision to life in a way that feels inspiring, refined, and even surprising. As a Product Designer at Bizzabo, you'll take on complex tasks and transform them into elegant and easy-to-use designs for our customers. Achieving this goal requires collaboration with engineers, and product managers throughout the design process&mdash;from initial ideation to creating user flows and wireframes to building prototypes and final designs. You will, along with your team at each stage, learn our user's pain points, search for creative opportunities, and ensure that the final product addresses the solution delightfully.As a Product Designer, you will be a creative problem solver and deep thinker. You will work closely with developers and product managers, and other cross-functional partners to iterate and optimize the user experience and drive product excellence.Bizzabo powers immersive in-person, virtual, and hybrid experiences. The Bizzabo Event Experience OS is a data-rich open platform that allows Event Experience Leaders to manage events, engage audiences, activate communities, and deliver powerful business outcomes &mdash; while keeping attendee data private and secure. Bizzabo powers the events of world-leading brands &mdash; from Fortune 100 enterprise organizations and financial institutions to creative agencies and scaling tech companies. Bizzabo was founded in 2011 by Boaz Katz, Alon Alroy, and Eran Ben-Shushan, and is headquartered in New York and Tel Aviv.Requirements:What you’ll be doing:Work closely with product managers, engineers, UX writers, to craft designs that solve problems in an inspiring way.Create use cases and prototypes to validate your ideas with our users, iterate your concepts, and push into production pixel-perfect designs when ready.Communicate interaction concepts, conceptual ideas, and design rationale with clarity, persuasion, and a user-centered design process.*Who you are:*+3 years of experience designing at a product-focused tech company, having full ownership of the entire product life cycleVast experience designing for mobile or web.Innovative problem-solver; your passion is transforming complex problems into simple and intuitive user experiences.A “yes, can-do” approach is a must.An understanding of product and design methodologies.Understanding of both qualitative and quantitative user data (A/B testing, analytics tools, usability testing, and user interviews).Highly independent yet a strong team player. We love people with solid and unique opinions that don’t need hand-holding. Yet no designer is an island, and being a team player is a must.You use all tools available to express your ideas. But mostly Figma :)A visual communication degree is a plus.Curiosity and willingness to learn - a must.Job Type: Full-timeShow more Report"}, {"company": "Seperia", "job": "Project Manager", "city": "Herzliya", "date": "30d+", "rating": "4.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=124&ao=1136043&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_5c5e57ee&cb=1678899913280&jobListingId=1008454526356&jrtk=3-1-1grj3n8fe2i74001-1grj3gsk82a83000-2dd7a7e97e40b648-", "description": "Seperia builds and operates global fintech review sites. From 2003, we have been driving millions of sales to our partners (advertisers). We do it by focusing on value added content, wrapped within an engaging web product and matched with high-intent traffic.\n\nWe’re looking for our next Marketing Project Manager.\n\nWhat You Will Do:\nWork with the product designer, the acquisition team, and developers to create, manage and expand our leading, user-centric review sites.\nCommunicate with international brands on a monthly basis – manage the partnerships, evaluate their performance metrics, and drive product monetization.\nPerform hands-on research, analysis, planning, and execution of tasks.\nWork across interfaces to complete various tasks, through tools such as WordPress, Google Analytics, and BI systems.\nLead broad initiatives related to the product.\nWhat You Need:\nGreat written & verbal communication skills (Hebrew & English) – a must.\nAn independent and performance-oriented attitude with the ability to drive people and processes.\n1+ years of experience in product (marketing) management, project (marketing) management or global website management.\nA web-savvy mindset.\nExperience in managing websites via WordPress – advantage.\nTechnical capabilities & experience working with developers – advantage.\nWhat We Offer:\nHuge potential for growth. Our company is growing and we’re looking for someone who can grow with us.\nFreedom – we care less about formalities, and more about results. With a dynamic, informal environment, we keep excellence, innovation, and results at the forefront.\nUpside – as a performance marketing company, we develop global-level, scalable marketing assets with no glass ceiling. You can enjoy a growing upside.Show more Report"}, {"company": "COSENTINO", "job": "Sales Development Representative", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=125&ao=1136043&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7238b4d8&cb=1678899914286&jobListingId=1008463889218&jrtk=3-1-1grj3n9fb2het001-1grj3gsk82a83000-5ab79720b282d04b-", "description": "Mar 11, 2023\nTel Aviv, IL\nWhat are we looking for\nIn order to develop a high-performance sales team, we are looking for a qualified Sales Development Representative Israel (SDR) to find and select potential customers who can benefit from our products and services.\nThis figure will manage both the requests made through the different channels (Inbound) and the prospecting and search for new business outside our systems (Outbound). The objective is to identify potential customers, initiating new relationships and putting them in common with our sales representatives in order to obtain new business. Every lead is an opportunity to drive top-line revenue growth, customer acquisition levels and profitability.\n\nWhat you will do\nRepresent our company's products and services, starting with a comprehensive understanding and ability to explain and prescribe our materials and applications based on consumer needs.\nIdentifying potential customers/business opportunities through inbound requests (Inbound) and building relationships by working the prospect base and opportunities out of our systems (Outbound).\nManaging and maintaining a portfolio of active leads and engaging sales reps when there is a business opportunity (short and medium term).\nFollow-up of the management of potential opportunities by the sales force and action in case of non-compliance with the protocol (contact with sales representatives).\nIdentification and sharing of best practices to optimize the protocol for managing potential opportunities.\nManagement through Salesforce, cold calling, and email to generate new sales leads.\nIdentify prospect needs and suggest appropriate products/services.\nBuild long-term trusting relationships with prospects/leads to qualify those consumers as sales opportunities.\nProactively seek out new business opportunities in the marketplace.\nReport to sales manager with weekly, monthly, and quarterly results.\nWhat you need to succeed\nBachelor's degree or at least 5 years of relevant work experience.\n2-3 years of sales experience, with a track record of exceeding key targets.\nStrong phone and email communication skills.\nAbility to customize the pitch based on the needs and particularities of the client and their business context.\nProven creative problem-solving approach and strong analytical skills.\nStrong desire and ability to move up within a sales organization. Attitude.\nHigh level of English and Hebrew.\n70% remote.\n\nSkills valued positively:\n\nProficiency with SalesForce and Teams.\nBachelor's degree or diploma in Technical Architecture or higher or Interior Design.\nPrevious experience as a sales development representative with a track record of meeting sales quotes.\nWhat we do offer\nBeing part of the world leader in the production and distribution of quartz and other natural stone surfaces, Cosentino Group.\n\nYou will join a company:\nWith an international mindset and presence in 100+ countries.\nWith an amazing growth story, sustained by an extraordinary innovation with products such as SilestoneÂ®, DektonÂ® and Sensa by CosentinoÂ®.\nIn which you will be able to grow your career and develop your leadership skills.\nLocation: Ha-Sadna'ot St 11, Herzliya, 91083, Israel.\nAbout Cosentino\nAt COSENTINO, our purpose is to inspire People through innovative and sustainable spaces. We are the world-leading producer of architectural and decorative surfaces. Our products are designed to provide innovative and functional solutions for either home and business spaces, such as Kitchen and Baths worktops, outdoor open spaces, facades, etc. Innovation, sustainability, functionality and beauty describe our value proposition to the different market stakeholders and end Clients. www.cosentino.com\n\nWith a presence in more than 100 Countries and 5 continents, our business keeps growing consistently in all geographies. as well as career opportunities for Talented people like you.\n\nCosentino is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: Cosentino is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Cosentino are based on business needs, job requirements and individual qualifications, without regard to race, colour, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate.\n\n\nCosentino will not tolerate discrimination or harassment based on any of these characteristics.”\n\nJob Segment: Sales Rep, Outside Sales, Interior Designer, Sales, CreativeShow more Report"}, {"company": "Roundforest", "job": "Senior Product Designer", "city": "Ramat Gan", "date": "13d", "rating": "4.1", "link": "", "description": "Description:\nRoundforest is on a mission to help busy people make shopping decisions with peace of mind. We’re looking for a passionate candidate who gets excited about the opportunity to join our journey and impact 40,000,000 consumers (and counting).\nSenior Product Designer objective:\nAs a Senior Product Designer at Roundforest, you will be responsible for creating friendly, visually appealing and usable products. You will own the design of one of our products and work collaboratively with your pod (product manager, engineers, data analysts) as well as your guild (other product designers) to deliver high-quality products that meet the needs of our users.\n**Please attach an updated portfolio to your application**\nAt Roundforest, we value creative thinking and therefore often will do things differently. Accordingly, Roundforest's Senior Product Designer role may differ in a few ways from similar positions out there:\nOur product designers work as part of a product pod, which is a bit like a little start up within a start up. Instead of designers working in isolation or only with other designers, here they closely collaborate with cross-functional individuals (product managers, data analysts, engineers) to create impactful solutions that address real user problems. By working in pods, designers are able to fully immerse themselves in the product and gain a deep understanding of the user's needs. This approach fosters a culture of innovation and creativity, and enables us to deliver products that truly resonate with our users.\nFinally, we’re looking for candidates with a ׳hop margin׳ - a secret ingredient we look for in all new hires. In other words, this position requires the candidate to leap into the next phase of their career and to step outside their comfort zone, while maintaining a reasonable learning curve. Let's evolve together!\nRequirements:\n\n5+ years of experience in product design\nData-driven with deep understanding of UX methodologies\nA proven track record of applying user-centric design principles into products\nStrong communication skills and ability to work with various stakeholder\nExcellent visual, interaction and prototyping design skills\nDiverse Perspectives\nWe know that innovation thrives on teams where diverse points of view come together to solve hard problems. As such, we explicitly seek people who bring diverse life experiences, diverse educational backgrounds, diverse cultures, and diverse work experiences. Please be prepared to share with us how your perspective will bring something unique and valuable to our team.Show more Report"}, {"company": "Valens", "job": "Board Designer", "city": "Hod HaSharon", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=127&ao=1136043&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7ec02eba&cb=1678899916958&jobListingId=1007580391524&jrtk=3-1-1grj3nc2thaqc801-1grj3gsk82a83000-95c4d946380af45e-", "description": "Responsible for developing new reference designs & applications (based on Valens chip set and various peripherals)\nCollaborate with other team members to deliver high quality board designs with a timely, successful release to production\nSupport demo shows, POCs projects and other various activities within the group\nJob Requirements\nAt least 3 years of experience with board design (analog and digital)\nHands-on experience designing and accompanying full product design process\nExperience with high-speed board/system design, schematic capture, component selection and board layout\nLab bring-up, testing, and debugging (including board-related bring-up with software, familiarity with signal-integrity aspects, etc)\nTechnical knowledge and design/working experience with PCIe, Ethernet, SerDes, I2C/SPI/MDIO\nExperience working with external designers and manufacturers of Mechanical enclosure – An advantage\nExperience working with thermal analysis – An advantage\nEMC – Experience with design and testing using external labs – An advantage\nExperience in board design for video applications (e.g. Camera, DVR or Video matrixes) – An advantage\nExcellent communication skills with fluent verbal and written EnglishReport"}, {"company": "FIVE Product Definition", "job": "PRODUCT DESIGNER hired", "city": "Petah Tikva", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=128&ao=1136043&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_42abbe4e&cb=1678899918370&jobListingId=1007013697177&jrtk=3-1-1grj3ndehmbj1801-1grj3gsk82a83000-5a6c19db763ced3e-", "description": "We are looking for a truly talented Product Designer with innovative and unique creative vision; one with excellent ability to understand and design highly complex screens, and with pixel perfect design skills.\n\nYou’ll be responsible for all interface design aspects for digital products, and work closely with Design, Product, Marketing and Dev teams to create design solutions for complex digital products in various fields and platforms.\n\nRequirements:\n\nProduct design portfolio\nMastery of various design tools (tech-savvy skills – advantage)\nStrong attention to detail\n\nJob location: Petah Tikva\nJob type: flexible\nMail to: designer@5ive.co.ilReport"}, {"company": "PRIMIS", "job": "Product Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=129&ao=1136043&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a7a3cc22&cb=1678899919885&jobListingId=1008437629237&jrtk=3-1-1grj3neuak24q801-1grj3gsk82a83000-4a9d02d7e39884d4-", "description": "A Bit About Us\nWe are an ever-evolving company, driven by our passion for video.\nWe’ve grown from a small start-up to a thriving business,\nand have been a part of the biggest global ad agency for ten years.\n\nOur main priority is maintaining our fun and determined environment\nand keeping our employees engaged in their work.\nWe need people that are as passionate about video and the ad tech industry.\nIf you are ambitious, hardworking, and motivated, we want to get to know you!\nAbout the Position\nThe Product Manager will be a part of the product team and be responsible for managing Primis business logic products, monetization, and dashboards.\n\nWhat you’ll do:\n\nWork with internal stakeholders and customers to collect requirements and write detailed requirements\n\nProvide the R&D with detailed specifications in Epics and US methodology\n\nWork with UI/UX product designer to deliver clear wireframes and user journeys\n\nProduct documentation such as product brief, product description, operational guide, release notes, and product presentation\n\nCompetitive analysis\n\nBe on top of the video discovery advertising standards, changes, and trends, as well as privacy rules\n\nQualifications\nExperience in the ad tech video industry, or working with internet/media companies\n\n\nExperience in programmatic advertising monetization methods, prebid, RTB, and VAST protocols\n\nExperience working with Google GAM\n\n3+ years of product management experience in SW companies\n\nExperience working in agile methodology\n\nAbility to quickly and effectively explore new subjects, identify knowledge sources and understand new technologies, markets and concepts independently\n\nStrong analytical thinker, organized, with attention to details\n\nExperience participating in the complete product lifecycle of web and/or software product\n\nAbility to thrive in a fast-paced startup working environment\n\nPro-active and independent achiever, self-learner, able to handle a task from ideation to production\n\nGood communication skills across teams and with usersShow more Report"}, {"company": "WebNews", "job": "UX DESIGNER [JUNIOR]", "city": "Netanya", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=130&ao=1136043&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4285a9c6&cb=1678899920924&jobListingId=1005947207547&jrtk=3-1-1grj3nfupm6q0801-1grj3gsk82a83000-a2a568d93fa7fdc8-", "description": "Ability for good analysis and attention to detail\nCreativity and original way of thought\nAbility to learn quickly\nMaster’s degree in relevant fields (human engineering / cognitive psychology / industrial psychology, industrial engineering and management)\nSuperb human relations, including management and customer-facing capabilities.\nAbility to work well on your own as well as in a team\nCV: jobs@webnewsltd.co.ilShow more Report"}]