[{"company": "Teva Pharmaceuticals", "job": "Internal Channels Manager (Temp- Maternity leave)", "city": "Tel Aviv-Yafo", "date": "24h", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=101&ao=1136043&s=58&guid=00000186e63d721b9e7688837657d796&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_3b6f1743&cb=1678900125798&jobListingId=1008530607632&jrtk=3-1-1grj3to11klsv801-1grj3qsjc28it000-47d7d913f0085169-", "description": "Internal Channels Manager (Temp- Maternity leave)\nDate: Mar 15, 2023\nLocation:\nTel Aviv, Israel, 1\nCompany: Teva Pharmaceuticals\nJob Id: 46629\nWho are we?\n\nTogether, we’re on a mission to make good health more affordable and accessible, to help millions around the world enjoy healthier lives. It’s a mission that bonds our people across nearly 60 countries and a rich, diverse variety of nationalities and backgrounds.\nWorking here means working with the world’s leading manufacturer of generic medicines, and the proud producer of many of the products on the World Health Organization’s Essential Medicines List. Today, at least 200 million people around the world take one of our medicines every single day. An amazing number, but we’re always looking for new ways to continue making a difference, and new people to make a difference with.\n\nJob Description\n\nThis is an opportunity to work in a leading global Pharma company and a professional communications team responsible for communication to around 40,000 employees worldwide. This person will take ownership of the internal channels and devise the appropriate internal channels strategy as well as approach to each of the channels, and measure success. They will also manage the planning and editorial for the internal channels and secure the quality of the content. The key elements of the position are:\nLead the internal channels strategy, manage the content and be responsible for the calendar for each.\nServe as a trusted partner for campaign managers / global communications colleagues for best practice and guidelines for internal communication.\nResponsible for the editorial plan for the global sections of Teva’s intranet, and works closely with the Digital team as well as markets' communicators\nReviews alternative internal / external channels not yet used or not fully utilized in Teva, and if relevant, be responsible for implementation of the strategy / content for that channel (working with the Digital team on the technical implementation).\nPlan and analyze analytics per channel / communication campaign across channels, and present with learnings and proposed changes to increase effectiveness of reach (working with the Digital team to provide the data)\nResponsible for the strategy and governance for internal newsletters and mass emails\nResponsible for editing the global One Teva newsletter\nQualifications\nA bachelor's degree in communications or a related discipline.\nEnglish mother-tongue essential, Hebrew an advantage (spoken)\nProven experience of at least 5 years in internal communications\nAble to see the “big picture” and understand the needs of the various departments who need to use the internal channels to communicate.\nStrong project management and organizational skills.\nAbility to work in a focused and accountable way under pressure and to tight deadlines.\nHigh levels of attention to detail and quality.\nStrong collaboration skills and the ability to influence others\nHighly developed verbal and written communication skills in mother-tongue English.\nLocated in Tel Aviv Site, Israel.\nFunction\nCommunications\nSub Function\nPublic Relations / Corporate Reputation\nReports To\n\nVP Brand Marketing\n\nAlready Working @TEVA?\n\nIf you are a current Teva employee, please apply using the internal career site available on \"Employee Central\". By doing so, your application will be treated with priority. You will also be able to see opportunities that are open exclusively to Teva employees. Use the following link to search and apply: Internal Career Site\nThe internal career site is available from your home network as well. If you have trouble accessing your EC account, please contact your local HR/IT partner.\nTeva’s Equal Employment Opportunity Commitment\nTeva Pharmaceuticals is committed to equal opportunity in employment. It is Teva's global policy that equal employment opportunity be provided without regard to age, race, creed, color, religion, sex, disability, pregnancy, medical condition, sexual orientation, gender identity or expression, ancestry, veteran status, national or ethnic origin or any other legally recognized status entitled to protection under applicable laws.Show more Report"}, {"company": "DoiT International", "job": "Startup Account Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.8", "link": "", "description": "Location\n\nOur Account Manager will be an integral part of our Sales team in EMEA. This role is based remotely in Israel.\n\nWho We Are\n\nWe enable greatness through the cloud. We thrive on working with fast-growing companies worldwide to solve essential and advanced cloud challenges. DoiT provides intelligent technology that simplifies and automates cloud usage alongside expert consultancy and unlimited technical support, all at no extra cost to our customers. Join our mission, where you'll work remotely with a committed, experienced, and global team in a collaborative and supportive culture. We are an award-winning strategic partner of Google Cloud and AWS, we provide intelligent technology, expert consultancy and unlimited technical support for customers across over 70 countries.\n\nThe Opportunity\n\nThe role of DoiT's Account Management team is to nurture relationships with existing customers, identify valuable ways to engage further with customers, provide a trusted point of contact for the cloud vendor teams regarding accounts' growth opportunities and retain 100% of DoiT's existing customers.\n\nResponsibilities\n\nDevelop a deep understanding of our business, our cloud management platform, support and services and how they help our clients and their needs.\nMaintain knowledge, context and ownership of the customers you are responsible for and own communication with the respective vendor teams in a way to show value and potential opportunities for revenue growth.\nManage customer-related support escalations to resolution, ensuring customer satisfaction is highest.\nNegotiate and close long-term commitments with key stakeholders, balancing the requirements of the customer, the vendor and the company's interests.\nIdentify New workload and Cost Optimization opportunities within the Customer's Cloud Environment / SaaS solutions.\nEstablish a regular cadence with the complete portfolio of your customers as part of your book of business. Balancing the requirements of large strategic customers and fast-growing emerging clients.\nHelp aggregate customer feedback that ensures our products & solutions are closely aligned with customer needs and requests.\nProvide customer feedback and requests to engineering teams to provide greater market/customer context and help prioritize deliverables within active development cycles.\nDeliver regular quarterly reviews with customers, tracking active project timelines, projected spend on respective cloud platforms and feedback on DoiT support & engagement.\nWork with Cloud Vendors Sales Rep on mutual customers.\n\nQualifications\n\n2+ years of experience in an Account Management/Customer Success/Customer Engineering role.\n3+ years experience at a technology company\nWorking experience with AWS, GCP, or other major public clouds\nStrong verbal/written communication skills in Hebrew & English.\nStrong technical skills that enable you to engage productively with technical teams and the ability to build influential relationships.\nGreat operational/administration skills, analytical, detail-oriented and able to \"zoom\" in/out from the big picture to the minutiae.\nA desire to grow within the organization and continuously broaden your skill sets.\nA great sense of humor and enjoys having fun at work.\n\nBonus Points\n\nCloud Certifications (AWS cloud practitioner or Google Cloud Digital Leader certifications)\n\nAre you a Do'er?\n\nBe your truest self. Work on your terms. Make a difference. We are home to a global team of incredible talent who work remotely and have the flexibility to have a schedule that balances your work and home life. We embrace and support leveling up your skills professionally and personally.\nWhat does being a Do'er mean? We're all about being entrepreneurial, pursuing knowledge and having fun! Click here to learn more about our core values.\n\nSounds too good to be true? Check out our Glassdoor Page.\n\nWe thought so too, but we're here and happy we hit that 'apply' button.\n\nUnlimited PTO\nFlexible Working Options\nHealth Insurance\nParental Leave\nEmployee Stock Option Plan\nHome Office Allowance\nProfessional Development Stipend\nPeer Recognition Program\n#LI-RemoteShow more Report"}, {"company": "Applause", "job": "Strategic Account Manager", "city": "Herzliya", "date": "30d+", "rating": "4.1", "link": "", "description": "Applause empowers leading brands to deliver flawless digital experiences for their customers on any device, in every location. The company’s testing, feedback and research solutions enable businesses to delight customers, drive topline revenue and innovate faster.\n\nApplause ensures digital quality for websites, mobile apps, IoT products and in-store interactions in a way no other approach can – via its technology platform and managed global community of over one million on-demand digital experience experts. Only real people on real devices in real locations can provide the real issues and feedback that brands need to deliver great digital customer experiences. Thousands of companies of every size rely on Applause to dramatically decrease the time and cost of delivering great digital experiences for their customers.\n\nWe are looking for a Strategic Account Manager (m/f/x) for driving revenue growth by building and managing strategic accounts, long-term client relationships, and developing key business relationships. The role requires a focus on new business development, in addition to, up-selling and cross-selling to existing clients and securing contract renewals with a focus on the Hi Tech industry. This will be achieved through solution selling, account planning, identifying high-quality clients, qualifying and developing assigned accounts while understanding the client business environment, educating clients on Applause's product offerings, and identifying ways the company can assist clients in solving its application development testing challenges.\n\n\nPrimary Responsibilities:\n\nDevelops and executes sales plans and coordinates sales efforts to achieve existing customer up-sell revenue targets and new customer revenue.\nMeets or exceeds defined sales quota through strategic account planning, networking and use of company resources.\nStrong preference for experience selling technology/ managed services into Hi Tech industry.\nFocus on Account Management and Business Development to maximizes Applause’s revenue and profitability potential by up-selling to existing clients, driving renewal revenue and ensuring client satisfaction;\nInvolvement in kickoff meetings, major milestone meetings, and opportunistic participation where senior client decision makers are present.\nSales Leadership – Strategic sales approach, creates value for clients and adds to the company’s capabilities and reputation;\nMaintains a thorough understanding of Applause’s product offerings and tailoring its presentation to meet the needs of different types of organizations.\nAssists clients in developing the business case and value proposition for proposed solutions when necessary\nCollaborates with Client Services Team and Executive Leadership Team in executing the company’s sales process including proposal development.\nTracks and maintains all prospect and client activity in Salesforce.com.\nPeople Development – Contributes to the growth, development and positive experience of the sales team.\n\nYour experience and skills:\n\nBA/BS Degree or equivalent business experience.\n4+years of Professional services, Managed services or solution sales experience\nProven track record of successful customer engagements across a spectrum of enterprise-class verticals.\nDemonstrated success selling to strategic accounts.\nA strong foundation for strategic and tactical selling of a solution sale.\nExcellent presentation and negotiation skills.\nMotivated to advance growth in an entrepreneurial, rapidly growing company environment.\nWhy Applause?\n\nInternational team full of passionate and talented people\nOpportunity to grow and contribute to the success of a global company working with the biggest, widely recognized brands\nVariety of learning and development opportunities\nRemote-friendly: work-from-home or our office in Herzliya\nCulture of teamwork and transparency\nThree times on the Forbes List of Most promising companies\nApplause is an international company that, like our crowd, embraces diverse backgrounds, perspectives, and abilities. Our employees bring their true self to Applause. Do you want to be involved in the expansion of an international company and work for one of the fastest growing tech firms? If so, then this position at Applause is perfect for you!\n\nApplause is a place where everyone belongs and where we believe everyone deserves the exceptional. Since our founding, we have continued to celebrate diversity and are committed to creating an inclusive environment. We have a global workforce that, like our crowd, embraces diverse backgrounds, perspectives, and abilities. Our employees bring their true self to Applause. We prohibit discrimination and harassment of any kind based on race, color, religion, national origin, sex (including pregnancy), sexual orientation, gender identity, gender expression, age, veteran status, genetic information, disability, or other applicable legally protected characteristics. If you are qualified to perform the essential functions of this job, but believe you require a reasonable accommodation to do so, please click here to complete an accommodation request. Please note Applause will only review requests for applications that have been submitted. We will review your qualifications and follow up with you regarding your request if your qualifications meet our current needs.\n\n#LI-GS1Show more Report"}, {"company": "Rockwell Automation", "job": "Account Manager - End User", "city": "Tel Aviv-Yafo", "date": "2d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=104&ao=1136043&s=58&guid=00000186e63d721b9e7688837657d796&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ee08d1a1&cb=1678900129928&jobListingId=1008525917258&jrtk=3-1-1grj3ts1rmfqk801-1grj3qsjc28it000-858ce1248d1b9e84-", "description": "Rockwell Automation is a global technology leader focused on helping the world’s manufacturers be more productive, sustainable, and agile. With more than 25,000 employees who make the world better every day, we know we have something special. Behind our customers - amazing companies that help feed the world, provide life-saving medicine on a global scale, and focus on clean water and green mobility - our people are energized problem solvers that take pride in how the work we do changes the world for the better.\nWe welcome all makers, forward thinkers, and problem solvers who are looking for a place to do their best work. And if that’s you we would love to have you join us!\nJob Description\nTo be based in our office in Tel Aviv, we are looking for a dedicated Account Manager with focus in our End User customers in the Life Cycle services and solutions industry.\nSome key information about the role:\nMain responsibilities: Sells company’s products and/or services to existing named accounts within a geographic territory. Maintains relationships with existing named accounts. May have their own accounts or work on a team.\nComplexity: Works on issues of diverse scope where analysis of data requires evaluation of identifiable factors. Demonstrates good judgment in selecting methods and techniques for obtaining solutions.\nSupervision: Normally receives little instruction on day-to-day work, generally instructions on new assignments.\nScope: Receives assignments in the form of objectives and determines the process by which to meet goals.\nInteraction: Frequently interacts with peers and customers to gain cooperation of others or conduct presentations of technical information/project activities. Networks with senior internal/external personnel in own area of expertise.\nSkills, Knowledge, Experience and Education\nPrior minimum 3-5 years of relevant experience in a technology-based organization\nSales and technology background and mindset\nProven ability to achieve results in a customer-oriented environment\nAbility to acquire new business within existing and new customers\nBachelor or master’s degree in an engineering/technical related field or equivalent\nAdditional experience in Software sales or integration is appreciated\nFluency both in Hebrew and English\nWhy a career at Rockwell Automation\nCareer growth opportunities and an employee performance-based culture in one of the fastest growing and largest manufacturing automation companies on the planet. A journey you want to be part of!\nCompetitive compensation package and employee benefits in a business casual environment, recognition & service awards\nA world-class & multi-cultural digital Sales and Management Team with a commitment to fun, competition, innovation, collaboration, and integrity\nBe an instrumental part of the growth engine of our company, work with measurements that are linked to your impact on revenue\nDevelop your skills in working with multiple stakeholders around the world and contribute to business culture\n#LI-DAB #LifeatROKShow more Report"}, {"company": "Payoneer", "job": "Sales Ops Analyst", "city": "Petah Tikva", "date": "27d", "rating": "4.1", "link": "", "description": "A universe of opportunities. Open to you.\n\nPayoneer's mission is to empower anyone, anywhere to participate and succeed in the global economy. If our mission connects with your values, if you revel in solving complex challenges, and if you want to continuously advance your career, come realize your potential at Payoneer!\n\nLife at Payoneer is a global community, where you'll work with colleagues all over the world, in a hybrid or remote work frame. As an equal opportunity employer, the only things that matter to us are your skills, your drive and your desire to have a positive impact on others.\n\n\nAs a Sales Ops Analyst, your core objective is to define the compensation plan, strategy, and targets, and calculate and track sales force performance. You will lead E2E projects to drive and enable our next phase of best-in-class sales operations – accelerating our existing momentum, scaling our commission for growth, and maximizing Payoneer's full potential across the world.\n\nAt the core of everything we do, we're proud that Payoneer's customers are front-and-center in all our strategic decisions. As we continue to grow at pace, providing our customers a universe of opportunities and opening their business up to the world, we would like to maintain and exceed the same high standards. We've built a powerful, high performing business and go-to-market regions, through a continuous growth mindset and improvement of our sales operations, tools, and processes.\n\nYou'd get us there by linking sales KPIs and targets to our strategy, demonstrating strong analytics skills, a data-driven mindset and project management abilities. You'd be tracking and analyzing monthly and quarterly performance, communicating with go-to-market community members on the deals, achievements, sales success, and achieved compensation, and leading cross-department initiatives to enhance standardization and process improvement.\n\nWhat you'll be spending your time on:\n\nDefining and evaluating analytical KPIs for sales workflows to ensure healthy growth of the business\nTracking and calculating monthly and quarterly sales performance\nWorking with the global sales management team to enhance business understanding and achievements\nProviding recommendations and actions based on strategic objectives, forecasts, and performance metrics\nBuilding reports and dashboards in Excel and SF\nLeading E2E projects, supporting the sales/onboarding process, and implementing operational metrics\n\nIn this role, you will:\n\nLead the commission plan, KPI automation, and data hygiene in Salesforce, working closely with the business applications team:\n\nAnalyze sales and account management results and identify areas for strategic focus and development\nWork with the finance and data department on integrating data from various sources and creating analytical models\nSupport the GTM team and communicate effectively the achievement status\nDevelop tracking tools and methodologies, and compile and analyze data over time to forecast sales trends\n\nCollaborate with team members and be proactive as:\n\nA humble, caring professional who puts customers and colleagues first and is passionate about both of their experiences\nA team player who understands that collaboration is the key to success, while being self-motivated with a can-do attitude\nAn energetic self-starter who possesses strong interpersonal skills and is able to collaborate with various teams across the business to drive execution\n\nRequirements:\n\n2-4 years of experience in analytical roles/sales incentive/project management in a technological/financial environment\nExperience in sales operation/business operation/program management/consulting/FP&A\nDriven by business goals, with a deep understanding of business analysis, and modeling and data infrastructure\nExpertise in SF/CRM, Excel, financial modeling, analyzing, and forecasting the financial impact\nStrong project management skills, service-oriented, and possessing the ability to promote initiatives in a dynamic environment\nBachelor's degree in business, finance, industrial engineering, or a related field\nExcellent written and verbal communication skills in English\n\nWho we are:\n\nPayoneer (NASDAQ: PAYO) is the world's go-to partner for digital commerce, everywhere. From borderless payments to boundless growth, Payoneer promises any business, in any market, the technology, connections, and confidence to participate and flourish in the new global economy. Powering growth for customers ranging from aspiring entrepreneurs in emerging markets to the world's leading brands, Payoneer offers a universe of opportunities, open to you.Show more Report"}, {"company": "United Nations", "job": "Digital Learning Platform Project Manager", "city": "Jerusalem", "date": "17d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=106&ao=1136043&s=58&guid=00000186e63d721b9e7688837657d796&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_00e81052&cb=1678900134052&jobListingId=1008493350630&jrtk=3-1-1grj3u018jrpp801-1grj3qsjc28it000-8d568721e4543452-", "description": "UNRWA, the largest United Nations operation in the Middle East with over 30,000 staff working across five areas of operation, is looking for highly committed personnel wishing to make a change.\n\nIf you are looking for a rewarding opportunity to make a tangible difference for one of the most vulnerable communities in the world, UNRWA would like to hear from you.\n\nThe Digital Learning Platform Project Manager reports to Deputy Director of UNRWA Affairs and receives technical guidance from the Deputy Director of Education and the Senior Education Programme Specialist.\nResponsibilities\n- Is responsible for the overall effective and efficient management of the project in terms of planning, implementation, monitoring, and coordination including, leading the Project Management Team (PMT) consisting of key managers responsible for the various verticals of the project and ensure effective and timeline decisions making for the implementation of the project, presenting the latest project updates and key points for decision making to the Project Governance Team. Participate and support the organization of the Project Governance Team Meetings.\n\nLeads and monitors the implementation of Digital Learning Platform (DLP) project including implementation of activities in line with the project results framework and ensuring that the key project deliverables, outputs, and outcomes are achieved efficiently; mentoring the key Managers that responsible for implementation of various strands of the project (education, technology, communications, partnerships etc.); and in coordination with Project Management and Governance teams Identifying key project challenges to implementation and addressing them through effective decision making.\nAdministers the project overall budget and controlling the financial resources of the project in coordination with finance department; liaises regularly with the donors on project related issues as and when required, which may include providing ad hoc updates and responding to queries etc.\nDevelops and maintain working relationships with the internal/external project stakeholders and organizes consultative meetings with them to present and implement project activities; ensuring adequate coordination and consultation with key stakeholders, as well as Leads any other internal and external coordination and consultations to learn from global experiences in digital transformation on education as required.\nEnsures consistency between the various project activities and other activities funded by the Agency or implemented by the host country.\nSupervises key project positions including the management and oversight of consultants, to ensure smooth implementation of the project. Ensures clear roles and responsibilities are assigned in accordance with the project structures and to achieve maximum efficiency. May provide strategic and technical advice for the project based on prior experience in working on education projects related to use of technology and in areas of conflict.\nCoordinates and prepares progress reports that will show ongoing progress and results on agreed upon targets and expenditures over time.\nMaintains project information, capturing project lessons learnt and cross-fertilization with other projects/activities implemented by the Agency in support to its modernization/digital transformation efforts.\nCompetencies\nUN Core Values of Integrity, Professionalism and Respect for Diversity, and Core Competencies of Communication, Working with People and Drive for Results apply by default.\n\nPlanning and OrganizingLeading and SupervisingPersuading and InfluencingDelivering Results\nCreating and Maintaining Impact and Partnership\nFor guidance on how to prepare for competency-based interviews: https://careers.un.org/lbw/home.aspx?viewtype=AYI\nEducation\n- An advanced university degree (Master’s or equivalent) from an accredited educational institution in social sciences, education, or a related domain.\nJob - Specific Qualification\n- A certification in project management from a recognized institution or professional programme (e.g. PMP, PRINCE2, IPMA, etc.) is desirable.\nWork Experience\n- At least 8 years of progressively responsible and relevant professional experience in project management related to education projects, with a technology or educational technology focus at national and international levels, is required.\n\nUnless already serving as an international staff member in the UN Common System, a candidate for an international post must have at least 2 continuous years of international relevant experience outside UNRWA, and outside the country(s) of which the candidate is a national or holds citizenship, a passport, or a national identity number, is required.\nExperience working on e-learning/education technology projects in schools, is required.\nExperience in project execution (based on a results framework), reporting and budgeting, is required.\nFamiliarity with relevant organizations of the UN system working on education, is desirable.\nKnowledge and understanding of the Palestine refugee situation and the political context of the Middle East, is desirable.\nExperience of working on education-technology projects in conflict areas, is desirable.\nExperience of working on a digital curriculum involving digital pedagogies, is desirable.\nLanguages\n- Excellent command of written and spoken English is required.\n\nWorking knowledge or fluency in Arabic, is desirable.\nAssessment\nEvaluation of qualified candidates may include an assessment exercise which may be followed by competency-based interview.\nSpecial Notice\nType of Contract and duration: One year project funded, with the possibility of further extension subject to availability of funds, need and performance.\n\nDuty station is Jerusalem, working for West Bank Field Office.\n\nApplicants have to complete the Personal History Profile (PHP) in inspira in order to be considered. The PHP should be completed with full relevant work experience as per the requirements in the Job Opening, in order to be considered.\n\nUNRWA welcomes applications from qualified candidates with disabilities.\n\nA roster may be created from the selection exercise, and successful candidates may become eligible for a temporary appointment to the same post or a similar post.\n\nEquivalency:\nA first level university degree in combination with two additional years of qualifying experience may be accepted in lieu of an advanced university degree.\nNB: work experience alone or formal qualifications with no relevant work experience are not considered an acceptable combination.\n\nUNRWA is funded almost entirely by voluntary contributions from UN member states, regional bodies, business foundations and individual contributions. The mission of UNRWA is to help Palestine refugees achieve their full potential in human development under the difficult circumstances in which they live.\n\nFor more details on UNRWA, please visit: https://www.unrwa.org/\nUnited Nations Considerations\nStaff members are subject to the authority of the Commissioner-General of UNRWA and to assignment by him or her.\n\n\nUNRWA is committed to achieving gender parity at all levels of staffing under the current UN-wide gender agenda and strongly encourages applications from qualified applicants from under-represented groups.\n\nAt UNRWA, the paramount consideration in the recruitment and employment of staff is the necessity of securing the highest standards of efficiency, competence and integrity, with due regard to geographic diversity. All employment decisions are made on the basis of qualifications and organizational needs. UNRWA is committed to creating a diverse and inclusive environment of mutual respect. Reasonable accommodation for applicants with disabilities may be provided to support participation in the recruitment process when requested and indicated in the application.\n\nUNRWA Considerations\n\nUNRWA staff are expected to uphold the highest standards of efficiency, competence, neutrality, impartiality and integrity. This includes respect for and commitment to human rights, diversity and non-violent means of dealing with all kinds of conflict. Only persons who fully and unconditionally commit to these values should consider applying for UNRWA jobs. Candidates will not be considered for employment with UNRWA if they have committed violations of international human rights law, violations of international humanitarian law, sexual exploitation, sexual abuse, or sexual harassment, or if there are reasonable grounds to believe that they have been involved in the commission of any of these acts. Candidates who have committed crimes other than minor traffic offences may not be considered for employment. The Agency may disqualify applicants who have separated for reason of misconduct, who left a UN Agency while misconduct processes were pending, or who appear on the UN Sanctions List.\nUNRWA is a non-smoking work environment.\n\nApplicants are urged to follow carefully all instructions available in the online recruitment platform, inspira. For more detailed guidance, applicants may refer to the Manual for the Applicant, which can be accessed by clicking on “Manuals” hyper-link on the upper right side of the inspira account-holder homepage.\n\nThe evaluation of applicants will be conducted on the basis of the information submitted in the application according to the evaluation criteria of the job opening and the applicable internal legislations of the United Nations including the Charter of the United Nations, resolutions of the General Assembly, the Staff Regulations and Rules, administrative issuances and guidelines. Applicants must provide complete and accurate information pertaining to their personal profile and qualifications according to the instructions provided in inspira to be considered for the current job opening. No amendment, addition, deletion, revision or modification shall be made to applications that have been submitted. Candidates under serious consideration for selection will be subject to reference checks to verify the information provided in the application.\n\nJob openings advertised on the Careers Portal will be removed at 11:59 p.m. (New York time) on the deadline date.Show more Report"}, {"company": "SciPlay", "job": "VIP Experience Manager", "city": "Israel", "date": "24h", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=107&ao=1136043&s=58&guid=00000186e63d721b9e7688837657d796&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_46b4c804&cb=1678900135071&jobListingId=1008528301532&jrtk=3-1-1grj3u11cjfm6801-1grj3qsjc28it000-9b61fc1516b9912a-", "description": "DESCRIPTION\nThe VIP Experience Manager is responsible for the day-to-day work with all SciPlay game teams and stakeholders to develop and implement VIP assets to drive the mutual goals and objectives of the product and VIP operations teams.\nKEY RESPONSIBILITIES\nSciPlay is a leading developer and publisher of digital games on mobile and web platforms, providing highly entertaining free-to-play games that millions of people play every day for their authenticity, engagement and fun.\nSciPlay currently offers nine core games, including social casino games Jackpot Party Casino, Gold Fish Casino Slots, Hot Shot Casino and Quick Hit Slots, and casual games MONOPOLY Slots, Bingo Showdown, 88 Fortunes Slots, Backgammon Live, and Solitaire Pet Adventure with offices all over the world!\nThis individual will work centrally under the VIP operations to advance the projects with game team stakeholders to ensure that VIP assets, communication tools, and player rewards within the core products are of the highest quality and align with SciPlay and the VIP Operations Teams goals. This person works closely with game team product managers, GMs, developers, monetization, and Live Ops teams for each core game and is a crucial contributor in driving the future VIP Game roadmap. This role will report to the Director of VIP. They will collaborate on new initiatives to amplify VIP assets within each product while learning and leveraging our strengths against other social gaming competitors in the marketplace.\nEssential Job Functions:\nCollaborate with game team stakeholders to develop and implement VIP assets to drive the mutual goals and objectives of the product and VIP operations teams.\nProactively identify opportunities for VIP operations program improvements and continued development within SciPlay products.\nPartner with game team stakeholders to oversee the design, development, and implementation of VIP program initiatives within SciPlay products\nRegularly meet with VIP Team Managers and VIP Account Managers to continually identify areas of growth and opportunity for the VIP program within the products and initiate those efforts with game team stakeholders.\nCoordinate with VIP Account Managers, Retention Manager, and VIP Team Managers to collect player feedback about new assets, features, and content and present findings to game team stakeholders.\nPartner with VIP Data Analyst to collect and evaluate the KPI impact of new product assets from VIP players and provide actionable insights to continue to drive the VIP program forward consistent with game team business objectives\nContinually communicate with Design Team to identify features, rewards, and benefits available to VIP players on competitor products in the social casino marketplace.\nHelping Manage a queue of inbound and outbound VIP player communication in support channels (and on Facebook) for SciPlay products where a VIP Account Manager is not yet established\nMonitor and update VIP Team leadership regularly on new program efforts in the product development pipelines for each core product.\nContinually communicate with CS Team leadership to understand general player sentiment regarding new feature releases, product updates, and changes to existing game mechanics.\nAssist VIP Operation s Team leadership in the training and onboarding of Account Managers to provide insight regarding game team processes, available VIP assets, projects on the future roadmap, and VIP communication/admin tools.\nResponsible for creating at least 1 VIP contest per week, where players are challenged in the game, and prizes are awarded to the top winners.\nCreate a 1 VIP giveaway which challenges players to drive in the-game KPIs, and prizes are awarded to random winners.\nCoordinate at least 1 community contest per week.\nBoth of these should help drive opt-in growth month-over-month\nCreate a VIP Appreciation program in-game for games where one is not yet established.\nCoordinate sending and drafting of 1 newsletter per month with Account Manager (due to events, this will need to be completed together)\nPrepare post-event analysis for stakeholders within 7 days of event conclusion, including revenue analysis.\nHealth check: feedback from players, any issues experienced with event mechanics and event processes (opt-ins, payouts, communications)\nProvide monthly wrap-up of events presented during the first VIP Weekly Sync of the month.\nCreate a monthly schedule of planned events presented during the final VIP Weekly Sync of the month.\n\nREQUIREMENTS\nEducation\nBachelors degree in related field.\nYears of Related Experience\nYears of experience 5 to 8 years\nWe are SciPlay! We make games!\nThe roots of our company are simple and strong: Our founder, Aaron “Shurm” Schurman, fell head over heels for casino games and had a vision to create the most entertaining free-to-play casino games for gamers around the world. We’ve grown into a company that makes games we are truly proud of and that are enjoyed by millions of players every day. Our history is extensive, but we’re just getting started. In 1998, we got our start as Phantom EFX and in 2019, we reintroduced ourselves as SciPlay and went public on the Nasdaq.\nAt SciPlay, we are programmed to think untraditionally. From our yearly development conferences, shindigs, and new game launches, we believe in doing what you love and doing it well. We take great pride in our ability to create authentic experiences for players and we are excited to continue investing in our workforce, technology, and our data-driven approach, all with the mission of delighting our players long into the future. We believe that if we continue to stay passionate, set ambitious goals, live our values and play together, we will become the #1 social casino and casual gaming company in the world.\nA few of our highlighted perks and benefits:Competitive salariesPaid Family LeavePaid Volunteer TimeAnnual bonuses, matching 401k, stock options, and other benefitsGame Room featuring current generation consoles, numerous game titles, and various table games.Fully Stocked Kitchen with Beverages and SnacksOpen Office Concept with Ergonomic Seating and Standing DesksSummer HoursHybrid Office (Currently 1 Day In / 4 Days Remote)\nWe don’t consider the above list “Culture” though. Culture at SciPlay is MUCH MORE than just that including, but not limited to:Culture League Dedicated to Employee Engagement and FunEmployee Resource GroupsMental Health ResourcesCareer RoadmapsAnnual Company RetreatsLearning & Development OpportunitiesManagement TrainingLeadership Book ClubsEmpathic LeadershipWork Life Balance\nCompany Values:\n#beYOU\n#playTOGETHER\n#embraceCULTURE\n#levelUP\n#getRESULTS\n#justWIN\nRead More About Our Values Here:\nhttps://www.sciplay.com/about-sciplay/sciplay-core-values/\n Don’t meet every single requirement? Studies have shown that women and people of color are less likely to apply to jobs unless they meet every single qualification. At SciPlay we are dedicated to building a diverse, inclusive and authentic workplace, so if you’re excited about this role but your past experience doesn’t align perfectly with every qualification in the job description, we encourage you to apply anyways. You may be just the right candidate for this or other roles we have! #beYOU\nSciPlayers are humble. In the live environment of mobile game development, there’s no room for egos and the loudest voice doesn’t get their way here. We are diverse in our backgrounds and our experience, both professionally and personally, and we believe our differences are key to unlocking our super powers.\nSciPlay Corporation and its affiliates (collectively, SciPlay) are committed to creating a workforce of credibility and dependability. As a prerequisite to employment with SciPlay (to the extent permitted by law), you shall be asked to consent to SciPlay conducting a due diligence/background investigation on you. This job description should not be interpreted as all-inclusive; it is intended to identify major responsibilities and requirements of the job. The employee in this position may be requested to perform other job-related tasks and responsibilities than those stated above. SciPlay is an Equal Opportunity Employer and does not discriminate against applicants due to race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class. If you’d like more information about your equal employment opportunity rights as an applicant under the law, please click here EEOC Poster.\n#LI-ME1 #LI-Hybrid #LI-RemoteShow more Report"}, {"company": "Genesys", "job": "Product Designer (UX/UI)", "city": "Tel Aviv-Yafo", "date": "1 day ago", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=108&ao=1136043&s=58&guid=00000186e63d721b9e7688837657d796&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_bce7a778&cb=1678900136289&jobListingId=1008527139477&jrtk=3-1-1grj3u2692g8l001-1grj3qsjc28it000-b3d079c1be7ebabb-", "description": "It's fun to work in a company where people truly BELIEVE in what they're doing!\nWe're committed to bringing passion and customer focus to the business.\nExceed.ai is a Conversational Marketing platform, powered by Artificial Intelligence, that automates the lead qualification, nurturing process, and meeting schedule for Sales and Marketing teams to save them time and allow them to focus on building relationships with prospects and customers, having meaningful conversations and being creative. As the Exceed Product Designer, you’ll help build the next-generation, cloud-based customer experience platform. This role will be responsible for creating compelling and delightful experiences employing Design thinking methodologies and best practices. You will help define product features as well as user interactions and flows, creating wireframes, prototyping, documenting, and user testing the designs. As a confident communicator, you can work laterally to engage with senior stakeholders across the different disciplines with ease.\nThis is a fixed term contract for a duration of 6 - 9 months.\nLocation: For this role, we are open to candidates being based either on-site full time, or working Hybrid 50/50.\nIn this role the primary responsibilities include (but are not limited to):\nProduct designs as needed to ensure ideas are realized to their fullest potential through the effective use of user centered design and information principles.\nParticipate as a design lead to cross-functional teams that include, project management, product management, software developers, and QA.\nParticipate in product and feature ideation and conceptual development for web solutions, also taking into account responsive design considerations.\nProduce conceptual models, flow charts, conceptual sketches, wireframes, IAs, design prototypes, and design specifications.\nDesign and specify user interfaces using participatory and iterative design techniques, including observational studies, customer interviews, usability testing, and other forms of requirement’s discovery.\nCreate digital assets that effectively communicate product function and intent, user interaction, and screen hierarchy.\nEffectively communicate research findings, conceptual ideas, detailed designs, and design rationale both verbally and visually to stakeholders and team members.\nWork closely with development teams to ensure that design specifications are implemented.\nManage multiple projects at one time, switching focus between projects as required to manage priorities.\nRequired Qualifications:\n2+ years proven experience designing data-intensive software applications for a global audience.\nStrong knowledge of interaction design processes and methodology particularly as applied to desktop & mobile products.\nThrive in a fast-paced work environment that requires independent self-direction with an aptitude for team collaboration and open communication.\nProactive and takes ownership for producing positive results.\nContributes as a valued team member and colleague with leaders at all levels.\nDemonstrates personal self-awareness and desire for continual learning and personal development.\nMust possess the presentation skills and professionalism to project a professional image, both internally and externally.\nHave developed UX and/or User Interface (UI) designs for IT professionals.\nExperience working closely with engineering to champion design at every step.\nHave an online portfolio showing a mix of UX/UI design experience.\nProficient in industry standard design tools such as XD or Figma. (Figma is our tool of choice)\nPreferred Qualifications:\nB.S or M.S. in any of the following: HCI, Interaction Design, Industrial Design, Visual Design, and/or related fields.\nExperience with AI or machine learning capabilities.\nCovid-19:\nSafety for our employees and our communities is a key priority for Genesys. We continue to experience rapid growth during the Covid-19 pandemic and are conducting remote hiring and onboarding processes. All hiring and onboarding processes are being conducted remotely at this time.\nAs our Covid-19 task force and internal teams plan to reopen our global offices, the policies and procedures continue to be updated.\nReasonable Accommodations:\nIf you require a reasonable accommodation to complete any part of the application process or are limited in the ability or unable to access or use this online application process and need an alternative method for applying, you or someone you know may complete the Reasonable Accommodations Form for assistance. Please use the Candidate field in the dropdown menu to ensure a timely response.\nThis form is designed to assist job seekers who seek reasonable accommodation for the application process. Submissions entered for non-accommodation-related issues, such as following up on an application or submitting a resume, may not receive a response.Show more Report"}, {"company": "Aniview", "job": "Customer Success Manager", "city": "Tel Aviv-Yafo", "date": "26d", "rating": "4.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=109&ao=1136043&s=58&guid=00000186e63d721b9e7688837657d796&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9ea6f6aa&cb=1678900137518&jobListingId=1008478752757&jrtk=3-1-1grj3u3f2kf2u801-1grj3qsjc28it000-d4dd80d7ba62210e-", "description": "Job Category: Clients & Operations\nJob Location: Tel Aviv - Israel\nAniView is seeking a talented, driven Customer Success Manager to join our fast-growing team.\nAs part of our team, you will have a key position supporting our local and international customers by providing technical assistance, monitoring, and account management.\nThe ideal candidate should have a strong interest in technology and business and be comfortable in a customer-facing position.\nResponsibilities\nServe as a trusted advisor to customers by utilizing your deep understanding of the Aniview product to help achieve customers’ business goals.\nAct as the customers advocate and collaborate with internal teams, including product management, operations, and sales, to find and provide the best possible solutions\nManage and lead on-site technical product-related workshops and demos\nWork closely with the sales teams and serve as the expert with everything tech and product related to help identify and close opportunities\nBuild a long-lasting relationship with the customer both remotely and face to face while serving as the account technical and product POC, while helping accounts explore untapped opportunities to drive business goals\nDefine new technical requirements, build project timelines and manage the delivery, both outbound and inbound\nRequirements\n1-2 years of client-facing account management with an understanding of digital marketing and the digital landscape.\nYou’re curious and tech-savvy. You enjoy deep-diving into the technical details and can demonstrate your technical depth and skills\nKnowledge of HTML, CSS, and server-side technologies\nYou have the ability to understand customer needs and requirements and translate them into actionable items and plans for the company’s internal stakeholders\nAn analytical disposition. You’re comfortable digging through data, manipulating it in excel, and drawing out impactful insights for your clients.\nAn optimistic attitude, a strong passion for your work, intellectual curiosity, and the ability to positively influence your peers.\nExcellent problem-solving skills\nExcellent storyteller & communication. You’re proficient with presentation software & comfortable presenting data-driven stories and recommendations internally and externally\nExcellent verbal and written English – a mustShow more Report"}, {"company": "Adidas", "job": "Manager - Digital Partners Commerce", "city": "Holon", "date": "10d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=110&ao=1136043&s=58&guid=00000186e63d721b9e7688837657d796&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d6b25a25&cb=1678900138762&jobListingId=1008509664047&jrtk=3-1-1grj3u4mgp6fv801-1grj3qsjc28it000-5a304dbe0f0b9f0e-", "description": "Purpose/Mission\n\nThis role is responsible to drive profitable NS and sustainable market share growth within assigned channel while respecting the image of the both the brands\n\nKey Responsibilities\nFunctional;\nTo represent the assigned account(-s) internally as an ‘ambassador’ toward all functions and vice versa and manage all interfaces.\nTo ensure understanding of the assigned accounts and categories and documentation by Strategic Account Plans\nTo ensure development of the account strategies, formalization by Strategic Account Plans and get sign off by the direct superior.\nTo lead overall business & account management for the channel\nTo Sell-in and agree on sell-out support and ensure formalization by Account Marketing Plans.\nTo monitor sell-out and the order book continuously and ensure reliable and cost-efficient supply for the account.\nTo support enforcement of adidas Trade Terms Policy.\nTo negotiate with Deputy Directors and Senior Category managers of pure players for their buying budget and ensure that both the brands have significant share on their buying budgets as per channel strategy.\nTo ensure execution of pre orders as per the strategy as this is one of the most critical KPI’s\nTo monitor and report on customers and competitors sell-through and activities, and propose/initiate/take actions\nTo provide realistic plans and forecasts on customers performances\nGather customer insights for continuous feedback on range improvement to fill product gaps\nGain market intelligence to make actions plans to consistently gain competition share and ensure growth for our brands across categories\nKey Relationships:\nCluster Supply Chain Team\nCluster Brand teams\nWholesale team\nCS team\nHub DPC team\nFinance team\nDeputy Directors, Category Managers, Marketing Managers, Logistics Managers& Finance of DPC Partners\nRequisite Education and Experience / Minimum Qualifications:\nFunctional: > 3 years Sales,\nIndustry: ideally in apparel/fashion/shoes\nExposure: Sports, Marketing, account marketing\nUniversity degree in business with marketing and sales focus\n\nAT ADIDAS WE HAVE A WINNING CULTURE. BUT TO WIN, PHYSICAL POWER IS NOT ENOUGH. JUST LIKE ATHLETES OUR EMPLOYEES NEED MENTAL STRENGTH IN THEIR GAME. WE FOSTER THE ATHLETE’S MINDSET THROUGH A SET OF BEHAVIORS THAT WE WANT TO ENABLE AND DEVELOP IN OUR PEOPLE AND THAT ARE AT THE CORE OF OUR UNIQUE COMPANY CULTURE: THIS IS HOW WE WIN WHILE PLAYING FAIR.\nCOURAGE: Speak up when you see an opportunity; step up when you see a need..\nOWNERSHIP: Pick up the ball. Be proactive, take responsibility and follow-through.\nINNOVATION: Elevate to win. Be curious, test and learn new and better ways of doing things.\nTEAMPLAY: Win together. Work collaboratively and cultivate a shared mindset.\nINTEGRITY: Play by the rules. Hold yourself and others accountable to our company’s standards.\nRESPECT: Value all players. Display empathy, be inclusive and show dignity to all.\n\nADIDAS CELEBRATES DIVERSITY, SUPPORTS INCLUSIVENESS AND ENCOURAGES INDIVIDUAL EXPRESSION IN OUR WORKPLACE. WE DO NOT TOLERATE THE HARASSMENT OR DISCRIMINATION TOWARD ANY OF OUR APPLICANTS OR EMPLOYEES. WE ARE AN EQUAL OPPORTUNITY EMPLOYER.\n\nJOB TITLE:\nManager - Digital Partners Commerce\nBRAND:\nadidas\nLOCATION:\nHolon\nTEAM:\nSales\nSTATE:\nM\nCOUNTRY/REGION:\nIL\nCONTRACT TYPE:\nFull time\nNUMBER:\n495109\nDATE:\nMar 5, 2023Show more Report"}, {"company": "אר.ויי.בי. פלסמנט אגנסי בע\"מ", "job": "Technical Distribution Manager", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=111&ao=1110586&s=58&guid=00000186e63d721b9e7688837657d796&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_5c506f88&cb=1678900140302&jobListingId=1008461831903&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj3u630k62u801-1grj3qsjc28it000-c49823ca2cf4943a--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBB2KP6P2L82LHS5aSG47CCeq2kIRLxfP9R7M7DrMeTgwaDlD9rRvcSHwQzcVmA-3m69Bnl4XjU-yJnrU4Xl-jlFCKP0QmQMoFUJKazXjhP8JA29nHLcefTbAgVandAMvdE5cvCBuN7EyISNUNe0pB7486OJCEhVjN9i21jKo2eDqdrZLCAOKgUB-7GCq39_XRGJux27VNy8BJnDoHh-y2bLHMiXB-sL8Nd5l82yfWfiru8cdVrNViYvy6yeganSnosvvTFk62SBOTNW6YUXt7fKf34d38m9FXIFtVcmO8jDQOYcumZEukGT2BV--uxhB_Hy9BkNDOH_vG_nHeTGGeA-YIGXv62THfRkXARV1HHUOIXldO9-VoxilsZAStqhERjisRjODo_K3sDlhqOoCPrGbPlxn-eSgzgFyb3NfnXvrhP8LWRm2AKGwpB1v1MgRl_8qiFXULrZGvCbD2uzRdJtfWw3lcd6SsCA8OGfau0iOu2c1EMD0MBsUCVl9_1EgyJtCAnpIqsf5c7U36K02N0x1GZKWHo7JxahWhOltfrRmZqkgwkJvGpYWzYq4Jlfvte4FtZ6-7iOHO8Av-f3qbmTK3VVI6SMgfMisiIM15QGUwEqOoTu-ACkuRT7pIyLzGCfjt30wx81tp6WLB8fdVMJ_2AEZF_mbo%3D", "description": "About us We are a premier provider of digital IP infrastructure to music companies globally. Our cutting-edge technology and innovative solutions empower music businesses to thrive in the digital age. We are driving the music 3.0 economy forward by enhancing speed, accuracy, and transparency in rights management, digital supply chain management, and royalty distribution. Key Responsibilities: Ensure accuracy and efficiency in all technical distribution processes Coordinates with the product, support and engineering team Responds in a timely way to customer or product-related inquiries Informs and trains clients about products and their use Documents customer needs and reports customer feedback Owns and masters your given area of responsibility Plan and execute work without supervision Continuously evaluate and improve existing systems and processes About you We are seeking a highly motivated and detail-oriented Technical Operations Manager to join our digital supply chain and distribution team.\n\nThe ideal candidate will have a strong knowledge of the inner workings of the music industry, delivery platforms, familiarity with computer systems, experience with complex data models and system workflows, and a minimum of intermediate proficiency in SQL. A successful candidate will be highly organized, have the ability to work independently as well as coordinate with team members, and have a strong attention to detail. Requirements: Minimum 3 years of experience as a technical account manager Bachelor’s degree in Computer Science or relevant field Proficient in SQL Knowledge of digital technologies Strong familiarity with computer systems and complex data models and system workflows High attention to detail and strong organizational skills Ability to work independently and in a team environment Strong communication and interpersonal skills Familiarity with the music industryReport"}, {"company": "TikTok", "job": "Partnership Manager Growth-Affiliates and Content Publishers", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=112&ao=1136043&s=58&guid=00000186e63d721b9e7688837657d796&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_817c900a&cb=1678900142059&jobListingId=1008280005358&jrtk=3-1-1grj3u7svmfqd801-1grj3qsjc28it000-00c0b3b6d88b0110-", "description": "Responsibilities\nTikTok is the leading destination for short-form mobile video. Our mission is to inspire creativity and bring joy. TikTok has global offices including Los Angeles, New York, London, Paris, Berlin, Dubai, Singapore, Jakarta, Seoul and Tokyo.\n\nWhy Join Us\nAt TikTok, our people are humble, intelligent, compassionate and creative. We create to inspire - for you, for us, and for more than 1 billion users on our platform. We lead with curiosity and aim for the highest, never shying away from taking calculated risks and embracing ambiguity as it comes. Here, the opportunities are limitless for those who dare to pursue bold ideas that exist just beyond the boundary of possibility. Join us and make impact happen with a career at TikTok.\n\nTikTok's Growth team aims to help businesses and brands of all sizes unleash their creative side, connect with our audience, or perhaps be discovered! From designing scaled sales and service delivery programs to ensuring our customers have best-in-class tools and products at their fingertips, our Growth team combines operational expertise with a customer-centric mindset to help businesses achieve their marketing goals on TikTok.\n\nAs a Partnership Manager, You’ll be working with leading direct to consumer companies and agencies focused on paid user acquisition. The Growth Partnership Manager role will be to identify relevant potential clients, evaluate the opportunity, create the partnership, scale the client’s media activity on TikTok, and establish themselves as trusted advisors to their partners.\n\nResponsibilities - What You'll Do:\nBusiness Management and Development\n\nIdentify strategic affiliates and drive cooperation with TikTok.\nMaintain a robust sales pipeline, to achieve revenue targets, drive penetration and account growth.\nBe the primary POC and maintain strong direct relationships with Cx level and marketing teams.\nTrack, analyze and communicate key metrics and business trends as they relate to partner relationships.\n\nCampaign Planning and Management\n\nInitiate joint business plans to maintain long term growth by understanding business objectives, KPIs and challenges.\nSupport affiliates performance by supplying data trends and industry insights, develop strategic sales plans, and prepare and conduct transformational pitches and sales presentations.\nFacilitate ad campaigns from start to finish, with deep knowledge of TikTok ads solutions and understanding of the clients' needs.\n\nCross Functional Collaboration\n\nServe as an internal advocate for our partners and work with internal cross-functions.\n\nWork with cross-functional Client Solutions team to maintain healthy ROI, improve work efficiency, and build long term growth.\n\nWork with Marketing team to develop pitch narratives and case studies, and take part in industry events and conferences to be positioned as a thought leader.\nWork with various product teams, on feedback and suggestions of ads solutions, systems and tools.\n\nQualifications\n\nQualifications - Who We're Looking For:\n\nBachelor's degree or equivalent practical experience.\n5 years of experience in affiliates account management and/or affiliate networks/affiliation industry.\nFluency in English and Hebrew, with ability to effectively communicate with and serve English speaking clients.\nExperience and success in strategically growing and maintaining complex, high-value managed accounts, through a consultative approach.\nExperience in building trusted relationships with directors and C-level stakeholders by developing a strong understanding of the client business and driving deep, data-driven insights.\nDeep knowledge of the digital advertising platforms and ecosystem, and of the affiliate marketing world in specific.\nA data-driven approach to user acquisition.\n\nTikTok is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At TikTok, our mission is to inspire creativity and bring joy. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We are passionate about this and hope you are too.Show more Report"}, {"company": "Similarweb", "job": "Billing Specialist", "city": "Tel Aviv-Yafo", "date": "3d", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=1136043&s=58&guid=00000186e63d721b9e7688837657d796&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_73284708&cb=1678900143163&jobListingId=1008523571718&jrtk=3-1-1grj3u8v02dhb001-1grj3qsjc28it000-0572eed0b5434a8b-", "description": "Similarweb is the leading digital intelligence platform used by over 3,500 global customers. Our wide range of solutions power the digital strategies of companies like Google, eBay, and Adidas.\n\nWe help our customers succeed in today's digital world by giving them access to data-driven insights, competitive benchmarks, strategic analysis, and more.\n\nIn 2021, we went public on the New York Stock Exchange, and we haven't stopped growing since!\n\nWe're looking for a Billing Specialist to join the team based in our Tel Aviv office.\n\nResponsibilities:\n\nProcess all billing inquiries in a timely fashion.\nEnsure that transactions are being prepared according to finance policies and approval standards are being met per set requirements.\nResponsible for verifying and processing daily invoices\nBe the focal point for addressing billing inquiries and activities for customers and provisioning permissions, sales, and support\nProcess internal requests for address changes, billing account changes, rate changes, account termination, account reactivation, recurring billing additions, etc.\nSupport the collection activities through special billing requirements and billing reconciliation issues as well as supplying customer documentation\nContribute to the team's mission to improve data flows, optimizing our processes, and ensuring accounting output is accurate.\n\nWhat will I bring to the team?\n\nCompleted a degree in finance/economics/business management preferred\nHave a good technical and system understanding\n2 years of experience as a Billing specialist, order management or similar role\nProficiency with MS Windows Office Suite and G-drive (advanced user of Excel preferred)\nSuperb attention to detail and strong analytical abilities\nExcellent organizational, interpersonal, and communication skills\nAbility to work with the corporate office and to be self-motivated\nAbility to learn quickly and keep up in an ever-changing environment\nHigh level of confidentiality, discretion, and professionalism\nAbility to produce well-written, professional documents (spreadsheets, email, etc)\nAbility to follow directions, meet strict deadlines, and work independently\nAbility and genuine desire to develop positive and productive working relationships with both internal and external customers\nExcellent English – written and spoken.\nSalesforce experience - a plus\n3rd party billing system experience - a plus\nWorking Mondays through Fridays - Hybrid model\n\nWe believe in balancing between the flexibility of working from home, and the fun of working together and face to face personal connections. That is why, at Similarweb we have implemented a Hybrid model, in which you work from the office 3 days, and can decide to work from home two days a week. Enjoying the best of both worlds!\n\nWhy choose Similarweb?\n\nWe believe that building a great product and a great company starts with finding amazing people and helping them grow and develop professionally and personally. At Similarweb, you'll be surrounded by curious, witty and passionate people that are hungry to drive real impact. We are proud to have over 800 creative and talented professionals, and we strongly believe in winning together as a way of driving a successful business!\n\nOur Values:\n\nData Driven: We believe data driven decisions are the key to success and we are evangelists for the power of digital insights\nPassionate: We care deeply about what we do, are accountable for our actions and are committed to helping each other\nExcellence: We believe in excellence as a mindset. It's in our nature; and we work hard to make a difference\nWinning Together: We know what it takes to build a great company and a great product and it begins with valuing each and every member of our team and working together to reach new heights.\n\nSimilarweb is a global company that strives to create a workplace reflective of the communities we serve, where individuals are empowered to bring their full, authentic selves to work. We are committed to inclusivity across race, gender, ethnicity, culture, sexual orientation, age, religion, spirituality, identity and experience. We believe our culture of equality and mutual respect also helps us better understand and serve our customers in a world that is becoming more global, more diverse, and more digital every day.\n\nAbout Similarweb:\n\nSimilarweb is the most trusted platform for understanding online behavior. Millions of people rely on Similarweb insights daily as the ground truth for their knowledge of the digital world. We empower anyone — from the curious individual to the enterprise business leader — to make smarter decisions by understanding why things happen across the digital ecosystem. Learn more at WWW.SIMILARWEB.COM.Show more Report"}, {"company": "Synopsys", "job": "Technical Solutions Sales Manager - Digital Implementation", "city": "Herzliya", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=114&ao=1136043&s=58&guid=00000186e63d721b9e7688837657d796&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_2cdb053f&cb=1678900144368&jobListingId=1008348136060&jrtk=3-1-1grj3ua4rkf1e801-1grj3qsjc28it000-efca2fb8de22e7aa-", "description": "42432BR\nISRAEL - Herzelia, ISRAEL-Haifa\nJob Description and Requirements\nOur Go To Market Group is all about delivering high-value solutions to our customers while driving growth. This is an exciting opportunity to be part of the technical sales team that supports the industry-leading solutions across the EDA software spectrum.\nThe primary focus of the Technical Solutions Sales Manager (TSSM) is to drive business growth for Synopsys EDA tool suite with a specific focus on the Digital Implementation Platform. As a SNPS TSSM you will be responsible to define and implement growth strategies in tight collaboration with Account Managers and with the support of field engineering. As a Digital Implementation TSSM, you will also collaborate with TSSM’s in the Verification and Custom Design and AMS domains to define a Synopsys centric solution to address the customer challenges.\nAs part of your daily job:\nYou’ll be creating and fostering relationships with key decision makers on the customer side and conducting qualification/discovery meetings with the goal of understanding how Synopsys Digital Implementation platform fits the customer needs.\nYou will collaborate with the field engineering to drive the technical campaigns for pointed solutions to the customers\nWith the help of field engineering, you will also be responsible to represent the needs of our customers to the Digital Implementation Technical Marketing team and to Product management.\nSynopsys Digital Implementation platform is anchored by industry leading Design Compiler, Fusion Compiler, RTL Architect, PrimeTime and PrimePower\n\nKey Qualifications:\nBS/MS EE, CS, CE or related discipline and 7+ years of experience.\nGood understanding of the Digital Implementation (RTL to GDSII) flows and methodologies.\nExcellent interpersonal, presentation and communication skills with a passion for driving business in a challenging and rewarding environment\nAbility to work in a fast-paced innovation rich environment\nPassion for business growth and for cross-functional collaborations\nPrevious experience in technical sales is a plus\nAt Synopsys, we’re at the heart of the innovations that change the way we work and play. Self-driving cars. Artificial Intelligence. The cloud. 5G. The Internet of Things. These breakthroughs are ushering in the Era of Smart Everything. And we’re powering it all with the world’s most advanced technologies for chip design and software security. If you share our passion for innovation, we want to meet you. Our Silicon Design & Verification business is all about building high-performance silicon chips—faster. We’re the world’s leading provider of solutions for designing and verifying advanced silicon chips. We enable our customers to optimize chips for power, cost, and performance—eliminating months off their project schedules\n\nSynopsys has adopted a COVID-19 vaccination policy to safeguard the health and well-being of our employees and visitors. As a condition of employment, all employees based in the U.S. are required to be fully vaccinated for COVID-19, unless a reasonable accommodation is approved or as otherwise required by law.\n\nInclusion and Diversity are important to us. Synopsys considers all applicants for employment without regard to race, color, religion, national origin, gender, sexual orientation, gender identity, age, military veteran status, or disability.\nJob Category\nSales\nCountry\nIsrael\nJob Subcategory\nProduct Solution\nHire Type\nEmployeeShow more Report"}, {"company": "Johnson Controls", "job": "Senior Digital Solutions Sales Leader", "city": "Tel Aviv-Yafo", "date": "16d", "rating": "3.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=115&ao=1136043&s=58&guid=00000186e63d721b9e7688837657d796&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a3b6bfec&cb=1678900145920&jobListingId=1008494785977&jrtk=3-1-1grj3ubljklum801-1grj3qsjc28it000-7c66f3670123b097-", "description": "Job Details\nWhat you will do\nSenior Digital Solutions Sales Leader position is part of our Building Technology & Solutions business with Johnson Controls.\nOur digital technology business is growing at a very fast pace. Our teams are outcome-based sellers developing our OpenBlue solutions that link building, Information Technology/Business Systems and Specialty systems into a single converged network to achieve our customers’ operating costs and improve the functionality of the building by providing an intelligent communications network to exchange data, automate actions and provide critical information required to optimize systems and people performance throughout the life cycle of the building.\nThe digital solutions team provides the missing “technology solution” piece and supports the local market’s channel efforts to identify, propose, sell and deliver new construction, prime retrofit and technology refresh scopes of work. We help sales deliver Internet of Things (IoT) outcomes through systems integration, design-assist, and converged technology solutions, producing smarter buildings.\nHow you will do it\nUnder general direction, you will conduct solution-based sales of advanced solutions, to strategic major accounts and lighthouse smart building projects. You will work with account managers and selling teams in key verticals to identify, qualify, and close opportunities. Skills required for the role include consultative selling at the executive level, differentiating offerings from competitors, and understanding complex sales processes.\nDirectly responsible for exceeding Digital Solutions sales targets on a monthly, quarterly, and yearly basis\nProvide business and technical expertise to qualify Digital Solution opportunities and maintain a consistent, high-quality pipeline with sufficient coverage and high forecast accuracy.\nKnow your customer pain points and target persona(s) and align high value impact scenarios. Effectively understand needs and influence multiple departments and levels within a customer’s organization.\nCollaborate with regional sales teams to identify and target high-potential opportunities to increase sales and total account wallet share in strategic accounts with Digital Solutions aligned to customer priorities. Develop and maintain Digital Solution strategy as part of strategic Account Plans that details priorities, personas, progress and blockers.\nDevelop and present monthly business insights into KPIs; share insights and trends on market conditions, customer adoption.\nMaintain working knowledge of industry and technology trends such as IoT, AI and Software as a Service business models, and sustainability.\nOptimal usage of salesforce CRM to ensure that you are able to effectively manage a sales pipeline with proper qualification and relationship mapping developing opportunities from demand creation to close of business.\nProvide customer signal and feedback to inform Digital Solution development and roadmap prioritization. Identify new solution for unmet customer needs by working with Ecosystem Team and partners to fulfill customer requirements when our Global Products team is not able to address defined needs.\nActively participate in industry professional groups and speaking engagements.\nWhat we look for\nRequired\nBachelor’s degree, Master’s preferred.\nEnterprise solution sales Prefer 10 years plus of demonstrated success in enterprise, value-based solution and software sales, meeting revenue targets.\nExperienced in Account Management including planning, opportunity qualification and creation, stakeholder communication, partner engagement and sales excellence practices including opportunity and pipeline management, and close planning.\nDemonstrated consultative, value-based solution selling skills and ability to connect innovative solutions to customer priorities. Experienced in building and maintaining Executive level (CXO) stakeholder relationships.\nCollaboration. Experienced in orchestrating and leading teams to develop and close sales opportunities through influence.\nTechnical Acumen understanding of Internet of Things architecture, edge and cloud technologies.\nStrong business acumen demonstrated, including business case development, strong rhetorical skills, natural teaming and collaboration skills, achievement oriented and highly savvy in technology and digital information.\nCandidate should be adaptive, agile and demonstrate curiosity and willingness to learn.\nExperience working in a large corporation, matrixed organization.\nWilling to travel as needed within the designated territory\n#LI-ED1Show more Report"}, {"company": "Similarweb", "job": "Account Manager, Agencies", "city": "Tel Aviv-Yafo", "date": "16d", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=1136043&s=58&guid=00000186e63d721b9e7688837657d796&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_bf749dc1&cb=1678900147069&jobListingId=1008493714992&jrtk=3-1-1grj3ucpimfrf801-1grj3qsjc28it000-03baeed2cb77cd93-", "description": "Similarweb is the leading digital intelligence platform used by over 3500 global customers. Our wide range of solutions power the digital strategies of companies like Google, eBay, and Adidas.\n\nWe help our customers succeed in today's digital world by giving them access to data-driven insights, competitive benchmarks, strategic analysis, and more.\n\nIn 2021, we went public on the New York Stock Exchange, and we haven't stopped growing since!\n\nWe're looking for an Agencies Account Manager to help us retain and expand our relationships with our existing Agency customers.\n\nThis role will report to the Team Manager of Independent Agency Account Management.\n\n\nWhy is this role so important at Similarweb?\n\nSimialrweb is used by thousands of companies, of every size and from every industry, to give them a competitive advantage in driving online traffic.\n\nAs an Account Manager, you will be responsible for developing, executing, and owning a long-term Account Strategy for customers. You will be responsible for retention and expansion of accounts. You will own the relationship with customers and key decision makers helping them with reaching business goals and KPI's.\n\nSo, what will you be doing all day?\n\nYour role as part of the Independent Agency team means your daily responsibilities may include:\n\nManage and grow long-term partnerships with Independent Agency clients\nUnderstand customers' business goals, and proactively support achieving those goals using Similarweb solutions\nLead the commercial relationship with the agency customer, including quarterly business reviews, contract renewal and expansion\nContinuously identify and lead upsell opportunities\nWork with Customer Success Analysts to maximize the engagement and product adoption of end-users\nInfluence future lifetime value and new business growth through customer advocacy and reference-ability\n\nThis is the perfect job for someone who:\n\n 3-5+ years of proven commercial experience as an Account Manager or Sales Manager for software or internet-based solutions\nStrong understanding of the agencies' digital marketing space\nExcellent communication and presentation skills\nAbility to influence, confidently handle objections, and resolve customer issues\nExperience in consultative sales processes in large, complex prospect organizations\nExperience in presenting to and interacting with senior management of prospect organizations\nTeam player, able to effectively interact with colleagues and business partners across the company\nExperience working in an Agency - advantage\nSpanish speaker is a plus\nWorking days - Mon-Fri\n\nAbout the team\n\nOur Agencies team gets to work with businesses in the EMEA region. You'll have the unique opportunity to become a trusted advisor to these agencies, and help them implement strategies that really drive success. As an individual contributor, you will be part of a collaborative, high-energy team of talented professionals.\n\nWhy you'll love being a Similarwebber:\n\nYou'll actually love the product you work with: Our customers aren't our only raving fans. When we asked our employees why they chose to come work at Similarweb, 99% of them said \"the product.\" Imagine how exciting your job is when you get to work with the most powerful digital intelligence platform in the world.\n\nYou'll find a home for your big ideas: We encourage an open dialogue and empower employees to bring their ideas to the table. You'll find the resources you need to take initiative and create meaningful change within the organization.\n\nWe offer competitive perks & benefits: We take your well-being seriously, and offer competitive compensation packages to all employees. We also put a strong emphasis on community, with regular team outings and happy hours.\n\nYou can grow your career in any direction you choose: Interested in becoming a VP or want to transition into a different department? Whether it's Career Week, personalized coaching, or our ongoing learning solutions, you'll find all the tools and opportunities you need to develop your career right here.\n\nDiversity isn't just a buzzword: People want to work in a place where they can be themselves. We strive to create a workplace that is reflective of the communities we serve, where everyone is empowered to bring their full, authentic selves to work. We are committed to inclusivity across race, gender, ethnicity, culture, sexual orientation, age, religion, spirituality, identity and experience. We believe our culture of equality and mutual respect also helps us better understand and serve our customers in a world that is becoming more global, more diverse, and more digital every day.Show more Report"}, {"company": "Outbrain", "job": "Business Development Manager - Italian Speaker", "city": "Netanya", "date": "30d+", "rating": "4.4", "link": "", "description": "We are Outbrain.\n\nWe're one of the world's largest content recommendation platforms, delighting audiences with engaging, personalized content recommendations while serving as the primary engagement partner and platform for the world's top digital media companies.\n\nOutbrain is seeking an energetic, customer- and data-obsessed Account Manager to support and contribute to our Global Growth Publishers unit. You will work closely with Business Development and Technical teams to support and engage the growing Outbrain community of Mid tail publishers.\n\nThe ideal candidate is a go-getter, client service focused, analytical, data driven, and problems-solver, who works well independently as well as part of a team. This individual should use his/her skills and creatively tailor the right solution for each client with the objective of accelerating and growing key accounts.\n\nYou can expect a great working environment with a committed, motivated, and energetic international team.\n\n\n**Please submit your CV in English.**\n\n\n A day in the life\n\nOutbrain is looking for a top-notch Business Development Manager who will help to grow and retain Outbrain's Mid tail-market publisher business. This individual will work with the business and account management team helping assess and convert inbound leads, looking for new publishers, assisting in team special projects and initiatives and market analysis. The BD will also take part in prospecting, negotiating and signing new deals.\n\nWe're looking for someone with entrepreneurial instincts, self-motivated who is also a team player that has prior experience in the Digital media/Ad-tech in sales positions working for global companies and specifically has prior experience with sales in EMEA markets.\n\n\nWhat you'll bring\n\n2-3 years of experience in digital marketing, technology, or sales roles dealing with EMEA clients.\nEnglish and Italian proficiency with excellent written and verbal communication skills - Must!\nExcellent selling, negotiation, and problem-solving skills.\nSelf-motivated and Goal-driven individual, an expert in time-management and organizational skills.\nExcellent analytical skills and a proven ability to monitor, identify and present performance metrics.\nCollaborative; a natural at working inside and across teams in a fast-growth, startup environment\nFamiliarity with web analytics tools\nPrior experience in working with 'Outreach' or equivalent Sales Engagement Platforms - Advantage\nPrior experience in working with SalesForce or equivalent\n\n\nMore than snacks!\n\nOffice and home hybrid working\nExpand your toolbox with our mentorship program and internal learning tools\nHappy hours\n…and of course a fully stocked kitchen!\n\n\nWe Recommend #LifeAtOutbrain\n\nOur company culture is welcoming, dynamic, diverse, global, and built on top performance.\n\nDid you know \"trust\" is one of our core values? We apply this value to our day-to-day by working collaboratively on a global scale. With managers and teammates often sitting in other countries and time zones, we value communication, patience, and open-mindedness to all cultural backgrounds. We encourage all ideas, and everyone gets a seat at the table!\n\nOur team is made up of individuals who are approachable, resourceful, passionate, and proactive. We foster a sense of belonging through our Employee Resource Groups –employee-led groups in which we debate topics and drive change. From OB Green (environmental), OB WE (women empowerment), OB Good (charitable initiatives) to OB4E (diversity, equity, and inclusion), you'll be able to share your passions with likeminded people.\n\nDive into the Outbrain experience via our Instagram account!Report"}, {"company": "VMware", "job": "Senior Success 360 (S360) Customer Success Manager - Opportunity for Working Remotely , Jerusalem", "city": "Jerusalem", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=118&ao=1136043&s=58&guid=00000186e63d721b9e7688837657d796&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a396bc17&cb=1678900149891&jobListingId=1008447390448&jrtk=3-1-1grj3ufcl36hs001-1grj3qsjc28it000-4d6cc3aee947b773-", "description": "Senior Success 360 Customer Success Manager\nWhy will you enjoy this new opportunity?\nDo you enjoy helping Global and Enterprise organizations achieve their business outcomes through their technology investments? If you do, we have the perfect job opportunity for you!\nAs a Success 360 Customer Success Manager, you will serve as a trusted advisor, driving a cross-functional, unified customer experience for our customers during their transformational journey with VMWare.\nUpon joining our Customer Success team, you will play a critical role in delivering the Success 360 offering for enterprise customers by enabling them to rapidly and successfully onboard, adopt and realize business value with harmonized digital and in-person engagements across the entire customer journey.\nIn the Customer Success Manager role, you will interact daily with your assigned customers, helping them to achieve onboarding and activation milestones in driving product consumption. You will also jointly develop Success Plans with each customer to align their technology objectives to business outcomes.\nAs a Customer Success Manager, you be able to create a long-term relationship with your assigned customers as you develop an understanding of the customer’s desired business outcomes, focusing on maximizing value realization across their VMware portfolio.\nSuccess in the Role: What are the performance outcomes over the first 6-12 months you will work toward completing?\nDuring the first year, you will onboard into the Customer Success role and work with your assigned customers.\nUpon joining the Customer Success 360 team, you will be guided through a well-organized four-week onboarding plan that will be prepared for you.\nAfter onboarding, you will be assigned your first S360 accounts and work to establish ongoing cadence for account meetings with the customer, the account team and internal resources to understand the customer’s current and planned VMware production adoption and use cases.\nOne month after engaging with your customers, you will be able to articulate customer key business objectives and desired outcomes and begin crafting a joint Success Plan with the customer.\nYou will establish ongoing cadence for account meetings with the customer, and orchestrate internal resources to progress toward achieving key milestones.\nYou will create your Success Plan in Gainsight and record all customer activity and milestones throughout the customer journey.\nWithin 3 months of your joining date, you will be able to present your achievements in a Quarterly Business Review using the internal tools and deliverables that we will provide to you.\nYou will collaborate with internal resources to understand customer use cases and identify opportunities for prescribing Adoption Guidance and Workshops to further adoption and consumption.\nYou will proactively monitor customer health, identify expansion opportunities and mitigate renewal risk.\nDuring months 6-12, you will continue to drive business priorities within your assigned accounts and contribute to improving the overall Success 360 practice.\nYou will develop best practices to identify and proactively solve potential process or executional challenges.\nYou will ensure best-in-class execution; Develop and implement changes in both the customer's and VMware's operations systems that directly add value.\nThe Work: What type of work will you be doing? What assignments, requirements, or skills will you be performing on a regular basis?\nAs part of the s360 Customer Manager team, you will be working throughout the S360 subscription period with several assigned and strategic customers. The activities you will perform are all aligned with the purpose of helping our customers achieve their desired business outcomes through VMware technology. You will orchestrate the adoption and consumption of the VMware technologies the customer has purchased.\nYou will also be collaborating with the broader VMware account team and specialists as you perform the following:\nYou will have a track record of experience in customer success, in an enterprise software or SaaS organization, with a proven track record of successfully managing complex customer relationship in technology.\nYou will develop excellent understanding of VMware and associated technologies.\nYou will keep track of business and technology trends seen in market and hold one or more industry certifications in areas of interest.\nYou will possess robust inter-personal skills and ability to build relationships with internal and client stakeholders (including business and up to C-suite).\nYou will have experience developing and driving business cases that outline value to customers.\nYou will develop best practices to identify and proactively solve potential process or executional challenges.\nYou will demonstrate ability to manage multiple customer accounts, projects and deadlines simultaneously.\nWhat is the leadership like for this role? What is the structure and culture of the team like?\nThe Global Success 360 team is focused on driving strategic customer outcomes, while enabling our customers to derive maximum value from their VMware solutions. We provide a unified governance model to ensure we are acting as One VMware on behalf of our customers.\nWe strive to have a diverse and unified team, one which is focused on our customers and their success while contributing to a positive team culture. We are an open team who share best practice and collaboration amongst our colleagues. We give back to each other and our communities and welcome innovation and creativity at all levels, to be a meaningful contributor in our countries and societies.\nWhere is this role located?\nFlexible: The role is considered remote (based in Germany) and working from your home office unless otherwise specified by your future manager. You may be required to travel to VMware planned events and to meet with your customers and account teams (up to 25%).\nWhat are the benefits and perks of working at VMware?\nYou will be supported with a competitive and comprehensive benefits package. Below are some highlights, or you can view the complete benefits package by visiting www.benefits.vmware.com.\nMedical Coverage, Retirement, and Parental Leave Plans for All Family Types\nGenerous Time Off Programs\n40 hours of paid time to volunteer in your community\nRethink's Neurodiversity program to support parents raising children with learning or behavior challenges, or developmental disabilities\nFinancial contributions to your ongoing development (conference participation, trainings, course work, etc.)\nWellness reimbursement and online fitness and wellbeing classes\nCategory : Services and Consulting\nSubcategory: Customer Success\nExperience: Manager and Professional\nFull Time/ Part Time: Full Time\nPosted Date: 2023-02-02\nVMware Company Overview: At VMware, we believe that software has the power to unlock new opportunities for people and our planet. We look beyond the barriers of compromise to engineer new ways to make technologies work together seamlessly. Our cloud, mobility, and security software form a flexible, consistent digital foundation for securely delivering the apps, services and experiences that are transforming business innovation around the globe. At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Shape what’s possible today at http://careers.vmware.com.\n\nEqual Employment Opportunity Statement: VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. Vmware will provide reasonable accommodation to employees who have protected disabilities consistent with local law.Show more Report"}, {"company": "Alphawave IP inc", "job": "ASIC Sales Director", "city": "Hod HaSharon", "date": "8d", "rating": "4.8", "link": "", "description": "Alphawave Semi enables tomorrow’s future by accelerating the critical data communication at the heart of our digital world – from seamless video streaming to AI to the metaverse and much more. Our technology powers product innovation in the most data demanding industries today including data centers, networking, storage, artificial intelligence, 5G wireless infrastructure, and autonomous vehicles. Customers partner with us for mission critical data communication, our innovative technologies, and proven track record. Together, we enable the next generation of digital technology.\nThe Opportunity\nWe’re looking for the Wavemakers of tomorrow.\nASIC Sales Director\nAlphawave SEMI is looking for a new European Regional Sales Director to join our exciting and dynamic team to prospect and build our sales funnel, close opportunities, and build long-lasting strategic relationships with new and existing ASIC customers for our ASIC business unit.\nWhat You Will Do\nDefining, building, and growing sales funnel in European region.\nQualifying customer opportunities from a technical and commercial perspective and prioritizing opportunities based on value to Alphawave’s short/long-term business interests.\nBuilding, nurturing, and maintaining long-lasting, strong relationships with customers while partnering with them to better understand their ASIC design requirements.\nDeveloping and executing account plans to achieve and exceed sales targets.\nCreating and communicating sales goals and seeking out new opportunities to achieve those goals; closing opportunities to meet or exceed objectives.\nEnsuring regular communication on the progress of sales opportunities and status of current customer engagements through the use of Alphawave’s CRM tool, emails, meetings and other forms of communications.\nEffectively communicating differentiation and value propositions through presentations and proposals\nWhat You Will Need\n10+ years of complex technical product sales to System and Chip companies.\n5 years of proven Custom Logic product or ASIC sales experience.\nStrong technical foundation and interpersonal skills to understand and promote technologies and custom SoC solutions for cutting edge process nodes.\nUnderstanding of industry-specific trends and key drivers for market/technical trends.\nFamiliarity with complex ASIC sales where value needs to be explained to the various stakeholders at the customer.\nAccustomed to working with ASIC engineering at customers and at Alphawave to define key customer requirements including performance, power and IP to develop an optimized proposal based on customer requirements.\nBackground in computer electrical engineering/computer science in a real nice to have.\nPrevious role as Design Engineer for a field application engineer in the semiconductor space is a nice to have.\nAbout You\nCustomer focused.\nExcellent communication skills\nAble to listen to and appreciate ideas and opinions that differ from yours\nExtremely detail oriented\nSuperb analytical and problem-solving skills\nDrives for consistency\nTakes personal pride in high standard of outputs\nSelf-motivated and self-managing\nDiversity & Inclusivity\nAlphawave SEMI is based out of one of the most diverse countries in the world. This includes differences related to race, ethnicity, national origin, gender, gender expression and presentation, sexual orientation, religion, age, ability and socioeconomic status. To us, diversity is one our strongest assets to our organization. We commit ourselves to promoting the recognition and appreciation of our diverse and rich culture. We believe that it is critical to our success to promote freedom of thought and opinion in a respectful environment. The decisions we make are rooted by respectfully considering each other’s thoughts and opinions and by working towards a greater common goal.\nAccommodation\nAlphawave SEMI is an equal opportunity employer and welcomes applications from all qualified individuals, including visible minorities, Indigenous People, and persons with disabilities. We welcome and encourage applications from people with disabilities. If as a qualified job applicant, you request accommodation, Alphawave Semi will consult with you to provide reasonable accommodations according to your specific needs. If you wish to make a request, you will be provided an opportunity if your application is selected to proceed in our hiring process.Show more Report"}, {"company": "VMware", "job": "Senior Solution Engineer Herzliya, Tel Aviv District", "city": "Herzliya", "date": "6d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=120&ao=1136043&s=58&guid=00000186e63d721b9e7688837657d796&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0234e28a&cb=1678900153191&jobListingId=1008517059340&jrtk=3-1-1grj3uiotnce2801-1grj3qsjc28it000-3e97fa6c80a219dd-", "description": "Do you want to help customers in their digital transformation journey?\nDo you want to help customers to adopt multi-cloud?\nWe are looking for a “Senior Solution Engineer” to join us.\nWhy is this opportunity extraordinary?\nHelping our customers lead in their Digital Transformation and taking them to the multi-cloud world is a fantastic opportunity. From the driver's seat as a visionary, trusted advisor in the Enterprise Defense space, you will have a great place with us if you consider this impressive. We are looking for a passionate new teammate to join our team in Israel. As the Senior Solution Engineer, this position is about driving our Enterprise customer’s strategies and aligning them with our VMware Portfolio. This role requires a high percentage of client-facing time and limited hands-on.\nThe Work: What type of work will you be doing? What assignments, requirements, or skills will you be performing regularly?\nYou will be the champion across the IT landscape sharing the story of how virtualization and cloud computing can help our enterprises achieve their goals. You will be experienced in engaging and creating relationships with Technology Leaders and senior IT decision-makers, including CIOs. You will demonstrate a deep understanding of what motivates senior leaders and a strategic approach to enterprise account IT pre-sales.\nYou will collaborate closely with your Accounts Executive’s sales team and orchestrate the specialist teams. The Lead Solution Engineer is a high-impact, visible role responsible for ensuring pervasive enterprise adoption of VMware software and solutions.\nSuccess in the Role: What performance outcomes will you work toward completing over the first 6-12 months?\nThe key to success will be:\nGaining knowledge of our products, solutions & their positioning\nUnderstanding overall VMware Vision and Strategy\nUnderstanding how we can help customers move into the multi-cloud world & the unique value they can get from our solutions & services.\nWorking with an experienced colleague to ease the onboarding process\nAfter that:\nUnderstanding and supporting customer's high-level business challenges\nMatching VMware solutions to customer's business and technical requirements\nIdentifying customer projects for VMware solutions\nBecoming a trusted advisor within the handled accounts\nDefining and implementing a go-to-market strategy for each account to ensure the proper adoption of VMware solutions\nEducating & keeping the customers updated on the VMware Value Proposition\nVisualizing the VMware vision, design, and product roadmaps to executives and technical management\nWhat is the leadership like for this role? What is the structure and culture of the team like?\nThe role reports to the VMware Solution Engineering Israel organization. As a long-term leader in VMware, they have extensive experience in Enterprise, Global, and Commercial customer areas. The team consists of Solution Engineers focusing on customers across various industries. The team’s vision is built upon having a clear idea of what we want to achieve in the industry and how we want to help our customers get there. Teamwork & helping the team be successful first is lived by everyone daily. The team strives to be the best and most knowledgeable in the industry across our solution portfolio. We like to have fun while working hard to develop ourselves and drive business growth.\nWhere is this role located?\nFlexible: The position is considered flexible and will be a mix of working from a local VMware office and remote, depending on your preferences and arrangements with your future manager. You will be expected to live within a reasonable non-daily commute of the office.\n\nWhat are the benefits and perks of working at VMware?\nYou and your loved ones will be supported with a competitive and comprehensive benefits package. Below are some highlights, or you can view the complete benefits package by visiting www.benefits.vmware.com.\nEmployee Stock Purchase Plan\nMedical Coverage, Retirement, and Parental Leave Plans for All Family Types\nGenerous Time Off Programs\n40 hours of paid time to volunteer in your community\nFinancial contributions to your ongoing development (conference participation, training, course work, etc.)\nWellness reimbursement and online fitness and wellbeing classes\nEqual Employment Opportunity Statement\nVMware is an Equal Opportunity Employer committed to providing employees with a work environment free of discrimination and harassment. All employment decisions are based on business needs, job requirements, and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, age, physical, mental or sensory disability, sexual orientation, gender identity, and expression, marital, civil union or domestic partnership status, past or present military service, HIV status, family medical history or genetic information, family or parental status including pregnancy, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics.\nCategory : Sales\nSubcategory: Systems Engineering\nExperience: Manager and Professional\nFull Time/ Part Time: Full Time\nPosted Date: 2023-03-09\nVMware Company Overview: At VMware, we believe that software has the power to unlock new opportunities for people and our planet. We look beyond the barriers of compromise to engineer new ways to make technologies work together seamlessly. Our cloud, mobility, and security software form a flexible, consistent digital foundation for securely delivering the apps, services and experiences that are transforming business innovation around the globe. At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Shape what’s possible today at http://careers.vmware.com.\n\nEqual Employment Opportunity Statement: VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. Vmware will provide reasonable accommodation to employees who have protected disabilities consistent with local law.Report"}, {"company": "Synopsys", "job": "Technical Solutions Sales Manager - Verification Platform", "city": "Herzliya", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=121&ao=1136043&s=58&guid=00000186e63d721b9e7688837657d796&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_233890a0&cb=1678900154315&jobListingId=1008348136122&jrtk=3-1-1grj3ujs4jm7h801-1grj3qsjc28it000-82f70b0463e69f8a-", "description": "42431BR\nISRAEL - Herzelia, ISRAEL - Israel, ISRAEL-Haifa\nJob Description and Requirements\nOur Go To Market Group is all about delivering high-value solutions to our customers while driving growth. This is an exciting opportunity to be part of the technical sales team that supports the industry-leading solutions across the EDA software spectrum.\nThe primary focus of the Technical Solutions Sales Manager (TSSM) is to drive business growth for Synopsys EDA tool suite with a specific focus on the Verification Platform. As a SNPS TSSM you will be responsible to define and implement growth strategies in tight collaboration with Account Managers and with the support of field engineering. As a Verification TSSM, you will also collaborate with TSSM’s in the Digital Implementation and Custom Design and AMS domains to define a Synopsys centric solution to address the customer challenges.\nAs part of your daily job:\nYou’ll be creating and fostering relationships with key decision makers on the customer side and conducting qualification/discovery meetings with the goal of understanding how Synopsys Verification platform fits the customer needs.\nYou will collaborate with the field engineering to drive the technical campaigns for pointed solutions to the customers\nWith the help of field engineering, you will also be responsible to represent the needs of our customers to the Verification Technical Marketing team and to Product management.\nSynopsys Verification platform is anchored by industry leading VCS Simulator, VC SpyGlass, VC Formal and Verdi.\n\nKey Qualifications:\nBS/MS EE, CS, CE or related discipline and 7+ years of experience.\nGood understanding of the Verification flows and methodologies.\nExcellent interpersonal, presentation and communication skills with a passion for driving business in a challenging and rewarding environment\nAbility to work in a fast-paced innovation rich environment\nPassion for business growth and for cross-functional collaborations\nPrevious experience in technical sales is a plus\nAt Synopsys, we’re at the heart of the innovations that change the way we work and play. Self-driving cars. Artificial Intelligence. The cloud. 5G. The Internet of Things. These breakthroughs are ushering in the Era of Smart Everything. And we’re powering it all with the world’s most advanced technologies for chip design and software security. If you share our passion for innovation, we want to meet you. Our Silicon Design & Verification business is all about building high-performance silicon chips—faster. We’re the world’s leading provider of solutions for designing and verifying advanced silicon chips. We enable our customers to optimize chips for power, cost, and performance—eliminating months off their project schedules\nSynopsys has adopted a COVID-19 vaccination policy to safeguard the health and well-being of our employees and visitors. As a condition of employment, all employees based in the U.S. are required to be fully vaccinated for COVID-19, unless a reasonable accommodation is approved or as otherwise required by law.\nInclusion and Diversity are important to us. Synopsys considers all applicants for employment without regard to race, color, religion, national origin, gender, sexual orientation, gender identity, age, military veteran status, or disability.\nJob Category\nSales\nCountry\nIsrael\nJob Subcategory\nProduct Solution\nHire Type\nEmployeeShow more Report"}, {"company": "HP", "job": "Partners Business Manager", "city": "Netanya", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=122&ao=1136043&s=58&guid=00000186e63d721b9e7688837657d796&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ed9ec1e1&cb=1678900155384&jobListingId=1008430375043&jrtk=3-1-1grj3ukt1haqc801-1grj3qsjc28it000-a82d3c6d718d61b9-", "description": "HP is a global leader in digital printing solutions, with a superior customer experience and cutting-edge technology.\nHP's products and services are helping to drive the Fourth Industrial Revolution. We're blurring the boundaries between physical and digital with highly automated technologies that require minimal manual input.\nWe are looking for a partner business manager for our Go To Market division. This person will be responsible for continuing the success of our daily business practices and managing the sales pipeline. You will also build and implement processes for increased productivity and growth.\nIf you are a motivated leader who thrives on creating a climate of inclusion, trust, and productivity, your place is with us!\nResponsibilities:\nActively prospect within accounts to discover or cultivate solutions sales opportunities within the area of technical specialty (in close cooperation with the account manager).\nDevelop and expand solutions that generate additional product attachments and upsell revenue.\nEstablish a professional, working, and consultative relationship with the client by developing a core understanding of the client's unique business needs within their industry.\nWork with the client up to IT management level.\nContribute to pipeline building by generating leads, referrals, and new customer opportunities within the specialty area.\nThe focus may be on growing renewal contracts for small-to-midsize accounts with limited complexity to higher-total contract value renewals.\nInterface with both internal and external/industry experts to anticipate customer needs and facilitate solution development.\nRequirements:\nTypically 5-7 years of experience in specialty sales- A must\nExperience in the IT industry - A must\nBachelor's degree\nDetailed knowledge of key customer types or customers for given products.\nKnowledge of products, services, and solutions, as well as the differences between own offerings and those of competitors.\nUse knowledge of the specialty, and consultative selling skills, to proactively help customers make IT business decisions.\nSolid communication and presentation skills in IT at the manager level.\nConceptualizes and articulates well-targeted solutions in the area of specialty - product, service, solution - from proposal to contract sign-off.\nDevelop profitable deals so that HP can expand it's business and revenue based on existing business.\nMaintain knowledge of industry trends, associated solutions, and critical partner/ISV solutions.\nUpdate deal profiles and forecasts regularly in Siebel.\nThank you for taking the time to review our job; if you think it matches your experience and interests, please apply today; we are eager to learn more about you!\nDo you want to know more about us? Then click here to get more insight into our «HP Way» :\nwww.facebook.com/hpcareers\nwww.instagram.com/hpcareers\nwww.twitter.com/hpcareers\nwww.hp.com\n#LI-POST\nAbout HP\n\n\nYou’re out to reimagine and reinvent what’s possible—in your career as well as the world around you.\n\nSo are we. We love taking on tough challenges, disrupting the status quo, and creating what’s next. We’re in search of talented people who are inspired by big challenges, driven to learn and grow, and dedicated to making a meaningful difference.\n\n\nHP is a technology company that operates in more than 170 countries around the world united in creating technology that makes life better for everyone, everywhere.\n\n\nOur history: HP’s commitment to diversity, equity and inclusion – it's just who we are.\n\nFrom the boardroom to factory floor, we create a culture where everyone is respected and where people can be themselves, while being a part of something bigger than themselves. We celebrate the notion that you can belong at HP and bring your authentic self to work each and every day. When you do that, you’re more innovative and that helps grow our bottom line. Come to HP and thrive!Show more Report"}, {"company": "InspHire", "job": "Ad Operations Manager", "city": "Herzliya", "date": "30d+", "rating": "5.0", "link": "", "description": "A digital publishing house that owns and operates a collection of highly successful websites is seeking an Ad Operations Manager to join the Revenue Operations team and to work closely with Engineering and Product groups. This position will help to maximize revenue opportunities and provide account management for the company's inventory across all its sites.\n\nThe ideal candidate will be responsible for daily revenue management and execution of AdOps tasks, as well as managing ongoing programmatic partnerships. The position consists of daily contact with demand partners, in parallel to managing the technical aspect of the ad serving and media optimization. The candidate is expected to continuously grow revenue based on the company's KPI’s and targets, and to provide monetization insights, real-time information and results to the company management team.\n\nDay-to-Day Responsibilities\nResponsible for ad stack optimization across all programmatic products - display, video and native - to hit the company’s quarterly aggressive revenue targets.\nCreate and update revenue dashboards focused on delivering actionable insights with clear and concise findings.\nMonitor and maintain ad quality across our portfolio of sites.\nMaintain Ads.txt files and additional compliance and transparency initiatives.\nWork closely with product and engineering on testing and implementing advertising products, as well as troubleshooting and QAing together with the demand partners.\nActively participate in vetting new programmatic business/partnership opportunities.\nServe as the point of contact for advertiser/demand relationships.\nAssist Sales team with research discovery and data pulls, used to strengthen company sales efforts.\nStay up to date on all industry news including updates to Prebid.org, regulatory updates (GDPR, CCPA..etc), Identity solutions, policy changes (ads and content) and key browser changes.\n\nQualifications\n1-2 years of experience in AdOps roles or similar (Data Analytics, Account Management, Programmatic Business Development).\nMandatory – English language proficiency at a very high level.\nMandatory – Advanced Excel knowledge (or BI tools) and Analytical skills.\nProfound service orientation, sales abilities and initiative.\nAbility to build strong relationships with business partners.\nExperience with Google Ad Manager (DFP) or other Ad Servers.\nUnderstanding of programmatic ecosystems and platforms such as Google, AppNexus, Rubicon, Index Exchange etc.\nStrong knowledge of web debugging with tools such as Charles and Chrome Developer Tools.\nAbility to address problems with a data-driven approach, resourcefulness and attention to details.\nA go-getter attitude with the ability to both work independently and collaborate as appropriate.\nAdvantage - Experience working with Product and Engineering teams. Advantage - Experience working with Sales teams.Show more Report"}, {"company": "AU10TIX", "job": "Sales Development Representative", "city": "Hod HaSharon", "date": "30d+", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=124&ao=1136043&s=58&guid=00000186e63d721b9e7688837657d796&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_77d9b04d&cb=1678900158333&jobListingId=1008302477687&jrtk=3-1-1grj3unpgkcn2801-1grj3qsjc28it000-11cff2a07a177e36-", "description": "Sales Development Representative\nReference # 1131\nLocation: Hod Hasharon\nType: Full Time\nJOB DESCRIPTION:\nAU10TIX, a global identity intelligence leader headquartered in Israel, is on a mission to obliterate fraud and further a more secure and inclusive world. The company provides critical, modular solutions to verify and link physical and digital identities so businesses and their customers can confidently connect. Over the past decade, AU10TIX has become the preferred partner of major global brands for customer onboarding and customer verification automation – and continues to work on the edge of what’s next for identity’s role in society. AU10TIX’s proprietary technology provides results in less than 8 seconds, enabling businesses to onboard customers faster while preventing fraud, meeting compliance mandates and, importantly, promoting trust and safety\n\nWe are looking for a hungry and energetic Sales Development Representative (SDR) to provide sales development support for our growing sales teams in the U.S., EMEA and APAC. This role will be responsible for generating new leads via cold calling, email, LinkedIn and more. Additionally, the SDR will be tasked with servicing inbound leads and related inquiries with a focus on engaging and preliminarily qualifying all prospective customers.\nRESPONSIBILITIES:\nGenerate warm leads for Au10tix sales managers via cold calling, email and other channels.\nRespond, engage and qualify inbound leads and inquiries.\nSchedule demos and meetings for sales managers.\nWork closely with Sales and Marketing to develop account intelligence, use-case opportunities and more.\nBe able to conduct intelligent and engaging conversations over the phone and via email.\nAct as a subject matter expert on Au10tix’s product offerings\nREQUIREMENTS:\nPrevious experience as a Sales Development Representative from\nDemonstrated ability to collaborate with a distributed sales team.\nCapability of understanding customer pain-points and requirements.\nStrong communication skills – written, verbal and presentation.\nAbility to manage numerous requests and time demands concurrently.\nPromotes a strong sense of urgency for reaching goals and key deliverables.\nTeam player than can quickly understand the team’s dynamic.\nA desire to “win” both individually and as a team.\nBA/BS degree in business, marketing or another relevant field.\nFOR THIS JOB, SEND CV TO:\nAU10TIXHRG@AU10TIX.COMShow more Report"}, {"company": "TransPerfect", "job": "Graduate Business Developer / Account Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=125&ao=1136043&s=58&guid=00000186e63d721b9e7688837657d796&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_2be0e88c&cb=1678900159484&jobListingId=1006819603575&jrtk=3-1-1grj3uotnjijg801-1grj3qsjc28it000-2c6f31f12813e191-", "description": "TransPerfect Is More Than Just a Job…\nOur greatest asset is our people, and nothing is more important to us than ensuring that everyone knows that. Each of our 90+ offices has its own individual identity, and each also has its own unique rewards.\nDo you want to work for the global leader in the language services and technology industry? Are you interested in helping international brands/organizations find and implement solutions that allow them to communicate, operate and sell their products and services efficiently and effectively? And are you the type of person who enjoys working in an innovative and vibrant workplace? Then TransPerfect is for you!\nSo you like what you hear but haven’t worked in ‘language’ before? That is not a problem, TransPerfect is far from “just a translation agency”. Our services portfolio covers everything from business support services such as interpretation, multicultural and digital marketing, SEO and website globalization to multimedia work, video, e-learning and training, and legal support services. All services and client partnerships are aided by best-in-breed software platforms, specialized in optimizing business processes.\nThat’s enough about us – what about you?\nWe look for and appreciate anyone who is willing to roll up their sleeves and get stuck in! We offer a fast growth path and provide full training around our services, technology solutions and workflows. Therefore the key skills we are looking for are solid communication and relationship building abilities, keeping a cool head if situations get a bit stressful and really owning your role, taking responsibility for your clients and their business success.\nIf this sounds like you, we would love to hear from you! We have 90 offices worldwide but this particular opportunity is based in our Tel Aviv office.\nThe Account Manager / Business Developer position is responsible for developing new business relationships and serving as the first level of support to existing clients.\n\nPosition Responsibilities:\nDevelop an effective understanding of the capability, benefits and competitive advantages of TransPerfect’s services\nIdentify prospective customers and individual organizations to focus on sales activities\nDevelop new client relationships via cold calling, the Internet, and trade shows\nIn coordination with Sales Management, identify, qualify, develop and close sales opportunities\nPromote and educate clients regarding TransPerfect’s services\nProvide customer support and manage client expectations in liaison with the Production Management Team\nManage and control pricing and contractual issues by developing a thorough understanding of company procedures\nTake an active role in learning about each client’s industry, business needs and company culture to identify new business opportunities and provide a high level of service\nPerform other special projects or duties when required\nQualifications, Skills and Experience:\nProven sales track record or a strong desire to work in Sales\nMinimum Bachelor’s Degree or its equivalent\nSuperior written and spoken communication skills in English and Hebrew\nGood analytical skills needed to project revenues, monitor budgets and other necessary calculations\nProficiency in Microsoft Office (Word, Excel, Outlook)\nMost importantly, the ideal candidate must demonstrate ability to: multitask in a fast-paced environment, work well with people from a variety of different backgrounds and cultures, build relationships with clients and co-workers, work as part of a team, take active measures to solve problems and commit to a high level of serviceShow more Report"}, {"company": "TikTok", "job": "Client Solutions Manager - Gaming Key Accounts, Israel", "city": "Tel Aviv-Yafo", "date": "22d", "rating": "3.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=126&ao=1136043&s=58&guid=00000186e63d721b9e7688837657d796&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_64193bde&cb=1678900160910&jobListingId=1008484955768&jrtk=3-1-1grj3uq7k34at001-1grj3qsjc28it000-d7dc8f96a905aad0-", "description": "Responsibilities\nTikTok is the leading destination for short-form mobile video. Our mission is to inspire creativity and bring joy. TikTok has global offices including Los Angeles, New York, London, Paris, Berlin, Dubai, Singapore, Jakarta, Seoul and Tokyo.\n\nWhy Join Us\nAt TikTok, our people are humble, intelligent, compassionate and creative. We create to inspire - for you, for us, and for more than 1 billion users on our platform. We lead with curiosity and aim for the highest, never shying away from taking calculated risks and embracing ambiguity as it comes. Here, the opportunities are limitless for those who dare to pursue bold ideas that exist just beyond the boundary of possibility. Join us and make impact happen with a career at TikTok.\n\nAbout the team\nClient Solutions are the trusted advocates connecting key stakeholders, providing inspiration and insights, driving collaboration that translate into long term client partnerships and growth! We are responsible for the day to day relationship and for ensuring success of advertiser investment. As trusted partners, we proactively advise our clients of opportunity and solutions to exceed their expectations, securing future investment.\n\nThe Client Solutions Manager - Gaming is an expert in TikTok's performance & branding auction advertisement products for key clients in the gaming industry. You will work with key clients, sales teams, product and third-party stakeholders to ensure that campaigns are performing and producing the desired results. Success in this position requires a great focus on client service, highly skilled in the ability to plan and execute successful performance marketing campaigns for advertisers, and deep understanding of digital media advertisement ecosystem.\n\nResponsibilities\n\nManage and grow post-sale client relationships of auction ads offerings by monitoring and analyzing ad campaigns, and proactively take initiative to improve results;\nProficient in campaign management, setting up and optimization. Analyze campaign performance data to offer clients data-driven business insights and at the same time, use those insights to improve our advertising offerings\nEstablish long-term relationships with key clients and make sure their business needs are taken good care of by cross-functional team\nInvestigate and work directly with product & engineering teams to help them troubleshoot client issues during a campaign.\nDrive education on product, company updates and share company best practices as relevant to clients or agencies' business\nShare marketplace feedback and guide our advertising strategy;\nConduct regular business reviews and take a consultative, long-term approach to build productive relationships with clients, in collaboration with the sales team;\nResponsible for improvement of product feature adoption and consistently drive the product improvement from market feedback\nYou will also work with the creative strategy team to support the planning/ implementation of campaigns to deliver against Client goals.\nAssist with asset & data collection for various business needs such as Business Cases, Case Studies and QBRs\n\nQualifications\n\nExperience in account management/client service roles in digital marketing;\nExperience in media buying / user acquisition positions focused on performance marketing.\nDeep understanding & experience of the Gaming ecosystem\nExperience in optimization, tracking, attribution, measurement and using major tools like GA, Appsflyer, Adjust, etc\nAbility to analyze data and identify insights to assess campaign performance;\nProactive attitude with excellent data analytical skills in excel, SQL is a plus;\nDetail oriented, with exceptional organisational skills\nProficient in English and Hebrew\nSelf-starter, fast learner with a start-up spirit.\n\nTikTok is committed to creating an inclusive space where employees are valued for their skills, experiences, and unique perspectives. Our platform connects people from across the globe and so does our workplace. At TikTok, our mission is to inspire creativity and bring joy. To achieve that goal, we are committed to celebrating our diverse voices and to creating an environment that reflects the many communities we reach. We are passionate about this and hope you are too.Show more Report"}, {"company": "Rimini Street, Inc.", "job": "Sr Client Success Manager, Israel", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=127&ao=1136043&s=58&guid=00000186e63d721b9e7688837657d796&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_8b16c333&cb=1678900162605&jobListingId=1008431765967&jrtk=3-1-1grj3uruv2pe8001-1grj3qsjc28it000-f2fbf06098d51b86-", "description": "Job Description:\n\nRimini Street, Inc. (Nasdaq: RMNI) is a global provider of enterprise software products and services, the leading third-party support provider for Oracle and SAP software products and a Salesforce partner. The Company offers premium, ultra-responsive and integrated application management and support services that enable enterprise software licensees to save significant costs, free up resources for innovation and achieve better business outcomes. To date, more than 4,000 Fortune 500, Fortune Global 100, midmarket, public sector and other organizations from a broad range of industries have relied on Rimini Street as their trusted application enterprise software products and services provider.\nThe company is widely recognized by clients, leading industry analysts (including Gartner, Forrester, Constellation Research and Nucleus), and financial analysts as the leader in a large, fast growing market with tremendous upside and an extremely strong value proposition that resonates with CIOs and CFOs.\nWe have an exciting opportunity available right now to join us as a Sr Client Success Manager, responsible for a subset of clients within the EMEA region, based in Israel.\nPosition Summary\nWe are seeking an experienced Sr Client Success Manager who will be responsible for managing and expanding the partnership with our clients. The right candidate will have an entrepreneurial spirit, a proven track record of Client Management or Business Development & Executive Relationships excellence with the ability to provide solutions and guidance to meet business objectives and taking business to the next level. You must have a passion for clients. We need someone that can be very hands-on, do whatever it takes to deliver value, develop relationships, and be a strategic thinker with the ability to create long-term relationships with our clients\nAs a Sr Client Success Manager with Rimini Street, Inc., you’ll be managing a portfolio of named clients – driving client lifecycle – leading to adoption, cross-sell, advocacy and client satisfaction across your portfolio.\nEssential Duties and Responsibilities:\nDeliver and communicate ROI throughout the client lifecycle\nBuild C-level and executive relationships, establishing trusted advisor status\nDrive growth, value, retention and partnerships for our important clients to ensure active engagement and full recognition of ROI\nDevelop key account plans including; retention strategies, cross-sell opportunities, powermaps, client advocacy\nMeet/Exceed quarterly quota targets (renewals/cross-sell/advocacy)\nCreate awareness and demand for Rimini Street products and services\nIdentify, cultivate and engage on cross-sell opportunities within your portfolio for services and/or strategic solutions\nEnsure client retention through actively driving retention strategy, retention content including ROI models and proposals, and assisting with retention sales execution\nProvide ongoing proactive client management through executive business reviews, client onsite visits, executive relationships and overall client communications\nBuild and foster our Client Champion Community. Secure client sales and marketing advocates, ensuring client referenceability and driving client participation in select client marketing programs, events, interviews, etc.\nImplement and utilize current Social and Digital selling strategies to maximize opportunities via Social Networking platforms\nQuarterback the team and coordinate across executive leadership, sales, service delivery, marketing, etc.\nAdditional Duties & Responsibilities\nMonitor client consumption of Rimini Street services with the support of standard dashboards\nMaintain up-to-date client information in Salesforce.com and other systems\nProvide detailed and timely status reporting to all management as requested\nAssure client communications and escalations are performed on time, sufficiently and accurately\nOther job-related duties and responsibilities may be assigned from time-to-time\nQualifications/Skills/Experience:\n\nEducation\nBA/BS (MBA/Master preferred)\nLocation\nIsrael\nEssential Language Skills: English and Hebrew\nExperience\nGood knowledge of the enterprise software industry\nSpecific experience with Oracle and/or SAP preferable\nExperience dealing with CXO’s\nSignificant experience in Consultative Sales, Account Management, or Business Development\nExperience in managing a portfolio of clients in different industries\nExperience in cross-selling – identifying opportunities through trusted advisor partnership with clients and ability to coordinate and lead cross-functional team to drive better results for cross-sell and retention, etc.\nExperience in renewing and/or negotiating client support contracts\nExperience in working with complex, multi-divisional, multi-geographical customers\nExperience working with cross-functional teams (e.g. Sales, Renewals, Marketing, Services, etc.)\nSkills\nImpressive executive presence and communication abilities\nDemonstrated ability to provide proactive account management to a large portfolio of clients\nExceptional leadership, time management, facilitation, and organizational skills\nBias for action\nPassion for technology and for being a part of a fast-growing technology company\nProven analytical and problem-solving abilities\nProven experience with Social and Digital selling techniques\nAbility to create structure and prioritize tasks to best manage different situations\nStrong documentation skills MS Office Suite (Word, Visio, Excel, and PowerPoint); Salesforce CRM, Smartsheet, etc.\nRimini Street views all employees as partners, and is committed to providing an exciting, participatory and team-oriented work environment. In addition to our very competitive compensation packages, be prepared for challenging professional growth and fun along the way in our work-hard, play-hard corporate environment.\n#LI-DNI\nCompany Description:\n\nRimini Street, Inc. (Nasdaq: RMNI) is a global provider of enterprise software products and services, the leading third-party support provider for Oracle and SAP software products and a Salesforce partner. The Company offers premium, ultra-responsive and integrated application management and support services that enable enterprise software licensees to save significant costs, free up resources for innovation and achieve better business outcomes. To date, more than 4,000 Fortune 500, Fortune Global 100, midmarket, public sector and other organizations from a broad range of industries have relied on Rimini Street as their trusted application enterprise software products and services provider.\nRimini Street is widely recognized by clients, leading industry analysts (including Gartner, Forrester, Constellation Research and Nucleus), and financial analysts as the leader in a large, fast growing market with tremendous upside and an extremely strong value proposition that resonates with CIOs and CFOs. According to Gartner, the third-party support market will grow to $1.05 billion by 2023, a 200% increase. With tight IT budgets and flat global economic growth, IT and procurement professionals are actively looking for proven methods to cut costs while improving service. Rimini Street enables organizations to free up budget for strategic business initiatives by delivering savings of up to 90 percent on total maintenance and support costs, and to date, the company has saved organizations over $5 billion in total maintenance costs since its inception.\nWe’re building something special at Rimini Street. A company where people care about each other and trust each other to do the right thing. A company where highly intelligent and talented people come together to do challenging and meaningful work that makes a real difference to our clients, ending each day with a sense of achievement and balance in their lives.\nBe Treated Like the Best\nRimini Street hires only the best – and provides the compensation, bonus and benefit programs appropriate for proven top-performing professionals. We want our employees to have an opportunity to share in the financial success that results from our dedication to service excellence, high-quality deliverables and an unparalleled client experience\nNo bureaucracy, thousand-page rule books or politics — just everyone working together to build a great company through service excellence and client success\nWork hard, play hard environment – Rimini Street is a group of hard-working professionals who are passionate about achieving success, but we also enjoy opportunities to meet up at fun company events\nWe are also passionate about giving back to our communities around the world, with plenty of opportunities for volunteering and charity through the Rimini Street Foundation\nAll Rimini Street professionals are encouraged to grow and learn new skills\nAccelerating Company Growth\nTrading on Nasdaq under ticker symbol RMNI since October 2017\nAdded to the US Russell 2000® Index in 2018\nOver 4,000 clients, to date including 100 of the Fortune 500 and Global 100\nAnnual 2021 financial results of $326.8 million, up 16.3% year over year\nFiscal year operating cash flow of $42.1 million, up 107% year over year\nAnnounced the new patent pending Rimini Street Artificial Intelligence Support Applications, a result of the Company’s continued investment in optimizing support processes and ensuring global service delivery outcomes at scale. Using the AI Applications, Rimini Street has been able to deliver a better client experience and reduce software issue resolution times by 23%.\nCelebrated the 15th anniversary of the Company’s founding in 2005 to redefine the enterprise software support market and bring choice and value to software licensees around the world.\nRecent Industry Recognition\nReceived 33 awards in 2020, including 15 awards for excellence in customer service from awards companies such as the International Stevie Awards, the American Stevie Awards, and the Stevie Awards for Sales & Customer Service\nHonored with four Gold awards for Company of the Year in 2020.\nThe Rimini Street Foundation recognized with two awards in 2020 for Corporate Social Responsibility Program of the Year\nIn addition, in 2020 the Company supported more than 120 charities around the world through the Rimini Street Foundation, providing financial contributions, volunteer hours and in-kind donations including personal protective equipment to healthcare workers, senior centers, food banks and youth organizations globally. The Foundation also extended its charitable work in 2020 to Hong Kong, Malaysia, Mozambique, Sweden and the UAE.\nTo learn more about how Rimini Street is redefining the enterprise software support industry, visit http://www.riministreet.com\nRimini Street is committed to creating a diverse and inclusive environment and is proud to be an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to age, race, color, religion, national origin, sexual orientation, gender or gender identity, disability and protected veterans status or any other characteristic protected by law.\nPlease Note: Rimini Street does not accept resumes submitted by recruiting/staffing firms unless specifically requested by Human Resources. Unsolicited resumes will be ineligible for referral fees.Show more Report"}, {"company": "RYB Technologies", "job": "Manager of Digital & Product Marketing 724346", "city": "Israel", "date": "30d+", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=128&ao=1136043&s=58&guid=00000186e63d721b9e7688837657d796&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1f13143c&cb=1678900166258&jobListingId=1007565521712&jrtk=3-1-1grj3uvfok254801-1grj3qsjc28it000-0fbd84c8bf7a811b-", "description": "The world has changed. Remote work is here to stay & grow. Businesses are increasingly open to hiring talent anywhere they can find it and afford it. Region-based wage disparity is dropping and barriers to hiring like: countries, borders, and distance are melting away.\n\nOur vision is a World of Hiring at Your Fingertips, where one day every business will hire the best knowledge workers from the most diverse locations around the globe. Whether it's a seed-stage startup or a Fortune 500: to make their international hiring & payroll so easy that nothing is required except a bank account and the ability to click through our SaaS application or develop against our API.\n\nThe role entails:\nPartnering with other members of the executive team to evolve the product\nDeveloping and executing on the GTM strategy\nBuilding, managing and coaching a high-performing marketing team\nDirecting and supporting market research collection, analysis, and interpretation of market data for short- and long-term market forecasts and reports\nWorking closely with the sales department to align sales and marketing strategies\nManaging the marketing budget and expenditures\nMaintaining brand standards and ensuring compliance across all marketing and communications channels\nIdentifying competitors and evaluating their strategies and positioning and devising counter-strategies\n\nIdeally you have:\nPrevious experience in digital marketing, SEO, brand, social, content development, public relations, and UX design\nExperience in Marketing, ad-tech, mar-tech, email marketing\nExperience in SMB markets including selling to buyers in retail, hospitality & restaurant, financial services, real estate, marketing & advertising and other key segments.\nHands-on experience across a range of marketing technologies including email, marketing automation, analytics, text message, etc.\nStrong analytics capabilities and the ability to optimize systems using data\nOutstanding communication, presentation and leadership skills\nIn-depth knowledge of market research\nSense of ownership and pride in your performance and its impact on the company’s success\nA track record of strategic marketing leadership success at a B2C tech company or startup in the SaaS space.\n\nSend cv to jobs@rybtech.comShow more Report"}, {"company": "Carrot Pharma Recruitment", "job": "Vice President, Team Lead – Global Leader in Healthcare Digital Solutions", "city": "Israel", "date": "30d+", "rating": "4.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=129&ao=1136043&s=58&guid=00000186e63d721b9e7688837657d796&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4eacc0fd&cb=1678900167289&jobListingId=1008245531185&jrtk=3-1-1grj3v0h2p6ep801-1grj3qsjc28it000-4151baa807f852e7-", "description": "Vice President, Team Lead – Global Leader in Healthcare Digital Solutions – London - £80,000 to £100,000 + bonus\nThe Company\n\nOur client works in a range of sectors including healthcare, pharmaceuticals, life sciences, biotechnology and charities; providing services ranging from market research, medical education programs, promotional programs, clinical development, job recruitment and clinic appointment services.\n\nThey are named in Fortune’s 2020 ‘Future 50’ list – ahead of Facebook & Amazon!\nTheir mission is to make use of the internet to increase (as much as possible) the number of people who can live longer and healthier\nThe chance to manage global projects, working with healthcare professionals covering more than 130 therapy areas\nA truly collaborative culture that fosters constant growth and development\nCompetitive salary and benefits package\nThe Sales Department has a small agency feel and a top-of-the-market commission scheme\nThe Role\n\nThis is a brand-new role in the team and our client is keen on bringing someone on board who can hit the ground running! The Vice President, Team Lead’s role centres around managing the Account Managers, Associate Vice Presidents, and Vice Presidents of the sales team. You would be responsible for ensuring that all members of the UK sales team, including direct reports, are hitting their goals.\n\nYou have the chance to coach and mentor your direct reports\nContribute ideas and strategies for success with the Global Sales Leadership team\nCreate a vibrant, competitive, and supportive business development culture within the team where all team members focus on account growth and prospecting\nBe visible and active with all key accounts within the Sales team, building strong relationships with main contacts\nContinuously develop new business and maintain current business\nYou\n\nTo be successful in being their next Vice President, Team Lead, you will need to bring:\n\nA Bachelor’s degree (Masters is a plus! MBA is preferred)\nProven track record in securing new business\nProven ability to mentor and improve salespeople\nAble to effectively communicate with management, clients, and internal departments\nStrong record of target achievement\nAbility to champion internal accounts\nCollaborative & supportive with colleagues, while being a positive influence on colleagues and other departments\nPresentable, and polished, with excellent presentation skills\nDemonstrated experience in resolving issues, brainstorming, and problem-solving\nWhat should you do next?\n\nThis Vice President Team Lead role is one not to be missed; it encompasses the opportunity to work with some incredible people in the industry while furthering your career in a company that is at the forefront of its industry. To discuss this Vice President Team Lead role further or to find out about other operational roles in the market research industry that I’m currently working on, please get in touch or hit apply to submit your current CV.\n\nUnless otherwise stated, if applying for a job within the UK or European Union, you must ensure that you are already authorised to work there.\nCarrot Recruitment Ltd acts as an Employment Business and an Employment Agency on behalf of our client in recruitment for this role.Show more Report"}, {"company": "Analog Devices", "job": "Staff Engineer, Field Applications", "city": "Raanana", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=130&ao=1136043&s=58&guid=00000186e63d721b9e7688837657d796&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f33e8523&cb=1678900168433&jobListingId=1008377232479&jrtk=3-1-1grj3v1jl2i76001-1grj3qsjc28it000-089b856340ff0d2e-", "description": "Analog Devices (NASDAQ: ADI) designs and manufactures semiconductor products and solutions. We enable our customers to interpret the world around us by intelligently bridging the physical and digital worlds with unmatched technologies that sense, measure and connect.\nCandidate will provide field applications support, pre-sales and post-sales technical support to Strategic and Key customers for Analog Devices products used in industrial Automation and Healthcare. The Candidate also will support the Broadmarket. These parts range from Amplifiers, Data Converters, Power Supplies to industrial Communications. This involves working with customers, sales teams and products lines to identify key opportunities and position the best solutions tailored to customer needs to grow Analog Devices market share\nActivities include, but are not limited to:\nUnderstanding customers' system and proposing solutions using as many ADI components as possible.\nDeveloping and maintaining strong relationships with the customer and ensuring fast responses.\nTraining customers on Analog Devices' solutions and products and presenting at seminars.\nTraining Product Lines, Sales, and Applications on customer’s system requirements.\nRun evaluation systems/boards, being able to provide on-site customer lab support.\nWorking together and coordinating activities with the Account Managers, driving customer’s technical support activities and coordinating actions with Marketing and Product Lines.\nDeveloping and maintaining good relationships with Product Lines, Marketing and Application teams. Providing regular inputs and updates to help the definition of new products.\nProviding regular inputs on opportunities/designs wins and losses.\nQualifications\nGraduate/Postgraduate degree in electronics engineering, preferably MSEE or PhD\n3-5 years of analog experience at board/system level or previous experience as Field Application Engineer or similar role will be an advantage.\nMixed signal circuit applications/design at the board/system level. Experience in Networks (Hard- and Software) is a plus\nGood organizational skills and the ability to multi-task many projects and set priorities. Able to organize activities in an independent way.\nTeam player, outgoing personality with a ‘can-do’ attitude. Capability to present to and work with all levels of Management, Sales, and Engineering\nFlexibility and proactive attitude are a must.\nGood lab measurement and debug skills.\nGood verbal, written communication and interpersonal skills. Fluent English and local language.\nAbility to deliver convincing presentations\nRegional Travel (within territory) 35-50%\nFor positions requiring access to technical data, Analog Devices, Inc. may have to obtain export licensing approval from the U.S. Department of Commerce - Bureau of Industry and Security and/or the U.S. Department of State - Directorate of Defense Trade Controls. As such, applicants for this position – except US Citizens, US Permanent Residents, and protected individuals as defined by 8 U.S.C. 1324b(a)(3) – may have to go through an export licensing review process.\nAnalog Devices is an equal opportunity employer. We foster a culture where everyone has an opportunity to succeed regardless of their race, color, religion, age, ancestry, national origin, social or ethnic origin, sex, sexual orientation, gender, gender identity, gender expression, marital status, pregnancy, parental status, disability, medical condition, genetic information, military or veteran status, union membership, and political affiliation, or any other legally protected group.\nJob Req Type: Experienced\n\nRequired Travel: Yes, 50% of the time\n\nShift Type: 1st Shift/DaysShow more Report"}]