[{"company": "Schindler - Your Finance Team", "job": "חשב לחברת סטארט אפ", "city": "Raanana", "date": "21d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=101&ao=1110586&s=58&guid=00000186e63fbe76bce51d8ef930ef5c&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e688d014&cb=1678900398693&jobListingId=1008485478879&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj462hbkbkq801-1grj3vfmdi38u800-2a3ae69670fd383c--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNAO5_ZsnqAeIoCS8tMz_N53vSD3wHFKl87WAIkEpPx8qtFAyfxLY-xBCq04w8RgTAiihbzbI2E-XnXLnqhnvNzbScqUoPpoJ8JdXP-BBpXJJInEy4Cv6Aw0UMcOnHkm_dm-0XJ28aqN_M6cReAypnlJXfWVcKKPSz3p4oJJwaleW193GS0GwBNEz5s6q33B4aJLq9-7IaRaFQKhavJrw_G91vNWLcfTFAic7ibKZbN8GtIDnRvcepr22teTuDsVcINivAXaseZtZFjM-kJrmJJB0QHUjlFbesPVBV_3ior1zazLD9m5l22SO0L_sv7vnShKFpT2OvmFtoyoqlKJSFy33dA6Emg8zdhgMzvkivZuAFFGe0XhPoj-tsMJ7pib5pAWufnh-f6T8gJJMOLlG1Yfrar75Pg5s9qnOO_gtFo_6KjuBpczyiWOfTGleZYF9m8mtrN6hqC2UtqFxR8-mX176_OizFHZcSLCCvoeQNeJodoeOkF_eLga6No5FTpKi1FYK-VVg3Mnr2IpvOS7JYrMQw9ynjput2eBaAeBR00rKcZsmuvsw0xi3ZjUkvHJKZ5zvatzQlcO0mUs6PT3XJl7kw97u4UwYpvAvZbxxPtqL4MuwTycbGMOazGeRDb6fAHmN-OLu39Y6gwGGTbtrql1CDL_4ItiBgU%3D", "description": "\"Schindler-Your Finance Team\" is a leading financial services firm that manages the financial operations of startups, multinational companies, and research and development centers. We are looking for a highly motivated, independent controller to be a part of our dynamic team. Location – Petach Tikva Responsibilities: · Managing the day- to -day finance operations · Responsible for monthly, quarterly and annually financial closing process · Prepare financial reporting packages in accordance with US GAAP · Assist in cash flow management (payments and collections) · Support the work of bookkeeping department to ensure accuracy of financial records · Liaise with the banks, government agencies and offices as necessary Requirements: · Bachelor's degree in accounting or finance - required · 3+ years of experience in the tech, finance or fintech industry · Experience with US GAAP and multi-national company experience · High level English and Hebrew · Familiarity with ERP system – Priority · Strong attention to detail, the ability to multitask and a high level of accountability · Willingness to learn and go beyond defined job scopeShow more Report"}, {"company": "365scores", "job": "Controller", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "", "description": "365Scores is a global sports technology hub providing real-time results, in-depth stats, original content, customized news feeds, and more. Our mission statement is to make fans' experience better, more accurate, and more fun. We are located in Tel-Aviv with offices in Hong Kong, London and São Paulo, almost 100 employees world wide and growing.\nWe are looking for a finance controller to join us. Ideally right after a full intership at one of the BiG 5 firms .\nYou’ll enjoy a friendly, innovative, and creative atmosphere in a fast-growing and dynamic startup company.\nAs a Controller you will oversee a company's financial records, manage the day to day operational activity, work with bookkeeping teams, optimizing financial processes and controls, support statutory audit for several entities and other ad hoc projects required in the finance team.\nThe position is located in Tel-Aviv\nRequirements:\n\nBachelor’s degree in Accounting from a university or a leading college - a must\nLicensed CPA - a must\n2 years experience from one of the BiG 5 firms\nExcellent Excel skills\nDetail-oriented with superior analytical and problem-solving skills\nStartup mentality, roll up your sleeves attitude\nSelf-motivated and proactive\nStrong communication skills and service orientation\nA team player with good interpersonal relations\nWork level proficiency in English and Hebrew (both verbal and written)\n\nResponsibilities:\n\nSupport many aspects of accounting management (review of journal entries, invoices, payments, monthly closure, billing, etc.).\nOversee the daily financial operations of the company\npreparations of consolidated financial statements\nOngoing financial planning and management of the company’s budgeting processes\nEnsure the timely and accurate preparation and filing of the company’s financial reports\nWork closely with outside bookkeepers (Israeli and foreign) and payroll controllers on day-to-day financial operations, including payroll, AP, and AR processes.\nProvide comprehensive financial updates to management by evaluating, analyzing, and raising flags as needed.\nWork with the company's external auditors on quarterly reviews/ annual audits\nsupport Ad-hoc financial projectsReport"}, {"company": "bluewhite", "job": "Controller", "city": "Tel Aviv-Yafo", "date": "2d", "rating": "", "link": "", "description": "Imagine there was a platform that allows operating multiple autonomous vehicles, in the air and on the ground, across the globe, from a single location. How awesome would that be?! What if you were the one to help build it from scratch?\nBased in TLV (Sarona), Blue White Robotics is a world leader in autonomous technologies and unmanned systems.\nWe are seeking a sharp Controller to join our ranks! In this position you will report to the VP of Finance. This position will require hands-on approach. Candidates must be able to manage multiple responsibilities while managing outsourced functions to successfully and timely process all necessary accounting functions.\nThe major responsibilities of this position include, but are not limited to: Monthly financial close, production of periodic financial reports, maintenance of an adequate system of accounting records, and a comprehensive set of controls and budgets designed to mitigate risk, all to enhance the accuracy of the company’s reported financial results.\nResponsibilitiesPerform monthly and yearly closing and preparation of financial statements.Process journal entries and maintaining a General Ledger (including maintain COA).Prepare and file multiple jurisdiction tax returns.Support cash flow by preparing monthly budget reports.Oversee AR /AP and Payroll activities.Handle annual business operations renewals such as industry-related corporate, state, and\nlocal authorities licensing, General Liability and Workers Compensation.\nRequirements:\nBachelor’s degree in Accounting / Economy, or closely related field, from an accredited college.2+ years of relevant accounting experience.Strong analytical and problem-solving abilities - Must.Ability to prioritize, while monitoring timelines to achieve completion of objectives.Attention to details with an appreciation of the “big picture”.Ability to work independently and well under pressure.Excellent English, both oral and writing skills.Excellent organizational skills.Audit firm experience – Advantage.CPA – Advantage.Working Conditions: Primarily in an office environment and periodic weekend or evening work is expected.Show more Report"}, {"company": "AppsFlyer", "job": "Financial Information Systems Analyst - Maternity leave replacement", "city": "Herzliya", "date": "8d", "rating": "4.5", "link": "", "description": "Our Business Applications department is looking for a Financial Information Systems Analyst to help upscale Appsflyer's Financial applications landscape.\n\nAs a part of the Business Applications team, you will work closely with the Finance and IS units to map the business processes, gather requirements, design, implement, support and maintain the Netsuite ERP and other related Finance applications and integrations to ensure the delivery of innovative, high-quality solutions that meet the business needs.\n\nWhat you'll do\n\nProvide day to day support to internal clients - Especially supporting the Netsuite Cloud ERP, in addition to procurement and travel systems\nGather and document customer business requirements\nBecome a true business partner to the relevant stakeholders and support their vision & mission\nProvide creative technical solutions to complex business challenges - act as a strategic problem solver\nDefine detailed functional requirements for automations and integrations to NetSuite\nWork with the finance team and address requests on a daily basis\n\nWhat you have\n\nMaternity leave replacement for 6-7 months\n2 years of experience as an accountant/controller in a similar company/ a Finance person who would like to be transitioned to IS/ Last year student in Industrial engineering or Information system/ Information system analyst with 1-2 years experience working with ERP's (preferably NetSuite)\nWide understanding of financial business processes and tools (Billing, expenses, ERP, budget planning, etc.).\nExperience with defining requirements for complex customizations and integrations.\nExpert ability to translate business requirements to technical design, alongside good analytical skills\nAbility to communicate technical information to a non-technical audience.\nBachelor degree in Industrial Engineering / Information systems / Accounting - an advantage\nExcellent English - written and verbal\nBonus Points\nFamiliar with the NetSuite cloud ERP\nIntroduced by an AppsFlyer employee\nExperience with system Integration methods\nFamiliar with the Agile work methodologies - an advantage\nDegree in Accounting, Finance, Economic, Industrial Engineering, or related field - an advantage\n\n\nAs a global company operating in 16 countries across 5 continents, we reflect the human mosaic of the diverse and multicultural world in which we live. We ensure equal opportunities for all of our employees and promote the recruitment of diverse talents to our global teams without consideration of race, gender, culture, or sexual orientation. We value and encourage curiosity, diversity, and innovation from all our employees, customers, and partners.\n\n\"As a Customer Obsessed company, we must first be Employee Obsessed. We need to make sure that we provide the team with the tools and resources they need to go All-In.\" Oren Kaniel, CEOShow more Report"}, {"company": "IRP Systems", "job": "Finance controller", "city": "Ness Ziona", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=1136043&s=58&guid=00000186e63fbe76bce51d8ef930ef5c&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_21f59ffc&cb=1678900407780&jobListingId=1008431108531&jrtk=3-1-1grj46bc8klvj801-1grj3vfmdi38u800-98b233b6b4cd61b0-", "description": "DESCRIPTION\nIRP systems is developing the next generation of high-performance e-powertrain systems that will change the electric vehicles market and we are seeking an experienced finance controller to join the ride.\nREQUIREMENTS\nBachelor's degree in Accounting and a CPA – Mandatory2-3 years of audit experience from an accounting firm (big 4) – MandatoryAt least 3 years of experience as controller – MandatoryProficient in ExcelExcellent English - fluent ( Verbal and written).High-tech company experienceNetSuite knowledge- advantageAttention to detail, resourceful, independent, and strong interpersonal skillsQuick learner, organized, responsible, and personally dedicated to accomplishing objectives\nSKILLS AND QUALIFICATIONS:\nLead the monthly closing processesAssist with budget and forecast processesPerform periodical analytical analysis to explain variations and identify trendsWork and coordinate with the Company’s external auditors during interim and annual auditsOngoing communication and collaboration with finance teams abroadLead projects and ad-hoc financial tasks and processesPrepare tax returns and other reports to the Company’s authoritiesShow more Report"}, {"company": "Accenture", "job": "Business & Integ Arch Specialist", "city": "Herzliya", "date": "24h", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=106&ao=1136043&s=58&guid=00000186e63fbe76bce51d8ef930ef5c&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_30199f55&cb=1678900409337&jobListingId=1008529143918&jrtk=3-1-1grj46csmgfqf801-1grj3vfmdi38u800-ee094e79dbb38f41-", "description": "Accenture is a global consulting company with over 730,000 employees world-wide. Our portfolio of business includes Accenture Strategy, Accenture Consulting, Accenture Digital, Accenture Technology and Accenture Operations. At Accenture, you can launch yourself into your next journey-a dynamic career with a global consulting organization at the forefront of business, technology, and innovation.\nAs a Consulting Analyst who lives and breath technology, you will explore your professional passions and develop market leading skills that will enable you to thrive no matter what your future career path holds. Accenture consultants combine technology, digital and business expertise to design and deliver end-to-end solutions that our clients need to become high-performance businesses and governments.\nNell’Armonia part of Accenture is a consulting firm specialized in the field of information systems for business analytics and management of the company performance.\nYou will be working on the deployment of financial reporting and consolidation projects for customers who are among the most prestigious international groups headquartered in Israel. You will accompany them in the design and implementation of their management tools, the change management, and the business consulting inherent in these tools.\nProfessional requirements:B.A. in Economics / Economics & Management / Accounting (advantage).Professional experience of at least 1-3 years in a Finance reporting / Controller departments / Accounting firm.Good understanding and knowledge in consolidation Financial Reporting Standards (IFRS and USGAAP).Advantage: hands-on experience in using \\ implementing of Performance management tools: Oracle EPM / HFM (Hyperion financial management), CCH Tagetik etc.A good understanding of business processes and management reporting, statutory reporting, group consolidation and their impact on corporate information systems.\n\nAccenture is a global consulting company with over 730,000 employees world-wide. Our portfolio of business includes Accenture Strategy, Accenture Consulting, Accenture Digital, Accenture Technology and Accenture Operations. At Accenture, you can launch yourself into your next journey-a dynamic career with a global consulting organization at the forefront of business, technology, and innovation.\nAs a Consulting Analyst who lives and breath technology, you will explore your professional passions and develop market leading skills that will enable you to thrive no matter what your future career path holds. Accenture consultants combine technology, digital and business expertise to design and deliver end-to-end solutions that our clients need to become high-performance businesses and governments.\nNell’Armonia part of Accenture is a consulting firm specialized in the field of information systems for business analytics and management of the company performance.\nYou will be working on the deployment of financial reporting and consolidation projects for customers who are among the most prestigious international groups headquartered in Israel. You will accompany them in the design and implementation of their management tools, the change management, and the business consulting inherent in these tools.\nProfessional requirements:B.A. in Economics / Economics & Management / Accounting (advantage).Professional experience of at least 1-3 years in a Finance reporting / Controller departments / Accounting firm.Good understanding and knowledge in consolidation Financial Reporting Standards (IFRS and USGAAP).Advantage: hands-on experience in using \\ implementing of Performance management tools: Oracle EPM / HFM (Hyperion financial management), CCH Tagetik etc.A good understanding of business processes and management reporting, statutory reporting, group consolidation and their impact on corporate information systems.Report"}, {"company": "Klips", "job": "Group Controller", "city": "Ramat Gan", "date": "13d", "rating": "2.0", "link": "", "description": "Klips is a fast-growing innovative Fintech company, creator of next-generation Financial Hub including Crypto trading, CFD trading, Digital Banking facilities, Shares dealing, Payments, and CRM, using cutting-edge technologies to bring a new era in financial freedom terms.\nWe solve real day-to-day problems by unifying financial services and making them accessible while reducing the friction caused by using multiple service providers. We are now recruiting the Klips core team! This is your opportunity to take part in changing the financial world.\nKlips is a global company with offices in Israel, Cyprus, Romania, and South Africa.\nWorking in Klips means enjoying the flexibility, personal growth, and professional development.\nJOIN US!\nWe are looking for an experienced Group Controller for our global SaaS company.\nRequirements:\n\nBachelor's Degree in Accounting - A Must.\nin-depth knowledge of accounting is required: journal entries, bank adjustments, reports to the authorities.\n2+ years of overall combined accounting and finance experience in Tech./ Product companies-A Must.\nExperience in Crypto/ Currencies industry - an advantage.\nManagement experience .\nFamiliarity with IFRS and Israeli standards.\nEnglish - high proficiency.\nExperience with NetSuite ERP – Advantage.\nStrong analytical, problem-solving, and decision-making skills.\nA hands-on and proactive approach to problem-solving.\nOrganized, excellent multi-tasker, and great time management skills.\nExperience with NetSuite – An Advantage.\nTeamwork capabilities.\nResponsibilities:\n\nMonitoring of the monthly financial statement closing process and consolidation of subsidiaries.\nPreparation the financial reporting package, management reports with analytical analysis and actual vs budget.\nMonitor the compliance with local statutory reporting requirements, tax filings and capital requirements.\nPrepare and analyze financial data and internal reports; monitor progress and changes, provide valuable insights.\nWorking and providing support to all departments of the group on financial issues.\nWorking with external accountants.\nHQ ad hoc tasks on deep accounting, taxes, and projects.\nManaging and monitoring Cash flow planning and execution.Show more Report"}, {"company": "Kramer", "job": "Subsidiaries Controller", "city": "Central", "date": "30d+", "rating": "5.0", "link": "", "description": "Subsidiaries Controller\nWho are we?\nKramer is a leading player and pioneer in the Pro AV industry. Kramer our audio-visual experiences power creativity, collaboration, and engagement.\nAt Kramer, we make award-winning, innovative, and reliable Pro AV hardware, software, and cloud-based solutions. Enterprise companies, schools, universities, governments, and military end-users trust and rely upon Kramer technologies in more than 100 countries across six continents worldwide.\nFrom AVSM to advanced cloud-based communication, collaboration and control solutions, Kramer creates audio visual experiences that are more engaging, more inclusive and more connected than ever before.\nAbout the role\nWe're looking for a Subsidiaries Controller to join our finance team.\nReporting directly to the DOF.\nThis role includes responsibility over all aspects of the financial and tax reporting as well as interactions with Kramer Audio Visual finance teams around the world.\nWhat will your job look like?\nCoordinates and analyzes financial plans and forecasts and works independently to provide information to management.\nAnalyzes and interprets actual performance to plan, explains key variances, and makes recommendations for corrective actions.\nAssists with monthly and quarterly-end closing, year- end audits, ad-hoc requests, and other corporate financial mandatory requirements.\nResponsible for monitoring and meeting regulatory compliance requirements, through training process owners providing assistance with documentation, performing reviews, and completing testing as necessary. Able to critically analyze processes and controls, identify deficiencies, and assist with remediation efforts.\n Lead and assist in special ERP projects as necessary.\nResponsible for managing operational data and ensuring data integrity and accuracy\nDevelops system controls to ensure data integrity.Assists the reporting team manager in producing accurate and timely financial statements and regulatory reports.\nRequirements:\nBachelor’s degree in accounting from a university or a leading college – Must\nCPA with at least 2-4 years’ worth of experience as CPA.\nBig 4 background – Must\nExcellent English both writing and verbal – Must\nExperience in a global, multi-currency company.\nExperience with IFRS - An advantage.\nProficiency with Priority – An advantage.\nStrong Excel skills, including proficiency in developing financial models and graphs.\nStrong communication and interpersonal skills\nStructured, systematic, and able to manage many activities at the same time in a matrix structured organization.\nFull-time scope - overtime as needed\nRF87LAa7xeShow more Report"}, {"company": "Vision Systems", "job": "Controller", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=109&ao=1136043&s=58&guid=00000186e63fbe76bce51d8ef930ef5c&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_505e7d81&cb=1678900413382&jobListingId=1008363696089&jrtk=3-1-1grj46grnkltk801-1grj3vfmdi38u800-3bd21f5e9794fa83-", "description": "About The Position\nGauzy Ltd. is looking for a Controller to join our Finance department.\nThe main goal is to take a leading role in the preparation of consolidated financial statements in compliance with US-GAAP and SEC rules and to contribute in maintaining the accounting and financial processes of the company up to standard to ensure accurate financial reporting.\nResponsibilities\nFinancial Reporting and Accounting:\nPreparation of consolidated financial statements in compliance with US-GAAP, well documented working papers and other reports at demand.\nManage the monthly and quarterly period end closure including assets and liabilities update to period end and P&L - such as cash and cash equivalents, inventories, fixed assets, AR/AP balances, accrued expenses, revenues reconciliation, bonus accruals, payroll accruals etc.\nTake a substantial role in communication with external auditor and advisors.\nSupport many aspects of accounting and bookkeeping management (review of journal entries, invoices, payments, monthly and quarterly closure, billing, tax return, financial reporting etc.).\nTake part in the implementation and documentation of internal controls, new processes and policies in compliance with SOX regulations and company policies.\nRequirements\n3 years of experience in corporate finance departments as Controller or other similar position\nB.A. in Accounting\nCPA license\nKnowledge of accounting practices and financial processes (financial closure, reporting etc.)\nSolid knowledge of US-GAAP - advantage\nExperience with public Company filing - advantage\nLanguage: Fluent in English & Hebrew both written and spoken\nWorking knowledge of MS Office (mainly excel) and SAP software (advantage)\nAvailability to work long hours if required\nWell-organized with a great eye for details, ability to prioritize\nVery good communication and interpersonal skills\nReliable and able to carry out tasks autonomously and collaboratively, problem-solving abilityShow more Report"}, {"company": "Tailor Brands", "job": "Financial Controller", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.4", "link": "", "description": "With over 30 Million users on our platform, we’re here to change the future of business. Our all-in-one platform makes starting a business affordable and accessible to everyone - we welcome more than 800k new business owners every month. From our products to our careers, there are endless opportunities for growth.\nOur team | Our core | Our dream fulfillers\nWhen we started Tailor Brands, we wanted to help people to accelerate their growth and fulfill their dreams. This also defines us internally; we put our focus on maximizing individual impact and creating an environment of absolute transparency.\nAbout the role\nJoin our Finance department to oversee all financial aspects of the company, including general accounting, month close, business support, tax returns, audits, operations, cash management, payroll and much more\nAnalyze financial results (monthly, quarterly, and annual reports) with respect to cash burn, trends, costs, and compliance with budgets\nPrepare investors and management periodical packs\nCash management and cash projections\nEquity related matters, including managing the cap table, option plans etc.\nInteract with other departments to provide consultative support for planning initiatives through financial analysis, reports, and recommendations\nWork with the Company’s external auditors and ensure the timely and accurate filing of the Company’s financial reports\nPrepare tax returns and other statutory reports, including tax planning\nEnhance and implement financial and accounting system processes, tools, and controls\nRequirements:\n\nProfessional certification (CPA)\nInternship from one of the Big 4 firms\nAt least 2 years of experience as an assistant controller/controller in a global high-tech company - Startup is a big advantage\nGreat communication skills and ability to collaborate with other departments and external 3rd parties\nExperience in preparing financial statements according to US GAAP\nAbility to prioritize tasks, meet deadlines, well organized and function as a team member to accomplish job roles\nGreat attention to details and problem-solving skills\nSuperb written and verbal communication skills both in English and Hebrew\nWorking knowledge of MS Office (especially Excel) and Priority accounting software - Advantage\nFamiliarity with SaaS metrics (especially in B2C) - an advantageShow more Report"}, {"company": "FERRERO", "job": "Controller", "city": "Holon", "date": "30d+", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=111&ao=1136043&s=58&guid=00000186e63fbe76bce51d8ef930ef5c&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_fb93830d&cb=1678900415797&jobListingId=1008444696264&jrtk=3-1-1grj46j6mk6dv801-1grj3vfmdi38u800-068def62c111df25-", "description": "Job Location: Holon\nCompany description\n\nFerrero is a family-owned company with a truly progressive and global outlook and iconic brands such as Nutella®, Tic Tac®, Ferrero Rocher®, Raffaello®, Kinder Bueno® and Kinder Surprise®. As the love for our brands continues to grow, so too does our global reach. Represented in 55 countries, with products sold in more than 170, the Ferrero Group is loved by generations around the world. The secret to our global success? Nearly 35,000 dedicated employees who celebrate care and quality to craft a business, careers and brands we are proud of. Join us, and you could be one of them.\n\nDiversity Statement\n\nFerrero is committed to building a diverse and inclusive culture in which all employees feel welcomed and appreciated and have the same opportunities. We believe all of our people are equally talented in their own way. In nurturing the curiosity and natural abilities of our employees, we provide them, generation after generation, the means to succeed personally and professionally, enabling them to craft their journey at Ferrero. The diversity of our talents is what makes our work environment multicultural, innovative and highly rewarding.\n\nAbout the Role:\n\nResponsible for ensuring the proper planning process (Strategic Planning, Budget, Forecast).\nEnsures the reliability of Market data management.\nInteracts with all the local departments and the Central Reporting and controllers of central functions to explain deviations and budgetary assumptions.\n\nWho we are looking for:\n\n3-5 years of experience as Finance Business Analyst\nAdvanced Excel - Must (VBA is a plus)\nFluent in Hebrew and English\nKnowledge SAP R3 and Hyperion (Essbase is a plus)\nPrecision and commitment\nAbility to work effectively in multitasking and project mode, as well as under pressure and time constraints\nExperience in confectionary or FMCG is a plus\n\nRequisition ID\n58195\nJob function\nFinance, Administration & Control\nCountry\nIsrael\nCity\nHolon\nApply Now\nShare\nthis jobShow more Report"}, {"company": "Munters", "job": "Assistant Controller", "city": "Petah Tikva", "date": "7d", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=112&ao=1136043&s=58&guid=00000186e63fbe76bce51d8ef930ef5c&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7a649874&cb=1678900416923&jobListingId=1008514612635&jrtk=3-1-1grj46kafgfqf801-1grj3vfmdi38u800-c917b094190aabb2-", "description": "Did you know that we facilitate over half of the world’s lithium battery production? And that 1 out of 7 meals worldwide have been produced in facilities equipped with our climate control? Munters has been a pioneer of sustainable air treatment solutions since 1955. Today our technology is more relevant than ever and is mission-critical for the production of medicine to the running of data centers. Together we work to support our customers in creating a healthier planet. Come work for us and be a part of this exciting journey.\nMonters Israel is looking for a talented assistant controller to join our finance team. As such, you will be responsible for supporting our Finance Manager in the accounting and financial reporting functions of the organization. This includes assisting with the preparation of financial statements, budgeting and forecasting, internal controls, accounting operations and other projects.\nMunters is a global leader in energy efficient air treatment and climate solutions. Using innovative technologies, Munters creates the perfect climate for customers in a wide range of industries. Munters has been defining the future of air treatment since 1955. Today, around 3,300 employees carry out manufacturing and sales in more than 30 countries. Munters Group AB reports annual net sales of more than SEK 7 billion and is listed on Nasdaq Stockholm.\nHow is it working at Munters? Meet your future colleagues.Show more Report"}, {"company": "Haleon", "job": "Israel Finance Controller (maternity cover)", "city": "Israel", "date": "13d", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=1136043&s=58&guid=00000186e63fbe76bce51d8ef930ef5c&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b7a83fcf&cb=1678900418771&jobListingId=1008504741916&jrtk=3-1-1grj46m3b2i7f001-1grj3vfmdi38u800-d5c413ce1359dd3d-", "description": "Job Description\nSite Name: Petach Tikvah\nPosted Date: Mar 2 2023\nHello. We’re Haleon. A new world-leading consumer health company. Shaped by all who join us. Together, we’re improving everyday health for billions of people. By growing and innovating our global portfolio of category-leading brands – including Sensodyne, Advil, Voltaren, Otrivin, and Centrum – through a unique combination of deep human understanding and trusted science. What’s more, we’re achieving it in a company that we’re in control of. In an environment that we’re co-creating. And a culture that’s uniquely ours. Care to join us. It isn’t a question.\nJob Title\nFinance Controller (Maternity Cover)\nRight now, we’re in start-up mode. Giving those who join us the amazing opportunity to shape our company and the working experience we are building.\nWe are now looking for a great talent to join our Finance department in Israel, Petach Tikvah.\n You will be a part of a team of 4 individuals, reporting directly to Greece & Israel Finance Manager. This is a temporary role to cover for a maternity leave.\nIn this role you will act a sole controller in the department, being responsible for entire financial aspects, including reporting cycle- full management (budget and actuals), accounting team management( 2 persons), local distributors reconciliations, pricelists, global financial activities.\nYour Role Will Include…\nMonthly reporting cycle such as:\n Monthly reporting pack: accruals preparation, classification review, consolidation of results, analytics (vs. PY and budget)\nReporting all P&L\\BS components into Bison system\nWorking capital monthly review and control vs Budget\nAccounting team\\processes management\nTax: annual tax report, monthly tax submissions control\nAnnual financial report preparation with external auditors\nControl framework: monthly testing, ensure full compliance with the company internal controls\nPrice lists control and ongoing management\nDistributors and trade: distributors reconciliations and trade spend control\nProviding financial analysis and profitability scenarios to different models\\promotions upon request\nInteractions with external stakeholders such as distributors and Audit/tax consultants, as well as internal with Local function and Global tax\\finance\nWhy You?\nQualifications & Skills:\nEducation: CPA qualified, 2nd degree will be an advantage\nLanguage: Hebrew and English (fluent)\nComputer skills: Excel at a high level, SAP will be an advantage\nAt least 3 years' experience as a controller or in a similar role\nFinance competencies: local\\global accounting principles\nAnalytics skills\nExperience in a multinational company will be a plus\nStrong communicating skills\nPro-active attitude\nAble to manage processes also complex ones in a full life cycle\n\"Problem solver\" mindset\n#Li-Hybrid\nWhy Join Us?\nThe future of everyday health is changing. And we’re the people changing it. In front of us is an incredible opportunity to go beyond what any of us have done before. And make everyday health more achievable, more inclusive and more sustainable. For more and more people. So join us, as we build one of the world’s leading consumer healthcare companies. Join us to innovate our category-leading brands. To better understand people’s everyday health needs. To tackle the biggest barriers that stand in their way. To change individual and societal behavior. Join us to work with colleagues who share your restless energy. To explore your interests. To stretch yourself to do the best work of your career. And join us, as together we build a working experience that encourages us all to lead happier, healthier, more productive lives. The way we see it, every day is an opportunity for better. And we’re going all in to realize it.\nCare to join us. Find out what life at Haleon is really like www.haleon.com/careers/\n\nAt Haleon we embrace our diverse workforce by creating an inclusive environment that celebrates our unique perspectives, generates curiosity to create unmatched understanding of each other, and promotes fair and equitable outcomes for everyone. We're striving to create a climate where we celebrate our diversity in all forms by treating each other with respect, listening to different viewpoints, supporting our communities, and creating a workplace where your authentic self belongs and thrives. We believe in an agile working culture for all our roles. If flexibility is important to you, we encourage you to explore with our hiring team what the opportunities are.\n\nAs you apply, we will ask you to share some personal information, which is entirely voluntary. We want to have an opportunity to consider a diverse pool of qualified candidates and this information will assist us in meeting that objective and in understanding how well we are doing against our inclusion and diversity ambitions. We would really appreciate it if you could take a few moments to complete it. Rest assured, Hiring Managers do not have access to this information and we will treat your information confidentially.\n\nHaleon is an Equal Opportunity Employer. All qualified applicants will receive equal consideration for employment without regard to race, color, national origin, religion, sex, pregnancy, marital status, sexual orientation, gender identity/expression, age, disability, genetic information, military service, covered/protected veteran status or any other federal, state or local protected class.\n\nPlease note that if you are a US Licensed Healthcare Professional or Healthcare Professional as defined by the laws of the state issuing your license, Haleon may be required to capture and report expenses Haleon incurs, on your behalf, in the event you are afforded an interview for employment. This capture of applicable transfers of value is necessary to ensure Haleon’s compliance to all federal and state US Transparency requirements.Show more Report"}, {"company": "EX.CO", "job": "Controller", "city": "Tel Aviv-Yafo", "date": "8d", "rating": "4.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=114&ao=1136043&s=58&guid=00000186e63fbe76bce51d8ef930ef5c&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f144efba&cb=1678900419992&jobListingId=1008512167178&jrtk=3-1-1grj46natklu1801-1grj3vfmdi38u800-36f9c7e6682d201e-", "description": "Our Story:\nWe’re EX.CO, the world’s leading self-serve video technology platform. We empower publishers to own their video strategy for maximum yield by providing easy-to-use, AI-based solutions for ad serving, monetization, content automation, interactive experiences, and contextual targeting.\n Our one-stop-shop platform is trusted by some of the largest publishers globally including CBSi, Hearst, MLB, Nasdaq, Refinery29, Sky News, Time, ViacomCBS, VICE, and Ziff Davis.\n Founded in 2012 with employees located around the world, EX.CO is backed by The Walt Disney Company, Saban Ventures, Viola Group, 83North, and Firstime Ventures. For more information, visit EX.CO.\nYour Story:\nManage all financial aspects of the company including financial audits US GAAP, internal financial reports, tax reports, commercial agreements, billing, collection, payments etc.\nOngoing budget control and working closely with senior management and FP&A.\nEnsure that the regulatory requirements of all statutory entities are met regarding all the company’s financial affairs.\nAdministration of other finance-related matters (insurance, partners and third-party requests, application forms, etc.) including monitoring procedures.\nParticipate in fundraising rounds, M&A processes from DD to full execution, Developing KPIs.\nWork closely with the Director of Finance on ad-hock matters, ongoing, preparing analysis and presentations etc.\nRequirements:\nCPA degree in accounting, big-4 accounting firm experience.\n3+ years experience in a finance position in a global high-tech company.\nEnglish and Hebrew- fluent written and spoken. Good communication and presentation skills.\nExperience in the online industry – Advantage.\nExperience managing finance and tax aspects for US and UK subsidiaries.\nHighest standards of accuracy and precision; highly organized and detail-oriented.\nStrong analytical capabilities and business understanding, superior Excel skills.\nExperience with Priority- Advantage.Show more Report"}, {"company": "Trullion", "job": "Corporate Controller", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "", "description": "Accounting is the language of the business world, and all companies rely on accurate financial data to communicate with stakeholders. The $400 billion per year financial reporting industry is ready for new technology to take standards to the next level.\nAnd that's where Trullion comes in. Our AI-powered platform automates critical accounting workflows, provides real-time reports and insights and promotes new levels of collaboration for financial leaders.\nWe are a rapidly growing start-up with clients that include global multinational brands and leading audit firms. Our investors include Aleph, Third Point, Greycroft, leading CFOs, and CAOs from around the world.\nThis is the perfect time for you to join us as we expand our current offerings and launch new products. We are looking for an experienced Corporate Controller who wants to join our core team and help us build the single source of truth for the financial world.\nRequirements:\n\nCertified Public Accountant (CPA)\nGraduate of one of the “Big 4” accounting firms\n4+ years experience working as a controller of a startup company (experience with SaaS is preferred )\nExperience in US GAAP\nStrong Microsoft Excel skills\nExcellent oral and written communication in both English and Hebrew\nHighest standards of accuracy; highly organized, detail-oriented, and mindful of deadlines\nAbility to work both independently and collaboratively.\nProactive, fast learner, and self-motivated\nCulture warrior\nResponsibilities:\n\nOversee all accounting, payroll, and tax.\nLead monthly, quarterly, and annual close processes, including preparing all required financial statements, tax filings, statutory reporting requirements, and ongoing interaction with external accountants under US GAAP.\nHelp manage the company's cash flow.\nManage and support day-to-day Finance Operations activities, including accounts payable, accounts receivable, cash flow and banking transactions, salaries, and management of internal and external bookkeepers.\nIdentify opportunities to improve financial and operational systems and cost-effectiveness.\nManage audit processes and work closely with external auditors during the interim and annual audit\nProvide periodical management reporting packages (including AR/AP aging, unaudited financials, budget vs. actuals analysis, etc.), Ad-Hoc reporting, and analysis as needed both internally and externally for management, investors, auditors, etc.\nResponsible for implementing accounting standards, including revenue recognition (ASC 606)\nAssist in designing and implementing internal controls and risk management.\nOversee relationships with banks both in the United States and in Israel.\nWork closely with the Head of Finance and CEO to help prepare the company budget and both short-term and long-term financial plans.\nAd-hoc accounting and finance-related projects as needed.\nAbout us:\n\nBacked by founders with IPO and “Unicorn” experiences, we stick to our 4 key values:\nWe’re on your side. The best way to achieve our goals is through collaboration: after all, your success is our success.\nWe think big. We want you to own what you do, elevate it to the next level, and try new and creative approaches.\nWe live by truth. We encourage everyone to come together with their own beliefs to form something meaningful.\nWe’re committed. We are committed to you, to each other, and to the idea of innovation.Show more Report"}, {"company": "Plusgrade", "job": "Accounting Analyst", "city": "Tel Aviv-Yafo", "date": "24h", "rating": "3.8", "link": "", "description": "Plusgrade powers the global travel industry with its portfolio of leading ancillary revenue solutions. Over 200 airline, hospitality, cruise, passenger rail, and financial services companies trust Plusgrade to create new, meaningful revenue streams through incredible customer experiences. As an ancillary revenue powerhouse, Plusgrade has generated billions of dollars in new revenue opportunities across its platform for its partners, while creating enhanced travel experiences for millions of their passengers and guests. Plusgrade was founded in 2009 with headquarters in Montreal and has offices around the world.\nABOUT THE ROLE:\nWe are seeking a dynamic Accounting Analyst to join our finance department on a contract basis (3 to 6 months). The Accounting Analyst will assist our team accounting tasks for our newly acquired legal entity in Israel and help to transition to the Corporate accounting processes. This role will report to the VP, Controller of Plusgrade and work closely with the Plusgrade Finance team.\n WHAT YOU WILL BE DOING:Maintain accounting records and filing information as required.Prepare monthly invoices and forward them to all the customers. Work on collections to ensure customers are paying timely.Work with the Head Office to ensure bills and invoices are paid on time.Assist the accounting team to answer accounts payable and accounts receivable questions and issues.Process and verify employee expense reports accurately with adherence to corporate expense policies.Reconcile corporate credit card expense report.Support administrative tasks for the Israel employees.Work closely with the 3rd party accounting service provider to produce a monthly trial balance within the Corporate timelinesAssist in the preparation of monthly payrolls-Assist with Finance projects as requested (Implemenation of NetSuite for example).\nYOU ARE SOMEONE WITH:3+ years of experience in a similar function or rolePost-secondary degree/diploma in accounting or related fieldProficient in Excel (vlookups, pivot tables, sumifs, etc.), Google Docs and technology-savvyFluency in English and Hebrew, both spoken and writtenStrong organizational and planning skills, ability to work accurately and efficiently under demanding deadlines and with minimal supervisionWorks well on teams and as an individual contributorAbility to maintain strict confidentiality\nWHAT YOU’LL LOVE ABOUT US:\n\\uD83C\\uDFE6 RRSP/401(k) Matching\n\\uD83C\\uDFE5 Comprehensive Health Plans\n\\uD83D\\uDCC5 Unlimited Vacation/PTO\n✈️ Travel Experience Credit\n\\uD83E\\uDDD8 Annual Wellness Credit\n\\uD83E\\uDD57 Team Events and Monthly Lunches\n\\uD83D\\uDCBB Home Office/Commuter Credit\n\\uD83C\\uDF05 Work From Anywhere Program\nOUR PROCESS:\nPlusgrade is an equal opportunity employer and is committed to providing an accessible recruitment process. We welcome applications from all qualified individuals and are committed to equal employment opportunities regardless of gender identity or expression, race, ethnic origin, creed, place of origin, age, sex, marital status, physical or mental disability, sexual orientation, and any other category protected by law. Upon request we will provide accommodation for applicants with disabilities.\nWe believe in diversity and inclusivity and that is why our interview process is designed for a positive candidate experience and to ensure every candidate is evaluated equally. All applications will be reviewed from our Talent Team and the successful candidate(s) will go through the following recruitment process:\nRecruiter Phone InterviewHiring Manager InterviewTake-home Assessment or remote coding exercise (if applicable)Team Interview\nAll candidates will be provided with feedback regardless if they pass or didn’t pass any of our interview stages. All your information will be kept confidential.Show more Report"}, {"company": "REE", "job": "Assistant Controller", "city": "Israel", "date": "2d", "rating": "4.7", "link": "", "description": "REE Automotive (Nasdaq: REE) is changing the electric mobility and aims at becoming the standard for EVs. REE’s disruptive corner technology enables a completely flat and modular chassis that supports all mission-specific EVs in the spaces of commercial vehicles and people movers.\nWe are looking for a highly motivated, organized and dedicated assistant controller to join our finance team at our HQ in Kibbutz Glil-Yam (Herzliya). This is a great opportunity for a post-internship candidate to take a key role in the day-to-day tasks of our financial department and gain experience at a multi-national high-growth organization traded on NASDAQ.\nResponsibilities:\n\nSupport and execute month, quarter and annual close, reporting and results analysis.Assist with preparation of financial statements according to US GAAP.Implement and oversee financial, accounting and SOX processes and policies.Prepare tax filings.Support and cooperate with AP team, FP&A, foreign finance teams and business partners.Cooperate with external auditors.Assist with ad-hoc projects as necessary.\nRequirements:\n\nCertified Public Accountant in Israel.Internship at one of the Big-4 accounting firms (assurance or technical accounting departments).Up to 2 years of post-internship experience.Experience with publicly traded companies and SOX processes – a must.Fluent English and ability to work effectively with foreign subsidiaries – a must.Proficient in Microsoft Excel – a must.Experience with auditing multinational hi-tech companies – an advantage.Knowledge in accounting and reporting according to US GAAP.Great communication and inter-personal skills.Ability to work well under pressure, meet tight deadlines and strive in a fast-paced work environment.Highly motivated, independent, quick learner, well organized and willing to take new responsibilities.\nWebsite:\n\nREEShow more Report"}, {"company": "Harman International", "job": "Controller Assistant", "city": "Hod HaSharon", "date": "30d+", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=118&ao=1136043&s=58&guid=00000186e63fbe76bce51d8ef930ef5c&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0f2ea83c&cb=1678900424973&jobListingId=1008425861405&jrtk=3-1-1grj46s5egrif801-1grj3vfmdi38u800-96f52a14c2e031f2-", "description": "A Career at HARMAN\nAs a technology leader that is rapidly on the move, HARMAN is filled with people who are focused on making life better. Innovation, inclusivity and teamwork are a part of our DNA. When you add that to the challenges we take on and solve together, you’ll discover that at HARMAN you can grow, make a difference and be proud of the work you do every day.\nHARMAN Israel is a software company specializing in the automotive \"Connected Car\" field,\nLocated in Hod-Hasharon.\nHARMAN Israel is a synergy of leading automotive technology solutions who are owned by Harman International, a Samsung company: IGNITE, OTA, Cybersecurity & ADAS\nAt HARMAN, we combine passion and purpose to deliver smart products, systems, software and services that connect people wherever they are.\nWe are seeking for an experienced CPA Assistant Controller to join our Finance team\nKey Responsibilities:\nMonitoring subsidiaries reporting to ensure smooth delivery of day-to-day financial operations of AP, AR, Fixed Assets, GL and statutory reporting.\nOverseeing the month-end/quarter-end and year-end closing process, review/prepare journal entries and general ledger reconciliations.\nParticipating in the monthly and quarterly financial closing, consolidation, reporting process of the company and additional data as required by the corporate reporting package.\nParticipating part in the annual budget process and preform monthly actual vs. budget analysis.\nAssisting in preparation of the statuary financial statements and tax return reports.\nOverseeing accounting procedures and internal procedures.\nWorking with department managers, corporate staff, and subsidiaries finance\nAd-Hoc financial tasks and projects.\nRequired Skills & Qualifications\nCPA, experience from the big 4 - MUST!\nFluent English- MUST!\nFamiliarity with IFRS - advantage\nFamiliar with ERP (“SAP R3” an advantage)\nAbility to analyze financial data and prepare financial reports and statements\nGreat attention to details and ability to multitask\nStrong analytical, interpersonal and communications skills\nHARMAN is an Equal Opportunity /Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race,color, religion, sex, sexual orientation, gender identity, national origin,disability or Protected Veterans status. HARMAN offers a great work environment, challenging career opportunities, professional training and competitive compensation. (www.harman.com)Show more Report"}, {"company": "UVision", "job": "Controller – Maternity Leave Replacement", "city": "Israel", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=119&ao=1136043&s=58&guid=00000186e63fbe76bce51d8ef930ef5c&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_279e45ec&cb=1678900425985&jobListingId=1007503800768&jrtk=3-1-1grj46t5hncfm801-1grj3vfmdi38u800-0c78c0cf0e908443-", "description": "UVision, which develops a line of products of unique loitering munitions, is looking for a financial controller to join our growing finance team\n\nSupervising bookkeeping team\nPreparation of periodic & annual financial statements, including consolidation of subsidiaries\nPreparing and Monitoring financial reporting – budget vs actual, revenues, cost analysis & forecast reports\nMonitoring Company’s cashflow.\nManage all monthly, quarterly and year end closings and preparing of monthly financial statements and analysis\nSupport quarterly and annual audits\nWriting and managing finance and procurement procedures\nRequirements:\nCPA experience from a large accounting firm\n2+ years’ experience in a global Hi-tech company, experience from a\nmanufacturing company – advantage\nExperience in IFRS accounting standards\nExperience with Subsidiaries abroad – advantage\nPrior knowledge with ERP Systems, Priority – advantage\nFluent verbal & written English skills\nStrong Microsoft Excel and Office applications skillsShow more Report"}, {"company": "AKT", "job": "Assistant Controller - Israel based", "city": "Israel", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=120&ao=1136043&s=58&guid=00000186e63fbe76bce51d8ef930ef5c&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_17741bc1&cb=1678900427229&jobListingId=1007957460379&jrtk=3-1-1grj46uc3kbko801-1grj3vfmdi38u800-23926336f70b8262-", "description": "AKT, a global HR solutions and services company and one of the largest SAP Cloud People Solutions consulting firms in the EMEA region, is growing and looking for a high-motivated, skilled, independent, and responsible Assistant Controller to become an integral part of our Finance team. As an Assistant Controller, you will be reporting to and working closely with the Director of Finance.\nRole and Key Responsibilities\nManage accounting records and Preparation of financial statements.\nAssist with preparation of management reports.\nAssist in analyzing monthly and quarterly budgets Vs Actuals, forecasts and company goals.\nPreparation of annual tax reports and other statutory reporting requirements.\nWork with the Company's external auditors/advisors on audit, accounting, and other matters.\nMonitor the bookkeeping team and review the accuracy of financial data.\nAssist in establishing and maintaining financial key policies, procedures, and controls throughout the entire reporting process.\nSupport the accounting team in various tasks and reporting.\nAssist with managing cash flow and preparing ad hoc reports.\nOversee billing and collection process.\nOversee daily operations of financial activities and liaise with service providers.\nJob Requirements\nCertified Public Accountant (CPA)\nAudit experience from one of the Big 4 - advantage.\n 1-2 years of post-internship experience in a global company – advantage.\nProficient with Microsoft Excel\nExcellent oral and written communication skills in both English and Hebrew\nStrong knowledge of US-GAAP and Israeli GAAP\nFull time position at AKT’s offices in Azrieli Holon, Israel\nPersonal Skills\nStrong analytical, interpersonal, and communication skills.\nTeam player and service-oriented.\nDetail-oriented but yet a big picture thinker.\nWell organized with a can do approach, a multi-tasker with attention to details\nIntensive work that often requires long hours and flexibility.\nAKT offers\nStimulating and collaborative working environment\nInternational business environment (offices in UK, France, India, Czech Republic, Israel, with more to be added).Report"}, {"company": "KLA", "job": "Revenue Analyst", "city": "Yavne", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=121&ao=1136043&s=58&guid=00000186e63fbe76bce51d8ef930ef5c&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d8605948&cb=1678900428896&jobListingId=1008171542151&jrtk=3-1-1grj4700a34at001-1grj3vfmdi38u800-10a4007d49e3d890-", "description": "Company Overview\nKLA is a global leader in diversified electronics for the semiconductor manufacturing ecosystem. Virtually every electronic device in the world is produced using our technologies. No laptop, smartphone, wearable device, voice-controlled gadget, flexible screen, VR device or smart car would have made it into your hands without us. KLA invents systems and solutions for the manufacturing of wafers and reticles, integrated circuits, packaging, printed circuit boards and flat panel displays. The innovative ideas and devices that are advancing humanity all begin with inspiration, research and development. KLA focuses more than average on innovation and we invest 15% of sales back into R&D. Our expert teams of physicists, engineers, data scientists and problem-solvers work together with the world’s leading technology providers to accelerate the delivery of tomorrow’s electronic devices. Life here is exciting and our teams thrive on tackling really hard problems. There is never a dull moment with us.\nGroup/Division\nKLA is well known for its high-performing business model which routinely produces significant profit margins and revenue. Key to supporting KLA business is the finance team that partners with corporate and global business organizations to provide expertise and guidance for developing and executing sound business models and practices. The Finance organization consists of operations and corporate finance teams. The operations finance team influences business decisions by gathering the best available operations information, distilling it and making recommendations to our management team on the best course of action. The corporate team provides a broad range of services, such as financial planning, corporate accounting, tax, industry analysis and benchmarking, internal audits, SEC reporting and merger and acquisition support.\nJob Description\nResponsibilities\n\nWe’re looking for a detail-oriented Financial Analyst to contribute to a great finance team and work cross-functionally within the company. The ideal candidate will work with multiple business functions and have the opportunity to affect the company’s overall long term financial performance.\n\nThe Division Revenue Financial Analyst will support the Division Controller and the VP/GM in driving revenue achievement. Responsibilities include:\n\nPartner with sales, operations and other divisional functions to optimize revenue plan and execution.\n\nMaintain accurate database for bookings, shipment, revenue history and forecast.\n\nPerform scenario planning and support the annual strategic planning process.\n\nSupport period close processes, preparation of financial packages and reporting.\n\nProvide analysis of business trends, such as customers, pricing, GM Analysis, etc...\n\nIdentify, support, and implement group process improvements.\n\nMinimum Qualifications\nQualifications\nBachelor's Degree or equivalent in Accounting/Finance with up to 5 years of relevant experience (with emphasis on accounting, forecasting and financial analysis).\nKnowledge of basic revenue accounting and finance principles.\nExcellent communication skill and ability to influence without direct authority.\nAnalytical mindset and ability to provide meaningful analyses that are concise and actionable.\nMust be hard working, have a positive attitude and willingly contribute to a team.\nAbility to meet deadlines, perform under time pressure, cope with the fast-pace environment, prioritize and multi-task.\nComfortable working in an ambiguous environment and be flexible to constant change.\nOpenness to learning and looking for ways to improve.\nWorking knowledge of revenue accounting standards preferred.\nAdvanced Excel skill and working knowledge of ERP systems.\nExperience working on TM1/SAP an advantage.\nFluent English.\nWe offer a competitive, family friendly total rewards package. We design our programs to reflect our commitment to an inclusive environment, while ensuring we provide benefits that meet the diverse needs of our employees.\nKLA is proud to be an equal opportunity employerReport"}, {"company": "Team8", "job": "Team8-Controller-Temporary Position", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.4", "link": "", "description": "Team8, the world’s leading company-building platform, is hiring a controller to join its finance team and will be the main finance focal point of our new portfolio companies.\nWe are seeking an intelligent and hard-working individual, who is a team player, process-driven and detail-oriented, and thrives in a fast-paced work environment.\nThe role is currently temporary (7 months) with an option to extend it\nMain Responsibilities:\nManaging the ongoing day-to-day finance of the companies - from month closing, budget building, cash management, and board preparations.\nPreparation of monthly, quarterly, and annual closing for several of our portfolio companies.\nManaging global Bookkeeping.\nSupervise the intercompany billing process.\nPerforming managerial reporting, forecasting, and budgeting.\nAssist with the external relationship with auditors.\nUndertaking ad-hoc financial tasks.\nRequirements:\n\nC.P.A.\nExperienced in an audit of global Hi-Tech companies/ high-growth start-up environments (SAAS companies - advantage)\nExperience as an assistant controller / Controller - Mandatory\nHigh proficiency in English.\nWorking knowledge of MS Office (especially Excel) and ERP systems\nLeading projects capabilities and analytical abilities.\nAnalytical mindset and strong communication skills, especially when it comes to explaining financial information to diverse constituencies\nUS tax and audit experience\nOverall track record of professional and academic success\nTeam8:\n\nTeam8Show more Report"}, {"company": "Enlight Renewable Energy", "job": "Assistant Controller", "city": "Rosh Ha`Ayin", "date": "14d", "rating": "", "link": "", "description": "Come be a part of the renewable energy revolution! Established in 2008, Enlight Renewable Energy is a traded company and it is one of Israel's leading companies in the initiation, development, financing, construction and operation of renewable energy projects. The company operates in Israel, Europe and the US, boasting a diversified portfolio of income-generating projects, projects under construction and pre-construction. We are looking for an Assistant Controller to join us in the Finance department.Responsibilities: Preparation of financial reports and auditsPerforming general accounting workManagement of monthly, quarterly, and annual closing processesWork closely with the company's bookkeeping, including providing support on tax and accounting issuesSupport Controller in all financial matters of the organizationRequierments: 3-4 years of experience as a certified CPA, BIG4 graduate – a mustPrevious experience in the fields of infrastructure or renewable energy - a significant advantageAdvanced Excel skills – a mustHigh level of English (writing, reading and speaking) – a mustStrong analytical and accounting skillsExcellent interpersonal skills and ability to work effectively with employees at all levels within the organization and externally, including global functionsJob Type: Full-timeShow more Report"}, {"company": "Mindspace", "job": "Financial Controller", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.2", "link": "", "description": "Imagine your dream office... Now, try again.\nMindspace is a rapidly growing global provider of inspiring workspaces for teams of all sizes. Our community consists of enterprise companies and established startups, as well as small businesses, entrepreneurs, and creative freelancers. With members in more than 34 locations across 7 countries, we are setting the gold standard for flexible workspaces around the world.\nWho is the financial Controller?\nThis full-time position is based in Tel Aviv and entails managing the financial policies of Mindspace. The ideal candidate should have several years of experience in a top accounting firm, experience as a controller/ assistant controller and a creative team player with strong interpersonal and management skills.\nYour day at Mindspace.\nWith a strong understanding of accounting and financial measures, you will be ensuring that business operations are aligned with the company’s policies. You’ll be handed a lot of responsibility including managing a team based in and outside Israel. We trust that you are an independent, responsible, and professional who is able to work in a fast-paced environment with cross-organizational teams and interfaces.\nWhat you will be responsible for, mainly.\nGuides financial decisions by establishing, monitoring, and enforcing policies and procedures.\nMonitors and confirms financial condition by conducting audits; providing information to external auditors ( local and foreign )\nPreparing ongoing reports to the company’s stakeholders\nAnalyzing company’s financial results with respect to profits, trends, margins, costs and vs. budget\nManaging employees .\nMonth-end close process\nEnsure invoicing is done on time and includes all the necessary accounts, involved in complicated billing issues, revenue recognition, and debt collection\nTax - comply with local, government reporting requirements and tax filings\nResponsible for managing and reporting monthly CF\nPreparation of quarterly reporting package and related working paper.\nEnsuring global compliance with IFRS 16.\nPreparing annual budget.\n #LI-Onsite\nRequirements:\n\nExperience & Minimum Qualifications:\nBachelor’s degree in accounting - a must\nCPA from a Big 4 accounting firm, with a minimum of 1-2 years of experience after internship (experience from a global company – an advantage)\nExcellent computer skills; experience in SAP\nGood knowledge of Israel Tax and tax reporting experience\nExceptional knowledge of finance, accounting, budgeting, cost accounting and cost control principles, and Generally Accepted Accounting Principles.\nHigh level of English and Hebrew - MUST\nAdvanced knowledge of bookkeeping and accounting best practices, laws, standards\nAnalytical ability to develop and implement improvements or recommendations\nCritical Competencies for Success:\nWe may be an international firm – but you must possess a strong understanding and knowledge of Israeli taxation and compliance laws\nYou’ll be handed a lot of responsibility – so we trust that you’re an independent and responsible worker who is able to work in a fast-paced environment with cross-organizational teams and interfaces\nThere are no taking shortcuts here – transparency is key!\nYou should be a highly-creative team player who is able to think on his feet when the going gets tough\nBuilding infrastructure processes and procedures should not be out of your comfort zone – so come prepared with a can-do attitude\nFired up about Mindspace; you are ready to live, eat and breathe Mindspace, spreading the love to everyone you encounter\nPlease submit your application in English.\nMindspace is an equal opportunity employer.Show more Report"}, {"company": "Forter", "job": "Controller", "city": "Tel Aviv-Yafo", "date": "30d", "rating": "4.7", "link": "", "description": "About us:\n\nDigital commerce is built on trust. At every point along the eCommerce journey, businesses must make a critical decision: Can I trust this customer? Answering this simple question accurately and instantly is powerful—it can accelerate revenue growth and strengthen a company's connection with its customers. How do we do it? Forter was founded on the insight that it's not about what is being purchased, nor where— but who is behind the interaction.\n\nThe Forter Decision Engine finds patterns across more than one billion identities in our dataset. We isolate fraudsters and protect customers—ensuring everyone gets the experience they deserve. Given that trust is central to how we operate, Forter is very much driven by a defined set of values. We attract remarkable talent and have retention and engagement levels that are well above benchmarks. We're meticulous about strengthening our culture\n\nAbout the role:\n\nForter is seeking a talented Controller to join our finance team. As such, you will be assisting in managing the financial reporting and compliance operations. You will report to the Corporate controller.\n\nWhat you'll be doing:\nLead the monthly and annual closing processes for the company and its subsidiaries.\nPrepare monthly/ quarterly/ annual consolidated financial statements (US GAAP)\nSupport the day-to-day finance operations of the company and its subsidiaries and ongoing communication with finance teams abroad.\nSupport the bookkeeper in all day-to-day aspects to ensure the accuracy of financial records.\nPreparation of materials for the quarterly and annual reports and working with the external auditors\nProvide analytical analysis as needed.\nPrepare statutory reports such as annual financial reports and tax reports for global subsidiaries .\nSpecial projects and assignments as needed.\nCooperate with team members and colleagues for organizational support while maintaining excellent work relations and level of service.\nWhat you'll need:\nBachelor's degree in Accounting (CPA)\nCPA from a Big 4 accounting firm, specializing in Hi-Tech (an advantage).\nAt list 2 years of experience from a Hi-Tech company, in a similar position.\nKnowledge of US GAAP and State laws, experience working with US financial entities.\nExcellent Microsoft Excel skills\nExcellent analytical and problem-solving skills\nExcellent English skills - written and verbal\nAble to work in a fast-paced environment, ability to prioritize workload and meet tight deadlines.\nAdvanced knowledge NetSuite- an advantage\nHigh level of independence and self-examination\nLife as a Forterian:\n\nWe are a team of over 500 Forterians spread across 3 different continents. Since 2013, we've raised $525 million from investors such as Tiger Global, Bessemer, Sequoia Capital, March Capital and Salesforce Ventures. We're on a mission to bring trust to global digital commerce so that companies like Nordstrom, Priceline, Instacart and ASOS can block fraud, drive revenue and improve customer experience.\n\nAt Forter, we believe unique people create unique ideas, and valuable experience comes in many forms. So, even if your background doesn't match everything we have listed in the job description, we still encourage you to apply and tell us why your skills and values could be an asset to us. By welcoming different perspectives, we grow together as humans and as a company.\n\nForter is an Equal Employment Opportunity employer that will consider all qualified applicants, regardless of race, color, religion, gender, sexual orientation, marital status, gender identity or expression, national origin, genetics, age, disability status, protected veteran status, or any other characteristic protected by applicable law.\nForter's Applicant Privacy PolicyShow more Report"}, {"company": "Landa", "job": "Controller", "city": "Rehovot", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=126&ao=1136043&s=58&guid=00000186e63fbe76bce51d8ef930ef5c&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e24b2797&cb=1678900435223&jobListingId=1008333510051&jrtk=3-1-1grj47669joqt801-1grj3vfmdi38u800-cf0cf48cfdb606d6-", "description": "DESCRIPTION\nLanda seeks an enthusiastic and experienced controller to join its Finance department and oversee the company’s accounting operations. In this role you will be responsible for budgeting, production of financial reports, issuing procedures, as well as conducting risk management.\n\nRESPONSIBILITIES\nManage the monthly and quarterly financial closing processes, including quality control over financial transactions and financial reporting\nIn charge of bookkeeping and support day to day finance operation of the company\nReview the monthly account reconciliations, including preparing more complex and critical month-end journal entries.\nMonitor and review perpetual inventory transactions\nSupport complex accounting matters that require judgment.\nAssist in developing, implementing and maintaining key financial policies and procedures.\nResponsibility for the company's statutory reporting and filing requirements, including required tax filing.\nAssisting with ongoing tax matters\nSupport for projects, including automation projects and processes improvements\nREQUIREMENTS\nCPA from Big 4 accounting firm with a minimum of 5 years of experience\nExperience in the high-tech industry – advantage\nExperience in inventory and cogs accounting – advantage\nKnowledge and experience in IFRS-Must\nHigh analytical skills\nKnowledge and experience working with ERP systems – QAD advantage\nExperience with general ledger functions and the quarter / year-end close process\nStrong software skills with knowledge of Excel\nATTRIBUTES\nA strong and proactive team player.\nExcellent interpersonal skills.\nAbility to work in fast-paced work environment and work under pressure.\nAttention to detail and good time management skills.\nStrong organizational skills.\nFluency in English (spoken and written) –mustShow more Report"}, {"company": "Gauzy", "job": "Controller", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.6", "link": "", "description": "Gauzy Ltd. is looking for a Controller to join our Finance department.\nThe main goal is to take a leading role in the preparation of consolidated financial statements in compliance with US-GAAP and SEC rules and to contribute in maintaining the accounting and financial processes of the company up to standard to ensure accurate financial reporting.\nRequirements:\n\n3 years of experience in corporate finance departments as Controller or other similar position\nB.A. in Accounting\nCPA license\nKnowledge of accounting practices and financial processes (financial closure, reporting etc.)\nSolid knowledge of US-GAAP - advantage\nExperience with public Company filing - advantage\nLanguage: Fluent in English & Hebrew both written and spoken\nWorking knowledge of MS Office (mainly excel) and SAP software (advantage)\nAvailability to work long hours if required\nWell-organized with a great eye for details, ability to prioritize\nVery good communication and interpersonal skills\nReliable and able to carry out tasks autonomously and collaboratively, problem-solving ability\nResponsibilities:\n\nFinancial Reporting and Accounting:\nPreparation of consolidated financial statements in compliance with US-GAAP, well documented working papers and other reports at demand.\nManage the monthly and quarterly period end closure including assets and liabilities update to period end and P&L - such as cash and cash equivalents, inventories, fixed assets, AR/AP balances, accrued expenses, revenues reconciliation, bonus accruals, payroll accruals etc.\nTake a substantial role in communication with external auditor and advisors.\nSupport many aspects of accounting and bookkeeping management (review of journal entries, invoices, payments, monthly and quarterly closure, billing, tax return, financial reporting etc.).\nTake part in the implementation and documentation of internal controls, new processes and policies in compliance with SOX regulations and company policies.Show more Report"}, {"company": "Comeet", "job": "Controller", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.4", "link": "", "description": "Comeet is a fast-growing collaborative recruiting platform. Our mission is to make recruitment scalable, predictable, and enjoyable for managers, HR teams and candidates around the world and help companies hire the right people on time to fuel their growth.\nWe are looking for an experienced Controller to help build and manage all financial policies, processes, procedures, and controls for the scale and efficiency of the business, and assist in driving the company’s financial strategy and planning. You will be responsible for assessing the financial performance of the company as well as possible risks and investments in partnership with the Head of Finance.\nYou bring experience with the challenges that come from scaling company financial processes globally. You are reliable finance professional with broad knowledge of all relevant accounting, financial, and business principles for global technology companies. You are a strategic thinker and effective leader who can make wise, fair, kind, and profitable decisions.\nThe goal is to guide the company towards scale, profitability, employee retention, and long-term success. This position is remote with optional one day in the Tel Aviv office per week and reports directly to the Head of Finance in Israel.\nRequirements:\n\nProven experience as Controller or similar role; minimum of 4 years and up to 6 years of experience as a Controller or other finance operations function.\nIn-depth knowledge of corporate finance and accounting principles, laws and best practices; including US GAAP.\nSolid knowledge of financial analysis and forecasting.\nProficient in the use of MS Office (Excel) and financial management software (Quickbooks, Priority, SaaSOptics, etc).\nAn analytical mind with a strategic ability and the highest standards of accuracy; highly organized, detail-oriented, and mindful of deadlines.\nExcellent organizational and leadership skills; including the ability to work independently, self-learn, and adapt to a fast-changing environment.\nOutstanding communication and interpersonal abilities.\nFluent English - writing and verbal is required.\nBSc/BA in accounting, finance or relevant field; MSc/MA is a plus.\nCPA or other relevant qualification is a plus.\nBig 4 accounting firm, SaaS startup, or High-Tech company experience is an advantage.\nWhy Comeet is your perfect match\nWe’re a values-driven business with a strong passion for innovation that makes a meaningful impact on the world around us. Comeet is a place where you can bring your whole self and be welcomed. It’s a diverse and inclusive company culture with team members in 6+ countries with a remote first mentality.\nResponsibilities:\n\nDrive the financial planning of the company by analyzing its performance and risks.\nRetain constant awareness of the company’s financial position and act to prevent problems.\nSet up and oversee the company’s finance IT system; QuickBooks, Priority, SaaSOptics, etc.\nOversee all audit and internal financial control operations; including maintenance of a system of controls over accounting transactions.\nDevelop the corporate fundraising strategy and manage relationships with partners and investors as needed in partnership with the Head of Finance.\nPrepare timely and detailed reports on financial performance on a monthly, quarterly, and annual basis.\nConduct analysis to make forecasts and report to the management team.\nEnsure adherence to financial laws and guidelines; including preparation of Statutory Financial statements and filing tax returns in Israel and USA.\nWorking with interfaces within the finance department, audit team, outsourced finance functions, corporate, and other departments of the company.\nProvide support to the Head of Finance in all on-going business topics and in strategic projects and initiatives.\nEnsure timely provision of information and service to other departments and stakeholders.\nManage Israel, USA, and all other regions payroll and payment to vendors.\nProvide support to the Head of Finance and CEO in all legal aspects with support from external legal partners.Show more Report"}, {"company": "Deloitte", "job": "Business Controller Lead", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=129&ao=1136043&s=58&guid=00000186e63fbe76bce51d8ef930ef5c&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1dd02c7b&cb=1678900440193&jobListingId=1008447188229&jrtk=3-1-1grj47b1kk614801-1grj3vfmdi38u800-24ba1cf5e47a3e22-", "description": "Description\n\nDeloitte Israel is looking for a business corporate controller to join our finance team.\n\nThe successful candidate will lead the controllership team, will be involved in all the financial processing, and manage all aspects of the finance department’s daily operations.\n\nDeloitte Israel has been an integral part of the US firm since 2019 when the US-Israel member firms combination agreement was executed. The Finance team is managed on a single platform and the continuation of the finance transformation is supported through integration with state-of-the-art technology systems and processes.\n\nThe position is open to both women and men\n\nThe job is full-time and hybrid in Azrieli Towers, Tel Aviv/from home\n\nResponsibilities:\n\nManage the controllership team in Israel and collaborate with US and global finance teams across the organization\nDrive the consolidated periodic financial statement close process, implement controls, monitor changes, oversee the close execution with global teams.\nResponsible for all accounting issues, operations and activities, guide controllers, implement new processes and improve existing analysis and controls.\nOversee and review the financial data, AR, collection, AP, GL maintenance, Capex, reconciliations, allocation, FX gain/loss ect…\nManage day to day analyses and management reporting, ensure proper internal controls\nDevelop relationships with global teams\nRequirements\n\nRequirements:\n\nCPA (BIG 4), BA in Accounting, MBA (is a plus)\n10+ years experience as a controller\nMust have strong accounting knowledge and strong business perspective.\nProven experience as a controller in global company\nProblem solving skills\nStrong management capabilities and proactive leader\nTeam player – excellent interpersonal skills\nExcellent written and verbal communication skills, English and Hebrew\nExperience working with SAP is an advantage\nReporting to the VP Finance\n\nAt Deloitte, we believe that an inclusive mindset and diverse workforce are two of our greatest competitive strengths. That’s why we continue to reinforce our commitment to foster inclusionReport"}, {"company": "Logz.io", "job": "Controller", "city": "Tel Aviv-Yafo", "date": "30d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=130&ao=1136043&s=58&guid=00000186e63fbe76bce51d8ef930ef5c&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f8c125c8&cb=1678900441310&jobListingId=1008468917414&jrtk=3-1-1grj47c392p8r001-1grj3vfmdi38u800-9259d9e897c71144-", "description": "About Logz.ioLogz.io helps cloud-native businesses monitor and secure their environment. Our Open 360™ Platform turns observability from a high-cost, low-value burden to a high-value, cost-efficient enabler of better business outcomes by combining and extending familiar, powerful and relevant Open Source capabilities across Logs, Metrics and Traces – complemented by security monitoring in the form of cloud-based SIEM. Now developers and engineers can employ an end-to-end, cloud-native observability stack built on scalable and easy-to-use Open Source using a single UI and unified agent – at a cost that anyone can afford. Our customers unlock proactive troubleshooting, faster product delivery and a fully supported SaaS observability platform, all while compounding efficiencies in time and cost. Logz is looking for a strong Controller to Join our team! This role will report to the company’s Director of Finance and work closely with a team of global professionals .Responsibilities:Team leader contributing to the monthly process and reports packages, both for internal and external usesEnsure timeliness and accuracy of financial and management reporting data.Managing audits with the Company’s external auditors as well as the timely and accurate filing of the Company’s financial reports.Coordinating and/or preparing tax schedules, tax returns and other statutory reports in local GAAP.Support the implementation of new accounting standards in order to comply with US-GAAP.Oversee the process of collections, accounts payable and payroll and tax returns, for several subsidiaries.Enhance and implement financial and accounting systems processes, tools and control systems.Support the work of AP team to ensure accuracy of financial recordsSupporting billing-related processes and integration with financial systems, such as NetSuite, SF and otherInteract with other departments to provide consultative support to planning initiatives through financial analysis, reports and recommendations.Prepare different analyses and assist with various tasks related to everyday activity.Verify proper implementation of company’s processes and policies (expenses, travel, etc)Ad-Hoc projectsRequirements:CPA certification with a Big 4 firm experience3-5 Experience in High-tech companiesSaaS experience - MustExperience with NetSuite - MustStrong EXCEL and G Suite SkillsStrong knowledge and experience in US-GAAPHigh level of EnglishAbility to work in a fast-paced work environmentAttention to detailsWell-organized with the ability to prioritizeTeam player and team leaderJob Type: Full-timeShow more Report"}]