[{"company": "Plarium Global Ltd", "job": "Employee Experience Manager", "city": "Herzliya", "date": "20d", "rating": "4.6", "link": "", "description": "Employee Experience/ Welfare Manager/ Head of Fun- anyway you look at it, it is the beating heart of the HR department, and of the Company at a whole.\n\nSo, we're searching for a new heart - a creative, self driven, can-do, people loving heart, for our headquarters in Herzliya (270 employees).\n\nPlarium, besides being a-one-of-a-kind gaming company in Israel, making real games (no gambling/ social casino etc.) and in an international scale (Over 440 million players)- is successful, mostly due to our people-centric culture. We care, we take care, and sincerely believe that it is the work that should be balanced with the life, and not the other way around.\n\nDoes it feel like this job is yours? check the list below\n\nResponsibilities:\n\nPlan and execute company welfare projects, activities & events end to end (including celebrations, wellness activities, company's parties, holidays, divisional team fun days, happy hour, lectures, toasts and other fun events according to a yearly plan)\nVendor management- timelines, branding, logistics, etc\nIncrease employee's engagement and sense of belongingness\nCollaborate with other HR professionals, and other department leaders in the company.\nHandle operational tasks for HR activities such as onboarding, new employees' orientation, employee gifts, etc.\nManage the well - being budget\n\nWho are you?\n\n2-5 years experience in employee experience/ welfare in a hi-tech company\nSignificant and proven experience in planning, managing, and executing small and large scale events.\nExperience in managing budgets\nMultitasker- working on a few projects at a time with multiple internal and external partners\nTeam player and service oriented person.\nCan - do attitude, open minded, strong organizational skills, self starter, friendly, approachable.\nOperations and project management skills\nHave the motivation to make others happy\nOut of the box thinker\nRelevant academic degree\n\nWhat we offer?\n\nHybrid and flexible work environment\nStunning new offices with a gym, yoga classes, music room, amazing breakfasts and evening snacks, home-barista, fresh juices and more..Show more Report"}, {"company": "Glassbox Ltd.", "job": "Global Employee Experience Manager", "city": "Petah Tikva", "date": "30d+", "rating": "4.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=1136043&s=58&guid=00000186e63cb61695eeb9788ca5efae&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_84ee03a7&cb=1678900171572&jobListingId=1008363573578&jrtk=3-1-1grj3v4mpk252801-1grj3pdjcgaig800-55138202eb1dccb0-", "description": "Glassbox is looking for an Global Employee Experience Manager to join our Global HR team.\n\nWe are Glassbox, the world's leader in digital experience intelligence (DXI), and on a mission to deliver frictionless digital journeys to leading brands and their customers all over the world.\n\nWe are a hyper-growth scale-up company that continues to grow quarter-on-quarter and our customers love us - named a 2022 leader in nine G2 categories based on customer reviews!\n\nSo, now is the perfect time to come to Glassbox and help us accelerate our global leadership position!\n\nWill you join us on this journey?\n\n\nWe're looking for a Global Employee Experience Manager to establish an internal communications strategy and to create and execute a best-in-class strategy that will promote a supportive work environment for all our employees, including Operations.\n\nThis is a new position in the company and you have the opportunity to build it from scratch and make it your own!\n\n\nWhy is this role so curtail and at Glassbox?\n\nAs we are growing super fast we need a Global Employee Experience Manager to oversee initiatives that will sustain and scale the company culture, manage all internal communication channels and provide a positive work environment that it's line with our values as a company.\n\n\nWhat You Will Do\n\nBuild the strategy, manage and ensure that internal communication messaging is consistent across all mediums and tailored to different audiences within the organization\nWork with the local teams to promote and excite employee wellbeing through different activities, initiatives and events\nOversee the day-to-day global operational execution and the details that go into making these initiatives a success\nOversee and execute internal communication in the company to insure that our culture and motivation continues to drive business success\nManage the office operations of the company to insure a smooth and effective work\n\nYour daily responsibilities may include:\n\nInternal Communication - a Must:\n\nDevelop the Foundation's internal communication and engagement strategy, ensuring the organization's mission, values, initiatives and people news are communicated in a regular, considered, effective and engaging way\nManage and create engaging content for the internal communications channels (intranet, email, in-person events, virtual events etc) and regularly evaluate the efficiency of the channels used, making continuous improvements\nKeep communications fresh, creative, and engaging, to drive business objectives, culture, employer brand awareness and employee engagement\nEnsure consistent messaging across all of internal channels\n\nEmployee Experience:\n\nExecute innovative, yearly global employee experience plans that match our fast paced work environment and culture needs\nLead global welfare policies and activities, company events and projects from beginning to end\nBuilding an annual wellbeing plan, which supports and emphasizes employee experience and its implementation at strategic and operational level\nSupport the day 2 day employees life cycle activities\nMaintain ownership of annual budget and planning\n\nOperations:\n\nBe responsible for the day-to-day logistics and administration of the company office, including running of the office, maintenance, and repairs, supplies and food orders, etc.\nManaging the front desk secretary\nOversee company travel requests\n\n\nWhat You Will Need\n\nExcellent English and Hebrew, both verbal and written - a must\n3 years as a global employee experience in a global High-Tech company - a must\nCreative, proactive, multitasker, with a hands-on\nExperience in managing priorities in a high-pressure, results-oriented environment\nFamiliarity with Social Digital - a mustShow more Report"}, {"company": "Glassbox", "job": "Global Employee Experience Manager", "city": "Israel", "date": "30d+", "rating": "4.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=103&ao=1136043&s=58&guid=00000186e63cb61695eeb9788ca5efae&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c20e97d3&cb=1678900172649&jobListingId=1008403518043&jrtk=3-1-1grj3v5p92i76001-1grj3pdjcgaig800-636524760360b25d-", "description": "Global Employee Experience Manager\nIsrael - HR - Full-time - Intermediate\nGlassbox is looking for an Global Employee Experience Manager to join our Global HR team.\n\nWe are Glassbox, the world's leader in digital experience intelligence (DXI), and on a mission to deliver frictionless digital journeys to leading brands and their customers all over the world.\n\nWe are a hyper-growth scale-up company that continues to grow quarter-on-quarter and our customers love us - named a 2022 leader in nine G2 categories based on customer reviews!\n\nSo, now is the perfect time to come to Glassbox and help us accelerate our global leadership position!\n\nWill you join us on this journey?\n\n\nWe’re looking for a Global Employee Experience Manager to establish an internal communications strategy and to create and execute a best-in-class strategy that will promote a supportive work environment for all our employees, including Operations.\n\nThis is a new position in the company and you have the opportunity to build it from scratch and make it your own!\n\n\nWhy is this role so curtail and at Glassbox?\n\nAs we are growing super fast we need a Global Employee Experience Manager to oversee initiatives that will sustain and scale the company culture, manage all internal communication channels and provide a positive work environment that it’s line with our values as a company.\n\n\nWhat You Will Do\n\nBuild the strategy, manage and ensure that internal communication messaging is consistent across all mediums and tailored to different audiences within the organization\nWork with the local teams to promote and excite employee wellbeing through different activities, initiatives and events\nOversee the day-to-day global operational execution and the details that go into making these initiatives a success\nOversee and execute internal communication in the company to insure that our culture and motivation continues to drive business success\nManage the office operations of the company to insure a smooth and effective work\n\nYour daily responsibilities may include:\n\nInternal Communication - a Must:\n\nDevelop the Foundation’s internal communication and engagement strategy, ensuring the organization’s mission, values, initiatives and people news are communicated in a regular, considered, effective and engaging way\nManage and create engaging content for the internal communications channels (intranet, email, in-person events, virtual events etc) and regularly evaluate the efficiency of the channels used, making continuous improvements\nKeep communications fresh, creative, and engaging, to drive business objectives, culture, employer brand awareness and employee engagement\nEnsure consistent messaging across all of internal channels\n\nEmployee Experience:\n\nExecute innovative, yearly global employee experience plans that match our fast paced work environment and culture needs\nLead global welfare policies and activities, company events and projects from beginning to end\nBuilding an annual wellbeing plan, which supports and emphasizes employee experience and its implementation at strategic and operational level\nSupport the day 2 day employees life cycle activities\nMaintain ownership of annual budget and planning\n\nOperations:\n\nBe responsible for the day-to-day logistics and administration of the company office, including running of the office, maintenance, and repairs, supplies and food orders, etc.\nManaging the front desk secretary\nOversee company travel requests\n\n\nWhat You Will Need\n\nExcellent English and Hebrew, both verbal and written - a must\n3 years as a global employee experience in a global High-Tech company - a must\nCreative, proactive, multitasker, with a hands-on\nExperience in managing priorities in a high-pressure, results-oriented environment\nFamiliarity with Social Digital - a mustReport"}, {"company": "Teva Pharmaceuticals", "job": "Director, Strategy & Portfolio Management, ITMO", "city": "Tel Aviv-Yafo", "date": "24h", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=104&ao=1136043&s=58&guid=00000186e63cb61695eeb9788ca5efae&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_5d5d2c71&cb=1678900174039&jobListingId=1008530607569&jrtk=3-1-1grj3v743kf3b801-1grj3pdjcgaig800-7a025e4a2e59afd3-", "description": "Director, Strategy & Portfolio Management, ITMO\nDate: Mar 15, 2023\nLocation:\nTel Aviv, Israel, 1\nCompany: Teva Pharmaceuticals\nJob Id: 46610\nWho are we?\n\nTogether, we’re on a mission to make good health more affordable and accessible, to help millions around the world enjoy healthier lives. It’s a mission that bonds our people across nearly 60 countries and a rich, diverse variety of nationalities and backgrounds.\nWorking here means working with the world’s leading manufacturer of generic medicines, and the proud producer of many of the products on the World Health Organization’s Essential Medicines List. Today, at least 200 million people around the world take one of our medicines every single day. An amazing number, but we’re always looking for new ways to continue making a difference, and new people to make a difference with.\n\nJob Description\n\nThe Director, ITMO Strategy & Portfolio Mgmt. is responsible for establishing and maintaining the smooth running of the IT operations from strategic planning through project execution.\nSpecific responsibilities include:\nStrategic Planning - Establish and manage the process for building and maintaining the long-range strategic plan for IT and Systems information Strategic Plan.\nAnnual Planning - Establish and manage the process for creating and approving the annual operating plan including detailed CAPEX planning and alignment with Finance and HR on OPEX and HC. Responsible for tracking the plan throughout the year to ensure adherence and address adjustments.\nManagement Routines - Develop the routines to ensure the smooth management of the IT department including meetings, reporting and communications points within IT and with the broader organization. Manage the process for requests and approvals of resources.\nProject/Portfolio Governance - Manage a team of Operations Leads who work with specific IT departments to ensure they are aligned to IT & Teva Strategy. Manage the governance of project delivery to ensure projects are running effectively and are set up for succeed.\nOperational Efficiency - Establish and Manage the routines and culture for the Operations leads to liaise effectively and efficiently with the assigned IT departments to enable smooth operations and management visibility to the complete picture of projects, people, and financials.\nCross IT Initiatives - Identify and manage cross IT initiatives and projects. Oversee delivery across the various delivery groups within the IT organization.\nIncubation - Identify and collect opportunities to expand the tools and capabilities of IT into new spaces. Serve as the location to establish the capability and move it into an operational status within the organization.\nQualifications\n\nEducation/Knowledge Requirements:\n10+ years of experience in senior/managerial IT role\n10+ years of experience implementing and managing global scale applications\nManagement-related Degree, or other applicable field preferred\n\nSkills and Capabilities:\nStrategic Thinking – Ability to think long term and align IT to broader organizational goals and plans.\nRelationship Management – Ability to manage competing priorities and maintain relationships with senior IT leaders without compromising on quality and standards.\nAnalysis and Problem Solving – Ability to break down complex issues into their root causes and define realistic solutions.\nCommunication and Change Management – Ability to communicate complex ideas and plans in clear and actionable ways. Capability to help drive an organization through changes in process and strategy.\nProcess and Continuous Improvement Mindset – Ability to establish efficient management processes and constantly push to improve the way IT works.\nTime Management Skills – Ability to manage multiple priorities simultaneously.\nFunction\nInformation Technology\nSub Function\nIT Business Application\nReports To\n\nHead of IT Managment Operations\n\nAlready Working @TEVA?\n\nIf you are a current Teva employee, please apply using the internal career site available on \"Employee Central\". By doing so, your application will be treated with priority. You will also be able to see opportunities that are open exclusively to Teva employees. Use the following link to search and apply: Internal Career Site\nThe internal career site is available from your home network as well. If you have trouble accessing your EC account, please contact your local HR/IT partner.\nTeva’s Equal Employment Opportunity Commitment\nTeva Pharmaceuticals is committed to equal opportunity in employment. It is Teva's global policy that equal employment opportunity be provided without regard to age, race, creed, color, religion, sex, disability, pregnancy, medical condition, sexual orientation, gender identity or expression, ancestry, veteran status, national or ethnic origin or any other legally recognized status entitled to protection under applicable laws.Show more Report"}, {"company": "AKT", "job": "Consultant & Professional Assistant to Head of HR Excellence", "city": "Israel", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=1136043&s=58&guid=00000186e63cb61695eeb9788ca5efae&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1900f3cb&cb=1678900175455&jobListingId=1008336845066&jrtk=3-1-1grj3v8g5gajo801-1grj3pdjcgaig800-42e781070cd781e0-", "description": "AKT, a global HR solutions and services company, is seeking a Consultant to join our HR Excellence Practice team, tackling a wide range of HR challenges such as HR strategy, HR transformations, talent acquisition, HR processes, strategic workforce planning and people analytics.\nThe Consultant & Professional Assistant role is an entry level consultant to serve as the right hand of Head of HR Excellence practice in our advisory unit.\nThe role holder will also act as Project Management Officer for various HR consultancy projects. This is a fantastic opportunity to be exposed to leading edge HR content and fascinating HR innovation projects, garnering the right tools and skills that are the foundation for success in HR consultancy.\nKey Responsibilities:\nProject Management Officer (PMO)\nPlanning, monitoring and controlling HR consultancy projects\nOperational management of projects: preparing Gantt reports, budgets, tasks, while tracking deliverables\nInternal and external interfaces work (AKT and client)\nManaging Sales operations in HR Excellence practice\nConsultant and professional assistant:\nImplementation of methodologies in various HR consultancy projects, supporting projects and senior consultants in various projects\nDevelopment of professional content and presentations for clients to be delivered via lectures, client events, webinars, published reports\nWriting and developing proposals for consultancy projects\nProfile requirements:\n2 to 4 years of relevant experience in a mid-to-large global organization (project management experience is an advantage)\nMaster’s degree from a leading institution, in relevant fields: organizational consultancy, industrial engineering, organizational psychology, labor studies, etc.\nTechnology savvy and/or capability to learn about the latest technological advances in HR\nExperience in project management – an advantage\nExperience and/or strong functional understanding of the HR domain – an advantage\nExperience working in global companies - an advantage\nProfessional and committed to deliver customer satisfaction in challenging environments\nProfessional presentation and communication skills (both written & oral)\nProfessional ability in all Microsoft Office applications, in particular Microsoft Excel\nPersonal Skills:\nLanguage skills: Hebrew (native-level) and English (native-level) for both content reading and writing as well as verbal delivery).\nA quick learner\nDynamic project coordinator and team player with strong commitment and drive to accomplish individual and team tasks and goals\nAmbitious, driven, self-motivated, flexible and able to meet tight deadlines\nAbility to cope with multi-tasking and working independently\nTake initiative, exercise sound judgment and result-oriented\nStrong analytical skills\nCustomer oriented and flexible – willing to work intense and non-regular hours\nDesire to learn and grow quickly\nAKT offers:\nPersonal growth opportunities in a stimulating and collaborative working environment\nChallenging projects in both local and global companies\nInternal knowledge transferShow more Report"}, {"company": "Justt", "job": "Employee Experience Partner (maternity leave replacement)", "city": "Tel Aviv-Yafo", "date": "1 day ago", "rating": "3.9", "link": "", "description": "Justt’s smart technology and in-house expertise successfully resolves chargebacks for merchants, automatically reuniting them with their revenue.\nJustt’s proprietary AI pulls the best evidence to build merchants’ most compelling defense and keeps getting smarter with time, so win rates continue to grow, outperforming all other alternatives.\nOur technology ensures merchants can focus on building their business and strengthening customer relationships instead of wasting time on complex payment disputes.\nWe are looking for an experienced People ops and employee experience Professional to join our People team.\nOur mission is to enable and inspire every employee to be at their best, empowered to have a greater impact while aligning with company initiatives, values, and strategic objectives.\nThis position is a central function within our People team, and we are looking for a team player who is extremely hands-on, a self-starter, a multitasker, a collaborator, and a visionary. In this role, you will be responsible for planning and implementing employee experience day-to-day operations. Always deeply connected to Justt’s people, you will have the impactful role of continuing to shape and grow our culture.\nThis role is temporary as it is a maternity leave replacement for 9 months based in Tel Aviv.\nWe will be happy to explore future employment options together, based on performance and business needs.\nYou will:\nCreate a global employee well-being strategy aligned with the organization's business needs.\nBuild and manage global welfare and wellness programs and events from planning to execution including vendor identification, timelines, logistics, etc.\nInnovate and run Employee Experience related programs such as community events, sporting events, philanthropic activities, etc.\nBuild and manage orientation, onboarding, offboarding and all employees’ life cycle experiences.\nAutomate, Streamline and Maintain HR Processes via HR platforms ( Hibob)\nOwn employee lifecycle, including gifts and perks.\nExceptional analytical skills with the ability to collect, organize, and analyze significant amounts of HR data, paying attention to details.\nData storytelling, including visualization and PowerPoint skills.\nProcess and maintain accurate employee records and data changes, using our HRIS system.\n Responsible for maintaining and improving people related policies, procedures and practices.\nTranslate culture and brand through in-person as well as virtual events and experiences\nWork with a variety of suppliers and vendors to a high level of execution.\nWork closely with different departments and stakeholders to fully understand the different needs.\nRequirements:\n\nMinimum of 3-5 years of experience in a similar role such as : Employee Experience HR Operations in a global organization - Must\nExperience in planning, managing, and executing global welfare activities\nExperience developing and implementing employee engagement and experience initiatives.\nProficient in HRIS systems (as HiBoB) and Microsoft Office.\nA creative attitude, an ability to multitask, and a hands-on approach\nBachelor's degree in Human Resources, Business Administration, or a related field.\nA true project manager at heart, with the ability to plan, coordinate and execute large-scale events\nExceptional interpersonal and communication skills\nExcellent with budget management and procurement\nExcellent communication and interpersonal skills.\nStrong analytical and problem-solving skills.\nAbility to work independently and collaboratively in a fast-paced environment.\nExcellent English and Hebrew, both verbal and written requiredShow more Report"}, {"company": "SAP", "job": "Intern - Social Media & Communications Specialist SAP Labs Israel", "city": "Raanana", "date": "23d", "rating": "4.4", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=107&ao=1136043&s=58&guid=00000186e63cb61695eeb9788ca5efae&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_75fadf30&cb=1678900178127&jobListingId=1008482742774&jrtk=3-1-1grj3vb46kltr801-1grj3pdjcgaig800-cfd61f721a8c1210-", "description": "We help the world run better\nOur company culture is focused on helping our employees enable innovation by building breakthroughs together. How? We focus every day on building the foundation for tomorrow and creating a workplace that embraces differences, values flexibility, and is aligned to our purpose-driven and future-focused work. We offer a highly collaborative, caring team environment with a strong focus on learning and development, recognition for your individual contributions, and a variety of benefit options for you to choose from.Apply now!\nGENERAL DESCRIPTION\nThe Communications Specialist is responsible to engage and inspire our existing and potential employees, by creating effective internal and external communication plans, programs and awesome content. Working with a variety of stakeholders, from business leaders to employees and external vendors, our Communications Specialist will drive employee engagement through their excellent writing skills, project management and running our social media channels and activities.\nWhat you'll do\nCreating and promoting internal and external communications, according to brand guidelines. Maintain and drive content through internal communication channels, projects and initiatives.\nCreate and publish engaging content for social media, as well as initiate engaging activities aimed at internal and external audiences through social media channels.\nGathering and understanding complex topics and creating audience-relevant and compelling messages and programs.\nProduce a variety of materials such as newsletters, videos, blogs, employee events, campaigns, social media posts and more\nPlaying a key role in the planning and execution of company-wide employee events.\nProactively initiate, plan and execute effective employee communications strategies that support employees’ engagement and other pre-defined objectives\nProvide support of employees’ communications for senior leadership\nWork closely with HR, operations, marketing and other teams to ensure ongoing engaging and consistent communications across all channels, contributing to functional excellence and business success\nWhat you Bring\nIdeally Bachelor’s degree in communications, journalism, marketing, public relations or related field or others\nExcellent oral/written communication skills in English and Hebrew\nExcellent organizational skills and a proven ability to manage multiple projects and deadlines simultaneously\nStudent status\nDemonstrated professional experience in marketing and communication roles (Communications, marketing, marcom)\nExperience with contemporary digital communications and social media practices – Mandatory\nProven track record of creating high impact content and communications programs\nPLEASE SEND YOUR CV IN ENGLISH\nWe build breakthroughs together\nSAP innovations help more than 400,000 customers worldwide work together more efficiently and use business insight more effectively. Originally known for leadership in enterprise resource planning (ERP) software, SAP has evolved to become a market leader in end-to-end business application software and related services for database, analytics, intelligent technologies, and experience management. As a cloud company with 200 million users and more than 100,000 employees worldwide, we are purpose-driven and future-focused, with a highly collaborative team ethic and commitment to personal development. Whether connecting global industries, people, or platforms, we help ensure every challenge gets the solution it deserves. At SAP, we build breakthroughs, together.\nWe win with inclusion\nSAP’s culture of inclusion, focus on health and well-being, and flexible working models help ensure that everyone – regardless of background – feels included and can run at their best. At SAP, we believe we are made stronger by the unique capabilities and qualities that each person brings to our company, and we invest in our employees to inspire confidence and help everyone realize their full potential. We ultimately believe in unleashing all talent and creating a better and more equitable world.\nSAP is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to the values of Equal Employment Opportunity and provide accessibility accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team: Careers@sap.com\nFor SAP employees: Only permanent roles are eligible for the SAP Employee Referral Program, according to the eligibility rules set in the SAP Referral Policy. Specific conditions may apply for roles in Vocational Training.\nEOE AA M/F/Vet/Disability:\nQualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, ethnicity, age, gender (including pregnancy, childbirth, et al), sexual orientation, gender identity or expression, protected veteran status, or disability.\nSuccessful candidates might be required to undergo a background verification with an external vendor.\nRequisition ID: 363636 | Work Area: Administration | Expected Travel: 0 - 10% | Career Status: Student | Employment Type: Intern | Additional Locations: #LI-Hybrid.Show more Report"}, {"company": "Teva Pharmaceuticals", "job": "Sr Dir Facilities Management - International Markets", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=108&ao=1136043&s=58&guid=00000186e63cb61695eeb9788ca5efae&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_5acd11e6&cb=1678900179360&jobListingId=1008461877318&jrtk=3-1-1grj3vc9ukcnm801-1grj3pdjcgaig800-ec65d73e43619c4d-", "description": "Sr Dir Facilities Management - International Markets\nDate: Mar 10, 2023\nLocation:\nTel Aviv, Israel, 1\nCompany: Teva Pharmaceuticals\nJob Id: 45415\nWho are we?\nTeva is a global pharmaceutical leader and the world's largest generic medicines producer, committed to improving health and increasing access to quality health solutions worldwide. Our employees are at the core of our success, with colleagues in over 80 countries delivering the world's largest medicine cabinet to 200 million people every day. We offer a uniquely diverse portfolio of products and solutions for patients and we've built a promising pipeline centered around our core therapeutic areas. We are continually developing patient-centric solutions and significantly growing both our generic and specialty medicines business through investment in research and development, marketing, business development and innovation. This is how we improve health and enable people to live better, healthier lives. Join us on our journey of growth!\nJob Description\nStrategic planning for facilities operations for all sites in the region and serve as Country FM lead for our Israel sites.\nSupport and monitor the execution and performance of hard/soft services and projects in accordance with operational and financial targets. FM Services include but are not limited to hard services such as the maintenance, installation and construction of building systems and infrastructure such as electrical, plumbing and mechanical systems and utilities. Also includes management of soft services including: security, cleaning, food services, pest control, uniforms, etc.\nManage the execution of all Real Estate transaction within the region.\nEngage with all relevant stakeholders on a reoccurring basis. Develop and strengthen relationships with customers to ensure FM & RE needs are understood and met in the most effective and efficient manner.\nLeads changes for assigned sites in accordance with the organizational and strategic initiatives within GFM and TEVA.\nStrengthens talent pool by identifying top talents for continued growth and creating development plans for areas of improvement. Create/maintain culture of ownership and accountability. Develop succession plan within the organization.\nSupport the development of annual budgets for both operational and capital expenditures, to reach cost reduction targets.\nMonitor Facilities service levels in line with SOPs, SLAs, and KPIs in order to support business operations and reach service improvement targets. Drive continuous improvement across all responsibilities and all assigned sites.\nSupport regional strategic projects (opening and/or closure of sites, construction, relocating sites, etc.).\nEnsures compliance with Teva policies, procedures, operating plans and SOPs\nIdentify operational requirements and solutions for upcoming issues and problems (bottlenecks) on various organizational levels.\nQualifications\n\nQUALIFICATIONS:\nMinimum 10 years’ experience in Facility management including management of budgets, soft & hard services, and capital projects. Minimum of 7 years’ experience overseeing management level employees\nMinimum of a Bachelor’s degree (preference given to those with a degree in Facilities Management, Engineering or related field. Master’s degree preferred\nFluent in English\nExperience with working in multinational organizations and international portfolios is required\nWell-developed leadership and management skills, with experience in team building and leadership\nExperience with Manufacturing, R&D, and Distribution operations at a pharmaceutical or other regulated company preferred\nOutstanding people, communication, and problem solving skills are required for this position.\nProven ability to initiate, manage, and successfully implement significant change processes.\nStrong ability to develop presentation/business cases and present to all levels of management\n\nSKILLS:\nAbility to create strong networks within a matrix organization\nProactive, well organized and flexible\nExcellent written and oral communications skills, including the ability to effectively communicate at all levels\nStrong working knowledge and experience using Microsoft Office\nTeam player, service orientated, supportive\nAssertiveness and determination to achieve result.\nFunction\nFacilities\nSub Function\nFacilities Management\nReports To\n\nVP, Global Facility Management & Real Estate\n\nAlready Working @TEVA?\n\nIf you are a current Teva employee, please apply using the internal career site available on \"Employee Central\". By doing so, your application will be treated with priority. You will also be able to see opportunities that are open exclusively to Teva employees. Use the following link to search and apply: Internal Career Site\nThe internal career site is available from your home network as well. If you have trouble accessing your EC account, please contact your local HR/IT partner.\nTeva’s Equal Employment Opportunity Commitment\nTeva Pharmaceuticals is committed to equal opportunity in employment. It is Teva's global policy that equal employment opportunity be provided without regard to age, race, creed, color, religion, sex, disability, pregnancy, medical condition, sexual orientation, gender identity or expression, ancestry, veteran status, national or ethnic origin or any other legally recognized status entitled to protection under applicable laws.Report"}, {"company": "Riskified", "job": "Technical Product Manager", "city": "Tel Aviv-Yafo", "date": "20d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=109&ao=1136043&s=58&guid=00000186e63cb61695eeb9788ca5efae&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c6789c98&cb=1678900180459&jobListingId=1008488963578&jrtk=3-1-1grj3vddamfqk801-1grj3pdjcgaig800-c20e5502e38e7e81-", "description": "About Us\n\nRiskified empowers merchants and shoppers to realize the full potential of eCommerce by making it safe, accessible, and frictionless. Our global team helps the world's most-innovative eCommerce merchants eliminate risk and uncertainty from their business. Merchants integrate Riskified's machine learning platform to create trusted customer relationships, driving higher sales while reducing costs. Riskified has reviewed hundreds of millions of transactions and approved billions of dollars of revenue for global brands and fast-growing businesses across industries, including Wayfair, Wish, Peloton, Gucci, and many more. As of July 29th, 2021, Riskified has begun trading on NYSE under the ticker RSKD.\n\nAbout the Role\n\nOur Product Management Team plays a pivotal role in our company, driving product success by working collaboratively with Riskified's engineering, data science, design, marketing, analytics, operation teams and GTM teams. Product Managers at Riskified are required to solve complex problems, using a varied and multi-disciplinary skillset. We are in hyper-growth mode, so are looking for people who can learn and adjust quickly as the company and our product suite expand.\nBeing part of our team means you'll be working alongside smart and motivated colleagues who consistently work hard and execute. Our philosophy centers around end-to-end ownership, which means that every team member is empowered and accountable. We hold ourselves to high standards, have ambitious goals, and are not afraid of trying new things.\n\nAs a Technical Product Manager at Riskified, you will be responsible for production-grade and real-time data analysis capabilities that power Riskified's products, supporting mission-critical services. You will scope requirements with engineers, data scientists, integration experts and fellow product managers for various solutions, utilizing the latest data technologies and methodologies, and build those into a roadmap, considering technical constraints and business needs.\n\nFrom the first day, you will have the autonomy to think strategically and make data-driven decisions to drive creative solutions\n\nWhat You'll Be Doing\nWork collaboratively with multiple teams, including Dev, Integration, SRE, Operations and BI teams, to scope and solve complex analytical and technical product problems\nOwn the solution API definition making sure that we address the latest market requirements to support Riskified business goals\nThink big. Work with GTM teams to understand the business needs, define creative solutions to address those opportunities and prioritize the product development accordingly\nDefine Non-Functional Requirements of high-availability, high-throughput or Big Data services, incorporating a broad range of considerations and tradeoffs\nOwn the solution roadmap to meet the business goals\nManage the agile development and release of developer-friendly new features and capabilities to promote synergy and reuse\nDefine and own KPIs that measure ease of use and reuse of such capabilities\nLead the planning, scoping, and prioritization of new capabilities to achieve Riskified business goals\nQualifications\n3+ years of experience as a Product Manager\nExperience with large-scale, big-data and cloud-based solutions\nStrong technical background, including familiarity with: Relational DBs, NoSQL, AWS Products, big data technologies (Kafka, Spark)\nExperience designing APIs and building high throughput services\nFast learner with strong interpersonal and communication skills\n3+ years of proven experience in hands-on server-side coding\nB.Sc. in Computer Science or military equivalent certifications\nExperience in SaaS companies in a B2B setting - an advantage\nExperience with eCommerce, FinTech, Online Payments, Fraud - an advantage\nLife at Riskified\n\nWe are a fast-growing and dynamic tech company with 750+ team members globally. We value collaboration and innovative thinking. We're looking for bright, driven, and passionate people to grow with us.\n\nCOVID-19 Update:\n\nOur Tel-Aviv team is currently working in a hybrid of remote and in-office work for all our team members. We have recently moved to our new space in Tel Aviv - check it out here!\n\nSome of our Tel Aviv Benefits & Perks:\n\nEquity for all employees, Keren Hishtalmut, pension\nPrivate medical insurance, extra time off for parents and caregivers\nCommuter and parking benefits\nTeam events, fully-stocked kitchen, lunch stipend, happy hours, yoga, pilates, functional training, basketball, soccer\nWide-ranging opportunities to volunteer and make an impact\nCommitment to your professional development with global onboarding, skills-based courses, full access to Udemy, lunch & learns\nAwesome Riskified gifts and swag!\n\nIn the News\n\nGeektime: Riskified Goes Public\n\nTheMarker: Riskified Jumps on NYSE Debut\n\nGeektime Insider: A look at Riskified Tel Aviv\n\nCalcalist: Riskified is the Most Promising Startup\n\nForbes: Riskified Becomes a Unicorn (Hebrew)\n\nCTech: Riskified Raises $165M\n\nTechCrunch: Riskified Prevents Fraud on Your Favorite E-commerce Site\n\nCTech: Riskified's VP HR on Post-COVID Flexible Work RoutinesShow more Report"}, {"company": "Moovit", "job": "Talent Acquisition & HR Partner - Temporary Position", "city": "Ness Ziona", "date": "28d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=110&ao=1136043&s=58&guid=00000186e63cb61695eeb9788ca5efae&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d2348489&cb=1678900182546&jobListingId=1008473864280&jrtk=3-1-1grj3vfdincf2801-1grj3pdjcgaig800-94b4ecf6e8e16d3f-", "description": "Who Are We?\nMoovit (www.moovit.com), part of Mobileye (Nasdaq:MBLY), is a leading Mobility as a Service (MaaS) solutions provider and the creator of the #1 urban mobility app. Moovit & Mobileye are accelerating the global adoption of autonomous transportation, including the launch of our joint Robotaxi service - MoovitAV.\nMoovit’s iOS, Android, and Web apps guide people in getting around town effectively and conveniently, using any mode of transport. Introduced in 2012, it now serves over 1.7 billion users in more than 3,500 cities across 112 countries.\nMoovit amasses up to six billion anonymous data points a day to add to the world’s largest repository of transit and urban mobility data. For governments, cities, transit agencies, and private companies, Moovit offers AI-powered MaaS solutions covering planning, operations, and optimization with proven value in reducing congestion, growing ridership, and increasing efficiency and asset utilization. Industry leaders such as Uber and Cubic have partnered with Moovit to power their mobility offerings.\nThe Role\nWe're looking for a Talent Acquisition & HR Business Partner — a temporary position for maternity leave replacement — you will be part of the HR team at a fast pace growing company to help us grow! and take part in the ongoing effort to grow and scale the company while keeping its unique culture.\nYou’ll be responsible for the end-to-end hiring process both local and global, beginning with profiling the best candidates, developing channels and sourcing strategies to engage talent, maintaining an effective hiring process, interviewing, and acting as a partner in all hiring decision-making.\n Responsibilities\nManage the end-to-end recruiting processes\nSource and creatively recruit top-notch candidates and maintain a strong pipeline\nBe responsible for assessment processes, including conducting face-to-face (and Zoom) interviews\nPartner and work closely with our hiring managers and act as a consultant on talent issues\nBuild strong relationships with candidates to maintain an excellent candidate experience and help get great results for both sides\nBe part of an HR team, raising ideas, improving current processes\nBe an ambassador for our culture and mission\nDevelop and maintain innovative sourcing channels and recruitment campaigns\nConduct effective, data-driven recruiting processes while utilizing our ATS (Comeet)\n\nREQUIREMENTS\nA recruitment professional with 4+ years of experience in the hi-tech industry\n1+ years as an HRBP in a fast-growing organization.\nExperience in leading in-house recruitment efforts for companies in the hi-tech industry\nVast experience in conducting in-depth face-to-face interviews\nData-driven and have a sense of urgency\nSourcing experience with different tools\nThinking in a creative and out-of-the-box way\nAbility to effectively manage time, prioritize tasks, and work within deadlines\nTeam player with excellent interpersonal skills and the ability to communicate with various interfaces\nSelf-starter that is results-oriented, independent with the ability to lead processes\nExperience in global hiring - Strong Advantage\nExcellent English and Hebrew, both verbal and written - A mustShow more Report"}, {"company": "Fluent Trade Technologies", "job": "Technical Recruiter & HR at Hi-Tech company", "city": "Jerusalem", "date": "30d+", "rating": "3.9", "link": "", "description": "Fluent Trade Technologies is the fastest ‘end-to-end’ data & trading technology provider in the FX, FI and Futures markets.\nFluent is a market leader with a significant tier 1 & 2 client base in the financial world .\nPlease visit us at www.fluenttech.net\nFluent Trade is a global product company with a head office in Jerusalem and a team in Ukraine, EU and the Philippines. We are proud to have top professionals at the Fluent Family and have been expanding it, expecting new projects.\nWe are looking for a candidate who will support the full scope of Technical Recruitment and Human Resources responsibilities to meet the Hi-Tech business needs on hiring and people management. They will maintain and enhance the organization's human resources by attracting candidates, planning, implementing and evaluating human resources policies, programs, and practices.\nWhat you will do:\nSource and arrange Hi-Tech Talent Acquisition in the Jerusalem area, EU, Ukraine and the Philippines\nRecruit in cooperation with the technical hiring team and Onboard new hires\nConduct HR operations and administration not limited to job offers, contracts and personnel data maintaining, trials follow-up, performance management and providing feedback, retention and exit procedures\nManage Payroll and benefits for employees\nResponsibility for the welfare of employees\nWhat you will bring:\n3+ years' experience in both Technical Headhunting/Sourcing and Human Resources in a Hi-Tech Company\nStrong technical sourcing and recruiting with demonstrated ability to improve talent acquisition strategies\nExperience in collaboration with the hiring team and managers to assess their hiring and management needs and expectations\nStrong organizational, critical thinking and communications skills\nAttention to detail and good judgment\nBachelor’s or College Degree\nNote: the office is in Jerusalem (near the train/central bus station)Show more Report"}, {"company": "ג'ויינט ישראל", "job": "HR Generalist", "city": "Jerusalem", "date": "30d+", "rating": "3.4", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=112&ao=1136043&s=58&guid=00000186e63cb61695eeb9788ca5efae&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7b22bfbd&cb=1678900185998&jobListingId=1008410006816&jrtk=3-1-1grj3viqcpkdr801-1grj3pdjcgaig800-55c25a9a0e996aca-", "description": "JDC has a great opportunity for an experienced HR Generalist to become part of a global HR team. The HR Generalist is responsible for providing professional HR management for our offices in the FSU as well as participating in the implementation and support of global/regional HR projects.\n﻿\nResponsibilities:\nRecruitment, employee onboarding, and orientation.\nDevelopment of an annual training and development plan and assistance in its implementation, support of corporate L&D system.\nSupport of the annual Performance Review Process.\nParticipation in workforce planning and salary review processes.\nProvision of data analysis and reports on an ongoing basis.\nParticipation in the development of new HR systems, processes, and operations to ensure greater efficiencies.\nSupport employee well-being (incl. organization of local and global corporate events, recognition programs, monitoring workplace well-being, and conducting surveys).\nConsultation with managers and staff on various HR issues.\nHigher education in Psychology, Human Resource Management, or a related field is preferred.\nAt least 3 years experience in HR positions, preferably in a global company with a branch structure.\nAbility to lead organizational processes, including remotely.\nAbility to multitask and prioritize tasks.\nAbility to maintain a high level of confidentiality and discretion.\nStrong leadership skills.\nExcellent communication and interpersonal skills.\nFluent in Hebrew and English, Russian - mother tongue.\nWe offer:\nWork in an international organization with a multi-cultural environment.\nInvolvement in global HR projects, being part of a global HR team.\nUse of advanced HR technologies for various and interesting tasks.\nProfessional development and learning opportunities.\nWorkplace in Jerusalem, flexibility to work part-time from home.\nJDC is the leading Jewish humanitarian organization in the world, operating in 70 countries. The Former Soviet Union (FSU) is JDC’s largest division, providing comprehensive care services to the elderly and children at risk and leading community programs for ~90,000 people in 11 countries in the FSU region.\nFor over three decades, JDC has been operating in the FSU to save Jewish lives and build Jewish life. In order to fulfill this dual mission, JDC-FSU leads two main endeavors – providing comprehensive care services to the most vulnerable Jews and leading a wide range of community programs in order to empower and promote the development of vibrant Jewish communities in the FSU.\nJDC-FSU maintains an extensive scope of operations and comprehensive service provision through vast local infrastructures developed on the ground. JDC-FSU provides welfare services and community activities in over 2,200 locations throughout the FSU, working through its 14 field offices.\nSend CVs to e-mail: JDC.68.638@applynow.ioOnly relevant candidates will be contacted.Show more Report"}, {"company": "Catholic Relief Services", "job": "Country Representative, JWBG", "city": "Jerusalem", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=1136043&s=58&guid=00000186e63cb61695eeb9788ca5efae&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9d012d43&cb=1678900187480&jobListingId=1008374042735&jrtk=3-1-1grj3vk8434av001-1grj3pdjcgaig800-7adc8d80a40f319e-", "description": "Job Title: Country Representative, JWBG\nReports to: Regional Director for EMECA\n\nDepartment: EMECA\nSalary Grade: 12\n\nAbout CRS:\nCatholic Relief Services carries out the commitment of the Bishops of the United States to assist the poor and vulnerable overseas. Our Catholic identity is at the heart of our mission and operations. We welcome as part of our staff and as partners people of all faiths and secular traditions who share our values and our commitment to serving those in need.\nBackground:\nCatholic Relief Services has been operating in the occupied Palestinian Territory (oPT) since the 1940s and established an office in Jerusalem in 1961. Our programs, undertaken in partnership with an extensive network of local organizations, aim to support peace with justice for all people in the Holy Land, while responding to the humanitarian needs and development aspirations of the Palestinian people.\nCRS’s current programmatic portfolio focuses on humanitarian relief, family resilience, livelihoods, and civil society strengthening programs that contribute towards the promotion of a just, secure, and comprehensive peace in the Holy Land. CRS’s work is funded by a diverse array of public and private donors, and implemented in close partnership with the local Church, through a broad network of local partner organizations. CRS maintains four offices in JWBG, with the main office in East Jerusalem and field offices in the West Bank (Bethlehem & Ramallah) and the Gaza Strip (Gaza City).\nGiven the highly fluid operational environment in the West Bank and Gaza, strong CRS JWBG team, the diversity and innovation of CRS JWBG programs, the importance of the Holy Land to the USCCB and the global Church, and the country program’s long history and strong reputation, CRS is seeking a Country Representative with a record of accomplishment in strategic visioning, outstanding leadership, new program development, representation, and resource acquisition, and sensitivity and commitment to issues impeding peace and justice, and development in the Holey Land.\nPrimary Responsibilities:\nResponsible for overall leadership and management of the CRS country program, including management of personnel, programs, Church, partner and donor relationships, and financial and material resources. As the CRS Country Representative in the Holy Land, significant external representation is expected. Duties also include guiding the development of new programs and partnerships, building local staff/partner capacity and networks, and representing CRS to a wide variety of people. Considerable emphasis will be placed on continued resource acquisition and diversification, including cultivation of current donors and development of new ones.\nSpecific Duties:\nPersonnel Management\nLead and directly supervise the senior management team, including the Head of Programs, Head of Operations, HR & Employee Health Manager, Gaza Head of Office, and Technical Advisor.\nEnsure full implementation of the CRS performance management system for direct reports and their subordinates, including annual performance planning, regular coaching, annual performance assessment, and timely recognition of unique achievements and interventions for struggling staff.\nPromote a culture of continuous learning and professional development, including utilization of CRS professional development plans, emphasis on CRS’s education policy, and frequent in-country learning and dissemination events.\nRecruit, develop, coach, and retain a diverse team of staff to build cadre of skilled and committed personnel.\nDemonstrate, maintain and encourage the principles of a just workplace.\nStrategic and Program Management\nLead the country program team, holding ultimate accountability for the success and reputation of CRS JWBG.\nProvide vision and guidance for annual programming, staff development, resource acquisition, and advocacy plans.\nManage ongoing programs and guide the development and design of new programs in the areas of humanitarian relief, social justice promotion, livelihoods, disaster risk reduction, environmental sustainability, civil society strengthening, and advocacy, in line with CRS’ Regional and Agency strategies.\nEnsure coherence of country program activities and investments with strategy through regular communication and close collaboration with the Regional Director, regional staff, and colleagues in other country programs in the EMECA region.\nEnsure program quality through consistent implementation of project review systems, comprehensive MEAL systems, and staff/partner development.\nRemain well-informed about national and regional issues affecting CRS’ presence and operations in the OPT, its programs and partners.\nEnsure active country program involvement in pursuing and contributing to the objectives of CRS’ strategy for EMECA.\nFinancial/Administrative Management\nWork closely with the Head of Operations, Head of Programs, and Finance Manager to develop and monitor annual and multi-year program budgets.\nEnsure compliance with all CRS and donor regulations and requirements, as well as local laws.\nIdentify areas of risk and take steps to reduce vulnerabilities.\nRepresentation and Growth\nRepresent CRS and share information regularly with local authorities, the Church, local partners, institutional donors, private foundations, other INGOs, the UN, and other relevant networks.\nPursue strategic alliances with Caritas Internationalis and other partners; promote inter-agency coordination, cooperation and co-funding for relevant programs in the country.\nIdentify and negotiate funding opportunities from institutional and non-traditional donors for ongoing and new programs.\nKnowledge, Skills and Abilities:\nExcellent strategic, analytical, systems thinking, and problem-solving skills, with capacity to see the big picture and ability to make sound judgment and decisions.\nExcellent relations management abilities. Ability to relate to people at all levels internally and externally. Strategic in how you approach each relationship.\nTeam leadership abilities with diverse/multi-disciplinary teams. Coaching/mentoring skills.\nStrong communications and presentation skills; able to develop tailored and persuasive messaging for varied audiences.\nProactive, resourceful, solutions-oriented and results-oriented.\nShould have the ability to function well in a stressful environment, stay focused, and maintain sufficient work-life balance with limited options for downtime activity.\nSupervisory Responsibilities: Head of Programs, Head of Operations, Gaza Field Office Manager, HR & Employee Health Manager, and Senior Program Advisor.\nRequired Languages - Fluency in Arabic is highly desirable.\nTravel – Willingness and ability to travel extensively (at least 30%) within the West Bank and Gaza, and occasionally elsewhere in the Middle East.\nKey Working Relationships:\nInternal : Regional Director and regional staff; other EMECA country representatives; EVP Overseas Operations; Chief Financial Officer; colleagues in Overseas Support Department, US Operations, Program Quality & Support Department, Charitable Giving, and Human Resources.\nExternal : Catholic Church, Catholic Coordinating Aid Organizations/CCAO, local partner organizations, host country government agencies, donor agencies, international and national non-governmental organizations, UN agencies, foreign governments.\nPreferred Qualifications:\nDemonstrated experience successfully managing a variety of complex, high-value projects from multiple international donors, including USAID, DFID, and UN agencies; understanding of relevant donor regulations.\nExperience engaging partners and strengthening partnerships. Experience working with Church partners a plus.\nStaff management experience and abilities that are conducive to a learning environment. Experience coaching and mentoring senior program staff.\nAbility to represent the agency at high levels.\nExperience in MS Office package (Excel, Word, PowerPoint, Visio), Web Conferencing Applications, and information and budget management systems.\nDemonstrated record of effective leadership at the CR level\nDemonstrated ability to represent effectively the Catholic, American identity of CRS\nEffective interpersonal and communications skills in an inter-cultural setting\nDemonstrated accomplishments in strategic visioning and new programming development\nProven success in resource acquisition, including cultivation of new donors and partnerships\nExperience in and affinity for institutional strengthening and partnership building\nFamiliarity with the Middle East is a plusShow more Report"}, {"company": "Comeet", "job": "Controller", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.4", "link": "", "description": "Comeet is a fast-growing collaborative recruiting platform. Our mission is to make recruitment scalable, predictable, and enjoyable for managers, HR teams and candidates around the world and help companies hire the right people on time to fuel their growth.\nWe are looking for an experienced Controller to help build and manage all financial policies, processes, procedures, and controls for the scale and efficiency of the business, and assist in driving the company’s financial strategy and planning. You will be responsible for assessing the financial performance of the company as well as possible risks and investments in partnership with the Head of Finance.\nYou bring experience with the challenges that come from scaling company financial processes globally. You are reliable finance professional with broad knowledge of all relevant accounting, financial, and business principles for global technology companies. You are a strategic thinker and effective leader who can make wise, fair, kind, and profitable decisions.\nThe goal is to guide the company towards scale, profitability, employee retention, and long-term success. This position is remote with optional one day in the Tel Aviv office per week and reports directly to the Head of Finance in Israel.\nRequirements:\n\nProven experience as Controller or similar role; minimum of 4 years and up to 6 years of experience as a Controller or other finance operations function.\nIn-depth knowledge of corporate finance and accounting principles, laws and best practices; including US GAAP.\nSolid knowledge of financial analysis and forecasting.\nProficient in the use of MS Office (Excel) and financial management software (Quickbooks, Priority, SaaSOptics, etc).\nAn analytical mind with a strategic ability and the highest standards of accuracy; highly organized, detail-oriented, and mindful of deadlines.\nExcellent organizational and leadership skills; including the ability to work independently, self-learn, and adapt to a fast-changing environment.\nOutstanding communication and interpersonal abilities.\nFluent English - writing and verbal is required.\nBSc/BA in accounting, finance or relevant field; MSc/MA is a plus.\nCPA or other relevant qualification is a plus.\nBig 4 accounting firm, SaaS startup, or High-Tech company experience is an advantage.\nWhy Comeet is your perfect match\nWe’re a values-driven business with a strong passion for innovation that makes a meaningful impact on the world around us. Comeet is a place where you can bring your whole self and be welcomed. It’s a diverse and inclusive company culture with team members in 6+ countries with a remote first mentality.\nResponsibilities:\n\nDrive the financial planning of the company by analyzing its performance and risks.\nRetain constant awareness of the company’s financial position and act to prevent problems.\nSet up and oversee the company’s finance IT system; QuickBooks, Priority, SaaSOptics, etc.\nOversee all audit and internal financial control operations; including maintenance of a system of controls over accounting transactions.\nDevelop the corporate fundraising strategy and manage relationships with partners and investors as needed in partnership with the Head of Finance.\nPrepare timely and detailed reports on financial performance on a monthly, quarterly, and annual basis.\nConduct analysis to make forecasts and report to the management team.\nEnsure adherence to financial laws and guidelines; including preparation of Statutory Financial statements and filing tax returns in Israel and USA.\nWorking with interfaces within the finance department, audit team, outsourced finance functions, corporate, and other departments of the company.\nProvide support to the Head of Finance in all on-going business topics and in strategic projects and initiatives.\nEnsure timely provision of information and service to other departments and stakeholders.\nManage Israel, USA, and all other regions payroll and payment to vendors.\nProvide support to the Head of Finance and CEO in all legal aspects with support from external legal partners.Show more Report"}, {"company": "Sapiens", "job": "VP of M&A", "city": "Holon", "date": "30d+", "rating": "3.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=115&ao=1136043&s=58&guid=00000186e63cb61695eeb9788ca5efae&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d07a5f96&cb=1678900190024&jobListingId=1008421976787&jrtk=3-1-1grj3vmmopke0801-1grj3pdjcgaig800-cbdc951ac733e1fe-", "description": "VP of M&A\nReq ID: 51363\nLocation:\nHolon, IL\nLocation: Holon, Israel\n\n*** We work in a hybrid working model (work from home a few times a week) ***\n\nAbout Us\nSapiens International Corporation (NASDAQ and TASE: SPNS) is a leading global provider of software solutions for the insurance industry, with a growing presence in the financial services sector. We offer integrated core software solutions and business services, and a full digital suite for the property and casualty/general insurance; life, pension, and annuities; and reinsurance markets. Sapiens also services the workers’ compensation and financial and compliance markets.\nOur portfolio includes policy administration, billing, and claims; underwriting, illustration and electronic application; reinsurance and decision management software. Sapiens’ digital platform features customer and agent portals, and a business intelligence platform. With a 30-year track record of delivering to more than 600 organizations, Sapiens’ team of over 5,000 employees operates through our fully-owned subsidiaries in North America, the United Kingdom, EMEA, and Asia Pacific. For more information: www.sapiens.com.\n\nVP of M&A\nThe VP of Mergers and Acquisitions(M&A) will be responsible for the execution of M&A transactions, including pre-LOI analysis, due diligence, and synergy/integration planning. This role requires a strong understanding of finance, business, and accounting principles, as well as excellent analytical, communication, and project management skills.\nThe VP of M&A will work closely with senior leadership and cross-functional teams to ensure that M&A activities align with the company's overall business objectives and drive value for shareholders.\nThis is a true opportunity to join a fast-growing corporate with a broad history and present of acquisitions and growth and shape the future of the InsurTech industry.\nReporting to the CFO and dotted line to the Head of Corporate Development.\n**Part-time jobs, employees, or freelancers on permanent contracts\nKey Responsibilities\nHands-on analysis of financial statements, budgets, and other financial data to assess the financial health and potential of target companies\nManage full due diligence processes, responsible for the different tracks and teams (Product, Business, Accounting, Tax, HR, Operations, etc..)\nConvert Due Diligence Findings into final SPA documentation (together with the Legal teams)\nSupport the Deal Structuring and Valuation\nSkills\nUnderstanding of finance and accounting principles as well as financial modeling skills\nExcellent analytical, communication, and project management skills.\nUnderstand deal structures and valuation models\nPost-Merger planning and integration – nice to have\n\nRequirements\nBachelor's degree in finance or accounting\nA minimum of 5 years of experience in M&A, with a proven track record of hands-on and leading due diligence processes\nAdvanced working knowledge and experience with a full due diligence process, documentation, and negotiation strategies\nStrong understanding of finance, business, and accounting principles\nAbility to build and maintain strong relationships with internal and external stakeholders\nProven experience and skills in team building, time management, conflict resolution, communication, briefing, presentation, and strategic thinking\nExperience working with different cultures, and strong intercultural and interpersonal skills\nAbility to work independently and in a team environment\nMBA or advanced degree in a relevant field is a plus\nPMI experience – an advantageReport"}, {"company": "ASM Global", "job": "Executive Chef", "city": "Central", "date": "30d+", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=1136043&s=58&guid=00000186e63cb61695eeb9788ca5efae&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_de0dfa3d&cb=1678900193399&jobListingId=1008386307952&jrtk=3-1-1grj3vq0f34av001-1grj3pdjcgaig800-b00c162d8e8efd8d-", "description": "Position Announcement: Executive Chef\nMobile Convention Center, Mobile, Alabama\nJOB TITLE: Executive Chef\nDEPARTMENT: Food & Beverage\nREPORTS TO: Director of F&B\nFLSA STATUS: Salaried / Exempt\nESSENTIAL DUTIES AND RESPONSIBILITIES\nDesigns creative menus, analyzes recipes, and determines proper prices for items to be sold at.\nMaintains quality standard when preparing and serving food\nPerforms interviews, hires, schedules, and supervises kitchen staff\nParticipate in weekly catering and event meetings\nConducts safety, sanitation, and maintenance in kitchen\nMaintains food costs while ensuring quality standards are met\nManages inventory of all kitchen supplies\nOrders all food and develops rapport with our numerous purveyors\nObserves kitchen staff while they prepare for events and maintains portion size, proper garnishing of food, and proper handling\nCarries out supervisory responsibilities in accordance with SMG's policies and applicable laws\nDisciplining employees in conjunction with HR; addressing complaints and resolving problems\nAbility to work under limited supervision\nRequires flexible hours including nights and weekends and holidays that vary based on events\nCandidate will manage a kitchen staff of up to 25 people\nDirectly supervises Kitchen personnel. Carries out supervisory responsibilities while following SMG's policies and applicable laws. Responsibilities include interviewing, hiring, and training employees; planning, assigning, and directing work; appraising performance; rewarding; disciplining employees in conjunction with Human Resources; addressing complaints and resolving problems.\nSKILLS AND ABILITIES\nMinimum knowledge, skills and abilities required to this job:\nDemonstrate working knowledge of Food and Beverage operations, including inventory, management and purchasing procedures.\nKnowledge of Menu development and ability to implement effectively.\nPossess skills and experience in employee relations and supervising/training personnel.\nEngage in much decision making that is generally governed by procedure and guided by policy.\nFollow oral and written instructions and communicate effectively with other in both oral and written form.\nOrganize and prioritize work to meet deadlines.\nWork effectively under pressure and/or stringent schedule and produce accurate results.\nMaintain an effective working relationship with clients, employees, exhibitors, patrons and others encountered in the course of employment.\nRemain flexible and adjust to situations as they occur.\nEDUCATION AND WORK EXPERIENCE\nBachelor’s degree from a four-year college/university; and/or Culinary Arts Certificate\nFive or more years of hands on experience\nFive or more years of kitchen/culinary and supervisory experience\nQUALIFICATIONS\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed below are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\nPHYSICAL DEMANDS\nManual dexterity - Regularly required to use hands, to finger, handle or feel.\nReach with hands and arms.\nClimb or balance and stoop, kneel, crouch and crawl to access inventory.\nMay spend long hours in sitting, walking or standing.\nLifting up to 50 lbs.\nOTHER QUALIFICATIONS\nManagement Food Handler Certified.\nTABC Certified\nAbility to prioritize multiple projects and meet strict deadlines\nAbility to work under minimal supervision\nAbility to work flexible hours including nights and weekends in addition to normal business hours\nMust have professional attitude and appearance\nNOTE: The essential responsibilities of this position are described under the headings above. They may be subject to change at any time due to reasonable accommodation or other reasons. Also, this document in no way states or implies that these are the only duties to be performed by the employee occupying this position.\nTo Apply for this position: Please apply online or send a copy of your most recent resume to: https://recruiting.adp.com\nAllison Stewart, Human Resources Coordinator\nSMG-Mobile\n401 Civic Center Dr\nMobile, AL 36602\nASM GLOBAL is an Equal Opportunity/Affirmative Action employer, and encourages Women, Minorities, Individuals with Disabilities, and protected Veterans to apply. VEVRAA Federal ContractorShow more Report"}]