[{"company": "Pfizer", "job": "Pharmaceutical Health Representative CV - Internal Medicine", "city": "Herzliya", "date": "24h", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=101&ao=1136043&s=58&guid=00000186e6300f68a17f76dafb66e764&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_81c8cf29&cb=1678899340259&jobListingId=1008528444530&jrtk=3-1-1grj35orlmbi0801-1grj304u1pkj7800-1268c2f76e5a085a-", "description": "Pfizer Israel is looking for a Talented and Motivated Pharmaceutical Health Representative.\nIsrael (Jerusalem area)\nContract Type: Permanent\nRole summary\nThe Pharmaceutical Health Representative is responsible for calling on practicing physicians, hospitals, managed care (kupot) and other health-related organizations/personnel within an assigned territory. He / She must provide the most current information pertaining to Pfizer Israel products and their approved indications in a manner which will ensure the appropriate use of these products and achieve the business potential of the territory. Accomplishment of these goals must comply with the terms and conditions outlined in the Representatives Pledge of Ethics, Pfizer’s Policy on Business Conduct as well as sampling policies.\nRole responsibilities\nInvest time and effort to achieve the established goals for the territory such as sales, market share, doctor calls, etc.\nDemonstrate extensive product knowledge and excellent Selling skills\nAbility to work in a cross functional team, high coordination and communication abilities\nMaintain the required technical expertise including competitive product knowledge and computer capabilities\nEnsure clear concise and accurate communication of product information using proper medical terminology\nPlan and organize daily sales call activities to optimize the use of time and maximize the achievement of sales and market share objectives\nPrepare, analyze and send sales/patients scanning monthly reports (as requested by DM) in his/her territory\nRecognize changes in the work environment, develop and implement alternative plans to achieve objectives, modify call plan/business plan activities accordingly\nDemonstrate persistence to accomplish objectives despite disappointments and/or rejection of original efforts\nMake daily decisions based on logical and factual information after weighing alternatives and their consequences\nCreate and maintain a positive impression with customers\nProject a professional image as demonstrated by neat physical appearance and appropriate manner of speech\nMaintain timely communication with supervisor and other members of the sales team\nFully comply with the terms and conditions prescribed in the Sales Representatives\nQualifications\nUndergraduate degree or equivalent in science, medicine or pharmacy\nFluent in Hebrew. Working knowledge of English.\nAt least three years sales experience in the pharmaceutical sector (working with Cardiologists- advantage)\nMedical background\nStrong communication and presentation skills\nHigh self-learning ability\nExcellent PC Skills\nAbility to work within an international environment.\nResults driven\nStrong planning and prioritizing skills\nFlexible Competitive\nSelf-motivated\nReliable\nHigh ethical standards\nTeam player\nOther Info\nRequired Driving license\nPurpose\nBreakthroughs that change patients' lives... At Pfizer we are a patient centric company, guided by our four values: courage, joy, equity and excellence. Our breakthrough culture lends itself to our dedication to transforming millions of lives.\nDigital Transformation Strategy\nOne bold way we are achieving our purpose is through our company wide digital transformation strategy. We are leading the way in adopting new data, modelling and automated solutions to further digitize and accelerate drug discovery and development with the aim of enhancing health outcomes and the patient experience.\nFlexibility\nWe aim to create a trusting, flexible workplace culture which encourages employees to achieve work life harmony, attracts talent and enables everyone to be their best working self. Let’s start the conversation!\nEqual Employment Opportunity\nWe believe that a diverse and inclusive workforce is crucial to building a successful business. As an employer, Pfizer is committed to celebrating this, in all its forms – allowing for us to be as diverse as the patients and communities we serve. Together, we continue to build a culture that encourages, supports and empowers our employees.\nSales\n#LI-PFEReport"}, {"company": "Medtronic", "job": "Sales Representative II Patient Monitoring & Respiratory Interventions", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=1136043&s=58&guid=00000186e6300f68a17f76dafb66e764&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_547a15b3&cb=1678899341336&jobListingId=1008407683093&jrtk=3-1-1grj35pumkhok801-1grj304u1pkj7800-2df411b02464b91b-", "description": "Careers that Change Lives\nWe’re a mission-driven leader in medical technology and solutions with a legacy of integrity and innovation.\nWork with us to incentivize better patient care, and partner across the industry to make healthcare more affordable and accessible. Be a part of a community of experts committed to ensuring quality, affordable healthcare worldwide.\nCome strengthen your specialized skills and enhance your expertise. We’ll support you with the training, mentorship, guidance, and networks you need to advance, and empower you to work in the way that’s best for you.\nTogether, we can confront the challenges that will change the face of healthcare. Join us for a career that changes lives.\nThe main purpose of this role is to sell the Patient Monitoring & Respiratory Interventions range of products based on clinical expertise and strong network in order accelerate adoption for new technologies and improve outcome and patient safety.\nA Day in the Life\nThe jobholder is primarily responsible for selling the full range of products in assigned territory in a professional manner to hospitals and related healthcare professionals. He/she will build strong ethical business relationships with customers to ensure usage of our products and expanding the market and penetration, leading through value selling. He / she will cooperate and coordinate activities with the Clinical Application Specialists in the territory in order to maximize PM&RI business opportunities.\nCustomer Management\nAchieve AOP and increase market share and market penetration.\nPresent and sell PM&RI products and services to current and potential customers.\nPrepare presentations, proposals, and sales contracts.\nIdentify and resolve customers concerns.\nCoordinates offers and tenders.\nHandles complaints and back orders.\nRises awareness around solutions. Organizes and coordinates product demo and workshops.\nBusiness Development\nLead with clinical selling activities within the territory. Coordinate with other MDT teams where needed.\nConduct initial product demonstrations and Initiate/coordinate clinical evaluations to OR/ICU/other staff.\nDevelop target list and selling strategy / account mapping.\nPrepare action plans and schedules to identify specific targets in order to achieve our goals.\nFollow up on new leads and referrals resulting from field activity. Identifies / quantifies opportunities and enter them in Salesforce.com.\nOccasionally interacting with purchasing managers / hospital administrators to set up and negotiate broader sales contracts.\nTake a wide organizational view of selling and managing accounts, with sufficient knowledge of competitors and their products.\nMaintain customer knowledge by gathering information about account activities and potential, key decision makers, competitive participation, market share etc.\nSupport & Training\nCommunicate current and new products, special developments, information, or feedback gathered through field activity to appropriate company staff.\nCoordinate with company staff to accomplish the work required to close sales.\nProvide verbal technical support and organize regular in-services.\nPromotes and sells Medtronic's products and services within an assigned geographic area and /or specific customer accounts to meet or exceed sales targets.\nResponsible for developing, building, and strengthening long-term relationships with stakeholders including distributors and healthcare professionals.\nResponsible for pursuing leads, assessing needs and providing product services to maximize the benefits derived from Medtronic's products and/or services.\nPromotes and establishes education of the company's products and/or services.\nConducts market research including customers and competitors' activities.\nImplements market development plans/strategies and changes as needed.\nCommunicates customer feedback on new products and/or modifications to existing products or applications to internal stakeholders including R&D, Operations and Marketing.\nMust Have: Minimum Requirements\nDegree in Life-science, Marketing, Business Administration or Biology, Paramedic or another relevant, advanced degree\nGood selling techniques and excellent selling strategies. As well as thorough knowledge of the decision-making process with customers (economic buyer, reimbursement)\nFluency in English\nProven track record to work independently, highly motivated with a “can do” attitude.\n Nice to have\nParamedic\nExperience in the medical device industry\nAbout Medtronic\nBold thinking. Bolder actions. We are Medtronic.\nWe lead global healthcare technology and boldly attack the most challenging health problems facing humanity by searching out and finding solutions. Our Mission — to alleviate pain, restore health, and extend life — unites a global team of 90,000+ passionate people. Powered by our diverse knowledge, insatiable curiosity, and desire to help all those who need it, we deliver innovative technologies that transform the lives of two people every second, every hour, every day. Expect more from us as we empower insight-driven care, experiences that put people first, and better outcomes for our world.\nIn everything we do, we are engineering the extraordinary.***\nPhysical Requirements\nThe physical demands described within the Responsibilities section of this job description are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the employee is regularly required to be independently mobile. The employee is also required to interact with a computer and communicate with peers and co-workers.\nAt Medtronic, you will find a diverse team of innovators who bring their unique backgrounds and their individual life experiences to work every day. We work hard to cultivate a workforce that reflects our patients and partners, we believe it’s the only way to drive healthcare forward. We want to attract a diverse workforce, regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, sexual orientation, gender identity and/or expression, veteran status, or any other characteristic protected by state or local law. Join us, and bring the power of your point of view to our culture of collaboration and innovation. It is through strong diversity, inclusion, and engagement that we can remain a leader in medical technology and solutions. And by embracing everything you have to offer —your unique perspectives, talents, and contributions —we can live up to the promise of our Mission\n***This position is an exciting and new opportunity to work with Medtronic’s Patient Monitoring, Respiratory Interventions and/or Medtronic Care Management System businesses. Currently a part of Medtronic, these businesses are being transitioned either into a new stand-alone company (currently referred to as NewCo) or will be merged into the business of another company. While you will start your employment with Medtronic, upon establishment of NewCo or upon the transition of the business unit to another company, in approximately 12-15 months your employment will transfer to one of these entities and you will no longer be employed by Medtronic.\nThe business will have the same singular focus, financial commitment, deep domain expertise, and global footprint needed to accelerate the development and commercialization of affordable and scalable healthcare technologiesShow more Report"}, {"company": "Novo Nordisk", "job": "Diabetes Sales Representative - Tel Aviv", "city": "Kfar Saba", "date": "27d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=103&ao=1136043&s=58&guid=00000186e6300f68a17f76dafb66e764&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_fb2b631c&cb=1678899342413&jobListingId=1008476367656&jrtk=3-1-1grj35r0ck622801-1grj304u1pkj7800-73da0a307fabe087-", "description": "Are you passionate about driving sales and developing business relationships? Are you a dynamic & results-oriented individual who loves to drive sales results with a passion for success? If yes, you may be the newest member of our Diabetes Sales team!\n\n\nThe Position\n\nNovo Nordisk Israel is looking for a Sales Representative for the area of Tel Aviv. The position is reporting to the Diabetes Field Sales Manager.\n\nThis role will promote Novo Nordisk products and develop business relationships with primary care physicians, Endocrinologists and Diabetes specialists. You will develop, implement, and update territory business plans to drive sales results. You will participate in conferences held locally for the benefit of your products.\n\n\nQualifications\n\nTo be eligible for the role, you hold a bachelor’s degree in Life science, you are fluent in Hebrew and English, and you have a strong commercial attitude.\n\nWe would also like you to have:\n\nPrevious experience as Sales Representative in the Pharmaceutical industry – Mandatory\nExperience in a pharmaceutical company on prescription products – Mandatory\nDigital orientation and use of Pharmaceutical Customer Relationship Management Systems - Advantage\nPrevious knowledge and experience in the Diabetes field - Advantage\nExcellent communication and interpersonal skills.\n\n\nAbout the Department\n\nOur Diabetes GLP1 Department is responsible for setting local portfolio strategy and for driving key marketing activities amongst Health Care Professionals. You will be a member of energetic and driven professionals and act to improve the daily lives of patients dealing with diabetes. This position represents Novo Nordisk with the goal of maximizing sales and positioning Novo Nordisk as the leading company in Diabetes care.\n\n\nWorking at Novo Nordisk\n\nWe are a proud life-science company, and life is our reason to exist. We’re inspired by life in all its forms and shapes, ups and downs, opportunities, and challenges. For employees at Novo Nordisk, life means many things – from the building blocks of life that form the basis of ground-breaking scientific research, to our rich personal lives that motivate and energise us to perform our best at work. Ultimately, life is why we’re all here - to ensure that people can lead a life independent of chronic disease.\n\n\nContact\n\nIf you believe you are qualified, and are willing to take the challenge, please send your CV directly via our online application tool.\n\nWe thank all applicants for their interest, however, only those candidates selected for inter-views will be contacted\n\n\nDeadline\n\nApply before 16/04/2023\n\n\nWe commit to an inclusive recruitment process and equality of opportunity for all our job applicants.\n\n\nAt Novo Nordisk we recognize that it is no longer good enough to aspire to be the best company in the world. We need to aspire to be the best company for the world and we know that this is only possible with talented employees with diverse perspectives, backgrounds and cultures. We are therefore committed to creating an inclusive culture that celebrates the diversity of our employees, the patients we serve and communities we operate in. Together, we’re life changing.Show more Report"}, {"company": "World Health Organization", "job": "Technical Officer (Primary Health Care)", "city": "Jerusalem", "date": "8d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=104&ao=1136043&s=58&guid=00000186e6300f68a17f76dafb66e764&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_47678d15&cb=1678899343848&jobListingId=1008514178099&jrtk=3-1-1grj35scckui3801-1grj304u1pkj7800-93ac093cb5c62dca-", "description": "Grade: P3\nContractual Arrangement: Temporary appointment under Staff Rule 420.4\nContract Duration (Years, Months, Days): 12 months (subject to availability of funds, satisfactory performance and continuing need for the position)\nJob Posting: Mar 7, 2023, 4:47:13 AM\nClosing Date: Mar 28, 2023, 4:59:00 PM\nPrimary Location: Jerusalem\nOrganization: EM_PSE WHO Representative's Office, Palestine\nSchedule: Full-time\n\nIMPORTANT NOTICE: Please note that the deadline for receipt of applications indicated above reflects your personal device's system settings.\n\nPN 439605\nOBJECTIVES OF THE PROGRAMME\nWithin the overall objective of promoting universal health coverage and strengthening health systems in Palestine, the main strategic objective related to this position is to strengthen primary healthcare in Palestine, while focusing on the family practice approach and in alignment with the National Health Strategy and the attainment of SDG-3.\nDESCRIPTION OF DUTIES\n1. Provide input to the work programme in primary healthcare strengthening in the occupied Palestinian Territory and assist the Health System Lead in the successful implementation of national health systems and primary healthcare policies.\n2. Undertake research on the public health, health system, primary healthcare topics to facilitate the development and implementation of the health system strengthening and public health programmes and activities.\n3. Draft, revise and further develop the national assessment and the national strategy of primary healthcare in Palestine and provide recommendations on a plan of action for improvement in the existing public health policies and health systems.\n4. Draft, revise and further develop the public health and primary healthcare guidelines as needed.\n5. Monitor work plans and budgets including resource mobilization for the work programme and follow up on the implementation of planned activities.\n6. Conduct data analyses and information on best practices and partners' experiences in implementing sustainable health systems with focus on primary healthcare.\n7. Promote WHO policies, programmes and guidelines in health financing through analysis of health care financing strategies aimed at providing recommendations for improving health care financing.\n8. Participate in capacity building in the area of primary health care strengthening.\n9. Conduct a variety of community outreach activities concerning strengthening primary healthcare in Palestine.\n10. Perform all other related duties as assigned.\nREQUIRED QUALIFICATIONS\nEducation\nEssential: A first university degree in Health (medicine or public health).\nDesirable: An advanced university degree (Masters level or above in Health (medicine or public health).\n\nExperience\nEssential: At least five years' experience in health systems strengthening with focus on primary healthcare, developing and policies/strategies that promote strengthening primary healthcare with international exposure.\nDesirable: Demonstrated experience at the international level.Experience in one of the Eastern Mediterranean Region countries.\n\nSkills\nKnowledge of WHO's policies, practices, guidelines and procedures in the related areas and ability to apply them in the country office setting.\nAbility to conduct research and analyze results, identify issues, formulate opinions, make conclusions and recommendations for strengthening health care systems.\nProven knowledge of technical aspects in the field of specialty.\nPublic speaking techniques.\nCommitment to implementing the goal of gender equality by ensuring the equal participation and full involvement of women and men in all aspects of work.\n\nWHO Competencies\nWHO global Competencies model at http://www.who.int/employment/WHO_competencies_EN.pdf?ua=1\nTeamwork\nRespecting and promoting individual and cultural differences\nCommunication\nMoving forward in a changing environment\nProducing results\n\nUse of Language Skills\nEssential: Expert knowledge of English.\n\n\nREMUNERATION\nWHO salaries for staff in the Professional category are calculated in US dollars. The remuneration for the above position comprises an annual base salary starting at USD 64,121 (subject to mandatory deductions for pension contributions and health insurance, as applicable), a variable post adjustment, which reflects the cost of living in a particular duty station, and currently amounts to USD 3356 per month for the duty station indicated above. Other benefits include 30 days of annual leave, allowances for dependent family members, home leave, and an education grant for dependent children.\n\nADDITIONAL INFORMATION\n\nThis vacancy notice may be used to fill other similar positions at the same grade level\nOnly candidates under serious consideration will be contacted.\nInterested candidates are strongly encouraged to apply on-line. For assessment of your application, please ensure that your profile on Stellis is updated; all experience records are entered with elaboration on tasks performed at the time. Kindly note that CV/PHFs inserted via LinkedIn are not accessible.\nA written test may be used as a form of screening.\nIn the event that your candidature is retained for an interview, you will be required to provide, in advance, a scanned copy of the degree(s)/diploma(s)/certificate(s) required for this position. WHO only considers higher educational qualifications obtained from an institution accredited/recognized in the World Higher Education Database (WHED), a list updated by the International Association of Universities (IAU)/United Nations Educational, Scientific and Cultural Organization (UNESCO). The list can be accessed through the link: http://www.whed.net/. Some professional certificates may not appear in the WHED and will require individual review.\nAny appointment/extension of appointment is subject to WHO Staff Regulations, Staff Rules and Manual.\nStaff members in other duty stations are encouraged to apply.\nFor information on WHO's operations please visit: http://www.who.int.\nWHO is committed to workforce diversity.\nWHO prides itself on a workforce that adheres to the highest ethical and professional standards and that is committed to put the WHO Values Charter into practice.\nWHO has zero tolerance towards sexual exploitation and abuse (SEA), sexual harassment and other types of abusive conduct (i.e., discrimination, abuse of authority and harassment). All members of the WHO workforce have a role to play in promoting a safe and respectful workplace and should report to WHO any actual or suspected cases of SEA, sexual harassment and other types of abusive conduct. To ensure that individuals with a substantiated history of SEA, sexual harassment or other types of abusive conduct are not hired by the Organization, WHO will conduct a background verification of final candidates.\nWHO has a smoke-free environment and does not recruit smokers or users of any form of tobacco.\nWHO has a mobility policy which can be found at the following link: http://www.who.int/employment/en/. Candidates appointed to an international post with WHO are subject to mobility and may be assigned to any activity or duty station of the Organization throughout the world.\nApplications from women and from nationals of non and underrepresented Member States are particularly encouraged.\nFor WHO General Service staff who do not meet the minimum educational qualifications, please see e-Manual III.4.1, para 220.Show more Report"}, {"company": "Rookout", "job": "Sales Development Representative", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=1136043&s=58&guid=00000186e6300f68a17f76dafb66e764&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7f98c3c3&cb=1678899344924&jobListingId=1008428131166&jrtk=3-1-1grj35tejkf3o801-1grj304u1pkj7800-8dfdf04b7ec5328f-", "description": "About The Position\nDo you get a kick out of helping businesses succeed? Then you just might be our next Rooketeer! Join our highly-talented dynamic team as we pursue our vision of helping developers deliver better software.\nWith Rookout, developers can review parts of their live code on demand, even while it is running. We simplify and accelerate the data collection process and save hours (or days, or even weeks) of dev and DevOps work.\nAs our Sales Development Rep, you'll get to choose who will be the company's next clients. You will run the entire top of the funnel from choosing the strategic accounts thru speaking with C-level decision-makers and delivering those meetings to the sales reps.\nThis role gives you an opportunity to join a sales team in a growing company and grow your career.\n\nResponsibilities\nThe Sales Development Rep (SDR) works with outbound and inbound demand generation to uncover and craft new opportunities that result in closed business.\nConnecting with prospects in a variety of ways\nDocumenting daily activities\nCollaborate with our Sales and Marketing teams to strategize on named accounts.\nRepresenting Rookout with integrity and professionalism at all times in all written and oral communications\n\nRequirements\nA minimum 1 year of outbound and inbound sales experience in the SaaS/software industry is preferred\nSelling to R&D, Engineering executives and professionals preferred\nClear and polished written communication skills\nExcellent speaking/ listening skills and ability to engage prospects\nFearless attitude and hunter mentality - willing to take intelligent risks\nStrategic planning abilities\nB2B sales experience\nMethodological and organized\nWhat we offer:\nThe anticipated salary range for this role is between $45K-$65K + Variable. Actual starting pay may vary based on a range of factors which can include experience, skills, and scope\nHealth, Dental, and vision insurance are paid fully by the company for the employee\n401k\nCompany stock optionsReport"}, {"company": "Haleon", "job": "Medical Sales Representative", "city": "Israel", "date": "19d", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=106&ao=1136043&s=58&guid=00000186e6300f68a17f76dafb66e764&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f28d24dd&cb=1678899345887&jobListingId=1008489746901&jrtk=3-1-1grj35ucuklte801-1grj304u1pkj7800-c886237da5cfb192-", "description": "Job Description\nSite Name: Field Worker - ISR\nPosted Date: Feb 23 2023\nHello. We’re Haleon. A new world-leading consumer health company. Shaped by all who join us. Together, we’re improving everyday health for billions of people. By growing and innovating our global portfolio of category-leading brands – including Sensodyne, Voltaren, Otrivin, and Centrum – through a unique combination of deep human understanding and trusted science. What’s more, we’re achieving it in a company that we’re in control of. In an environment that we’re co-creating. And a culture that’s uniquely ours. Care to join us. It isn’t a question.\nMedical Sales Representative\nWe are currently recruiting for a Medical Sales Representative to join our Sales Team in Tel Aviv area. In this role you will be working with dentists, specialists, dental hygienists and pharmacists in Kupat Cholim pharmacies.\nWhy You?\nQualifications & Skills:\nAcademic Degree is required\n2+ years of mandatory experience in working with pharmacists of the health funds sector, Kupat Cholim.\nExperience in nutritional supplements / OTC / dermo cosmetics\nEnglish at a communicate level\nPreferred Qualifications & Skills:\nDemonstration of HALEON behaviors to go beyond, focus on what matters most, keep it human\nExperience in prescription medications is an advantage.\nFluent English will be considered a plus\nWhy Join Us?\nThe future of everyday health is changing. And we’re the people changing it. In front of us is an incredible opportunity to go beyond what any of us have done before. And make everyday health more achievable, more inclusive and more sustainable. For more and more people. So join us, as we build one of the world’s leading consumer healthcare companies. Join us to innovate our category-leading brands. To better understand people’s everyday health needs. To tackle the biggest barriers that stand in their way. To change individual and societal behavior. Join us to work with colleagues who share your restless energy. To explore your interests. To stretch yourself to do the best work of your career. And join us, as together we build a working experience that encourages us all to lead happier, healthier, more productive lives. The way we see it, every day is an opportunity for better. And we’re going all in to realize it.\nDiversity, Equity, And Inclusion\nAt Haleon we embrace our diverse workforce by creating an inclusive environment that celebrates our unique perspectives, generates curiosity to create an unmatched understanding of each other, and promotes fair and equitable outcomes for everyone.\nWe’re striving to create a climate where we celebrate our diversity in all forms by treating each other with respect, listening to different viewpoints, supporting our communities, and creating a workplace where your authentic self belongs and thrives.\nWe believe in an agile working culture for all our roles. If flexibility is important to you, we encourage you to explore with our hiring team what the opportunities are.\nCare to join us. Find out what life at Haleon is really like www.haleon.com/careers/\n\nAt Haleon we embrace our diverse workforce by creating an inclusive environment that celebrates our unique perspectives, generates curiosity to create unmatched understanding of each other, and promotes fair and equitable outcomes for everyone. We're striving to create a climate where we celebrate our diversity in all forms by treating each other with respect, listening to different viewpoints, supporting our communities, and creating a workplace where your authentic self belongs and thrives. We believe in an agile working culture for all our roles. If flexibility is important to you, we encourage you to explore with our hiring team what the opportunities are.\n\nAs you apply, we will ask you to share some personal information, which is entirely voluntary. We want to have an opportunity to consider a diverse pool of qualified candidates and this information will assist us in meeting that objective and in understanding how well we are doing against our inclusion and diversity ambitions. We would really appreciate it if you could take a few moments to complete it. Rest assured, Hiring Managers do not have access to this information and we will treat your information confidentially.\n\nHaleon is an Equal Opportunity Employer. All qualified applicants will receive equal consideration for employment without regard to race, color, national origin, religion, sex, pregnancy, marital status, sexual orientation, gender identity/expression, age, disability, genetic information, military service, covered/protected veteran status or any other federal, state or local protected class.\n\nPlease note that if you are a US Licensed Healthcare Professional or Healthcare Professional as defined by the laws of the state issuing your license, Haleon may be required to capture and report expenses Haleon incurs, on your behalf, in the event you are afforded an interview for employment. This capture of applicable transfers of value is necessary to ensure Haleon’s compliance to all federal and state US Transparency requirements.Show more Report"}, {"company": "Abbott Laboratories", "job": "PN Medical Sales Representative", "city": "Tel Aviv-Yafo", "date": "28d", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=107&ao=1136043&s=58&guid=00000186e6300f68a17f76dafb66e764&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_2e3cf5ee&cb=1678899346948&jobListingId=1008471528183&jrtk=3-1-1grj35ve6mfrs801-1grj304u1pkj7800-ff932e44b3dc20b2-", "description": "Pediatric Nutrition Medical Representative\nAbbott Israel ANI is looking for a Pediatric Nutrition Medical Representative\nResponsibility for achieving sales targets by managing the assigned region and through product promotion, provision of information and education to designated customers.\nCORE JOB RESPONSIBILITIES:\nTo achieve trimestral and annual sales plan of Pediatric Nutrition in products as laid out in the sales forecast.\nTo promote Abbott products to the Health Care Professionals (HCP) and to develop relationships and support with Key Opinion Leaders (KOLS) and health care administrators.\nTo conduct sales calls using selling techniques and methodology employed by Abbott.\nTo achieve coverage and frequency of targeted customers as defined by the team leader.\nTo develop and maintain a high level of knowledge in terms of disease areas, products, competitors, health-care trends and environment.\nQUALIFICATIONS:\nEducation\nB.Sc. Nutrition / life science or equivalent\nExperience & Background\nRelevant sales experience\nProfessional employment as a Medical Rep\nFamiliarity computerized work environment\nPersonal Qualifications\nSales oriented.\nHigh verbal skills.\nAbility to work under pressure.\nAssertiveness.\nAbility to work in a team and good interpersonal communication.\nAbility to receive feedback.Show more Report"}, {"company": "Screenovate", "job": "Student Sales Development Representative (SDR)", "city": "Tel Aviv-Yafo", "date": "1 day ago", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=108&ao=1136043&s=58&guid=00000186e6300f68a17f76dafb66e764&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7dd40250&cb=1678899348115&jobListingId=1008527802444&jrtk=3-1-1grj360hk2dug001-1grj304u1pkj7800-5d80331790d08baa-", "description": "cnvrg.io is transforming AI and data science with a code-first platform helping the world's largest companies scale their machine learning with an unparalleled end-to-end solution.\n\nWe are looking for a Student Sales Development Representative (SDR) to join our growing team. The SDR will be responsible for identifying and creating new qualified opportunities for their Account Executive counterparts. As an SDR, you will have the opportunity to work with a talented and experienced team and contribute to the company's growth and success.\n\nGet your foot in the door as a Sales Development Representative in cutting-edge AI technology. You'll learn practical tools and strategies for driving sales such as CRM proficiencies, prospecting, qualifying, and account based targeting. This is perfect for anyone looking to acquire practical sales skills in the field.\n\nWhat will you do?\n\nConduct online research - identify key players, research accounts, generate interest, develop relationships with important stakeholders, and document interactions with prospects in Salesforce and Hubspot.\nResearch inbound leads from marketing activities, create and send personal, strategic, value-add emails, calls, and social messages to engage targeted clients.\nIdentify the needs and challenges of the prospective customer, determine their interest, and schedule discovery meetings with Sales Account Executives.\nQualify inbound leads, advance them to the next step in the sales cycle, and exceed monthly goals of demos.\nRecord activities in the CRM, update and manage sales activities, opportunities, and account information, and maintain prospect information in systems such as Salesforce and HubSpot.\nCommunicate effectively with Account Executives and cross-functionally with Sales, Marketing, Customer Success, and Product teams.\nQualifications\nQualifications and Experience:\nBachelor's / Master's degree student (at least 3 semesters until graduation).\nNative level of written and spoken English - a must (Any additional language is a huge plus).\nA desire to be in a software sales (full cycle) position as a career progression.\nA passion for technology, in particular deep technology.\nAbility to multitask and prioritize large lists of leads.\nAbility to make outbound calls and send out targeted emails on a daily basis.\nStrong written communication, phone, presentation, and interpersonal skills.\nA hard-working team player that is motivated to exceed expectations\n\nAdvantages:\nProficient with CRM software (e.g. Salesforce, Hubspot)\nExperience with ML, AI, and Data products.\nAn eagerness to work in an ever-changing, fast-paced startup environment\nSales experience in SaaS companies - Major Advantage\nExperience with lead follow-up work, responding to and qualifying leads from marketing-generated campaigns and web inquiries\nExperience in an SDR/BDR role\nInside this Business Group\nEnable amazing computing experiences with Intel Software continues to shape the way people think about computing – across CPU, GPU, and FPGA architectures. Get your hands on new technology and collaborate with some of the smartest people in the business. Our developers and software engineers work in all software layers, across multiple operating systems and platforms to enable cutting-edge solutions. Ready to solve some of the most complex software challenges? Explore an impactful and innovative career in Software.\n\nPosting Statement\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance.\n\nBenefits\nWe offer a total compensation package that ranks among the best in the industry. It consists of competitive pay, stock, bonuses, as well as, benefit programs which include health, retirement, and vacation. Find more information about all of our Amazing Benefits here: https://www.intel.com/content/www/us/en/jobs/benefits.html\n\nWorking Model\nThis role will be eligible for our hybrid work model which allows employees to split their time between working on-site at their assigned Intel site and off-site. In certain circumstances the work model may change to accommodate business needs.Show more Report"}, {"company": "Cisco Systems", "job": "Virtual Sales Account Manager-Israel Market", "city": "Netanya", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=109&ao=1136043&s=58&guid=00000186e6300f68a17f76dafb66e764&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6cd98918&cb=1678899349178&jobListingId=1008417410506&jrtk=3-1-1grj361jnpkcs801-1grj304u1pkj7800-ab6c82a623b91e95-", "description": "Please note this posting is to advertise potential job opportunities. This exact role may not be open today, but could open in the near future. When you apply, a Cisco representative may contact you directly if a relevant position opens.\nAre you passionate about being challenged and appreciated while embarking in a dynamic career? In an environment where colleagues become friends, where managers actively coach and where creativity and ambition are valued?\nWhat You'll Do\nResponsibilities will include all aspects of sales to Commercial accounts (Small, Medium and Large businesses), including marketing, prospecting and cold-calling, account profiling, pipeline creation, network designs and product configurations, unsolicited proposals, collaborative engagement of internal and external Cisco partners, resellers, and resources, post-sale management, and ultimate customer satisfaction and loyalty.\nYou will have a strong virtual alliance with field team in a very high-expectation, results-oriented environment accustomed to rapid execution of strategy resulting in quota retirement and stretch goal attainment.\nYou will drive the strategy for joint project & pipeline work through and with partner AM level dependent on partner competence- be the primary interface between customer and Partner AM team.\nYou will also execute a sales engagement model between Cisco channel sales teams and partner Account managers by focusing on major end customer opportunities only - owning the forecasting.\nYou will develop territory & account plans on selected market opportunities, prioritize internal and external (virtual) resources & executes to meet or exceed sales quota.\nWho You'll Work With\nThe Global Virtual Sales organization is one of Cisco’s fastest growing sales teams and is the talent engine for Cisco Sales with diverse and motivated teams that consistently deliver profitable growth.\nWe serve our customer life-cycle through a series of selling motions to drive higher value and an optimal experience from Cisco solutions. We are a dynamic and international team that brings excitement to the sales floor every single day. We connect Cisco customers with solutions that can transform their businesses and change the world for the better.\nWe will provide you with a platform for success including: mentoring, training and on-the-job learning that will strongly support you in your career advancement. You will discover a creative, flexible and award-winning working environment using the latest Cisco technology to enable and empower you to perform to the very best of your abilities. Our teams adapt quickly in response to market changes and we are all highly encouraged to give back to our local communities.\nWho You Are\nIf you love selling in a changing environment, are achievement-oriented and believe in performance rewards for exceeding annual sales goals though strong collaboration with partners and internal stakeholders, we have a place for you.\nOur minimum requirements for this role:\nExperience in similar or adjacent industry, start-up or consultancy company\nThe love for IT and ability to tap into technology\nSales experience or Technical/Customer service background\nFluent Hebrew and English required\nWhy Cisco?\n#WeAreCisco. We are all unique, but collectively we bring our talents to work as a team, to develop innovative technology and power a more inclusive, digital future for everyone. How do we do it? Well, for starters – with people like you!\nNearly every internet connection around the world touches Cisco. We’re the Internet’s optimists. Our technology makes sure the data travelling at light speed across connections does so securely, yet it’s not what we make but what we make happen which marks us out. We’re helping those who work in the health service to connect with patients and each other; schools, colleges and universities to teach in even the most challenging of times. We’re helping businesses of all shapes and size to connect with their employees and customers in new ways, providing people with access to the digital skills they need and connecting the most remote parts of the world – whether through 5G, or otherwise.\nWe tackle whatever challenges come our way. We have each other’s backs, we recognise our accomplishments, and we grow together. We celebrate and support one another – from big and small things in life to big career moments. And giving back is in our DNA (we get 10 days off each year to do just that).\nWe know that powering an inclusive future starts with us. Because without diversity and a dedication to equality, there is no moving forward. Our 30 Inclusive Communities, that bring people together around commonalities or passions, are leading the way. Together we’re committed to learning, listening, caring for our communities, whilst supporting the most vulnerable with a collective effort to make this world a better place either with technology, or through our actions.\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us! #WeAreCisco\nMessage to applicants applying to work in the U.S.:\n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire, full-time salaries in U.S. locations, not including equity or benefits. For non-sales roles the hiring ranges reflect base salary only; employees are also eligible to receive annual bonuses. Hiring ranges for sales positions include base and incentive compensation target. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications, or training. Applicants may not be eligible for the full salary range based on their U.S. hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.\nU.S. employees have access to quality medical, dental and vision insurance, a 401(k) plan with a Cisco matching contribution, short and long-term disability coverage, basic life insurance and numerous wellbeing offerings. Employees receive up to twelve paid holidays per calendar year, which includes one floating holiday, plus a day off for their birthday. Employees accrue up to 20 days of Paid Time Off (PTO) each year and have access to paid time away to deal with critical or emergency issues without tapping into their PTO. We offer additional paid time to volunteer and give back to the community. Employees are also able to purchase company stock through our Employee Stock Purchase Program.\nEmployees on sales plans earn performance-based incentive pay on top of their base salary, which is split between quota and non-quota components. For quota-based incentive pay, Cisco pays at the standard rate of 1% of incentive target for each 1% revenue attainment against the quota up to 100%. Once performance exceeds 100% quota attainment, incentive rates may increase up to five times the standard rate with no cap on incentive compensation. For non-quota-based sales performance elements such as strategic sales objectives, Cisco may pay up to 125% of target. Cisco sales plans do not have a minimum threshold of performance for sales incentive compensation to be paid.Show more Report"}, {"company": "Abbott Laboratories", "job": "Sales Force Efficiency (SFE) Associate", "city": "Tel Aviv-Yafo", "date": "28d", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=110&ao=1136043&s=58&guid=00000186e6300f68a17f76dafb66e764&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4efde753&cb=1678899350958&jobListingId=1008473408534&jrtk=3-1-1grj363asjijl801-1grj304u1pkj7800-714ac9336f01cfb6-", "description": "Sales Force Efficiency (SFE) Associate\nAbout Abbott\nAbbott is a global healthcare leader, creating breakthrough science to improve people’s health. We’re always looking towards the future, anticipating changes in medical science and technology.\nWorking at Abbott\nAt Abbott, you can do work that matters, grow, and learn, care for yourself and family, be your true self and live a full life. You will have access to:\nCareer development with an international company where you can grow the career you dream of.\nA company recognized as a great place to work in dozens of countries around the world and named one of the most admired companies in the world by Fortune.\nA company that is recognized as one of the best big companies to work for as well as a best place to work for diversity, working mothers, female executives, and scientists.\nThe Opportunity\nThis position works out of our Israel, Tel Aviv location in the Pediatric and Medical Nutrition division.\nAs a SFE Specialist you will optimize Sales Force Efficiency and effectiveness through the development, delivery, and implementation of SFE activities across brands. This includes the integration, monitoring and analysis of performance data, sales activities, and other support recommendations via the sales management team to achieve optimal levels of performance (and results).\nYou will collaborate with other functional teams to deploy segmentation and targeting programs across channels and platforms to optimize business outcomes and successfully achieve strategy.\nWhat You’ll Do\nIntegrate ethical, trade and BI / CRM to develop SFE programs that drive business needs and support sales strategy.\nDevelop, implement, and monitor incentive/compensation programs in support of sales objectives across brands.\nProactively assess and make recommendations in support of sales force development, supporting cross-functional collaboration and initiating development activities through the training team and other support functions.\nSet and track targets and KPIs at various levels and across platforms (includes ethical, trade, BI/ CRM), employing a structured approach to problem-solving to identify and recommend solutions to the root cause(s) of problems.\nLead governance of all internal SFE projects.\nBuild strategic partnership and communications across the organization, as required, to gain buy-in and support for SFE initiatives.\nAct in alignment with compliance and regulatory expectations\nRequired and Preferred Qualifications\nBA in economics/ business management or similar\n3-4 year of experience as Senior Trade Analyst or SFE role, in pharma sector, preferable in multinational companies\nHigh level of Hebrew and English\nHigh digital literacy and systems-thinking approach to integrating digital as a core component of strategy\nEffective negotiation and collaboration with stakeholders, managing differing priorities, personalities, styles, etc.\nVery strong data management and analytics expertise\nAbility to translate data into human behavior, and communicate insights to non-experts\nKnowledge of salesforce automation and ability to translate desired results into appropriate processes\nRepresentative, with high level of presentation skills\nApply Now with English CV\nFollow your career aspirations to Abbott for diverse opportunities with a company that can help you build your future and live your best life. Abbott is an Equal Opportunity Employer, committed to employee diversity.\nConnect with us at www.abbott.com, on Facebook at www.facebook.com/Abbott and on Twitter @AbbottNews and @AbbottGlobal.Show more Report"}, {"company": "INTEL", "job": "Student Sales Development Representative (SDR)", "city": "Tel Aviv-Yafo", "date": "16d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=111&ao=1136043&s=58&guid=00000186e6300f68a17f76dafb66e764&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b21435b9&cb=1678899352165&jobListingId=1008494855649&jrtk=3-1-1grj364guklv1801-1grj304u1pkj7800-bb8c5bcb0b2005e7-", "description": "Job Description\ncnvrg.io is transforming AI and data science with a code-first platform helping the world's largest companies scale their machine learning with an unparalleled end-to-end solution.\n\nWe are looking for a Student Sales Development Representative (SDR) to join our growing team. The SDR will be responsible for identifying and creating new qualified opportunities for their Account Executive counterparts. As an SDR, you will have the opportunity to work with a talented and experienced team and contribute to the company's growth and success.\n\nGet your foot in the door as a Sales Development Representative in cutting-edge AI technology. You'll learn practical tools and strategies for driving sales such as CRM proficiencies, prospecting, qualifying, and account based targeting. This is perfect for anyone looking to acquire practical sales skills in the field.\n\nWhat will you do?\n\nConduct online research - identify key players, research accounts, generate interest, develop relationships with important stakeholders, and document interactions with prospects in Salesforce and Hubspot.\nResearch inbound leads from marketing activities, create and send personal, strategic, value-add emails, calls, and social messages to engage targeted clients.\nIdentify the needs and challenges of the prospective customer, determine their interest, and schedule discovery meetings with Sales Account Executives.\nQualify inbound leads, advance them to the next step in the sales cycle, and exceed monthly goals of demos.\nRecord activities in the CRM, update and manage sales activities, opportunities, and account information, and maintain prospect information in systems such as Salesforce and HubSpot.\nCommunicate effectively with Account Executives and cross-functionally with Sales, Marketing, Customer Success, and Product teams.\nQualifications\nQualifications and Experience:\nBachelor's / Master's degree student (at least 3 semesters until graduation).\nNative level of written and spoken English - a must (Any additional language is a huge plus).\nA desire to be in a software sales (full cycle) position as a career progression.\nA passion for technology, in particular deep technology.\nAbility to multitask and prioritize large lists of leads.\nAbility to make outbound calls and send out targeted emails on a daily basis.\nStrong written communication, phone, presentation, and interpersonal skills.\nA hard-working team player that is motivated to exceed expectations\n\nAdvantages:\nProficient with CRM software (e.g. Salesforce, Hubspot)\nExperience with ML, AI, and Data products.\nAn eagerness to work in an ever-changing, fast-paced startup environment\nSales experience in SaaS companies - Major Advantage\nExperience with lead follow-up work, responding to and qualifying leads from marketing-generated campaigns and web inquiries\nExperience in an SDR/BDR role\nInside this Business Group\nEnable amazing computing experiences with Intel Software continues to shape the way people think about computing – across CPU, GPU, and FPGA architectures. Get your hands on new technology and collaborate with some of the smartest people in the business. Our developers and software engineers work in all software layers, across multiple operating systems and platforms to enable cutting-edge solutions. Ready to solve some of the most complex software challenges? Explore an impactful and innovative career in Software.\n\nPosting Statement\nAll qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance.\n\nBenefits\nWe offer a total compensation package that ranks among the best in the industry. It consists of competitive pay, stock, bonuses, as well as, benefit programs which include health, retirement, and vacation. Find more information about all of our Amazing Benefits here: https://www.intel.com/content/www/us/en/jobs/benefits.html\n\nWorking Model\nThis role will be eligible for our hybrid work model which allows employees to split their time between working on-site at their assigned Intel site and off-site. In certain circumstances the work model may change to accommodate business needs.\nJobType\nHybridShow more Report"}, {"company": "Medtronic", "job": "Sales Representative Surgical Innovations for the Center of Israel II", "city": "Tel Aviv-Yafo", "date": "29d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=112&ao=1136043&s=58&guid=00000186e6300f68a17f76dafb66e764&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_01375fc9&cb=1678899353119&jobListingId=1008471140933&jrtk=3-1-1grj365ebkuie801-1grj304u1pkj7800-4774dbe8b927e91f-", "description": "Careers that Change Lives\nThe main purpose of this role is to sell the Surgical Innovations range of products based on clinical expertise in order accelerate adoption for new technologies and and improve outcome for the patients.\nA Day in the Life\nThe jobholder is primarily responsible for selling the full range of products in assigned accounts or regions in a professional manner to hospitals and related healthcare professionals. He/she will build strong ethical business relationships with customers to ensure usage of our products and expanding the market and penetration, leading through value selling. He / she will cooperate and coordinate activities with the team in the territory in order to maximize the SI business opportunities.\nCustomer Management\nAchieve agreed budgets, focused on sales growth.\nPresent and sell SI products and services to current and potential clients.\nPrepare presentations, proposals and sales contracts.\nIdentify and resolve client concerns.\nCoordinates offers and tenders.\nHandles complaints and back orders\nRises awareness around solutions and organizes and coordinates product demo and workshops\nBusiness Development\nLead with clinical selling activities within the territory. Coordinate with other MDT teams where needed.\nIs able to conduct initial product demonstrations and Initiate/coordinates clinical evaluations to surgical staff.\nWorking with the RSM to develop target list and selling strategy / account mapping.\nPrepare action plans and schedules to identify specific targets in order to achive our goals.\nFollow up on new leads and referrals resulting from field activity. Identifies / quantifies opportunities and enter them in Salesforce.com.\nPrepare paperwork to activate and maintain contract services.\nOccasionally interacting with purchasing managers / hospital administrators to set up and negotiate broader sales contracts.\nTake a wide organisational view of selling and managing accounts, with sufficient knowledge of competitors and their products.\nMaintain customer knowledge by gathering information about account activities and potential, key decision makers, competitive participation, market share etc.\nSupport & Training\nCommunicate new product, special developments, information, or feedback gathered through field activity to appropriate company staff.\nCoordinate company staff to accomplish the work required to close sales.\nProvide verbal technical support and organise regular in-services.\nResponsibilities may include the following and other duties may be assigned.\nPromotes and sells Medtronic's products and services within an assigned geographic area and /or specific customer accounts to meet or exceed sales targets.\nResponsible for developing, building, and strengthening long-term relationships with stakeholders including distributors and healthcare professionals.\nResponsible for pursuing leads, assessing needs and providing product services to maximize the benefits derived from Medtronic's products and/or services.\nPromotes and establishes education of the company's products and/or services.\nConducts market research including customers and competitors activities.\nImplements market development plans/strategies and changes as needed.\nCommunicates customer feedback on new products and/or modifications to existing products or applications to internal stakeholders including R&D, Operations and Marketing.\nMust Have\nDegree in Life-science, Marketing, Business Administration or Biology or another relevant, advanced degree\nGood selling techniques and excellent selling strategies\nThorough knowledge of the competitive marketplace\nThorough knowledge of the decision making process with customers (economic buyer, reimbursement)\nFluency in English\nProven ability to effectively operate and communicate in a matrix environment and work effectively with physician customers, KOL’s and across district and organizational boundaries.\n Successful track record with sales results.\n Ability to manage a multi-product network.\nProven track record to work independently, while achieving aggressive personal and geographic objectives. Highly motivated, “can do” attitude.\nProven track record of good judgment. Demonstrated integrity and respect of peers.\nProven track record in business planning analysis and strategic planning\nComputer literacy\nFull clean drivers licence\nProven evidence of Medtronic Core Competencies\nResults Orientation · Integrity\nInterpersonal Effectiveness · Quality Orientation\nContinuous Learning · Innovation\nAbout Medtronic\nTogether, we can change healthcare worldwide. At Medtronic, we push the limits of what technology, therapies and services can do to help alleviate pain, restore health and extend life. We challenge ourselves and each other to make tomorrow better than yesterday. It is what makes this an exciting and rewarding place to be.\n\nWe want to accelerate and advance our ability to create meaningful innovations - but we will only succeed with the right people on our team. Let’s work together to address universal healthcare needs and improve patients’ lives. Help us shape the future.\n\nPhysical Job Requirements\n\nThe physical demands described within the Responsibilities section of this job description are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. For Office Roles: While performing the duties of this job, the employee is regularly required to be independently mobile. The employee is also required to interact with a computer, and communicate with peers and co-workers. Contact your manager or local HR to understand the Work Conditions and Physical requirements that may be specific to each role. (ADA-United States of America)Show more Report"}, {"company": "Abbott Laboratories", "job": "Medical Sales Representative", "city": "Tel Aviv-Yafo", "date": "10d", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=1136043&s=58&guid=00000186e6300f68a17f76dafb66e764&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_108a516a&cb=1678899354648&jobListingId=1008509501536&jrtk=3-1-1grj366u4k6dq801-1grj304u1pkj7800-0170a0ca8c313ec6-", "description": "Medical Sales Representative – Temp for Maternity Leave Cover (Jerusalem & South)\nCORE JOB RESPONSIBILITIES:\nTo achieve annual sales plan of Established Pharmaceuticals Division (EPD) products as laid out in the sales forecast.\nTo promote Abbott products to the Health Care Professionals (HCP) and to develop relationships and support with Key Opinion Leaders (KOLS) and health care administrators.\nTo conduct sales calls using selling techniques and methodology employed by Abbott.\nTo achieve coverage and frequency of targeted customers as defined by the team leader.\nTo develop and maintain a high level of knowledge in terms of disease areas, products, competitors, health-care trends and environment.\nGENERAL RESPONSIBILITY:\nTo manage the Area as defined by Team Leader:\nConstantly update and maintain the quality of the customers list.\nPossess knowledge of health care infrastructure in the area and update team leader.\nInitiate, organize and conduct representative lectures and Journal Club Events with Health Care Professionals (HCP).\nProactively collect information of HCP organized professional events, to identify sponsorship opportunities to product promotion.\nProactively analyze business situation in the area, propose special activities and actions for products promotion.\nReporting – Periodical area report as requested by team leader.\nTo maintain standards of conduct in line with Abbott code of business conduct\nThis is a field position - Job requires meeting doctors across country and specific in south of Israel and Jerusalem area.\nQUALIFICATIONS:\nEducation - B.Sc. life science or equivalent must\nExperience & Background - Relevant sales experience - Must, Professional employment as a Medical Rep - an advantage,\nFamiliarity computerized work environment.\nPersonal Qualifications - Sales oriented, High verbal skills, Ability to work under pressure, Assertiveness, Ability to work in a team and good interpersonal communication, Ability to receive feedback.Report"}, {"company": "Airalo", "job": "Customer Support Representative (Hebrew)", "city": "Israel", "date": "30d+", "rating": "3.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=114&ao=1136043&s=58&guid=00000186e6300f68a17f76dafb66e764&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_3add30ce&cb=1678899356337&jobListingId=1008344054192&jrtk=3-1-1grj368j9kbkh801-1grj304u1pkj7800-0821b0cca7b79f8e-", "description": "About Airalo\nAlo! Airalo is the world’s first eSIM store that helps people to connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry.\nWe are a traveltech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team spreads across 20+ countries and six continents. What glues us together is our commitment to changing the way you connect.\n\nAbout you\nWe hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement, both in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.\nAbout the Role\nPosition: Full-time / Employee\nLocation: Remote-first\nBenefits: Employee Stock Option, Work-from-home stipend, Annual wellness credit & other benefits\nPlease submit your resume in English, thank you!\nWe are currently looking for a full-time Support Representative to join our Airalo Support department. Being one of the members of a lean and cross-functional team, you will have an opportunity to impact the overall growth of the organization. As an equal member of our team, you will also have employee stock options among other perks as part of your role.\nAs the Support Representative, your target will be to ensure Airalo and its sister products provide excellent service standards and maintain high customer satisfaction. You will be responsible to help our users with the decision, purchase, installation, usage, troubleshooting, maintenance, or disposal stages of our products. You will be expected to become an expert in Airalo and our sister products and to provide outstanding support to our users by effectively following customer service procedures, implementing support guidelines, and setting and upkeeping customer satisfaction goals.\nResponsibilities include but are not limited to:\nClosely work with the Director of Support on day-to-day operations\nCoordinate with our international support department to meet customer satisfaction goals\nFollow department procedures, policies, and standards\nExcel in Airalo panels and other support venues\nRespond to support issues in a timely manner via ticketing\nProvide assistance with online reviews of our products\nContribute to customer service analytics and detailed reports\nAttend weekly and monthly meetings and engage in productive deliberation\nTake good care of your own mental, physical, emotional, and spiritual health\nMust-haves:\nA minimum of 3 years of proven experience in customer service or a related position\nProficiency in Microsoft Office, Google Workspace, and customer service software\nFluency in English and Hebrew\nGood written and verbal communication skills\nGood systems thinking capabilities\nGood division of labor skills\nGood analytical and deductive reasoning skills\nGood understanding of customer service practices and techniques\nBachelor’s degree\nGood to have:\nFluency in other languages.\nPrior work experience in telecommunications\nKnowledge of eSIM and GSMA related technologies and services\nWe sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo.Show more Report"}, {"company": "Medtronic", "job": "Patient Services Representative -Hebrew & Russian Speaker II", "city": "Tel Aviv-Yafo", "date": "3d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=115&ao=1136043&s=58&guid=00000186e6300f68a17f76dafb66e764&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_db99e09c&cb=1678899357582&jobListingId=1008523755260&jrtk=3-1-1grj369oag2r1801-1grj304u1pkj7800-dbfb8b3f1f2f3931-", "description": "Careers that Change Lives\nWe’re a mission-driven leader in medical technology and solutions with a legacy of integrity and innovation.\nWork with us to incentivize better patient care, and partner across the industry to make healthcare more affordable and accessible. Be a part of a community of experts committed to ensuring quality, affordable healthcare worldwide.\nCome strengthen your specialized skills and enhance your expertise.\nWe’ll support you with the training, mentorship, guidance, and networks you need to advance, and empower you to work in the way that’s best for you.\nTogether, we can confront the challenges that will change the face of healthcare. Join us for a career that changes lives.\nA Day in the Life\nThe Patient Service representatives are in contact with diabetes patients, or parents of young patients and provide support, answers and solutions to questions regarding products usage, warranty and more They also meet patients upon needs and provide face to face support.\nAs Patient Service representative you will work as part of the customer service team and in close contact with other teams in the diabetes business unit.\nFuture of Work\nIn this role you will be able to work in a Hybrid Work Model. Talk about this with your interviewer for more information.\nMust Have:\nProven experience in customer service positions\nFilmier with CRM and ERP systems\nFluent in Hebrew & Russian and English\nNice to have:\nExperience from medical device industry\nExperience in customer retention\nAbout Medtronic\nBold thinking. Bolder actions. We are Medtronic.\nWe lead global healthcare technology and boldly attack the most challenging health problems facing humanity by searching out and finding solutions. Our Mission — to alleviate pain, restore health, and extend life — unites a global team of 90,000+ passionate people. Powered by our diverse knowledge, insatiable curiosity, and desire to help all those who need it, we deliver innovative technologies that transform the lives of two people every second, every hour, every day. Expect more from us as we empower insight-driven care, experiences that put people first, and better outcomes for our world.\nIn everything we do, we are engineering the extraordinary.\nPhysical Requirements\nThe physical demands described within the Responsibilities section of this job description are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the employee is regularly required to be independently mobile. The employee is also required to interact with a computer and communicate with peers and co-workers.\nAt Medtronic, you will find a diverse team of innovators who bring their unique backgrounds and their individual life experiences to work every day. We work hard to cultivate a workforce that reflects our patients and partners, we believe it’s the only way to drive healthcare forward. We want to attract a diverse workforce, regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, sexual orientation, gender identity and/or expression, veteran status, or any other characteristic protected by state or local law. Join us and bring the power of your point of view to our culture of collaboration and innovation. It is through strong diversity, inclusion, and engagement that we can remain a leader in medical technology and solutions. And by embracing everything you have to offer —your unique perspectives, talents, and contributions —we can live up to the promise of our MissionShow more Report"}, {"company": "Medtronic", "job": "Patient Services Representative for the Arab Sector", "city": "Israel", "date": "27d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=1136043&s=58&guid=00000186e6300f68a17f76dafb66e764&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_5134d5ba&cb=1678899358836&jobListingId=1008476659518&jrtk=3-1-1grj36avqkf3p801-1grj304u1pkj7800-717f81410ebf8e37-", "description": "Careers that Change Lives\nWe’re a mission-driven leader in medical technology and solutions with a legacy of integrity and innovation.\nWork with us to incentivize better patient care, and partner across the industry to make healthcare more affordable and accessible. Be a part of a community of experts committed to ensuring quality, affordable healthcare worldwide.\nCome strengthen your specialized skills and enhance your expertise.\nWe’ll support you with the training, mentorship, guidance, and networks you need to advance, and empower you to work in the way that’s best for you.\nTogether, we can confront the challenges that will change the face of healthcare. Join us for a career that changes lives.\nA Day in the Life\nThe Patient Service representatives are in contact with diabetes patients, or parents of young patients and provide support, answers and solutions to questions regarding products usage, warranty and more They also meet patients upon needs and provide face to face support.\nAs Patient Service representative you will work as part of the customer service team and in close contact with other teams in the diabetes business unit.\nFuture of Work\nIn this role you will be able to work in a Hybrid Work Model. Talk about this with your interviewer for more information.\nMust Have:\nProven experience in customer service positions\nAn academic degree\nFluent in Hebrew , Arabic and English\nFilmier with CRM and ERP systems\nNice to have:\nExperience from medical device industry\nExperience in customer retention\nAbout Medtronic\nBold thinking. Bolder actions. We are Medtronic.\nWe lead global healthcare technology and boldly attack the most challenging health problems facing humanity by searching out and finding solutions. Our Mission — to alleviate pain, restore health, and extend life — unites a global team of 90,000+ passionate people. Powered by our diverse knowledge, insatiable curiosity, and desire to help all those who need it, we deliver innovative technologies that transform the lives of two people every second, every hour, every day. Expect more from us as we empower insight-driven care, experiences that put people first, and better outcomes for our world.\nIn everything we do, we are engineering the extraordinary.\nPhysical Requirements\nThe physical demands described within the Responsibilities section of this job description are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the employee is regularly required to be independently mobile. The employee is also required to interact with a computer and communicate with peers and co-workers.\nAt Medtronic, you will find a diverse team of innovators who bring their unique backgrounds and their individual life experiences to work every day. We work hard to cultivate a workforce that reflects our patients and partners, we believe it’s the only way to drive healthcare forward. We want to attract a diverse workforce, regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, sexual orientation, gender identity and/or expression, veteran status, or any other characteristic protected by state or local law. Join us and bring the power of your point of view to our culture of collaboration and innovation. It is through strong diversity, inclusion, and engagement that we can remain a leader in medical technology and solutions. And by embracing everything you have to offer —your unique perspectives, talents, and contributions —we can live up to the promise of our MissionShow more Report"}, {"company": "GSK", "job": "Medical Representative for HCP's in hospitals", "city": "Israel", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=117&ao=1136043&s=58&guid=00000186e6300f68a17f76dafb66e764&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6881231b&cb=1678899360268&jobListingId=1008385779403&jrtk=3-1-1grj36cedpkcv801-1grj304u1pkj7800-51157ff3e7133c92-", "description": "Site Name: Field Worker - ISR\nPosted Date: Jan 20 2023\nAre you energized by a commercial sales role that allows you to accelerate customer growth and shape short and long-term business goals? If so, this Sales role could be an ideal opportunity to explore.\nTo represent GSK in identifying the right patients for the right product through engagement with the customers based on our values, with key roles:\nRepresenting GSK in identifying right targeted patients with appropriate product in various indications for the patient’s benefits through engagement with HCPs align with our value and expectation.\nTo explore opportunities in targeted HCPs to expand reach and access to introduce GSK’s product for the appropriate patients.\nEstablish S&T (segmentation & targeting) and to incorporate into the business plan to explore reach to align GSK’s product with the right patients though the right customers.\nAcquiring Good Selling Outcome (GSO) to deliver on sales expectation\nDriving strategic approach align with Brand Strategy via Territory Business Planning with clear Plan of Action (POA)\nTo plan and execute Rep-led activities, i.e. Webinars, Group Doctors Meetings.\nBe proficient at scientific knowledge selling of GSK innovative product across various indications\nAchieve set sales targets and SFI KPI\nDemonstrate sense of urgency and agility to implement changes according to market dynamics\nDeliver Lead activities through Omnichannel approach\nAdopt GSK Culture in all daily activities and execution\nPromote within the Promotional and Marketing Code of Ethics.\nStrict compliance to Company Policies and Procedures – T&E, Pharmacovigilance, Promo, and marketing code of ethics.\nCross functional engagement, including with Medical, Marketing, Training,\nTimely submission of Veeva and other reports requirements\nWhy you?\nWe are looking for professionals with these required skills to achieve our goals:\nREQUIRED QUALIFICATIONS:\nBSc\nExperience in working with HCP's in hospitals\nCOMPETENCIES REQUIRED (EXPERT AND ABOVE):\nHigh learning abilities\nFull field work from center to northern territory\nPresentation Skills\nAnalytical\nPlanning and Organization\nAccountable for impact through patient focus selling\nSelling skills\nCommunication skills\nProactive\nTeamwork\nKNOWLEDGE:\nTerritory Management- Veeva, Business Plan\nCustomer Profiling – Segmentation and Targeting\nTechnical knowledge on disease and product.\nGood Selling Outcome (GSO)\nOmnichannel\nGSK is a global biopharma company with a special purpose – to unite science, technology and talent to get ahead of disease together – so we can positively impact the health of billions of people and deliver stronger, more sustainable shareholder returns – as an organisation where people can thrive. Getting ahead means preventing disease as well as treating it, and we aim to impact the health of 2.5 billion people around the world in the next 10 years.\nOur success absolutely depends on our people. While getting ahead of disease together is about our ambition for patients and shareholders, it’s also about making GSK a place where people can thrive. We want GSK to be a workplace where everyone can feel a sense of belonging and thrive as set out in our Equal and Inclusive Treatment of Employees policy. We’re committed to being more proactive at all levels so that our workforce reflects the communities we work and hire in, and our GSK leadership reflects our GSK workforce.\nIf you require an accommodation or other assistance to apply for a job at GSK, please contact the GSK Service Centre at 1-877-694-7547 (US Toll Free) or +1 801 567 5155 (outside US).\nGSK is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive equal consideration for employment without regard to race, color, national origin, religion, sex, pregnancy, marital status, sexual orientation, gender identity/expression, age, disability, genetic information, military service, covered/protected veteran status or any other federal, state or local protected class.\nImportant notice to Employment businesses/ Agencies\nGSK does not accept referrals from employment businesses and/or employment agencies in respect of the vacancies posted on this site. All employment businesses/agencies are required to contact GSK's commercial and general procurement/human resources department to obtain prior written authorization before referring any candidates to GSK. The obtaining of prior written authorization is a condition precedent to any agreement (verbal or written) between the employment business/ agency and GSK. In the absence of such written authorization being obtained any actions undertaken by the employment business/agency shall be deemed to have been performed without the consent or contractual agreement of GSK. GSK shall therefore not be liable for any fees arising from such actions or any fees arising from any referrals by employment businesses/agencies in respect of the vacancies posted on this site.\nPlease note that if you are a US Licensed Healthcare Professional or Healthcare Professional as defined by the laws of the state issuing your license, GSK may be required to capture and report expenses GSK incurs, on your behalf, in the event you are afforded an interview for employment. This capture of applicable transfers of value is necessary to ensure GSK’s compliance to all federal and state US Transparency requirements. For more information, please visit GSK’s Transparency Reporting For the Record site.Show more Report"}, {"company": "Syneos Health Clinical", "job": "Clin Ops Specialist - Sponsor Dedicated - office based in Hod Hasharon, hybrid", "city": "Israel", "date": "6d", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=118&ao=1136043&s=58&guid=00000186e6300f68a17f76dafb66e764&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_15d8efa2&cb=1678899361522&jobListingId=1008519023012&jrtk=3-1-1grj36dkvpkf1801-1grj304u1pkj7800-17152e09f71e0aa7-", "description": "Description\nClinical Trial Assistant - Sponsor Dedicated\nSyneos Health is the only fully integrated biopharmaceutical solutions organization purpose-built to accelerate customer success. We lead with a product development mindset, seamlessly connecting our capabilities to add high-value insights to speed therapies to patients and provide practical value to help our customers achieve their objectives.\nJob responsibilities\nResponsible for performing activities in compliance with applicable Corporate and Clinical Operations Policies, Standard Operating Procedures and Work InstructionsAssists Clinical Monitoring staff with site management activities, including serving as a Sponsor representative for sites on assigned studies, and communicating with sites to ensure compliance with protocol requirements, study procedures and relevant guidelinesCreates and assists with maintenance of Trial Master File (TMF) and project files, including participation in file auditsPrepares and maintains site manuals, reference tools and other documentsMaintains, updates, and inputs clinical tracking information into databasesTracks incoming and outgoing clinical and regulatory documents and updates for investigator sites, studies, project team, or clientManages shared mailbox, processes site requests and routes correspondence appropriatelyCoordinates the ordering, packaging, shipping and tracking of site supplies and materialsAssists with coordination of team meetings, attends meetings and prepares accurate meeting minutes and action itemsMay handle receipt, tracking and disposition of Case Report Forms and QueriesMaintains overall awareness in the field of clinical research by completing all necessary and assigned training\n\nQualifications\nWhat we’re looking for\nHigh School diploma or equivalentGood communication and interpersonal skillsAbility to embrace new technologiesMinimal travel up to 25% may be required\nGet to know Syneos Health\nOver the past 5 years, we have worked with 94% of all Novel FDA Approved Drugs, 95% of EMA Authorized Products and over 200 Studies across 73,000 Sites and 675,000+ Trial patients.\nNo matter what your role is, you’ll take the initiative and challenge the status quo with us in a highly competitive and ever-changing environment. Learn more about Syneos Health\n#LI-AM3Show more Report"}, {"company": "Sandoz", "job": "Legal & ERC Head", "city": "Tel Aviv-Yafo", "date": "12d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=119&ao=1136043&s=58&guid=00000186e6300f68a17f76dafb66e764&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9b6e3f7f&cb=1678899362684&jobListingId=1008507295445&jrtk=3-1-1grj36epl2eor001-1grj304u1pkj7800-3d2c5096b802562e-", "description": "1996! In this year Sandoz initiated the world’s first biosimilar development program. Over 20 years of experience in biosimilar development have equipped us with extensive knowledge and world-class expertise and capabilities in the development, manufacturing, and commercialization of biosimilar medicines to the healthcare community and patients worldwide. This opportunity is waiting for you to contribute to Sandoz success story toward the future. Join Sandoz Israel as Legal & ERC Head to provide legal leadership through pro-active, in-depth, business-focused advice to the organization, as well as implementing initiatives and processes to set standards and reinforce a culture of quality, integrity, ethical behavior and responsibility.\n\n\nYour responsibilities include, but not limited to:\n\nContributes to and influences the BU strategy and decision- making processes; Contributes to the development of overall legal functional strategy in the BU and beyondLeads, and is responsible for, implementation of key legal processes: drafting, negotiating and settling commercial agreements (e.g. clinical trial agreements, IITs, license agreements, supply and distribution agreements) and where appropriate liaising with the other members of the Legal functionsLegally support evolution of Go-to-Market model, by preparing, updating and negotiating agreements with the Partners and Health Authorities, monitoring external regulatory environment and managing associated risks.\nProvide complex, contextual and business-oriented advice in order to influence actions regarding local implementation of Global ERC Policies/Guidelines and laws/regulations; drive simplification on local SOPs and processes development; and foster innovation across the country ERC program\nAs a member of SEC, engage the leaders to leverage integrity messages, to maintain high level of awareness, to translate law trends/ litigations/ legislations affecting business into actionable information, and to continually monitor effectiveness of ERC program, including cultural drivers of ethical decisions and integrity for continuous improvementServe as a thought leader and key spokesperson in business development and continuity, internally and externally, and lead efforts to capture and share innovations, best practices and lessons learned on a Cluster, RE and Global level\nCommitment to Diversity & Inclusion:\nNovartis is committed to building an outstanding, inclusive work environment and diverse teams representative of the patients and communities we serve.\nMinimum requirements\nWhat you’ll bring to the role:\n\nDegree in Law5-8 years’ post-qualification experience preferably in a commercial multinational environmentAbility to analyze complex legal issuesStrong verbal & written communication skills; together with a high ability to influence and negotiateAbility to work effectively with HR and Finance colleaguesEnglish mandatory\nWhy consider Sandoz?\n\n500 million patients were touched by Sandoz generic and biosimilar medicines in 2020 and while we’re proud of this, we know there is more we could do to continue to help pioneer access to medicines for people around the world.\n\nHow will we do this? We believe new insights, perspectives and ground-breaking solutions can be found at the intersection of medical science and digital innovation. That a diverse, equitable and inclusive environment inspires new ways of working.\n\nWe believe our potential can thrive and grow in an unbossed culture underpinned by integrity, curiosity and flexibility. And we can reinvent what's possible, when we collaborate with courage to aggressively and ambitiously tackle the world’s toughest medical challenges. Because the greatest risk in life, is the risk of never trying!\n\nImagine what you could do here at Sandoz!\n\n\nImagine what you could do at Sandoz!\n\n\nCommitment to Diversity & Inclusion:\nSandoz, a Novartis company, embraces diversity, equal opportunity, and inclusion. We are committed to building diverse teams, representative of the patients and communities we serve, and we strive to create an inclusive workplace that cultivates bold innovation through collaboration and empowers our people to unleash their full potential.\nSandoz are an equal opportunities employer and welcome applications from all suitably qualified persons.\n\nJoin our Novartis Group Network: If this role is not suitable to your experience or career goals but you wish to stay connected to hear more about Novartis and our career opportunities, join the Novartis Network here: https://talentnetwork.novartis.com/network\n\nWe are Sandoz, a Novartis Division. Join us and help reimagine medicine.\nDivision\nSANDOZ\nBusiness Unit\nCOMMERCIAL OPS EUROPE SZ\nCountry\nIsrael\nWork Location\nTel Aviv\nCompany/Legal Entity\nNovartis Israel\nFunctional Area\nLegal & Intellectual Property & Compliance\nJob Type\nFull Time\nEmployment Type\nRegular\nShift Work\nNo\nEarly Talent\nNoShow more Report"}, {"company": "Medtronic", "job": "Customer Service Representative", "city": "Tel Aviv-Yafo", "date": "6d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=120&ao=1136043&s=58&guid=00000186e6300f68a17f76dafb66e764&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_905750ee&cb=1678899363771&jobListingId=1008519366765&jrtk=3-1-1grj36fr3k61r801-1grj304u1pkj7800-7501738a98329368-", "description": "Careers that Change Lives\nWe’re a mission-driven leader in medical technology and solutions with a legacy of integrity and innovation.\nWork with us to incentivize better patient care, and partner across the industry to make healthcare more affordable and accessible. Be a part of a community of experts committed to ensuring quality, affordable healthcare worldwide.\nCome strengthen your specialized skills and enhance your expertise. We’ll support you with the training, mentorship, guidance, and networks you need to advance, and empower you to work in the way that’s best for you.\nTogether, we can confront the challenges that will change the face of healthcare. Join us for a career that changes lives.\nA Day in the Life\nAs a Customer Service rep, you will focus on handing orders, and invoicing items in the different locations at hospitals and medical centers in Israel.\nYou will have versatile responsibilities, such as:\nEntering orders to the system, analyzing the data, checking prices, and making sure that order is handled properly in the system.\nCreating delivery notes and making sure the items arrive to the hospital within the required timelines.\nProducing invoices for the required orders.\nSolving unexpected problems with the utmost professionalism according to the company's' guidelines.\nDeveloping effective professional relationship with the sell's rep and the customers.\nMust Haves\nB.A from certificated University\nGood communication skills with people.\nService oriented\nAbility to work under pressure.\nFluent Hebrew.\nNice to have\nExperienced working with SAP\nExperienced working in a global company.\nGood English communication skills\nFuture of Work\nIn this role you will be able to work in a Hybrid Work Model. Talk about this with your interviewer for more information.\nAbout Medtronic\nBold thinking. Bolder actions. We are Medtronic.\nWe lead global healthcare technology and boldly attack the most challenging health problems facing humanity by searching out and finding solutions. Our Mission — to alleviate pain, restore health, and extend life — unites a global team of 90,000+ passionate people. Powered by our diverse knowledge, insatiable curiosity, and desire to help all those who need it, we deliver innovative technologies that transform the lives of two people every second, every hour, every day. Expect more from us as we empower insight-driven care, experiences that put people first, and better outcomes for our world.\nIn everything we do, we are engineering the extraordinary.\nPhysical Requirements\nThe physical demands described within the Responsibilities section of this job description are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the employee is regularly required to be independently mobile. The employee is also required to interact with a computer and communicate with peers and co-workers.\nAt Medtronic, you will find a diverse team of innovators who bring their unique backgrounds and their individual life experiences to work every day. We work hard to cultivate a workforce that reflects our patients and partners, we believe it’s the only way to drive healthcare forward. We want to attract a diverse workforce, regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, sexual orientation, gender identity and/or expression, veteran status, or any other characteristic protected by state or local law. Join us, and bring the power of your point of view to our culture of collaboration and innovation. It is through strong diversity, inclusion, and engagement that we can remain a leader in medical technology and solutions. And by embracing everything you have to offer —your unique perspectives, talents, and contributions —we can live up to the promise of our MissionShow more Report"}, {"company": "Boston Scientific Corporation", "job": "Principal Regulatory Affairs Specialist", "city": "Israel", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=121&ao=1136043&s=58&guid=00000186e6300f68a17f76dafb66e764&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0cdd34d1&cb=1678899364713&jobListingId=1007959075834&jrtk=3-1-1grj36gov2hsa001-1grj304u1pkj7800-fc8e5c52ca76b03a-", "description": "Principal Regulatory Affairs Specialist\nBoston Scientific's hybrid workplace includes remote and onsite roles. By applying to this position, you will have the opportunity to discuss your preferred working location with your Talent Acquisition Specialist.\nRemote Eligible: Hybrid\nOnsite Location(s):\nYokneam, IL\nDiversity - Innovation - Caring - Global Collaboration - Winning Spirit - High Performance\nAt Boston Scientific, we’ll give you the opportunity to harness all that’s within you by working in teams of diverse and high-performing employees, tackling some of the most important health industry challenges. With access to the latest tools, information and training, we’ll help you in advancing your skills and career. Here, you’ll be supported in progressing – whatever your ambitions.\n\nWe as Boston Scientific are expanding our Regulatory Affairs team in Israel ( Yokneam) due to our growth and the acquisition of Lumenis Israel- Medical Lasers.\nThat's why we are recruiting for a Principal Regulatory Affairs Specialist\n\nAbout this role as Principal Regulatory Affairs Specialist- Israel:\nResponsible for Regulatory Affairs support of submissions and on going regulatory compliance for product development process.\n\nYour key responsibilities will be:\nReviews and signs-off on product design control documentation for compliance with applicable regulations.\nProvides technical/regulatory guidance to cross-functional teams.\nActs as company representative, developing and maintaining positive relationships with device reviewers through oral and written communications regarding pre-submission strategy/regulatory pathway development, testing requirements, clarification and follow-up of submissions under review.\nDevelops and implements regulatory strategies for modified products.\nActs as a core member on manufacturing and remediation teams, providing regulatory feedback and guidance throughout the program, and coordinating team inputs for submissions.\nResponsible for preparation and submission of global regulatory applications, as well as internal regulatory file documentation.\nReviews and signs-off on product and manufacturing changes for compliance with applicable regulations.\nEstablish and support a work environment of continuous improvement that supports BSC’s Quality Policy, Quality System and the appropriate regulations for the area they support. Ensure employees are trained to do their work and their training is documented.\n\nWho are we looking for:\nBachelor’s degree or equivalent work experience, preferably in a scientific or technical discipline\n8+ years Regulatory Affairs experience, medical device experience required\nWorking knowledge of design control documentation/requirements required\nWorking knowledge of FDA and international regulations\nGeneral understanding of product development process\nWorking knowledge of regulatory requirements for implantable, capital equipment and single use disposable devices\nAbility to manage several projects\nProficiency with Microsoft Office\nEffective research and analytical skills\nEffective written and oral communication, technical writing and editing skills\nAbility to work independently with minimal supervision\nLanguage skills: English and Hebrew\n\nQuality System Requirements:\nIn all actions, demonstrates a primary commitment to patient safety and product quality by maintaining compliance to the Quality Policy and all other documented quality processes and procedures.\nAssures that appropriate resources (personnel, tools, etc.) are maintained in order to assure Quality System compliance and adherence to the BSC Quality Policy.\nEstablishes and promotes a work environment that supports the Quality Policy and Quality System.\nRequisition ID: 532619\n\nAs a leader in medical science for more than 40 years, we are committed to solving the challenges that matter most – united by a deep caring for human life. Our mission to advance science for life is about transforming lives through innovative medical solutions that improve patient lives, create value for our customers, and support our employees and the communities in which we operate. Now more than ever, we have a responsibility to apply those values to everything we do – as a global business and as a global corporate citizen.\n\nSo, choosing a career with Boston Scientific (NYSE: BSX) isn’t just business, it’s personal. And if you’re a natural problem-solver with the imagination, determination, and spirit to make a meaningful difference to people worldwide, we encourage you to apply and look forward to connecting with you!\n\nAt Boston Scientific, we recognize that nurturing a diverse and inclusive workplace helps us be more innovative and it is important in our work of advancing science for life and improving patient health. That is why we stand for inclusion, equality, and opportunity for all. By embracing the richness of our unique backgrounds and perspectives, we create a better, more rewarding place for our employees to work and reflect the patients, customers, and communities we serve. Boston Scientific is proud to be an equal opportunity and affirmative action employer.\n\nBoston Scientific maintains a drug-free workplace. Pursuant to Va. Code § 2.2-4312 (2000), Boston Scientific is providing notification that the unlawful manufacture, sale, distribution, dispensation, possession, or use of a controlled substance or marijuana is prohibited in the workplace and that violations will result in disciplinary action up to and including termination.\n\nPlease be advised that certain US based positions, including without limitation field sales and service positions that call on hospitals and/or health care centers, require acceptable proof of COVID-19 vaccination status. Candidates will be notified during the interview and selection process if the role(s) for which they have applied require proof of vaccination as a condition of employment. Boston Scientific continues to evaluate its policies and protocols regarding the COVID-19 vaccine and will comply with all applicable state and federal law and healthcare credentialing requirements. As employees of the Company, you will be expected to meet the ongoing requirements for your roles, including any new requirements, should the Company’s policies or protocols change with regard to COVID-19 vaccination.\n\nJob Segment: Regulatory Affairs, Compliance, Law, Medical Device, Technical Writer, Legal, Healthcare, TechnologyShow more Report"}, {"company": "The Rector & Visitors of the University of Virginia", "job": "Research Assistant Professor - Mathematical and Computational Epidemiology", "city": "Central", "date": "6d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=122&ao=1136043&s=58&guid=00000186e6300f68a17f76dafb66e764&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9a83eb88&cb=1678899367414&jobListingId=1008519329663&jrtk=3-1-1grj36jd3jm4g801-1grj304u1pkj7800-3bb8d7a58d92dd45-", "description": "The Network Systems Science and Advanced Computing (NSSAC) division of the Biocomplexity Institute and Initiative (BII) at the University of Virginia is seeking applications for Research Assistant Professors in fields related to mathematical and computational epidemiology. BII performs world-class informatics research in life sciences, social sciences, and human health by integrating theory, modeling and simulation with computational and experimental science in a transdisciplinary, team science research environment.\n\nNSSAC is pursuing an advanced research and development program for interaction-based modeling, simulation and associated analysis, experimental design, and decision support tools for understanding large biological, information, social, and technological (BIST) systems. Extremely detailed, multi-scale computer simulations allow formal and experimental investigation of these systems. The need for such simulations is derived from questions posed by scientists, policymakers, and planners involved with very large complex systems. Our team is comprised of a diverse group of researchers from various domains including computer science, cognitive science, mathematics, biology, health science, electrical engineering, and economics. For additional information about NSSAC, visit: https://biocomplexity.virginia.edu/nssac\n\nThe position will be offered at the rank of assistant research professor and will be located in BII's location in Charlottesville, VA. Position reports to Madhav Marathe, Director of NSSAC and Professor of Computer Science in the School of Engineering and Applied Sciences.\nResponsibilities:\n\nCollaborates with and provides expertise to team science members including students, postdoctoral fellows, faculty, and sponsors;\nMentors undergraduate, graduate student, and postdoctoral research associates in NSSAC;\nLeads and collaborates in publication of scientific results in peer reviewed journals, professional conferences and other forums;\nEngages in collaborative work with peers both within the group and outside with the aim to achieve division objectives;\nRoutinely communicates research progress with supervisor, peers and other appropriate staff;\nIdentifies research opportunities; leads and participates in grant writing activities;\nParticipates fully in the intellectual life of the division and institute, and in the building of the division's reputation in research and academics.\nRequired Qualifications and Experience:\n\nPh.D. in computer science, biomedical engineering, mathematics, systems engineering or a closely related field;\nRecord of scholarly productivity, a demonstrated interest in creative and novel research endeavors, and ability to contribute significantly to highly functioning teams focused on complex real world challenges requiring a multi-disciplinary approach;\nDemonstrated record of scholarship in top-tier journals and an understanding of the external funding roles of Principal Investigator or a senior collaborator;\nExperience in developing peer-reviewable publications and evidence of publications in peer-reviewed journals;\nExplicit commitment to, and accomplishments in, teaching, research, and/or service notable to seniority;\nExperience mentoring undergraduate and graduate students;\nAbility to excel in a highly collaborative team science environment;\nStrong work ethic and ability to work individually as well as within high-performing and diverse team structures.\n\nPreference will be given to candidates that are collaborative in nature across disciplines and would complement or expand the division’s current strengths. Applicants with a respect for diversity and a passion for making a positive impact on the world in a collaborative environment are strongly encouraged to apply.\n\nTo apply, complete an application online through Workday and attach the following:\n\nCurrent Resume\nCover Letter\nContact Information for 3 references\nThree to four representative publications or similar research output products, e.g. software systems, data products etc.\n\n***Please note that you MUST upload multiple documents into the CV/Resume box. Applications that do not contain all of the required documents will not receive full consideration.\n*** Process for External Applicants:\nPlease apply through Workday, and search for 'R0033261'. Process for Internal UVA Applicants: Please apply through your Workday Home page, search “Find Jobs,” and search for ‘R0033261.’\n\nThe position will remain open until filled.\n\nFor questions regarding the position, please contact Madhav Marathe, Search Committee Chair, at marathe@virginia.edu.\n\nFor questions about the application process, please contact Daniel Strong, Senior Recruiter, at das6zb@virginia.edu.\n\nThis is a restricted position based upon the continued availability of funding.\n\nThe University will perform background checks on all new hires prior to employment. This position will also require an Education Verification (FSAKA).\n\nThe University of Virginia is annually ranked as one of the premier public institutions in the United States and is located in Charlottesville, a picturesque and vibrant small city perennially ranked as one of the best places to live in the U.S. More information about town, the school, faculty benefits and other topics can be found at http://uvacharge.virginia.edu/guide.html. UVA assists faculty spouses and partners seeking employment in the Charlottesville area. To learn more please visit https://dualcareer.virginia.edu\nMINIMUM REQUIREMENTS\n\n\nEducation: Ph.D. or terminal degree. ABD may be accepted.\n\nExperience: None\n\nLicensure: None\n\n\nPHYSICAL DEMANDS\n\n\nThis is primarily a sedentary job involving extensive use of desktop computers. The job does occasionally require traveling some distance to attend meetings, and programs.\n\nCOVID Vaccination Requirement and Guidelines\nPlease visit the UVA COVID-19 Job Requirements and Guidelines webpage prior to applying for current information regarding vaccination requirements and guidelines for employment at UVA.\nThe University of Virginia, i ncluding the UVA Health System which represents the UVA Medical Center, Schools of Medicine and Nursing, UVA Physician’s Group and the Claude Moore Health Sciences Library, are fundamentally committed to the diversity of our faculty and staff. We believe diversity is excellence expressing itself through every person's perspectives and lived experiences. We are equal opportunity and affirmative action employers. All qualified applicants will receive consideration for employment without regard to age, color, disability, gender identity or expression, marital status, national or ethnic origin, political affiliation, race, religion, sex (including pregnancy), sexual orientation, veteran status, and family medical or genetic information.Show more Report"}, {"company": "Thermo Fisher Scientific", "job": "Senior Biostatistician - Early Phase", "city": "Israel", "date": "20d", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=123&ao=1136043&s=58&guid=00000186e6300f68a17f76dafb66e764&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a1469dfd&cb=1678899368518&jobListingId=1008488942714&jrtk=3-1-1grj36kfhkf0k801-1grj304u1pkj7800-4169ca6df12f23c3-", "description": "PPD clinical research services’ mission is to improve health. It starts as an idea to cure. It becomes a life saved. All in-between, it’s you! We know that meaningful results not only require the right approach, but also the right people. We invite you to re-imagine health promoting protocols with us, working alongside our talented, bright and energetic teams.\nWe are passionate about being data and technically agile and driving enhanced value for our clients and patients. Determined to improve patient health, we help PPD provide industry-leading statistical, programming and clinical pharmacology contributions through global delivery, consistent quality adherence and scientific insight.\nAs a Senior Biostatistician within our Early Phase team, you will function independently as a project lead or lead statistician to deliver the project tasks/responsibilities. As well you will perform project management functions relating to the administrative and scientific activities of specific project work and team members.\nEssential Functions:\nEnsures compliance with the activities outlined in the department's Working Practice Documents and contributes changes as needed. Follows departmental procedures for statistical analyses and programming work.\nWork independently as a project lead or as lead statistician to deliver on lead tasks/responsibilities across large and complex projects. Interacts with the sponsor on all aspects of the project and present to sponsor and regulatory agencies as needed.\nProvides sample size calculations and review protocols for completeness, appropriateness of clinical design, and sound statistical analysis. Contributes to writing appropriate protocol sections. Provides randomization schemes and appropriate documentation.\nWrites / reviews analysis plans and guide others on the team in its implementation. Defines appropriate methods and procedures for statistical analysis.\nProvides specifications for analysis database, oversee its development, and assures completeness for use in all programming. Coordinates with programmers and data management personnel as to database maintenance, updating, and documentation. Performs statistical analysis for key efficacy endpoints.\nPrepares reports, manuscripts, and other documents. Contributes statistical methods section for Integrated Clinical and Statistical Report, Integrated Summaries of Safety, Integrated Summaries of Efficacy, and other documents.\nMonitors project budget as it relates to project work scope and communicate proactively with management concerning potential changes in work scope. Communicates with sponsors concerning project work scope and budgetary changes after reviewing with management.\nMentors members of the department by providing project guidance and statistical advice and by promoting employee development, completing performance planning, and providing resource planning.\nProvides general infrastructure support to the Department (presents / teaches at the department meetings, contributes to other general department documents or policies, assists with newsletter, helps in department libraries, or trains new hires).\nActs as the representative of the department to other divisions. Assists in bidding and business development activities. Consults with business development with respect to bids and timelines.\nEducation and Experience:\nMaster's degree in statistics, biostatistics, mathematics or related field.\nPrevious experience that provides the knowledge, skills, and abilities to perform the job (comparable to 3+ years’).\nKnowledge, Skills and Abilities:\nStrong SAS® programming skills\n(Proficient in BASE, STAT, MACRO and GRAPH) and understanding of database structures\nCapable of directing and promoting teamwork in a multi-disciplinary team setting\nStrong understanding of statistical principles and strong statistical skills\nSolid project management skills, as shown through management of multiple projects\nDemonstrated initiative and motivation\nStrong written and verbal communications skills, including proficiency in the English language\nStrong organizational, time management, and planning skills to create and follow timelines, conduct long- range planning, adapt to changing priorities and handle multiple projects\nStrong interpersonal skills and positive attitude to work effectively in a team environment and act as a liaison with other department.\nAt PPD clinical research services we hire the best, develop ourselves and each other, and recognize the power of being one team. We understand that you will want to grow both professionally and personally throughout your career, and therefore at PPD clinical research services you will benefit from an award-winning learning and development programme, ensuring you reach your potential.\nAs well as being rewarded a competitive salary, we have an extensive benefits package based around the health and well-being of our employees. We have a flexible working culture, where PPD clinical research services truly value a work-life balance. We’ve grown sustainably year on year but continue to offer a collaborative environment, with teams of colleagues eager to share expertise and have fun together. We are a global organization but with a local feel.\nOur 4i Values:\nIntegrity – Innovation – Intensity – Involvement\n If you resonate with our 4i values above, and ultimately wish to accelerate the delivery of safe and effective therapeutics for some of the world’s most urgent health needs, submit your application – we’d love to hear from you!\n #LI-EM2 #LI-REMOTEShow more Report"}, {"company": "Medtronic", "job": "Sales Representative Surgical Innovations for the North of Israel", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=124&ao=1136043&s=58&guid=00000186e6300f68a17f76dafb66e764&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f1f3f612&cb=1678899369702&jobListingId=1008340888961&jrtk=3-1-1grj36ll134av001-1grj304u1pkj7800-ab5b211197628a67-", "description": "Careers that Change Lives\nThe main purpose of this role is to sell the Surgical Innovations range of products based on clinical expertise in order accelerate adoption for new technologies and and improve outcome for the patients.\nA Day in the Life\nThe jobholder is primarily responsible for selling the full range of products in assigned accounts or regions in a professional manner to hospitals and related healthcare professionals. He/she will build strong ethical business relationships with customers to ensure usage of our products and expanding the market and penetration, leading through value selling. He / she will cooperate and coordinate activities with the team in the territory in order to maximize the SI business opportunities.\nCustomer Management\nAchieve agreed budgets, focused on sales growth.\nPresent and sell SI products and services to current and potential clients.\nPrepare presentations, proposals and sales contracts.\nIdentify and resolve client concerns.\nCoordinates offers and tenders.\nHandles complaints and back orders\nRises awareness around solutions and organizes and coordinates product demo and workshops\nBusiness Development\nLead with clinical selling activities within the territory. Coordinate with other MDT teams where needed.\nIs able to conduct initial product demonstrations and Initiate/coordinates clinical evaluations to surgical staff.\nWorking with the RSM to develop target list and selling strategy / account mapping.\nPrepare action plans and schedules to identify specific targets in order to achive our goals.\nFollow up on new leads and referrals resulting from field activity. Identifies / quantifies opportunities and enter them in Salesforce.com.\nPrepare paperwork to activate and maintain contract services.\nOccasionally interacting with purchasing managers / hospital administrators to set up and negotiate broader sales contracts.\nTake a wide organisational view of selling and managing accounts, with sufficient knowledge of competitors and their products.\nMaintain customer knowledge by gathering information about account activities and potential, key decision makers, competitive participation, market share etc.\nSupport & Training\nCommunicate new product, special developments, information, or feedback gathered through field activity to appropriate company staff.\nCoordinate company staff to accomplish the work required to close sales.\nProvide verbal technical support and organise regular in-services.\nResponsibilities may include the following and other duties may be assigned.\nPromotes and sells Medtronic's products and services within an assigned geographic area and /or specific customer accounts to meet or exceed sales targets.\nResponsible for developing, building, and strengthening long-term relationships with stakeholders including distributors and healthcare professionals.\nResponsible for pursuing leads, assessing needs and providing product services to maximize the benefits derived from Medtronic's products and/or services.\nPromotes and establishes education of the company's products and/or services.\nConducts market research including customers and competitors activities.\nImplements market development plans/strategies and changes as needed.\nCommunicates customer feedback on new products and/or modifications to existing products or applications to internal stakeholders including R&D, Operations and Marketing.\nMust Have\nDegree in Life-science, Marketing, Business Administration or Biology or another relevant, advanced degree\nGood selling techniques and excellent selling strategies\nThorough knowledge of the competitive marketplace\nThorough knowledge of the decision making process with customers (economic buyer, reimbursement)\nFluency in English\nProven ability to effectively operate and communicate in a matrix environment and work effectively with physician customers, KOL’s and across district and organizational boundaries.\n Successful track record with sales results.\n Ability to manage a multi-product network.\nProven track record to work independently, while achieving aggressive personal and geographic objectives. Highly motivated, “can do” attitude.\nProven track record of good judgment. Demonstrated integrity and respect of peers.\nProven track record in business planning analysis and strategic planning\nComputer literacy\nFull clean drivers licence\nProven evidence of Medtronic Core Competencies\nResults Orientation · Integrity\nInterpersonal Effectiveness · Quality Orientation\nContinuous Learning · Innovation\nAbout Medtronic\nTogether, we can change healthcare worldwide. At Medtronic, we push the limits of what technology, therapies and services can do to help alleviate pain, restore health and extend life. We challenge ourselves and each other to make tomorrow better than yesterday. It is what makes this an exciting and rewarding place to be.\n\nWe want to accelerate and advance our ability to create meaningful innovations - but we will only succeed with the right people on our team. Let’s work together to address universal healthcare needs and improve patients’ lives. Help us shape the future.\n\nPhysical Job Requirements\n\nThe physical demands described within the Responsibilities section of this job description are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. For Office Roles: While performing the duties of this job, the employee is regularly required to be independently mobile. The employee is also required to interact with a computer, and communicate with peers and co-workers. Contact your manager or local HR to understand the Work Conditions and Physical requirements that may be specific to each role. (ADA-United States of America)Show more Report"}, {"company": "InspHire", "job": "Sales Development Representative", "city": "Raanana", "date": "30d+", "rating": "5.0", "link": "", "description": "A company that believes in contributing to the health of mankind by understanding cannabis is looking for a Sales Development Representative.\nResponsibilities:\nQualify leads from marketing campaigns as sales opportunities\nContact potential clients through cold calls and emails\nPresent the company to potential clients\nIdentify client needs and suggest appropriate products/services\nCustomize product solutions to increase customer satisfaction\nBuild long-term trusting relationships with clients\nProactively seek new business opportunities in the market\nSet up meetings or calls between (prospective) clients and Account Executives\nReport to the regional sales manager on (weekly/monthly/quarterly) sales results\nStay up-to-date with new products/services and new pricing/payment plans\nQualifications:\nProven work experience as a Business Development Representative or similar role\nHands-on experience with multiple sales techniques (including cold calls)\nTrack record of achieving sales quotas\nExperience with CRM software (e.g. Pipedrive or Salesforce)\nFamiliarity with MS Excel (analyzing spreadsheets and charts)\nUnderstanding of sales performance metrics\nExcellent communication and negotiation skills\nAbility to deliver engaging presentationsShow more Report"}, {"company": "ICON", "job": "Clinical Research Associate - Oncology", "city": "Israel", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=126&ao=1136043&s=58&guid=00000186e6300f68a17f76dafb66e764&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_bc8b831b&cb=1678899372162&jobListingId=1008230234898&jrtk=3-1-1grj36o1kpkdm801-1grj304u1pkj7800-e115b4b770d5f769-", "description": "ICON plc is a world-leading healthcare intelligence and clinical research organization. From molecule to medicine, we advance clinical research providing outsourced services to pharmaceutical, biotechnology, medical device and government and public health organization's.\nWith our patients at the center of all that we do, we help to accelerate the development of drugs and devices that save lives and improve quality of life.\nOur people are our greatest strength, are at the core of our culture, and the driving force behind our success. ICON people have a mission to succeed and a passion that ensures what we do, we do well.\nAs a Senior Clinical Research Associate you will coordinate all aspects of the clinical monitoring and site management process in accordance with regulatory guidelines, local regulations and standard operating procedures. In this role you will be a decision maker, solving problems independently or as part of the client and ICON team.\n\nYou will be managing competing priorities, supporting the on-site team, ensuring investigators follow the clinical trial protocol, providing training, and most importantly, motivating the team to ensure high quality results.\n\n\n\n\n\nAccountabilities/Responsibilities:\nYou will monitor multiple Phase I, II, III & IV clinical trial sites, across different therapeutic areas. Assist other CRAs with co-monitoring activities both remote and on-site.\nYou will utilise your customer service mindset with your sites focusing on delivering value, building loyalty and trust to create a positive impact and strong relationship with investigators and study coordinators where respect, knowledge and commitment to ICH/GCP guidelines are key to successful trial conduct.\nAs the CRA you are the main sponsor representative, providing key project updates. You will collaborate with the team, developing commitment to study timelines and objectives through regular visits with site staff in-person and remotely.\nYou will be first to review \"source to CRF/eCRF,\" ensuring patient safety and data integrity aspect of the study.\nAs the first point of contact for study sites, escalating any concerns/issues to other departments including Safety, Investigational Medicinal Product, Local Study Managers and management team as appropriate.\nAdditionally, you will oversee the sites' adherence to GCP/ICH practices, ensuring quality of study conduct.\nTo be successful in the role, you will have:\nBachelor’s Degree (or equivalent)\nMinimum 1 year of independent on-site monitoring experience\nExperience conducting all types of MVs such as: Site Selection, Initiation, Routine Monitoring and Close Out Visits both remotely and on-site\nA demonstrated working knowledge of ICH/GCP Guidelines\nExcellent record-keeping skills and attention to detail\nFluent in English and Hebrew, both written and oral\nBenefits of Working in ICON:\nOur success depends on the knowledge, capabilities and quality of our people. That’s why we are committed to developing our employees in a continuous learning culture – one where we challenge you with engaging work and where every experience adds to your professional development.\nAt ICON, our focus is to provide you with a comprehensive and competitive total reward package that comprises, not only an excellent level of base pay, but also a wide range of variable pay and recognition programs. In addition, our best in class employee benefits, supportive policies and wellbeing initiatives are tailored to support you and your family at all stages of your career - both now, and into the future.\nICON, including subsidiaries, is an equal opportunity and inclusive employer and is committed to providing a workplace free of discrimination and harassment. All qualified applicants will receive equal consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\nIf, because of a medical condition or disability, you need a reasonable accommodation for any part of the application process, or in order to perform the essential functions of a position, please let us know.Report"}, {"company": "TE Connectivity", "job": "Account Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=127&ao=1136043&s=58&guid=00000186e6300f68a17f76dafb66e764&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_39c9e485&cb=1678899373441&jobListingId=1008428213704&jrtk=3-1-1grj36p96i9hm801-1grj304u1pkj7800-1b67f8262aeab101-", "description": "The Account Manager is the outside engineering representative for a number of accounts in a defined territory and/or a specific industry/technology.\nReporting directly to the Sales Manager , the Aeronautic, Defense and Marine Account Manager will be responsible for:\nGather all information needed to make the design input available as complete as possible\nWork out, prepare and present TE proposals (product selection, design solutions and project objectives)\nInterface between the TE ADM Account/sales managers and the customer to ensure that both sides\nUnderstand the requirements and have all needed information available\nWork out, prepare and present TE proposals (product selection, design solutions and project objectives)\nEnsure on time customer delivery of all information, including samples and supporting design and\nproduct verification activities\nProvide regular project status updates to the involved parties.\nRegularly updates on Salesforce.com\nDesign-in the TE products and solutions.\n\nWhat your background should look like:\nBachelor Degree or engineering degree preferably in electronics and electromechanics\n4 to 5 years’ experience in business development in the defense industry\nExperience in customer relation management or field application\nStrategic thinking with the ability to execute on priorities.\nAbility to identify and pursue new business opportunities in line with business plans.\nValid driver’s license.\nCurious, entrepreneurial spirit and Leadership\nEnglish and Hebrew languages are required for this Position\nAvailability to travel abroad when required\nCompetencies\nValues: Integrity, Accountability, Teamwork, Innovation\nABOUT TE CONNECTIVITY\nTE Connectivity is a global technology leader enabling a secure, sustainable, productive, and connected future. Our broad range of connectivity and sensor solutions have been proven in the most demanding environments, enabling advancements in transportation, industrial applications, medical technology, energy technology, data communications, and for the home. With approximately 85,000 employees, including more than 8,000 engineers, we work with customers in nearly 140 countries. TE ensures that EVERY CONNECTION COUNTS.\n\nWHAT TE CONNECTIVITY OFFERS:\nWe are pleased to offer you an exciting total package that can also be flexibly adapted to changing life situations - the well-being of our employees is our top priority!\nCompetitive Salary PackagePerformance-Based Bonus PlansHealth and Wellness IncentivesEmployee Stock Purchase ProgramCommunity Outreach Programs / Charity EventsEmployee Resource Group\n\nAcross our global sites and business units, we put together packages of benefits that are either supported by TE itself or provided by external service providers. In principle, the benefits offered can vary from site to site.Report"}, {"company": "Xerox", "job": "Technical Service Representative (Production)", "city": "Tel Aviv-Yafo", "date": "28d", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=128&ao=1136043&s=58&guid=00000186e6300f68a17f76dafb66e764&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_bf088cf0&cb=1678899375313&jobListingId=1008471959908&jrtk=3-1-1grj36r38ghop801-1grj304u1pkj7800-892486ea0ded0a81-", "description": "City: Tel-Aviv-Yafo\nState/Province: Tel Aviv\nCountry: Israel\nDepartment: Technical Customer Services\nDate: Friday, February 24, 2023\nWorking time: Full-time\nRef#: 20021877\nJob Level: Specialist\nJob Type: Experienced\nJob Field: Technical Customer Services\nSeniority Level: Associate\nDescription & Requirements\nAbout Xerox Holdings Corporation\nFor more than 100 years, Xerox has continually redefined the workplace experience. Harnessing our leadership position in office and production print technology, we’ve expanded into software and services to sustainably power today’s workforce. From the office to industrial environments, our differentiated business solutions and financial services are designed to make every day work better for clients — no matter where that work is being done. Today, Xerox scientists and engineers are continuing our legacy of innovation with disruptive technologies in digital transformation, augmented reality, robotic process automation, additive manufacturing, Industrial Internet of Things and cleantech. Learn more at xerox.com and explore our commitment to diversity, inclusion and belonging.\n\n\nWe're an industry leader that's rapidly growing our Technical Services division and have an immediate need for professional production service technicians to delight our customers.\n\nPrimary Responsibilities:\n\nOffer outstanding service to our clients. Manage call resolve issues in accordance with customers SLA agreement to manage customer relations and optimize customer satisfaction.\nLeverage senior level experience and specialized training in electromechanical equipment and advanced troubleshooting to perform repairs and maintenance on large scale production equipment\nPerform full range of maintenance on assigned products; including technical diagnostics, software loads, installation, removal, retrofit and utilization of remote resolution software.\nTake responsibility for customer satisfaction by serving as the primary customer contact and providing all maintenance, production, and supply inventories of assigned equipment\nProvide assistance and guidance to other team members regarding policies, procedures and overall equipment repair best practices\n\n\nSkills and Qualifications:\n\nSenior Electro-mechanical experience including using a multi-meter to troubleshoot electrical circuits, and the ability to read and comprehend electrical schematics to properly troubleshoot systems. This could include past roles with electro-mechanical experience, HVAC/Cable Internet technician, Electrician, Automotive Mechanic, Repair, or Military or Veteran.\nSuperior time management skills and RELIABILITY. Our customers are counting on you. If you're a \"10 minutes early is on time, and on time is late\" person, we want to talk about your career goals! We value dependable employees who are eager to meet deadlines.\nValid driver's license, appropriate insurance coverage, and a clean driving history. A Motor Vehicle Record (MVR) is included in our technician background check.\nThis is an extremely active position that requires the ability to lift 50 pounds, walking, standing, squatting, bending, and driving for over 50% of the workday. Safety is our top priority especially around electrical components.\nUseful certifications for this role:\n\n\nHere’s what success looks like in the first 60 days:\n\nYou have successfully navigated through our new hire training and completed the technical training courses which have set you up for success in the following categories:\nComprehensive understanding of our company and customer service culture\nClear expectations in reference of call load, territory alignment and client satisfaction\nThorough knowledge base of the equipment and inventory needs to support your territory\nActively and correctly completing service calls independently.\n\n\nAdditional Benefits:\n\nSubstantial growth opportunities for future career development within a supportive and collaborative company culture\nFull medical/dental/vision, wellness credits, and a company contribution to a Health Savings Account and 401k matching\nPaid time off, plus holidays and personal days\n\nXerox is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, creed, religion, ancestry, national origin, age, gender identity or expression, sex, marital status, sexual orientation, physical or mental disability, use of a guide dog or service animal, military/veteran status, citizenship status, basis of genetic information, or any other group protected by law. Learn more at www.xerox.com! People with disabilities who need a reasonable accommodation to apply or compete for employment with Xerox may request such accommodation(s) by sending an e-mail to XeroxStaffingAdminCenter@xerox.com. Be sure to include your name, the job you are interested in, and the accommodation you are seeking.\n© 2020 Xerox Corporation. All rights reserved. Xerox® and Xerox and Design® are trademarks of Xerox Corporation in the United States and/or other countries.Report"}, {"company": "LightForce Ortho", "job": "Senior Algorithms CAD/CAM Software Engineer", "city": "Israel", "date": "26d", "rating": "4.6", "link": "", "description": "Position\nSenior Algorithms CAD/CAM Software Engineer\nLocation\nRemote\nDescription\nLightForce Orthodontics is seeking a talented Senior CAD/CAM Software Engineer to join our rapidly expanding team. As a Senior CAD/CAM Software Engineer, you will be in a leadership position supporting LightForce's 3D tools, enabling internal and external users through performant algorithms and intuitive user experience.\nAs a Senior Algorithms CAD/CAM Software Engineer, play a critical role that enables the company in a period of exponential growth. You will be responsible for designing, building, maintaining, and improving our 3D architecture. You will make sure that all 3D development within the organization is well designed and enables future development and long-term maintainability.\nLightForce Orthodontics hires committed, self-motivated employees and then gives them the freedom and flexibility to do great work. You will help to grow a fantastic engineering team and industry-changing tech company, to advance the orthodontic profession, and to provide positive health benefits to patients.\nEssential Duties and Responsibilities\nMake significant contributions to the design, architecture and implementation of our web-based digital treatment platform\nOwn every part of the process: from design through development, testing, and delivery\nCollaborate with multiple teams to collect needs and assist in implementation.\nCollaborate and coach other junior software engineers.\nEducation and Experience\n5+ years of experience as a software engineer\n2+ years of experience building CAD, CAM, FEA or CFD applications\nExperience working in an Agile/Scrum environment\nExcellent written and verbal communication skills with the ability to communicate effectively with all stakeholders\nBS/MS in Computer Science, Software Engineering, or a related quantitative field\nPreferred Qualifications\nExtensive knowledge of WebGL, 3D web ecosystem (Three.js or Babylon.js)\nExperience in developing graphical applications with C++ and/or TypeScript/Javascript\nExperience working on 3D computational geometry problems or geometric modeling concepts\nPrior experience developing and optimizing graphs and graph algorithms\nPrior experience with JavaScript / Typescript\nPerks\nFlexible vacation\nGenerous premium coverage for medical, dental, and vision plans\nRetirement benefits / accounts\nPre-tax commuter benefits program\nPaid parental leave\nAbout LightForce\nAt LightForce Orthodontics we use advanced manufacturing technologies and proprietary CAD software to create the world's best orthodontic treatment experience. We create 100% patient-matched orthodontic ceramic brackets designed from digital impressions with the goal of reducing treatment duration for patients and chair-time for clinicians.\nTo perform this job successfully, an individual must be able to perform each essential duty satisfactorily. The requirements listed above are representative of the knowledge, skill, and/or ability required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\nLightForce Orthodontics is an Equal Opportunity/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, gender, age, national origin, disability, Protected Veteran status, sexual orientation, or any other characteristic protected by federal, state or local law.Show more Report"}, {"company": "Medtronic", "job": "Sales Representative Diabetes for the Arab Sector", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=130&ao=1136043&s=58&guid=00000186e6300f68a17f76dafb66e764&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9211409a&cb=1678899377643&jobListingId=1008271645987&jrtk=3-1-1grj36tbskclg801-1grj304u1pkj7800-96d52a5616598db5-", "description": "Careers that Change Lives\nWe’re a mission-driven leader in medical technology and solutions with a legacy of integrity and innovation.\nWork with us to incentivize better patient care, and partner across the industry to make healthcare more affordable and accessible. Be a part of a community of experts committed to ensuring quality, affordable healthcare worldwide.\nCome strengthen your specialized skills and enhance your expertise.\nWe’ll support you with the training, mentorship, guidance, and networks you need to advance, and empower you to work in the way that’s best for you.\nTogether, we can confront the challenges that will change the face of healthcare. Join us for a career that changes lives.\nA Day in the Life\nWe are hiring Sales Representative Diabetes for the ARAB Sector in this position you will be responsible to:\nPromote and sells Medtronic's products and services within an assigned geographic area and /or specific customer accounts to meet or exceed sales targets.\nResponsible for developing, building, and strengthening long-term relationships with stakeholders including distributors and healthcare professionals.\nPursuing leads, assessing needs and providing product services to maximize the benefits derived from Medtronic's products and/r services.\nImplement market development plans/strategies and changes as needed.\nCommunicate customer feedback on new products and/or modifications to existing products or applications to internal stakeholders including R&D, Operations and Marketing.\nEffective communication and influence skills; possess the capability to influence and motivate all levels by demonstrating competence and confidence, knowledge, and experience, being personally accessible, being a good listener, using fact-based\npersuasion, dedication, persistence as appropriate to audience\nMust Haves\nBachelor's degree\nArabic mother tongue level\nAt least 3 years' experience in B2B sales position\nHebrew and English – Full working proficiency\nAbility to work alone and under pressure\nDirect experience interacting and dealing with key opinion leaders and other leading roles in the scientific and clinical community\n Nice to Have\nExperience in the Medical device or the Pharma industry\nAbout Medtronic\nBold thinking. Bolder actions. We are Medtronic.\nWe lead global healthcare technology and boldly attack the most challenging health problems facing humanity by searching out and finding solutions. Our Mission — to alleviate pain, restore health, and extend life — unites a global team of 90,000+ passionate people. Powered by our diverse knowledge, insatiable curiosity, and desire to help all those who need it, we deliver innovative technologies that transform the lives of two people every second, every hour, every day. Expect more from us as we empower insight-driven care, experiences that put people first, and better outcomes for our world.\nIn everything we do, we are engineering the extraordinary.\nPhysical Requirements\nThe physical demands described within the Responsibilities section of this job description are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing the duties of this job, the employee is regularly required to be independently mobile. The employee is also required to interact with a computer and communicate with peers and co-workers.\nAt Medtronic, you will find a diverse team of innovators who bring their unique backgrounds and their individual life experiences to work every day. We work hard to cultivate a workforce that reflects our patients and partners, we believe it’s the only way to drive healthcare forward. We want to attract a diverse workforce, regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, sexual orientation, gender identity and/or expression, veteran status, or any other characteristic protected by state or local law. Join us and bring the power of your point of view to our culture of collaboration and innovation. It is through strong diversity, inclusion, and engagement that we can remain a leader in medical technology and solutions. And by embracing everything you have to offer —your unique perspectives, talents, and contributions —we can live up to the promise of our MissionReport"}]