[[{"company": "Noviopus", "job": "UI/UX Designer", "city": "Rishon LeẔiyyon", "date": "30d+", "rating": "", "link": "", "description": "An HR Tech startup that is developing the next generation of recruitment and finding a job system.We are looking for a UI/UX designer to design our web applications.The job is open for new or inexperienced designers as well.Need a skilled designer in creating designed web pages.Need to be creative and with a good understanding of user experience to create wireframes and designs.Job Types: Full-time, Part-time, VolunteerShow more Report"}, {"company": "KMS Lighthouse", "job": "Product Designer", "city": "Petah Tikva", "date": "30d+", "rating": "4.5", "link": "", "description": "KMS Lighthouse is looking for a Product Designer to join our expanding Israeli-based team. The product team at KMS Lighthouse is at the heart of the company. You should have an eye for clean and artful design, possess superior UI skills, and be able to translate high-level requirements into interaction flows and artifacts and transform them into beautiful, intuitive, and functional user interfaces.\nRequirements:\n\nUI and UX design experience for digital products or services\nExperience working with Figma\nDemonstrable UI design skills with a strong portfolio\nSolid experience in creating, storyboards, user flows, process flows, and site maps\nExcellent visual design skills with sensitivity to user-system interaction\nAbility to present your designs and sell your solutions to various stakeholders\nAbility to solve problems creatively and effectively\nUp-to-date with the latest UI trends, techniques, and technologies\nExperience working in an Agile/Scrum development process\nResponsibilities:\n\nCollaborate with product management and engineering to define and implement innovative solutions for the product direction, visuals, and experience\nExecute all visual design stages from concept to final hand-off to engineering\nConceptualize original ideas that bring simplicity and user-friendliness to complex design roadblocks\nCreate, storyboards, user flows, process flows and site maps to effectively communicate interaction and design ideas\nEstablish and promote design guidelines, best practices, and standards\nInvestigating user experience design requirements for our suite of digital assetsShow more Report"}, {"company": "SAR Technologies", "job": "Product designer", "city": "Herzliya", "date": "19d", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=103&ao=1136043&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e6adc93c&cb=1678899880448&jobListingId=1008489520921&jrtk=3-1-1grj3m8d6kbmh801-1grj3gsk82a83000-6d9cea7fa4805ddc-", "description": "Finonex is looking for a talented product designer to join our team in our office in Herzliya, Israel.\nAs a product designer, you will be responsible for designing and creating our product's user experience, user interfaces, and other visual elements. You will work closely with our product and development team to ensure that our visual design is aligned with our product and brand strategy.\nWe are looking for a customer centric, creative, passionate, pixel-perfect with an eye for quality, product designer.\nOur work model is hybrid, combining remote and on-site work\n\nIn this role you will:\nResponsible for user experience and visual design concepts across our products and platforms.\nDesign and implement challenging interfaces for web and mobile environments.\nCreate wireframe, high end mockups and prototyping to launch and beyond.\nShape and design features and be involved at any stage of the product design as necessary.\nAct as the user-advocate, subjecting early-stage designs to usability testing or expert review, and offering suggestions from a user perspective.\nDeliver measurable results to platform user experience and customer satisfaction.\nConduct a full design cycle from collecting inspiration through creating a pixel-perfect UI for all states and scenarios, and deliver to development including all possible scenarios and create product flows\nCollaborate daily with Product Managers and Software Developers to define, design, and deliver great products.\nAdvocate for the prioritization of design centered changes, refinements, and improvements\nLead brainstorms sessions and always look for improvements. Be initiative, suggest solutions and find problems\nUse design to go beyond jobs-to-be-done to delight and bring in brand experiences.\nLead with customer obsession, guide towards strong user experience and strategically leverage user research.\nYou have:\n+3 years of experience in designing customer-facing digital products, web and mobile.\nDeep understanding of UI and UX principles, practices and tools.\nStrong working knowledge and proven portfolio- a portfolio review will be required for all candidate interviews\nAbility to craft a basic prototype, manage tasks according to set priorities, multi-task and meet deadlines.\nOut of the box thinking, eye for design and high creativity.\nGood communication skills, able to take feedback from anyone in any rank.\nIndependent worker but with strong team player qualities\n Pixel-perfect with attention to the smallest of details\nProficiency in Figma, Sketch or similar software\nHighly motivated and fast learner with multitasking abilities.\nAbility to understand and translate high-level business concepts and product vision into your work with all stakeholders.\nCan do approach.\nIdeally a bachelor’s degree in Product Design, Human-Computer Interaction Design, or other relevant fields\nWill be nice that you have:\nWork experience in a trading On-line companies h\nWork experience in SAS platforms\nBezalel Academy of Art and Design or Shenkar College graduate- AdvantageShow more Report"}, {"company": "UI", "job": "UX Designer [junior]", "city": "Netanya", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=104&ao=1136043&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ebda77af&cb=1678899881902&jobListingId=1005994922600&jrtk=3-1-1grj3m9r9k24s801-1grj3gsk82a83000-96891cd954d37173-", "description": "If you’ve got a knack for problem solving and you’re passionate about human behaviour and technology - we need to talk :) Our team is looking for a UX designer to join our group of leading talents.\nWithin the scope of this role, you’ll have a chance to work on a variety of projects - from fast pacing startups to complex system in large organizations. You’ll collaborate closely with Development and UI professionals from early stages of the product requirements and up to a working prototype - while always considering user and business goals.\n\n\nWhat you bring to the table\nAbility for good analysis and attention to detail\nCreativity and original way of thought\nAbility to learn quickly\nMaster's degree in relevant fields (human engineering / cognitive psychology / industrial psychology, industrial engineering and management)\nSuperb human relations, including management and customer-facing capabilities.\nAbility to work well on your own as well as in a teamShow more Report"}, {"company": "ironSource", "job": "Product Designer", "city": "Tel Aviv-Yafo", "date": "3d", "rating": "4.3", "link": "", "description": "Grow Product Studio is looking for an UX/UI Product Designer to help shape and craft our complex platform systems into products that are simple and intuitive. You will design end-to-end user experiences and optimizations – from early prototypes to final implementation and you will also contribute to the development of our product style guidelines and design system.\nSo if you breathe UX/UI - let’s meet!\nRequirements:\n\nBachelor’s degree in Visual Communication from Bezalel, Shenkar, HIT, or Wizo\n3+ years of experience designing a complex system/platform\nYou have experience collaborating closely with R&D\nProven knowledge of Figma (design and prototyping), Sketch, and Adobe Illustrator\nExperience with user research and user testing\n***Submissions without a portfolio will not be considered***\nRole:\n\nBrainstorm and design new features and take concepts through to production\nDesign pixel-perfect complex system/platform user interfaces\nBuild, communicate, and present design ideas and be responsible for the product’s design language\nCollaborate with other designers, as well as product managers, developers, sales and marketing, and other stakeholders to deliver the best design solutions and help deliver outstanding user experiences and sales materials\nProduce all assets needed for the development teams and make sure that the work is delivered as it was designed\n\nBusiness Unit:\n\nDesign & Creative\n\nAdvantages:\n\nYou have a positive attitude and great social skills with a willingness to put aside ego for the sake of what's best for the team\nYou possess the ability to adapt, switch gears, and thrive in a fast-paced environment\nYou have excellent organizational skills and ability to prioritize and meet deadlines\nExperience creating and build a design system library\nYou have a high level of written and spoken English\nGreat people skills, fun person to be aroundShow more Report"}, {"company": "Xtra-Mile", "job": "Graphic Designer", "city": "Raanana", "date": "17d", "rating": "4.5", "link": "", "description": "Xtra-Mile, a leading lifecycle marketing agency specializing in B2B, is seeking a creative and talented graphic designer to join our studio team\nResponsibilities:\nDesigning marketing campaigns starting with the creative stage all the way through to the final product.\nCreating banners and ads for the various media platforms\nDesigning bulk e-mails, invites, landing pages, websites, presentations, brochures, and other printed materials.\nRequirements:\n\nDigital marketing design experience - required\nFully proficient in Adobe (Illustrator, Photoshop, and InDesign) - required\nProficient in PowerPoint – a significant advantage\nProficient is joint design software (Figma XD) - a significant advantage\nAnimation software experience - a significant advantage\nAbility to think outside the box, fast grasp, and dynamic teamwork\nHigh working proficiency in EnglishShow more Report"}, {"company": "eToro", "job": "Growth Product Designer", "city": "Bnei Brak", "date": "7d", "rating": "3.7", "link": "", "description": "eToro is a leading social trading and investment platform that allows users to invest in various assets including stocks, commodities, and cryptocurrencies. Our mission is to democratize finance by making it accessible to everyone.\nJob Overview:\nWe are looking for a talented Growth Product Designer to join our design team. The ideal candidate is a creative problem solver with a strong background in user-centered design and a passion for growth. The Growth Product Designer will work closely with our product, engineering, and growth teams to design and optimize features that drive user acquisition, activation, retention, and revenue.\nResponsibilities:\nCollaborate with product managers, engineers, and growth specialists to identify growth opportunities and design solutions that optimize user acquisition, activation, retention, and revenue.\nConduct user research to understand user behavior and inform design decisions.\nCreate wireframes, prototypes, and high-fidelity designs that communicate the user experience and align with the eToro brand.\nConduct usability testing and A/B tests to validate designs and identify areas for improvement.\nWork closely with the engineering team to ensure designs are implemented accurately and efficiently.\nContinuously monitor and analyze user feedback, usage data, and industry trends to inform design iterations and optimizations.\nRequirements:\n\n3+ years of experience in product design, with a focus on growth or optimization.\nProficient in design tools such as Sketch, Figma, Adobe Creative Suite, etc.\nExperience with user research, usability testing, and A/B testing.\nStrong understanding of UX principles and design thinking.\nExcellent communication and collaboration skills.\nPassion for design and a desire to stay up-to-date with the latest design trends and technologies.\nPlease attach a link to your portfolio\nWhy eToro:\neToro offers a dynamic and exciting work environment, where creativity and innovation are encouraged. As a Growth Product Designer, you will have the opportunity to work on a cutting-edge product that is revolutionizing the world of finance. In addition, eToro offers competitive salary and benefits packages, as well as opportunities for growth and advancement within the company.\nSub Department:\n\nProductReport"}, {"company": "MAËLYS", "job": "Brand Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "", "description": "MAЁLYS is one of the fastest-growing D2C beauty brands in the world. We are breaking the mold of the body care industry with innovative targeted body care solutions for specific skin concerns, an intricate and unique combination of data and marketing, and a seriously sassy and bold brand voice.\nWe are a team of people who want to make lasting, impactful changes, who live (and love) to see results, who innovate with passion, and who love a good sense of humor. Is our vibe your vibe? Then keep reading…\nAs a Brand Designer, you will have the opportunity to channel your creativity by creating engaging designs for our digital content. You will be part of a growing brand and in a role where you can see your impact and immediate results.\nYour life at MAËLYS will look like…\nConduct a full design cycle, from collecting inspiration to creating a pixel-perfect UX/UI.\nExecute design and conceptual tasks as assigned with significant attention to detail.\nContribute to, and collaborate with fellow designers on design concepts and the brand experience.\nDevelop visual concepts for digital campaigns, product marketing, and customer marketing.\nYou will thrive in this role if you have…\n1-3 years of experience as a Creative/Marketing/Graphic Designer (preferably in a product / eCommerce company).\nA strong portfolio demonstrating design thinking and execution skills.\nExcellent knowledge of Figma.\nKnowledge in Adobe Creative Cloud - Photoshop, Illustrator, (After Effects - an advantage.)\nStrong understanding of typography and hierarchies.\nStrong design, color, and composition abilities.\nProficient in English.Show more Report"}, {"company": "Liniad", "job": "Game Designer", "city": "Herzliya", "date": "1 day ago", "rating": "2.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=109&ao=1136043&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d4e23a41&cb=1678899888414&jobListingId=1008526119652&jrtk=3-1-1grj3mg5mkblj801-1grj3gsk82a83000-da47d5517c29db29-", "description": "We are searching for a talented designer to join our ranks, what do we do here? we focus on creating fun and exciting games.\n\nWhat You Will Do\nBringing your vision to the game by creating assets, and game mechanics. You’ll be hands-on throughout the entire process, from concept to design, animation and finally launch.\nResponsible for managing an effective pipeline for look development, assets, characters and general design, both 2d and 3d elements.\nCraft high-level and detailed mockups to effectively communicate design ideas.\n\nIntegrating and implementing creative elements (art and visual effects) into the games.\n\nReview your own work as well as the work of associate Designers working for us.\nCommunicate/resolve any development issues that may occur to the team.\nWhat You Will Bring\nStrong skills in Photoshop, After Effects and Illustrator\nProven track record of both artistic and technical creativity.\nEnglish proficiency – A Must\nPrevious experience working in the gaming industry – Advantage.\nUnity work experience or the ability to undergo Unity training – Advantage.\nUnderstanding of Animation – Advantage.Show more Report"}, {"company": "8fig", "job": "Product Design", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": "8fig is a growth platform built to propel e-Commerce brands to new heights with cash flow planning technology and continuous, uncapped capital. Founded by supply chain experts, our growing data-driven, client-obsessed team is driven by our purpose to democratize online retail and scale eCommerce sellers to 8-figures in revenue.\nWe are seeking a highly experienced and talented Product Designer with at least 3 years of experience in user experience and interactive design. The ideal candidate possesses strategic thinking and a comprehensive understanding of the product development process, from research and prototyping to design and usability testing. Strong communication, organizational, and analytical skills are essential, as the candidate will be expected to continuously learn and focus on solving complex product problems.\nKey Responsibilities:\nConducting user research to understand the needs and pain points of the target audience.\nCreating user personas and journey maps to guide design decisions.\nDesigning wireframes, prototypes, and high-fidelity mockups.\nConducting usability testing to validate design solutions.\nCollaborating with cross-functional teams, including product management, engineering, and marketing.\nCommunicating design decisions and rationale effectively to stakeholders.\nStaying up-to-date with industry trends and best practices in UX design.\nProviding design guidance and mentorship to junior designers.\nParticipating in the entire product development process, from research to launch.\nContinuously iterating on designs based on user feedback and data analysis.\n\nRequirements:\n\n\n3+ years of experience working as a UX designer on SaaS products\nMaster of design tools such as Sketch and Figma\nStrong understanding of user-centered design principles and techniques\nStrong portfolio demonstrating a track record of creating intuitive and user-friendly software\nExcellent interpersonal skills\nExperience with A/B testing and working with data intensive products\nAbility to work in a fast-paced, dynamic environment\nStrong analytical and problem-solving skills\nStrong attention to detail and ability to work with ambiguity\nExtra Points:\nInterest and background in fintech\nExperience selling products on Amazon, Shopify, BigCommerce…\nStrong public speaking skills, including confidence and stage presence\nIf you're still nodding your head in agreement and this seems like a good fit, don't hesitate to reach out—we're looking for you!Show more Report"}, {"company": "Finonex", "job": "Product designer", "city": "Herzliya", "date": "19d", "rating": "", "link": "", "description": "About the role:Finonex is looking for a talented product designer to join our team in our office in Herzliya, Israel.As a product designer, you will be responsible for designing and creating our product's user experience, user interfaces, and other visual elements. You will work closely with our product and development team to ensure that our visual design is aligned with our product and brand strategy.We are looking for a customer centric, creative, passionate, pixel-perfect with an eye for quality, product designer.Our work model is hybrid, combining remote and on-site workIn this role you will:Responsible for user experience and visual design concepts across our products and platforms.Design and implement challenging interfaces for web and mobile environments.Create wireframe, high end mockups and prototyping to launch and beyond.Shape and design features and be involved at any stage of the product design as necessary.Act as the user-advocate, subjecting early-stage designs to usability testing or expert review, and offering suggestions from a user perspective.Deliver measurable results to platform user experience and customer satisfaction.Conduct a full design cycle from collecting inspiration through creating a pixel-perfect UI for all states and scenarios, and deliver to development including all possible scenarios and create product flowsCollaborate daily with Product Managers and Software Developers to define, design, and deliver great products.Advocate for the prioritization of design centered changes, refinements, and improvementsLead brainstorms sessions and always look for improvements. Be initiative, suggest solutions and find problemsUse design to go beyond jobs-to-be-done to delight and bring in brand experiences.Lead with customer obsession, guide towards strong user experience and strategically leverage user research.You have:+ years of experience in designing customer-facing digital products, web and mobile.Deep understanding of UI and UX principles, practices and tools.Strong working knowledge and proven portfolio- a portfolio review will be required for all candidate interviewsAbility to craft a basic prototype, manage tasks according to set priorities, multi-task and meet deadlines.Out of the box thinking, eye for design and high creativity.Good communication skills, able to take feedback from anyone in any rank.Independent worker but with strong team player qualitiesPixel-perfect with attention to the smallest of detailsProficiency in Figma, Sketch or similar softwareHighly motivated and fast learner with multitasking abilities.Ability to understand and translate high-level business concepts and product vision into your work with all stakeholders.Can do approach.Ideally a bachelor’s degree in Product Design, Human-Computer Interaction Design, or other relevant fieldsWill be nice that you have:Work experience in a trading On-line companiesWork experience in SAS platformsBezalel Academy of Art and Design or Shenkar College graduateJob Type: Full-timeShow more Report"}, {"company": "Appdome", "job": "Product Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=112&ao=1136043&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_31f3c9d9&cb=1678899897264&jobListingId=1008439770186&jrtk=3-1-1grj3mor0kcn2801-1grj3gsk82a83000-59517c7b28a193ff-", "description": "Tel- Aviv · Full-time · Intermediate\nAbout The Position\nWe are looking for a sharp and experienced Product Designer to join our team, to help us take our system to new heights and showcase our customer obsession with the best UI possible.\n﻿Responsibilities:\nCollaborating cross-functionally with product management and development teams to deliver high-level results, with attention to detail, craft, and a consistent look & feel product\nMaintaining and evolving our system design, in collaboration with our front-end developers, to ensure the UI is consistently implemented across our product console\nSolving complicated design issues and turning user stories and roadmap requirements into intuitive, clear and effective user flows and experiences\nFollowing features throughout their full life-cycle: from ideation to implementation, hands-on in every stage: wireframes, prototypes, design mocks, guidelines & documentation, last-minute changes, research, customer and stakeholders feedback, next phases and QA\nWorking closely with the development team:\nCreating UX specifications and guidelines\nExecution of UX/UI QA\nCreating and refining product style guide and component documentation\n\nRequirements\n2+ years of experience designing advanced analysis software services for professional and technological users, involving visualization of data and analytical solution\nUnderstanding the complexity and specificity of designing user experience and interface for B2B services, with various user and customer definitions and business goals\nSuccessfully taking ownership of your work inside a product pod and being capable of collaborating independently with product and R&D teams\nExperience working with complex desktop and web systems\nExpressing your ideas and opinions in a cohesive, communicative, and compelling way, and holding your ground in professional discussions\nBeing curious and always learning new things\nUnderstanding the importance of designing whole flows and solutions rather than individual screens or elements\nExperience working with Figma, Sketch, Zeplin, InVision, Axure, etc.\nNice to have’s:\nBachelor's degree in Visual Communication\nBeing fluent in English – both writing and speaking\nAnalytical and tech-savviness\nExcellent soft skills and people skills\nCSS or any other programming experience\nExperience with UX research (user interviews, collecting and analyzing data)Show more Report"}, {"company": "OpenWeb", "job": "Product Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=1136043&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_65a7e9bf&cb=1678899899213&jobListingId=1008393417921&jrtk=3-1-1grj3mqo0kblo801-1grj3gsk82a83000-563d82becb4e2885-", "description": "We create a safe space for communities to thrive.\nOpenWeb's mission is to improve the quality of conversations online, building a healthier web where content creators of all kinds are empowered to thrive. As a product company, OpenWeb partners with publishers and brands to build strong, direct relationships with their audiences.\n\nOpenWeb's technology empowers its partners to build vibrant communities rooted in healthy conversations and robust social experiences.\nOpenWeb works with more than 1,000 top-tier publishers, hosting more than 100 million active users each month.\n\nFounded in 2015, OpenWeb has nearly 300 employees in New York City, Tel Aviv, Kyiv, San Diego, Canada, London, and Paris and is backed by world-class investors including Georgian, Insight Partners, , Entrée Capital, The New York Times, Samsung Next, Dentsu, and ScaleUp. To date, the company has raised $393 million in funding and is currently valued at $1.5 billion.\n\nTo learn more about OpenWeb's platform visit OpenWeb.com, or follow @OpenWebHQ on LinkedIn and Twitter.\n\nHow You'll Contribute as our Product Designer:\n\nCollaborate with the design and development team to conceptualize and execute designs for web and mobile platforms.\nWork with product managers to understand projects' requirements and deliverables.\nContribute to UX design efforts by conducting user research and testing.\nUse Figma to create wireframes, prototypes, and visual designs for web and mobile platforms.\nTake a part in our Design System development and maintenance.\n\nThe Skills and Experience You Bring:\n\n2+ years of experience designing for web and mobile platforms.\nStrong portfolio of UX-UI design works.\nExcellent communication and problem-solving skills.\nAbility to work in a team environment.\nAttention to detail and ability to deliver high-quality work on tight deadlines.\nProficiency with Figma.\nEnthusiasm for staying up-to-date with emerging design trends and technologies.\nBasic familiarity with HTML, CSS, and other front-end technologies.\nDesire to continually learn and improve.\n\nBuild your skills with us as you build a better web for everyone. Join us!\n\nAlso, we care about your privacy! Please take a moment to review OpenWeb's Privacy Practices.Show more Report"}, {"company": "adklix", "job": "Designer", "city": "Raanana", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=114&ao=1136043&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0fb6b3ae&cb=1678899900963&jobListingId=1005649432572&jrtk=3-1-1grj3mseoma4m801-1grj3gsk82a83000-ae61e9c7bbb15128-", "description": "Responsibilities:\nWe are looking for graphic designers to assist with the development of templates for a wide range of industries. This will be a full-time position.\n\nRequirements:\n\nGreat design skills with a sense of design, composition and color\nAbility to work quickly and create many different looks\nProficiency in Photoshop, Illustrator, Draw or other design tools\nAbility to learn our composition and design platform (if you know these other products you will pick it up in minutes)\n\njobs@adklix.comReport"}, {"company": "", "job": "Product Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=115&ao=1110586&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_690e641a&cb=1678899902062&jobListingId=1008151106664&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj3mtfskcm5801-1grj3gsk82a83000-bda560c74bd9781b--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBvbVAMtoXUX9BnFgS3dzEfHBVW07oPmHK0whkffRzM8vg8twICdy-XnjtbEqd-yCgrlowkbx4khFIuajjDyzPJgJLgN3tAarNSx0tWcBGRANNQWJtvXSBlSwD6OH1xQpjR6Ngzoa25TBZYrlaFhQkUXJBobXga670QHMm8BXsR6e4brtUOJqUKZwUw0tlUmTFDbBZIU8Sd_H4o2gB5OH74KG5qvYQFKkoihv6vizfI1d7W7CF47N1tMoUpZbZvP5iHQzO_6sGeeti4AD_ZjhIqnLlX_NPvigUPDmc8rhGX0QC7q07oh8x2JOYPQgmcxAYN12UG_abWWNXK-y4RMMXN1IpuUjtjWFMfc-4H-ADkN_OrpJok4gE2ECRAPh_v6WMA-iZGpp8IklBuXY3n6JFmWCc7VNBjoBPaV-mIpxcCN_rMZr_4HjUJ6UjcxNpwmti_R-2ICYpt-3TXlVVUPjK1rPzyss7v0Tccb2XNbnkQ_eiQzMK0mL9NVgOKtiwpizvvNb3yR0MMPumaZotMRkBLYO7XavQcNIVdkjP2DwRgEbLcZf5Z0lniOZlRTRJ3PQ4gT0BVrbMUr3Q6eJdrJpTNaIv-0rErSVwb0DjqL95Lev2hOJxsPf3J-ohBn1Rqp3mHJ8TnxCnB-KQx8XOdMXdF", "description": "A well-funded software company- SaaS/B2B, is looking for a highly talented and experienced Product Designer At least 3 years of UX/UI design experience in a SaaS environment, B2B / B2C / B2B2C company. A deep understanding of UX principles based on behavioral psychology, cognitive biases, and visual perception. End to End accountability and ownership of tasks. An exceptional portfolio demonstrating strong product and visual design capabilities, experience in creating frictionless user experiences, concepts and customer journeys.\n\nExperience in wireframing and prototyping using tools like Figma/Zeppelin. An ability to explain complex concepts and ideas in a simple and clear way to people from various backgrounds. Enthusiastic about the small details and excited to keep pushing it until its pixel-perfect, but also able to balance the trade-offs and work in short iterations. Fluent English - speaking and writingShow more Report"}, {"company": "experis (כח אדם)", "job": "סטודנטים", "city": "Kfar Saba", "date": "28d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=1136043&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_dc2323ae&cb=1678899903275&jobListingId=1008472301465&jrtk=3-1-1grj3mum4khpv801-1grj3gsk82a83000-e9e127036e1b90f3-", "description": "אני פונה באופן לא רשמי, ורק מנסה לעזור, אולי אצליח לעזור למישהו/י למצוא עבודה חדשה..בחברת סיליקום מחפשים בוגר/סטודנט לקראת סיום הלימודים הנדסאי חשמל/אלקטרוניקה/מכטרוניקה מצטיין בלי ניסיון או לחלופין הנדסאי עם ניסיון רלוונטי לתפקיד pcb layout designer (עורך מעגלים מודפסים).משרה מלאה במחלקת הפיתוח בכפר סבא.למתאימים נא להעביר אליי קורות חיים, דיפלומה וגיליון ציונים למייל |** לפנייה למשרה יש להגיש מועמדות **|בהצלחה!Show more Report"}, {"company": "Apple", "job": "Electro Optical Designer Student - Imaging & Sensing Technology Group", "city": "Herzliya", "date": "12d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=117&ao=1136043&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d577846a&cb=1678899904400&jobListingId=1008507046379&jrtk=3-1-1grj3mvnjjijg801-1grj3gsk82a83000-838d28d601456fce-", "description": "Summary\nPosted: Oct 30, 2022\nRole Number:200439437\nThe Imaging and Sensing group at Apple develops depth sensing systems such as the revolutionary True Depth camera that powers FaceID, as well as other cameras in Apple products. This multi-disciplinary group of engineers is responsible for architecture, design, and development of these highly complex sensing systems for Apple products. The team is seeking a student specializing in optics, in order to support optical design and simulation tasks.\nKey Qualifications\nA student for Masters or PhD specializing in optics.\nExperience in building optical setups \\ operating optical instruments.\nExperience in Matlab simulations of optical systems.\nKnowledge of sequential Zemax – important advantage.\nProficient verbal and written English language skills.\nDescription\nIn this position you’ll get to work on a variety of projects that have core optical components: Optical simulations of cameras / laser systems. Designing optical concepts for future products. Developing methods for characterization and testing of novel optical components. Presenting plans and results to the multi-functional team.\nEducation & Experience\nM.Sc/Ph.d in Electrical Engineering\\ Physics, majoring Optical Engineering or related fields\nAdditional RequirementsReport"}, {"company": "vcita", "job": "Product Designer - WiseStamp", "city": "Tel Aviv-Yafo", "date": "16d", "rating": "4.6", "link": "", "description": "In a nutshell:\nWe are seeking a talented Product Designer with a strong background in user experience to join our team. The successful candidate will work closely with product managers and developers to deliver delightful design solutions that meet our customers' needs. As the only product designer in the company, you will take part in strategic problem-solving efforts and have a meaningful impact on the user experience.\n#LI-Hybrid\nRequirements:\n\nAt least 4+ years of experience in designing B2B SaaS products\nA portfolio of work that demonstrates a breadth of visual and interaction design skills\nProficiency in mockup tools such as Figma\nStrong understanding of user-centered design principles\nAbility to work well in a team environment\nAbility to clearly articulate and communicate design decisions\nPassion for creating innovative and user-friendly products\nResponsibilities:\n\n\nCollaborate with product managers to develop wireframes, mockups, and prototypes\nEstablish design systems to ensure consistency and efficiency\nWork with front-end developers to ensure that designs are implemented as intended\nLearn the business impact of your designs and suggest improvements\nParticipate in user testing to ensure that the designs meet the needs of our users\nStay up-to-date with the latest design trends and best practicesShow more Report"}, {"company": "Finonex", "job": "Platform Product Manager", "city": "Herzliya", "date": "19d", "rating": "", "link": "", "description": "About the role:Finonex is looking for a talented and passionate product manager to join our team in our office in Herzliya, Israel.As a product manager, you will be responsible for our web and mobile trading platform.You will work closely with cross-functional teams including engineering, marketing, and design to identify and prioritize opportunities for growth in our international markets and lead the development and execution of product strategies and initiatives that drive engagement and revenue.Our work model is hybrid, combining remote and on-site workIn this role you will:Ownership of product requirements, driving the product life cycle in an agile methodology.Define roadmap, take it from vision to reality and prioritize product requirements.Manage the full product life-cycle, from product definition through launch to maintenance - ideation, scope, specification, prioritization, design, implementation, quality assurance, launch, and iteration.Define and build metrics and OKRs and drive growth in multiple aspects of the product.Highly analytical with attention to detail, able to complete extensive market research.Analyze usage patterns and solve problems.Keep investigating for new tools and services that can help deliver better productsPlanning the features with a designer, to create the best UI & UX.You have:4+ years of experience in product management in B2C productExperience with defining and measuring product and usability KPI'sA great sense for user experience and designStrategic thinking with good planning skills.Ability to manage lifecycles of several products simultaneously.Technological orientation and understanding of the development cycle.Excellent English level with excellent verbal and written skills.Ability to explain complex requirements in simple terms, excellent communicator (both written and verbal).Experienced in driving collaboration across multiple disciplines - Product, UX, R&D, Marketing, CS and Sales.Self-driven and organized with the ability to effectively prioritize and execute multiple initiatives.Strong leadership, organizational and execution skills.Will be nice that you have:Work experience in a trading on-line companiesWork experience in SAS platformsJob Type: Full-timeShow more Report"}, {"company": "SAR Technologies", "job": "Platform product manager", "city": "Herzliya", "date": "19d", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=120&ao=1136043&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c7aff774&cb=1678899908105&jobListingId=1008489520861&jrtk=3-1-1grj3n3e5kcn1801-1grj3gsk82a83000-ee38b6c86cda5eab-", "description": "Finonex is looking for a talented and passionate Platform product manager to join our team in our office in Herzliya, Israel.\n As a product manager, you will be responsible for our web and mobile trading platform.\nYou will work closely with cross-functional teams including engineering, marketing, and design to identify and prioritize opportunities for growth in our international markets and lead the development and execution of product strategies and initiatives that drive engagement and revenue.\nOur work model is hybrid, combining remote and on-site work\nIn this role you will:\nOwnership of product requirements, driving the product life cycle in an agile methodology.\nDefine roadmap, take it from vision to reality and prioritize product requirements.\nManage the full product life-cycle, from product definition through launch to maintenance - ideation, scope, specification, prioritization, design, implementation, quality assurance, launch, and iteration.\nDefine and build metrics and OKRs and drive growth in multiple aspects of the product.\nHighly analytical with attention to detail, able to complete extensive market research.\nAnalyze usage patterns and solve problems.\nKeep investigating for new tools and services that can help deliver better products\nPlanning the features with a designer, to create the best UI & UX.\nYou have:\n4+ years of experience in product management in B2C product\nExperience with defining and measuring product and usability KPI's\nA great sense for user experience and design\nStrategic thinking with good planning skills.\nAbility to manage lifecycles of several products simultaneously.\nTechnological orientation and understanding of the development cycle.\nExcellent English level with excellent verbal and written skills.\nAbility to explain complex requirements in simple terms, excellent communicator (both written and verbal).\nExperienced in driving collaboration across multiple disciplines - Product, UX, R&D, Marketing, CS and Sales.\nSelf-driven and organized with the ability to effectively prioritize and execute multiple initiatives.\nStrong leadership, organizational and execution skills.\nWill be nice that you have:\nWork experience in a trading On-line companies\nWork experience in SAS platformsShow more Report"}, {"company": "UI", "job": "UI DESIGNER", "city": "Netanya", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=121&ao=1136043&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_61a919e2&cb=1678899909141&jobListingId=1007149338351&jrtk=3-1-1grj3n4efkbkm801-1grj3gsk82a83000-c329a5886c8fea23-", "description": "If design is baked into your DNA and you’re curious to explore new challenges in designing complex systems, you’re in the right place:) Our team is looking for an UI designer to join our group of visual magicians.\nAs a UI Designer, you'll be responsible for designing usable and delightful interfaces and interactions. You’ll cooperate closely with UX and development professionals up to the point of execution that takes a product from good, to great, to exceptional.\n\nWhat you bring to the table\nTalented UI / UX designers, motivated to develop and specialize in the field\nDegree in visual communication\nAdvantage for lovers of motion and illustration\nOr in short people who love people and pixelsShow more Report"}, {"company": "DataRails", "job": "Product Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.9", "link": "", "description": "Datarails is an Israeli based Fintech Startup in massive growth, and we're looking for a talented and experienced product designer to join the team!\nDatarails is a SaaS B2B solution that tackles one of the biggest challenges in financial departments: the overflowing amount of data that, up until now, was managed by tons of Excel sheets. All those financial reports, forecasts, expenses, analytics? DataRails takes all this data and integrates it into a one, simple, smart report. It consolidates the information, enables the finance professionals to follow it, manage it, and create the ever-needed order within the realm of finances. It’s cloud-based, so nothing gets lost, it’s brilliant, so almost every feature can be added.\n\nAbout The Role:\n\nWe are looking for a motivated UX Designer with a strong track in B2B SaaS data products.\nAs a UX designer in Datarails, you'll join our Product team and play a critical role in making our product user friendly, easy to use and one of a kind. The product department at Datarails is creating a groundbreaking product. And we mean it. We're literally taking over the world of finance.\nWhat You'll Do:\n\nDesign and implement features by creating user flows, wireframes, pixel-perfect designs (and animated prototype whenever needed)\nConduct the full design cycle - from functional design and interaction UX to visual UI and dev handoff\nRaise the bar for product quality by advocating for user-centered design and insights driven by research based on data, support tickets, competitor analysis, and usability sessions with real users\nApply global UI standards and design systems effectively, identify areas of improvement, and offer solutions\nCollaborate daily with Product Managers, software developers and UX/UI Designers in order to define, design, and deliver extraordinary products\nAsk questions to ensure a clear understanding of current and future tasks, and to help manage relative priorities\nHave full ownership over product design processes\nConceptualize original ideas that bring simplicity and user-friendliness to complex design challenges\nEstablish and promote design guidelines, best practices, and standards\nWork in a dynamic and high-paced environment that is creating scalable extraordinary products.\nWhat We Need:\n\n4+ years of demonstrated experience in product design in a product company, B2B company is an advantage\nExperience in designing complex systems\nExperience creating and working with design systems\nAbility to understand complicated concepts and translate them to an excellent user experience\nWorking knowledge of the ideation and creation of UI design deliverables: Sitemaps, user flows, wireframes, low-fidelity and high-fidelity layouts, prototypes.\nA strong portfolio, demonstrating excellent product thinking, visual design, and problem-solving\nExperience participating in product exploration, conceptualization, and validation processes\nProficiency with advanced design tools (Figma - preferable)\nExcellent communication skills\nYou’re highly resourceful and motivated, capable of taking on big projects independently\nAdvantage: Experience with the Finance Industry\nWhat We Offer:\n\nWe offer a supportive, agile and creative work environment with brilliant colleagues!\nCompetitive compensation, ongoing recognition, and most of all, a chance to learn, contribute and develop your skills.\nOpportunity to join an explosive industry, a successful and growing organization, and an unmatched leadership team, passionate about their employees!\nMost of all we will give you fun, enthusiasm, support, a passion for healthy living, and never a dull moment!\nEEO Statement:\n\nWe want to make sure everyone has an equal chance to participate and make a difference. Datarails is an equal opportunity employer and prioritizes building a diverse and inclusive workplace. We provide equal employment opportunities to all employees and applicants of any type and do not discriminate based on race, color, religion, national origin, gender, age, sexual orientation, physical or mental disability, genetic information or characteristic, gender identity and expression, veteran status, or other non-job related characteristics or other prohibited grounds specified in applicable federal, state, and local laws. Datarails’ policy is to comply with all applicable laws related to nondiscrimination and equal opportunity and will not tolerate discrimination or harassment based on any of these characteristics. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.Show more Report"}, {"company": "Bizzabo", "job": "Product Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.6", "link": "", "description": "Experience is at the forefront of everything we do. The job of a Product Designer in Bizzabo is to envision how people experience our product and bring that vision to life in a way that feels inspiring, refined, and even surprising. As a Product Designer at Bizzabo, you'll take on complex tasks and transform them into elegant and easy-to-use designs for our customers. Achieving this goal requires collaboration with engineers, and product managers throughout the design process&mdash;from initial ideation to creating user flows and wireframes to building prototypes and final designs. You will, along with your team at each stage, learn our user's pain points, search for creative opportunities, and ensure that the final product addresses the solution delightfully.As a Product Designer, you will be a creative problem solver and deep thinker. You will work closely with developers and product managers, and other cross-functional partners to iterate and optimize the user experience and drive product excellence.Bizzabo powers immersive in-person, virtual, and hybrid experiences. The Bizzabo Event Experience OS is a data-rich open platform that allows Event Experience Leaders to manage events, engage audiences, activate communities, and deliver powerful business outcomes &mdash; while keeping attendee data private and secure. Bizzabo powers the events of world-leading brands &mdash; from Fortune 100 enterprise organizations and financial institutions to creative agencies and scaling tech companies. Bizzabo was founded in 2011 by Boaz Katz, Alon Alroy, and Eran Ben-Shushan, and is headquartered in New York and Tel Aviv.Requirements:What you’ll be doing:Work closely with product managers, engineers, UX writers, to craft designs that solve problems in an inspiring way.Create use cases and prototypes to validate your ideas with our users, iterate your concepts, and push into production pixel-perfect designs when ready.Communicate interaction concepts, conceptual ideas, and design rationale with clarity, persuasion, and a user-centered design process.*Who you are:*+3 years of experience designing at a product-focused tech company, having full ownership of the entire product life cycleVast experience designing for mobile or web.Innovative problem-solver; your passion is transforming complex problems into simple and intuitive user experiences.A “yes, can-do” approach is a must.An understanding of product and design methodologies.Understanding of both qualitative and quantitative user data (A/B testing, analytics tools, usability testing, and user interviews).Highly independent yet a strong team player. We love people with solid and unique opinions that don’t need hand-holding. Yet no designer is an island, and being a team player is a must.You use all tools available to express your ideas. But mostly Figma :)A visual communication degree is a plus.Curiosity and willingness to learn - a must.Job Type: Full-timeShow more Report"}, {"company": "Seperia", "job": "Project Manager", "city": "Herzliya", "date": "30d+", "rating": "4.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=124&ao=1136043&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_5c5e57ee&cb=1678899913280&jobListingId=1008454526356&jrtk=3-1-1grj3n8fe2i74001-1grj3gsk82a83000-2dd7a7e97e40b648-", "description": "Seperia builds and operates global fintech review sites. From 2003, we have been driving millions of sales to our partners (advertisers). We do it by focusing on value added content, wrapped within an engaging web product and matched with high-intent traffic.\n\nWe’re looking for our next Marketing Project Manager.\n\nWhat You Will Do:\nWork with the product designer, the acquisition team, and developers to create, manage and expand our leading, user-centric review sites.\nCommunicate with international brands on a monthly basis – manage the partnerships, evaluate their performance metrics, and drive product monetization.\nPerform hands-on research, analysis, planning, and execution of tasks.\nWork across interfaces to complete various tasks, through tools such as WordPress, Google Analytics, and BI systems.\nLead broad initiatives related to the product.\nWhat You Need:\nGreat written & verbal communication skills (Hebrew & English) – a must.\nAn independent and performance-oriented attitude with the ability to drive people and processes.\n1+ years of experience in product (marketing) management, project (marketing) management or global website management.\nA web-savvy mindset.\nExperience in managing websites via WordPress – advantage.\nTechnical capabilities & experience working with developers – advantage.\nWhat We Offer:\nHuge potential for growth. Our company is growing and we’re looking for someone who can grow with us.\nFreedom – we care less about formalities, and more about results. With a dynamic, informal environment, we keep excellence, innovation, and results at the forefront.\nUpside – as a performance marketing company, we develop global-level, scalable marketing assets with no glass ceiling. You can enjoy a growing upside.Show more Report"}, {"company": "COSENTINO", "job": "Sales Development Representative", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=125&ao=1136043&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7238b4d8&cb=1678899914286&jobListingId=1008463889218&jrtk=3-1-1grj3n9fb2het001-1grj3gsk82a83000-5ab79720b282d04b-", "description": "Mar 11, 2023\nTel Aviv, IL\nWhat are we looking for\nIn order to develop a high-performance sales team, we are looking for a qualified Sales Development Representative Israel (SDR) to find and select potential customers who can benefit from our products and services.\nThis figure will manage both the requests made through the different channels (Inbound) and the prospecting and search for new business outside our systems (Outbound). The objective is to identify potential customers, initiating new relationships and putting them in common with our sales representatives in order to obtain new business. Every lead is an opportunity to drive top-line revenue growth, customer acquisition levels and profitability.\n\nWhat you will do\nRepresent our company's products and services, starting with a comprehensive understanding and ability to explain and prescribe our materials and applications based on consumer needs.\nIdentifying potential customers/business opportunities through inbound requests (Inbound) and building relationships by working the prospect base and opportunities out of our systems (Outbound).\nManaging and maintaining a portfolio of active leads and engaging sales reps when there is a business opportunity (short and medium term).\nFollow-up of the management of potential opportunities by the sales force and action in case of non-compliance with the protocol (contact with sales representatives).\nIdentification and sharing of best practices to optimize the protocol for managing potential opportunities.\nManagement through Salesforce, cold calling, and email to generate new sales leads.\nIdentify prospect needs and suggest appropriate products/services.\nBuild long-term trusting relationships with prospects/leads to qualify those consumers as sales opportunities.\nProactively seek out new business opportunities in the marketplace.\nReport to sales manager with weekly, monthly, and quarterly results.\nWhat you need to succeed\nBachelor's degree or at least 5 years of relevant work experience.\n2-3 years of sales experience, with a track record of exceeding key targets.\nStrong phone and email communication skills.\nAbility to customize the pitch based on the needs and particularities of the client and their business context.\nProven creative problem-solving approach and strong analytical skills.\nStrong desire and ability to move up within a sales organization. Attitude.\nHigh level of English and Hebrew.\n70% remote.\n\nSkills valued positively:\n\nProficiency with SalesForce and Teams.\nBachelor's degree or diploma in Technical Architecture or higher or Interior Design.\nPrevious experience as a sales development representative with a track record of meeting sales quotes.\nWhat we do offer\nBeing part of the world leader in the production and distribution of quartz and other natural stone surfaces, Cosentino Group.\n\nYou will join a company:\nWith an international mindset and presence in 100+ countries.\nWith an amazing growth story, sustained by an extraordinary innovation with products such as SilestoneÂ®, DektonÂ® and Sensa by CosentinoÂ®.\nIn which you will be able to grow your career and develop your leadership skills.\nLocation: Ha-Sadna'ot St 11, Herzliya, 91083, Israel.\nAbout Cosentino\nAt COSENTINO, our purpose is to inspire People through innovative and sustainable spaces. We are the world-leading producer of architectural and decorative surfaces. Our products are designed to provide innovative and functional solutions for either home and business spaces, such as Kitchen and Baths worktops, outdoor open spaces, facades, etc. Innovation, sustainability, functionality and beauty describe our value proposition to the different market stakeholders and end Clients. www.cosentino.com\n\nWith a presence in more than 100 Countries and 5 continents, our business keeps growing consistently in all geographies. as well as career opportunities for Talented people like you.\n\nCosentino is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: Cosentino is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Cosentino are based on business needs, job requirements and individual qualifications, without regard to race, colour, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate.\n\n\nCosentino will not tolerate discrimination or harassment based on any of these characteristics.”\n\nJob Segment: Sales Rep, Outside Sales, Interior Designer, Sales, CreativeShow more Report"}, {"company": "Roundforest", "job": "Senior Product Designer", "city": "Ramat Gan", "date": "13d", "rating": "4.1", "link": "", "description": "Description:\nRoundforest is on a mission to help busy people make shopping decisions with peace of mind. We’re looking for a passionate candidate who gets excited about the opportunity to join our journey and impact 40,000,000 consumers (and counting).\nSenior Product Designer objective:\nAs a Senior Product Designer at Roundforest, you will be responsible for creating friendly, visually appealing and usable products. You will own the design of one of our products and work collaboratively with your pod (product manager, engineers, data analysts) as well as your guild (other product designers) to deliver high-quality products that meet the needs of our users.\n**Please attach an updated portfolio to your application**\nAt Roundforest, we value creative thinking and therefore often will do things differently. Accordingly, Roundforest's Senior Product Designer role may differ in a few ways from similar positions out there:\nOur product designers work as part of a product pod, which is a bit like a little start up within a start up. Instead of designers working in isolation or only with other designers, here they closely collaborate with cross-functional individuals (product managers, data analysts, engineers) to create impactful solutions that address real user problems. By working in pods, designers are able to fully immerse themselves in the product and gain a deep understanding of the user's needs. This approach fosters a culture of innovation and creativity, and enables us to deliver products that truly resonate with our users.\nFinally, we’re looking for candidates with a ׳hop margin׳ - a secret ingredient we look for in all new hires. In other words, this position requires the candidate to leap into the next phase of their career and to step outside their comfort zone, while maintaining a reasonable learning curve. Let's evolve together!\nRequirements:\n\n5+ years of experience in product design\nData-driven with deep understanding of UX methodologies\nA proven track record of applying user-centric design principles into products\nStrong communication skills and ability to work with various stakeholder\nExcellent visual, interaction and prototyping design skills\nDiverse Perspectives\nWe know that innovation thrives on teams where diverse points of view come together to solve hard problems. As such, we explicitly seek people who bring diverse life experiences, diverse educational backgrounds, diverse cultures, and diverse work experiences. Please be prepared to share with us how your perspective will bring something unique and valuable to our team.Show more Report"}, {"company": "Valens", "job": "Board Designer", "city": "Hod HaSharon", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=127&ao=1136043&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7ec02eba&cb=1678899916958&jobListingId=1007580391524&jrtk=3-1-1grj3nc2thaqc801-1grj3gsk82a83000-95c4d946380af45e-", "description": "Responsible for developing new reference designs & applications (based on Valens chip set and various peripherals)\nCollaborate with other team members to deliver high quality board designs with a timely, successful release to production\nSupport demo shows, POCs projects and other various activities within the group\nJob Requirements\nAt least 3 years of experience with board design (analog and digital)\nHands-on experience designing and accompanying full product design process\nExperience with high-speed board/system design, schematic capture, component selection and board layout\nLab bring-up, testing, and debugging (including board-related bring-up with software, familiarity with signal-integrity aspects, etc)\nTechnical knowledge and design/working experience with PCIe, Ethernet, SerDes, I2C/SPI/MDIO\nExperience working with external designers and manufacturers of Mechanical enclosure – An advantage\nExperience working with thermal analysis – An advantage\nEMC – Experience with design and testing using external labs – An advantage\nExperience in board design for video applications (e.g. Camera, DVR or Video matrixes) – An advantage\nExcellent communication skills with fluent verbal and written EnglishReport"}, {"company": "FIVE Product Definition", "job": "PRODUCT DESIGNER hired", "city": "Petah Tikva", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=128&ao=1136043&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_42abbe4e&cb=1678899918370&jobListingId=1007013697177&jrtk=3-1-1grj3ndehmbj1801-1grj3gsk82a83000-5a6c19db763ced3e-", "description": "We are looking for a truly talented Product Designer with innovative and unique creative vision; one with excellent ability to understand and design highly complex screens, and with pixel perfect design skills.\n\nYou’ll be responsible for all interface design aspects for digital products, and work closely with Design, Product, Marketing and Dev teams to create design solutions for complex digital products in various fields and platforms.\n\nRequirements:\n\nProduct design portfolio\nMastery of various design tools (tech-savvy skills – advantage)\nStrong attention to detail\n\nJob location: Petah Tikva\nJob type: flexible\nMail to: designer@5ive.co.ilReport"}, {"company": "PRIMIS", "job": "Product Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=129&ao=1136043&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a7a3cc22&cb=1678899919885&jobListingId=1008437629237&jrtk=3-1-1grj3neuak24q801-1grj3gsk82a83000-4a9d02d7e39884d4-", "description": "A Bit About Us\nWe are an ever-evolving company, driven by our passion for video.\nWe’ve grown from a small start-up to a thriving business,\nand have been a part of the biggest global ad agency for ten years.\n\nOur main priority is maintaining our fun and determined environment\nand keeping our employees engaged in their work.\nWe need people that are as passionate about video and the ad tech industry.\nIf you are ambitious, hardworking, and motivated, we want to get to know you!\nAbout the Position\nThe Product Manager will be a part of the product team and be responsible for managing Primis business logic products, monetization, and dashboards.\n\nWhat you’ll do:\n\nWork with internal stakeholders and customers to collect requirements and write detailed requirements\n\nProvide the R&D with detailed specifications in Epics and US methodology\n\nWork with UI/UX product designer to deliver clear wireframes and user journeys\n\nProduct documentation such as product brief, product description, operational guide, release notes, and product presentation\n\nCompetitive analysis\n\nBe on top of the video discovery advertising standards, changes, and trends, as well as privacy rules\n\nQualifications\nExperience in the ad tech video industry, or working with internet/media companies\n\n\nExperience in programmatic advertising monetization methods, prebid, RTB, and VAST protocols\n\nExperience working with Google GAM\n\n3+ years of product management experience in SW companies\n\nExperience working in agile methodology\n\nAbility to quickly and effectively explore new subjects, identify knowledge sources and understand new technologies, markets and concepts independently\n\nStrong analytical thinker, organized, with attention to details\n\nExperience participating in the complete product lifecycle of web and/or software product\n\nAbility to thrive in a fast-paced startup working environment\n\nPro-active and independent achiever, self-learner, able to handle a task from ideation to production\n\nGood communication skills across teams and with usersShow more Report"}, {"company": "WebNews", "job": "UX DESIGNER [JUNIOR]", "city": "Netanya", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=130&ao=1136043&s=58&guid=00000186e63872448af37e092f8830f9&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4285a9c6&cb=1678899920924&jobListingId=1005947207547&jrtk=3-1-1grj3nfupm6q0801-1grj3gsk82a83000-a2a568d93fa7fdc8-", "description": "Ability for good analysis and attention to detail\nCreativity and original way of thought\nAbility to learn quickly\nMaster’s degree in relevant fields (human engineering / cognitive psychology / industrial psychology, industrial engineering and management)\nSuperb human relations, including management and customer-facing capabilities.\nAbility to work well on your own as well as in a team\nCV: jobs@webnewsltd.co.ilShow more Report"}], [{"company": "אורגד מאגרים בע''מ", "job": "Chip Architect", "city": "Southern", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=101&ao=1110586&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ff95c0e3&cb=1678899922559&jobListingId=1007233305133&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj3nhhrjcb9801-1grj3ias7i38u800-2c1a5984f2d4a64e--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBZsODucnGrJLWj5MeRYhhBQWbIM2Fu4452kic8zLEsH3LNY2Br28VklcO2krxVESWfzoo7-NHecT4GzAEBvG8aUh7aRihQ1y-ChRj7ixRvN5gHq11Eei7EbS5xRzFHf-9QUPtR43gJ-q80MCCKL9RUGQ_ljYX811RrXG_4kWesff4BOaYrXe-gBSEmurlDCAdUfzV3rjNFtyUhWD4pHDG5K3CfL-nIlgZzSEoUyP_JQD3IeNXwEMBTELqz6cL4PmqrWkvSrir4Rq-Q0HM0E7Z1LZbGcVv4S5MB11TBOAmpnX4k_BK5XEDPWods0K9GYewUF04UW6CpCFAIBcv-LzYz6XLe7alJd1M4ANbs7-C0JmW69eTUAEsCOCB0IJZLxOzrTYlZDZ5aIN4U_6pYJUtYrf0q1JMZIjPmBhbK-BbTe5pXqjSGQn8WUJagsSYrgcZ-U-X-l_Qog5OL76scKn-6Qu1Z6HiH0PdwhV5OmKB7nXrRG7y-IA6Fm_AYH6wvEm45Q1PdilVE6Tp1Kau37qnJqwfImLlh0XXzBrhBEIowgHBvaXyDeuzdJ0S-_j2izE6q6mFWHpMluoKIRzlpCC2ilKA2wb9q-MQi0PszicukhnQk5d_IUzzH4O0d0YCB4kQ6uYvrtcnmGWY9br6VoJd-", "description": "§ Define the architecture of complex, high performance VLSI products for Analytics & AI acceleration § Work closely with the SW/Algorithms team to achieve best overall system performance § Work closely with the VLSI implementation team to achieve cost effective solutions § 7+ years experience in chip design § 3+ years experience in VLSI architecture definition § Electronics Engineering or Computer Engineering degree from a leading institutionShow more Report"}, {"company": "Apple", "job": "SoC Fabric Performance Architect", "city": "Herzliya", "date": "14d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_015eb32e&cb=1678899923568&jobListingId=1008500818011&jrtk=3-1-1grj3nigom6rr801-1grj3ias7i38u800-024cf1936d103501-", "description": "Summary\nPosted: Feb 22, 2022\nRole Number:200347751\nPassion and dedication to your job and there's no telling what you could accomplish Dynamic, resourceful people and inspiring, innovative technologies are the norm here. We are seeking for a highly motivated, hands-on Architect who is passionate about performance engineering and performance modeling of sophisticated SoC features. You will join a team of extraordinary engineers and interacting daily with software and hardware engineering teams across Apple. In this role, you will be a member of the Platform Architecture (PA) team, responsible to shape the architecture of Apple's future System-on-Chips (SoC) for performance. The position calls for performance modeling via C++ simulation its results data mining combined with analytical analysis. The position requires close collaboration with the design teams and PA peers. We are looking for experienced and talented engineers with a passion to explore new fabrics hardware concepts and model them to demonstrate their value and impact.\nKey Qualifications\nProven hands-on software development skills (C++ highly preferred)\nExperience with SoC (micro)architecture performance modeling - highly preferred\nProficient in scripting languages such as Python – highly preferred\nExperience with SoC Design or pre/post Si validation - highly preferred\nKnowledge with common performance benchmarks and workloads - preferred\nPassionate to learn and make an impact\nPedantic, self-organized/driven and able to define priorities\nDescription\nYou will part of the architecture team defining and verifying Apple’s next generation SoC hardware solutions. Your work will be highly visible and critical to delivering the best in class performance and power efficiency in Apple’s future products. You will be expected for effective collaborate with other Si architectures, performance modeling, designers and validation engineers:  SoC System level initial analytical analysis  C++ performance coding/modeling for studies with supporting Phyton scripts  Careful results data mining and conclusions presentation to a wide experienced forum  Documenting architectural specification with the chip architect/designers  Close collaboration with chip architects, performance modeling peers, design, and design verification teams  Improve Apple’s modeling platform by suggesting and developing APIs, tools test benches that can be used throughout the company.\nEducation & Experience\nBS.c in Electrical Engineering or Computer Engineering required, MS.c in EE or CE preferred\nAdditional Requirements\nWe live in a mobile and device driven world where knowledge of the physical world around us is needed. We rely on this knowledge to get around, to learn about our environment and to enable spectacular new features for custom applications. Apple is meeting those needs as robustly and as creatively as possible and is interested in people who want to help meet that commitment. The success we are striving for is the result of very skilled people working in an environment which cultivates creativity, partnership, and thinking in new ways. If that sounds like the kind of environment that you find intriguing, then let's talk.Show more Report"}, {"company": "Apple", "job": "Display system Architect - Platform Architecture", "city": "Haifa", "date": "24h", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=103&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_22cc0d6e&cb=1678899924668&jobListingId=1008529617231&jrtk=3-1-1grj3njj5khog801-1grj3ias7i38u800-85e093a57b24f863-", "description": "Summary\nPosted: Dec 12, 2022\nRole Number:200449091\nDo you love crafting elegant solutions to highly complex challenges? Are you a big-picture forward-thinking who understands how each element affects all the others? At Apple, our Architecture group is responsible for connecting our hardware and software into one unified system. Join this team, and you’ll collaborate with engineers across Apple to design how all of our technologies work in unison. You’ll drive development of our renowned system-on-a-chip architecture and develop algorithms for platform power, performance, and thermal management. You’ll develop forward-looking prototype systems as well as build and deploy software development tools that will be distributed to the Apple engineering community. Join this team, and you’ll help build the seamless technology experiences we’re known for worldwide. In this highly visible role, you will be interfacing with software, display and system engineers to support display sub-system architecture, integration, calibration, and software programming of the SOC display systems across Apple’s iOS and macOS products from architecture definition to product release.\nKey Qualifications\n5+ years experience in display system engineering in the mobile space\nStrong understanding of SoC architecture\nFamiliarity with display technologies, including pixel pipelines, link interfaces (LVDS, DP, eDP, MIPI, HDMI, etc.), display timing controllers and pixel technologies (LCD, OLED)\nAbility to debug hardware, software and integrated displays\nProgramming experience such as C/C++, scripting in Python/Perl/Lua preferred\nDescription\nAs a member of the Platform Architecture team, you will be responsible for supporting end-to-end display systems for Apple’s products. Responsibilities include: - Define and document display system architecture, including programming and system integration guidelines, in close collaboration with SOC and display architecture teams, software teams, display engineering teams - Support and guide the SOC display sub-system through hardware design, silicon and product bring-up. - Document and support display tuning: display timing definitions, image quality tuning, panel calibration - Troubleshoot and debug new display system architectures\nEducation & Experience\nB.Sc.EE is required\nAdditional RequirementsShow more Report"}, {"company": "Arm France", "job": "Principal Field Application Engineer / Solution Architect", "city": "Raanana", "date": "1 day ago", "rating": "", "link": "", "description": "Job Overview:Are you an experienced engineer who loves to continually learn and keep up with the latest developments in microprocessor and System-On-Chip development technologies?We have an exciting new opportunity for you!You will collaborate with the most innovative, global, chip design companies to help them design SoCs, which will power the Consumer, Infrastructure, Industrial and Automotive electronic products of the future, using leading-edge Arm IP components.Responsibilities:You will engage in architectural discussions, as part of the sales and support processes, with global and local companies.You will demonstrate system design expertise and architectural planning for products in early design stages.You will provide appropriate product recommendations to meet customer design specification.You will participate in defining new products or services to meet the needs of Arm customers and maintain a high standard of technical knowledge in relation to Arm and its products, services, and competitors.You will need to build professional relationships with the engineers, architects, and decision-makers on the customer side, and work closely with R&D group and product management teams within Arm.Critical Success Factors:Good understanding of SoC design and system level architectureHigh level of knowledge of Arm product and service suiteDevelopment of strong, positive relationships with Partner managers, Marketing, Engineering, and Applications Engineering teamsDevelopment of excellent relationship with customersAbility to measure and analyse customer design requirements and offer relevant Arm products and solutionsRequired Skills and Experience:University degree (or equivalent) in Electrical/Electronic Engineering or Computer ScienceExperience in designing and/or supporting complex ASICs, IP products and EDA technologiesKnowledge in microprocessors, physical IPs, SoC design, operating systemsUnderstanding of the hardware and software design process including relevant toolsDemonstrable experience of problem solving and debug skillsSome experience of Technical Support, Field Application Engineer, or customer interactionDynamic, self-starting individual with the ability to excite and instil confidence in customers about Arm and Arm’s technologyGood organizational skills and strong team playerExcellent interpersonal and communication skills at all levelsGood presentation skills, able to clearly express technical conceptsHardworking, open minded, reliable, innovativeAble to work and communicate at a detailed or a high level, as situation requiresExcellent spoken and written English language skillsAbility to work in a multinational environmentWilling to undertake travel worldwide as needed“Nice To Have” Skills and Experience:C/C++, assembler coding or other programming skillsKnowledge of GPU or graphics processing systemDetailed knowledge of the Arm ArchitectureKnowledge of one or more AMBA bus protocolsKnowledge of PCIe, CXL, CCIXIn Return:In this particular role, your will be working with some our key clients from Israel and international well known brands.This is a unique position that will allow strong technical individuals to develop in a more customer facing and sales environment, and therefor give a boost in their career.Equal Opportunities at ArmArm is an equal opportunity employer, committed to providing an environment of mutual respect where equal opportunities are available to all applicants and colleagues. We are a diverse organization of dedicated and innovative individuals, and don’t discriminate on the basis of any characteristic.Hybrid Working at ArmArm’s hybrid approach to working is centered around flexibility, where we split our time between the office and other locations to get our work done. We empower groups/teams to determine their hybrid working pattern, with an expected minimum attendance in the office of 20% per month, depending on the work, level of experience and team’s needs. In some cases, the flexibility we can offer is limited by local legal, regulatory, tax, or other considerations, and where this is the case, we will collaborate with you to find the best solution.Job Types: Full-time, PermanentSalary: From 506,000.00₪ per yearShow more Report"}, {"company": "Apple", "job": "USB-C Hardware Architect", "city": "Israel", "date": "8d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f8701358&cb=1678899927515&jobListingId=1008512022186&jrtk=3-1-1grj3nmbt2dh3001-1grj3ias7i38u800-dc977c36ab1ae46e-", "description": "Summary\nPosted: Aug 29, 2022\nRole Number:200410095\nWhy Apple? At Apple, we believe our products begin with our people. By hiring a diverse team, we drive creative thought. By giving that team everything, they need, we drive innovation. By hiring incredible engineers, we drive precision. And through our collaborative process, we build memorable experiences for our customers. These elements come together to make Apple an amazing environment for motivated people to do the greatest work of their lives. You will become part of a hands-on development team that sets the standard in cultivating excellence, creativity and innovation. Will you help us design the next generation of revolutionary Apple products? Imagine what you could do here. At Apple, new insights have a way of becoming extraordinary products very quickly. Bring passion and dedication to your job and there's no telling what we can accomplish together. In this role, you will join the Planform Architecture team that is responsible for future connectivity over USB-C, focused on USB4 development for Apple products. In this position you will become an expert in the related high-speed standards, defining the design requirements while working closely with other peers, design and verification teams.\nKey Qualifications\n5+ years of experience\nSolid background in verification / ASIC design\nPrevious experience in (micro)architecture – preferred\nExperience with high-speed designs (PCIe/USB/Ethernet) – preferred\nExperience with mixed signals designs – preferred\nExcellent communication skills\nAbility to work independently\nPassionate to learn and make an impact\nDescription\nAs part of the Platform Architecture organization, our team’s mission is to define the silicon capabilities for supporting external connectivity through USB-C in Apple’s products. We collaborate with the software and system organizations to define innovative solutions that provide an excellent user experience for Apple customers. We work together with different silicon teams throughout the entire design cycle to create state-of-the-art silicon products. This key position will help us fulfill our mission with the following core responsibilities: - Definition of hardware behavior, performance, and structure - Documenting architectural specifications - Assist in architectural analysis for different scenarios and problematic test cases - Deep understanding of the standard requirements and providing directions for design teams - Close collaboration with chip and block level architects, performance modeling teams, design, and design verification teams\nEducation & Experience\nBS, MS or PhD in Computer or Electrical Engineering\nAdditional RequirementsShow more Report"}, {"company": "Zscaler", "job": "Cloud Architect, Cloud Operations", "city": "Ramat Gan", "date": "30d+", "rating": "4.4", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=106&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a43517c6&cb=1678899928859&jobListingId=1008427448294&jrtk=3-1-1grj3nnm7mfri801-1grj3ias7i38u800-559bc08ffcd76510-", "description": "Company Description\nZscaler (NASDAQ: ZS) accelerates digital transformation so that customers can be more agile, efficient, resilient, and secure. The Zscaler Zero Trust Exchange is the company’s cloud-native platform that protects thousands of customers from cyberattacks and data loss by securely connecting users, devices, and applications in any location.\nWith more than 10 years of experience developing, operating, and scaling the cloud, Zscaler serves thousands of enterprise customers around the world, including 450 of the Forbes Global 2000 organizations. In addition to protecting customers from damaging threats, such as ransomware and data exfiltration, it helps them slash costs, reduce complexity, and improve the user experience by eliminating stacks of latency-creating gateway appliances.\nZscaler was founded in 2007 with a mission to make the cloud a safe place to do business and a more enjoyable experience for enterprise users. Zscaler’s purpose-built security platform puts a company’s defenses and controls where the connections occur—the internet—so that every connection is fast and secure, no matter how or where users connect or where their applications and workloads reside.\n\nJob Description\nJob Description\nDesign and deploy various customer facing Linux and BSD based systems infrastructures\nCreate and deploy scalable monitoring systems for massively growing global infrastructure\nArchitect and implement various cloud management automations\nContribute to OS packaging and distribution\nWrite, augment and maintain Ops documentations\nResolve NOC escalations and help prevent reiteration of those incidents by creating NOC processes, procedures and automations\nLinux/UNIX system engineering (create and support highly scalable compute solutions)\nMake recommendations on integration strategies, platforms, and application infrastructure required to successfully implement desired solutions providing best practice advice to other teams to optimize Zscaler Cloud effectiveness.\nAct as a subject matter expert on DevOps best practices with Cloud Development Groups, Configuration Management and NOC\nWork as a member of a cross-functional project team contributing to the technology-based solutions and consult on concept feasibility\n\nQualifications\nQualifications\n12+ years of experience in a Linux/UNIX System Administration or lead DevOps role\nBachelor's degree in Computer Science, a related technical field involving computer systems engineering, or equivalent practical experience.\nExperience programming in at least one of the following languages: Go, Python, or Perl\nPreferred Qualifications/Your Background:\nComfort and experience with Ops environment growing at a rapid scale\nExpertise in designing, analyzing, and troubleshooting large-scale distributed systems\nAbility to debug, optimize code, and automate routine tasks.\nHands on experience with immutable infrastructure and using infrastructure as code tools like Puppet, Chef, Ansible or similar\nKnowledge of Virtualization, OpenStack, Cloud Architecture and Services, Automated Deployments, API, Docker and Kubernetes\nStrong background in Linux/Unix system administration\nExcellent scripting skills and experience (Bash & Python/Perl) (Python preferred)\nExperience maintaining and deploying systems and software in diverse environments\nStrong understanding of web security and protocols HTTP, SSL/TLS, DNS, SQL Network fundamentals DHCP, ARP, Subnetting, Routing, NAT, Firewalls, IPv4 and IPv6\nRich DevOps skills across CI/CD, SCM, Static Code Analyzer, Builds and Releases, Continuous Integration Tools and frameworks (e.g. SVN, GIT, Jenkin, BitBucket, etc)\nKnowledge of advanced networking technologies and services including SDN, NFV, SDWAN, MPLS, BGP routing, switching, VXLANs, and architectures is a definite plus\nAbility to deliver results and work cross-functionally. Ability to engage/influence audiences and identify expansion engagements\nAdditional Information\nWhat You Can Expect From Us:\nAn environment where you will be working on cutting edge technologies and architectures\nA fun, passionate and collaborative workplace\nCompetitive salary and benefits, including equity\nThe pace and excitement of working for a Silicon Valley Unicorn\nWhy Zscaler?\n Zscaler is the world’s leading software-as-a-service security platform\nWe deliver best of breed security services with unprecedented scale\nWe protect 15 million users, in 3,250 organizations, across 185+ countries\nBlue Chip Customers (200 of Global 2,000 in our portfolio)\nGlassdoor rating of 4.7/5.0 + 98% CEO Approval = Exceptional place to work!\nPeople who excel at Zscaler are smart, motivated and share our values. Ask yourself: Do you want to team with the best talent in the industry? Do you want to work on disruptive technology? Do you thrive in a fluid work environment? Do you appreciate a company culture that enables individual and group success and celebrates achievement?\nIf you said yes, we’d love to talk to you about joining our award-winning team!\nLearn more at zscaler.com or follow us on Twitter @zscaler. Additional information about Zscaler (NASDAQ : ZS ) is available at http://www.zscaler.com. All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, sexual orientation, gender identity, national origin, protected veteran status, or on the basis of disability.\n\n#LI-MM8\n#LI-REMOTE\nWhy Zscaler?\n\nPeople who excel at Zscaler are smart, motivated and share our values. Ask yourself: Do you want to team with the best talent in the industry? Do you want to work on disruptive technology? Do you thrive in a fluid work environment? Do you appreciate a company culture that enables individual and group success and celebrates achievement? If you said yes, we’d love to talk to you about joining our award-winning team.\n\nAdditional information about Zscaler (NASDAQ: ZS ) is available at https://www.zscaler.com.\nZscaler is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.\nZscaler is committed to providing reasonable support (called accommodations or adjustments) in our recruiting processes for candidates who are differently abled, have long term conditions, mental health conditions or sincerely held religious beliefs, or who are neurodivergent or require pregnancy-related support. If you need support, please contact us by sending an email to accommodations@zscaler.com. This email address is used specifically for accommodation requests only, and resumes, CV's, or questions other than accommodations will not be replied to or accepted.Show more Report"}, {"company": "Arm", "job": "Principal Field Application Engineer / Solution Architect", "city": "Raanana", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=107&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_85b0f350&cb=1678899929987&jobListingId=1008395414151&jrtk=3-1-1grj3nopfncd4801-1grj3ias7i38u800-e0ea96ccb64cf620-", "description": "Job Overview:\nAre you an experienced engineer who loves to continually learn and keep up with the latest developments in microprocessor and System-On-Chip development technologies?\nWe have an exciting new opportunity for you!\nYou will collaborate with the most innovative, global, chip design companies to help them design SoCs, which will power the Consumer, Infrastructure, Industrial and Automotive electronic products of the future, using leading-edge Arm IP components.\nResponsibilities:\nYou will engage in architectural discussions, as part of the sales and support processes, with global and local companies.\nYou will demonstrate system design expertise and architectural planning for products in early design stages.\nYou will provide appropriate product recommendations to meet customer design specification.\nYou will participate in defining new products or services to meet the needs of Arm customers and maintain a high standard of technical knowledge in relation to Arm and its products, services, and competitors.\nYou will need to build professional relationships with the engineers, architects, and decision-makers on the customer side, and work closely with R&D group and product management teams within Arm.\nCritical Success Factors:\nGood understanding of SoC design and system level architecture\nHigh level of knowledge of Arm product and service suite\nDevelopment of strong, positive relationships with Partner managers, Marketing, Engineering, and Applications Engineering teams\nDevelopment of excellent relationship with customers\nAbility to measure and analyse customer design requirements and offer relevant Arm products and solutions\nRequired Skills and Experience:\nUniversity degree (or equivalent) in Electrical/Electronic Engineering or Computer Science\nExperience in designing and/or supporting complex ASICs, IP products and EDA technologies\nKnowledge in microprocessors, physical IPs, SoC design, operating systems\nUnderstanding of the hardware and software design process including relevant tools\nDemonstrable experience of problem solving and debug skills\nSome experience of Technical Support, Field Application Engineer, or customer interaction\nDynamic, self-starting individual with the ability to excite and instill confidence in customers about Arm and Arm’s technology\nGood organizational skills and strong team player\nExcellent interpersonal and communication skills at all levels\nGood presentation skills, able to clearly express technical concepts\nHardworking, open minded, reliable, innovative\nAble to work and communicate at a detailed or a high level, as situation requires\nExcellent spoken and written English language skills\nAbility to work in a multinational environment\nWilling to undertake travel worldwide as needed\n“Nice To Have” Skills and Experience:\nC/C++, assembler coding or other programming skills\nKnowledge of GPU or graphics processing system\nDetailed knowledge of the Arm Architecture\nKnowledge of one or more AMBA bus protocols\nKnowledge of PCIe, CXL, CCIX\nIn Return:\nArm is an equal opportunity employer, committed to providing an environment of mutual respect where equal opportunities are available to all applicants and colleagues. We are a diverse organization of dedicated and innovative individuals, and don’t discriminate on the basis of any characteristic.\n#LI-JB1\nEqual Opportunities at Arm\nArm is an equal opportunity employer, committed to providing an environment of mutual respect where equal opportunities are available to all applicants and colleagues. We are a diverse organization of dedicated and innovative individuals, and don’t discriminate on the basis of any characteristic.\nHybrid Working at Arm\nArm’s hybrid approach to working is centred around flexibility, where we split our time between the office and other locations to get our work done. We empower groups/teams to determine their hybrid working pattern, with an expected minimum attendance in the office of 20% per month, depending on the work, level of experience and team’s needs. In some cases, the flexibility we can offer is limited by local legal, regulatory, tax, or other considerations, and where this is the case, we will collaborate with you to find the best solution.Show more Report"}, {"company": "אורגד מאגרים בע\\\"מ", "job": "VLSI Architect", "city": "Central", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=108&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7b9b4aee&cb=1678899931134&jobListingId=1005682247307&jrtk=3-1-1grj3npsnkuie801-1grj3ias7i38u800-939f6ac5b24e291d-", "description": "מיקום המשרה: השרון\nלחברת תקשורת מעולה, עם תפקידים סופר מאתגרים, דרוש/ה תותח/ית על ובכלל\nדרישות:\nChip architect/micro-chip architect for the architecture team\n\nJob description\nTeam member in the architecture group\nDefine next generation high-speed, high-performance complex System-On-Chip pipeline architectures\nSupport the Design group by delivering SPECs and conducting the implementation\n\nMust\nBSC/MSC in Electrical/Computer engineering\n5-10 years of experience in VLSI /ASIC Design and Micro Architecture of complex blocks\n(…Experienced in High Speed Networking (such as: LAN Switch, NPU, NIC, Traffic Manager, Fabric Switch, etShow more Report"}, {"company": "Synopsys", "job": "Technical Solutions Sales Manager - Digital Implementation", "city": "Herzliya", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=109&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_752e561c&cb=1678899932292&jobListingId=1008348136060&jrtk=3-1-1grj3nqvr2jqc001-1grj3ias7i38u800-efca2fb8de22e7aa-", "description": "42432BR\nISRAEL - Herzelia, ISRAEL-Haifa\nJob Description and Requirements\nOur Go To Market Group is all about delivering high-value solutions to our customers while driving growth. This is an exciting opportunity to be part of the technical sales team that supports the industry-leading solutions across the EDA software spectrum.\nThe primary focus of the Technical Solutions Sales Manager (TSSM) is to drive business growth for Synopsys EDA tool suite with a specific focus on the Digital Implementation Platform. As a SNPS TSSM you will be responsible to define and implement growth strategies in tight collaboration with Account Managers and with the support of field engineering. As a Digital Implementation TSSM, you will also collaborate with TSSM’s in the Verification and Custom Design and AMS domains to define a Synopsys centric solution to address the customer challenges.\nAs part of your daily job:\nYou’ll be creating and fostering relationships with key decision makers on the customer side and conducting qualification/discovery meetings with the goal of understanding how Synopsys Digital Implementation platform fits the customer needs.\nYou will collaborate with the field engineering to drive the technical campaigns for pointed solutions to the customers\nWith the help of field engineering, you will also be responsible to represent the needs of our customers to the Digital Implementation Technical Marketing team and to Product management.\nSynopsys Digital Implementation platform is anchored by industry leading Design Compiler, Fusion Compiler, RTL Architect, PrimeTime and PrimePower\n\nKey Qualifications:\nBS/MS EE, CS, CE or related discipline and 7+ years of experience.\nGood understanding of the Digital Implementation (RTL to GDSII) flows and methodologies.\nExcellent interpersonal, presentation and communication skills with a passion for driving business in a challenging and rewarding environment\nAbility to work in a fast-paced innovation rich environment\nPassion for business growth and for cross-functional collaborations\nPrevious experience in technical sales is a plus\nAt Synopsys, we’re at the heart of the innovations that change the way we work and play. Self-driving cars. Artificial Intelligence. The cloud. 5G. The Internet of Things. These breakthroughs are ushering in the Era of Smart Everything. And we’re powering it all with the world’s most advanced technologies for chip design and software security. If you share our passion for innovation, we want to meet you. Our Silicon Design & Verification business is all about building high-performance silicon chips—faster. We’re the world’s leading provider of solutions for designing and verifying advanced silicon chips. We enable our customers to optimize chips for power, cost, and performance—eliminating months off their project schedules\n\nSynopsys has adopted a COVID-19 vaccination policy to safeguard the health and well-being of our employees and visitors. As a condition of employment, all employees based in the U.S. are required to be fully vaccinated for COVID-19, unless a reasonable accommodation is approved or as otherwise required by law.\n\nInclusion and Diversity are important to us. Synopsys considers all applicants for employment without regard to race, color, religion, national origin, gender, sexual orientation, gender identity, age, military veteran status, or disability.\nJob Category\nSales\nCountry\nIsrael\nJob Subcategory\nProduct Solution\nHire Type\nEmployeeShow more Report"}, {"company": "אורגד מאגרים בע\\\"מ", "job": "Video Chip Architect", "city": "Central", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=110&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_add046d7&cb=1678899933405&jobListingId=1005682245962&jrtk=3-1-1grj3ns2ok619801-1grj3ias7i38u800-2333162ad183f19b-", "description": "מיקום המשרה: השרון\nלחברה מובילה, בינלאומית, בחזית הטכנולוגית, דרוש/ה Video Chip Architect\nSenior Chip Architect to lead the definition of ISP & Video device\nדרישות:\nBSc in Electrical Engineering, MSc an advantage.\n3 years of hands-on work in VLSI design.\n2 years of hands-on work in chip architecture definitions.\n2 years of hands-on work in ISP and Video.\nDeep knowledge in Imaging and VideoShow more Report"}, {"company": "GuardKnox", "job": "Embedded Software Architect", "city": "Ramla", "date": "30d+", "rating": "4.2", "link": "", "description": "Who Are We?\nGuardKnox offers high-performance computing and firmware solutions that empower automotive manufacturers and main suppliers to develop modern automotive E/E architectures and deliver the next generation of Software Defined Vehicles.\nGuardKnox’s solutions provide the necessary innovation for the automotive market to enable drivers with customization and personalized vehicle experience - essentially bringing about the ‘Smartphonization’ of vehicles. Our technology serves the needs of automotive for dynamic and adaptive technological capabilities in the evolving automotive market.\nOur pioneering approach to software-defined and service-oriented vehicles gives our customers the tools to meet the demands of today’s drivers – and to keep meeting them tomorrow. We call it The Freedom to Evolve.\nAn integral part of GuardKnox R&D is the embedded software team. This team is responsible for the core software stack which powers GuardKnox embedded solutions. The Software Architect will be responsible for building a robust Embedded SW architecture to meet all customer requirements in high performance, high reliability with minimum risk, cost, and effort. The embedded software development activities run on all layers, starting from bare metal and up to the application.\nThe position requires a highly self-motivated SW Architect engineer, independent and out of the box thinker. You will have the opportunity to be involved from early stages of architecture & design planning, through development and testing, up to integration within GuardKnox hardware products, cloud infrastructures, and field deployment.\nRequirements:\n\nBachelors’ degree in Engineering, Computer Science, or related discipline from a familiar institute.\n10+ years of software development experience - MUST.\nStrong coding skills in C++ programming languages – MUST\nStrong development experience in C++, Linux, and real-time operating systems (RTOS; Integrity/VxWorks/QNX/LynxOS/Linux Embedded) – Must\nStrong SW architecture designing experience in embedded software. e.g. RTOS selection, designing power/clock management system followed to RTOS manner.\nUse of UML modeling tools such as Enterprise Architect or Magic Draw is a plus\nExperience with software design (OOD) and design patterns; Strong design and analytical skills – must\nKnowledge in networking – TCP/IP – must\nExperience with Socket programming; Concurrent and asynchronous programming;\nExperience with Version Control tools.\nExcellent analytical skills.\nStrong written and verbal communication skills\nPreferred Qualifications\n2+ years of software team leading experience in an international environment.\nGood understanding of Agile-Scrum, Unit Testing, and Code Review methodologies - preferred\nExperience with virtualization technologies and hypervisors – preferred\nKnowledge in automotive applications and networking protocols (CAN, CAN-FD, etc.) - preferred\nKnowledge in DDS/CORBA/gRPC/Apache Thrift - preferred\nCyber security background - preferred\nExperience in kernel space programming – preferred\nExperience with On-Chip/Target debugger – preferred\nExperience in Linux BSP and driver development (boot loaders, kernel, distributions, etc.) - preferred\nExperience with modern multi-core ARM devices - preferred\nExperience in safety-critical systems - preferred\nResponsibilities Include:\n\nAs an Architect you will define, design and implement (Hands-On is required) highly concurrent and efficient software components (components-based development).\nYou will be leading work around architecture, design and documentation of interfaces, and other design documentation. Furthermore, you will also support and coach the teams to follow architectural decisions taken on their daily work.\nYou will be a part of the overall product quality work by defining needed guidelines for design and coding, together with teams.\nWrite detailed Functional and Architecture specs.\nIn close cooperation with the team Lead, coordinate the embedded software team in terms of both system architectures designing and implementation.\nInteract with the product owners, system architect to gather requirements, architect solutions, provide means to deploy and support our software.\nLead technical projects and provide guidance to junior engineers.\nDesign and implement dynamic software loading system over the network.\nWork on proof of concepts and advance development projects.\nPerform research and analysis for current and future architectures.Show more Report"}, {"company": "JobInfo", "job": "Chip Architect", "city": "Central", "date": "30d+", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=112&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_39ca91b1&cb=1678899936022&jobListingId=1008276640417&jrtk=3-1-1grj3numbncfu801-1grj3ias7i38u800-fc46244ba5b2a132-", "description": "Job Description:\nJOB DESCRIPTION\nMember of the Chip architecture team.Definition of our next generation Packet Processor & Datapath Architecture for high-performance complex SoC Ethernet Switch. Our innovative packet processors are designed into the most advanced data centers by tier-1 vendors.Architecture & micro-architecture definition for the Switch sub-systems and blocks.Support the development group by delivering specs.\nAdditional Positions:\nArchitect, ASIC designer/VLSI\nCategory:\nHardware\nJob Qualifications:\nQUALIFICATIONS\nBSc/MSc/PhD in Electrical/Computer Engineering or a related field.\n\n5+ years of experience in VLSI/Chip/ASIC architecture, micro-architecture and design of complex blocks.\n\nExperienced in high speed networking (such as: Ethernet Switch, NPU, NIC, Traffic Manager, Fabric Switch, etc…).\n\nExcellent communication skills in English - written and verbal.\n\nGood team player - Excellent communication and good team working skills; the ability to work with people at all levels.\n\nIndependent and self-learning.\nCompany Occupation:\nHigh Tech, Networking/datacom/telecom\nCompany Size:\n500+Report"}, {"company": "אורגד מאגרים בע\\\"מ", "job": "SoC/DSP Architect", "city": "Central", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a5707477&cb=1678899937117&jobListingId=1005682245978&jrtk=3-1-1grj3nvomp6cn801-1grj3ias7i38u800-91bb13bd6a52431a-", "description": "מיקום המשרה: השרון\nלחברת תקשורת, בחזית הטכנולוגיה, דרוש/ה\nSenior Chip Architect to lead the definition of SoC for audio signal processing.\nדרישות:\nBSc in Electrical Engineering, MSc an advantage.\n3 years of hands-on work in VLSI design.\n2 years of hands-on work in chip architecture definitions.\n2 years of hands-on work in signal processing.\nExperience in Signal processing, knowledge in Video and AudioReport"}, {"company": "Arm", "job": "Principal Hardware Security Architect", "city": "Raanana", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=114&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0c11d66d&cb=1678899938864&jobListingId=1008395415714&jrtk=3-1-1grj3o1fe34pl001-1grj3ias7i38u800-e17b6b5b72647143-", "description": "As Principal Hardware Security Architect, you will be a part of Security Architecture team based in Ra’anana, Israel. You will be responsible for writing architectural specifications and analysing and reviewing security related products for the Mobile, Infrastructure, Automotive and IoT markets.\nYou will join a small team of motivated and professional security and system architects who all share a passion for maintaining Arm’s leadership position and making an impact on the future Arm technologies. If you share a similar passion, we want to hear from you!\nWe are offering a hybrid approach to home and office working to provide an adaptable experience for all employees. We expect 2 or more days per week in office to build productive interaction with peers, but are flexible about home working.\nResponsibilities:\nDevelop security related system architectures that address the needs of Arm’s target market segments in Client, Automotive, Infrastructure and IoT, standardize key concepts but leave space for partner differentiation\nPerform security reviews of existing Arm and external designs\nWork with product teams and other Arm architecture teams to define the next generation security related products\nProvide mentorship on system architecture and requirements to Arm engineering teams\nRepresent Arm in technical discussions with customers\nRequired Skills and Experience :\nB.Sc. in Computer Engineering, Computer Science, Electrical Engineering. Other degrees will also be considered with relevant experience\nAnother engineering / science degree (in different field) is an advantage\nExcellent and experienced Hardware Security Systems Architect\nproven experience in designing chip level HW architectures and specification documents for hardware systems (SoC)\nProven design/verification experience\nCreative, dynamic thinker, open minded and strong problem-solving skills\nFast learner of new technologies and standards\nGreat teammate with ability to work in a collaborative environment\nExcellent verbal, written and interpersonal communication skills\nExcellent written and spoken English communication\n“Nice To Have” Skills and Experience :\nExperience with Arm processors, CPU architecture and SoC subsystems\nExperience with deeply embedded systems, embedded software, low level drivers and hardware interfaces\nFamiliarity with cryptography, data security, network security, security standards, SoC security\nExperience in developing and analysing complex systems\nM.Sc. in a releveant field\nArm is an equal opportunity employer, committed to providing an environment of mutual respect where equal opportunities are available to all applicants and colleagues. We are a diverse organization of dedicated and innovative individuals, and don’t discriminate on the basis of any characteristic.\n#LI-JB1\nEqual Opportunities at Arm\nArm is an equal opportunity employer, committed to providing an environment of mutual respect where equal opportunities are available to all applicants and colleagues. We are a diverse organization of dedicated and innovative individuals, and don’t discriminate on the basis of any characteristic.\nHybrid Working at Arm\nArm’s hybrid approach to working is centred around flexibility, where we split our time between the office and other locations to get our work done. We empower groups/teams to determine their hybrid working pattern, with an expected minimum attendance in the office of 20% per month, depending on the work, level of experience and team’s needs. In some cases, the flexibility we can offer is limited by local legal, regulatory, tax, or other considerations, and where this is the case, we will collaborate with you to find the best solution.Report"}, {"company": "אורגד מאגרים בע\\\"מ", "job": "Chip Architect Manager", "city": "Central", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=115&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_659c7f93&cb=1678899940179&jobListingId=1005682247274&jrtk=3-1-1grj3o2nnk61r801-1grj3ias7i38u800-569ec2f572871408-", "description": "מיקום המשרה: השרון\nלחברת תקשורת, נסחרת ומובילה, דורש/ה מהנדס/ת סופר מבריק/ה להובלת צוות ארכיטקטורה\nדרישות:\nManages the architecture team\n:Responsible for detailed and complete chip definitions\nDefinition of new in-house designed IP\nSOC integration\nProgramming model\nPerformance analysis\nIP (Hard and Soft) benchmarking and selection\nWorks closely with IC, System, Software and Marketing teams to define and achieve a successful and timely project\nChip’s interface definition\n\n:Technical knowledge\nAt least 10 years of hands-on work in VLSI design and architecture definition\nExperience in designing multimedia devices that combine Audio, Video, Graphics and Imaging\nExperience in designing multi-CPU platforms (DSPs and Microprocessors) and standard SOC buses such as AHB and AXI\nExperience in designing power optimized solutions\nExperience in modeling platform-performanceShow more Report"}, {"company": "Cadence Design Systems", "job": "Software Architect", "city": "Petah Tikva", "date": "30d+", "rating": "4.4", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_bbee63b6&cb=1678899941340&jobListingId=1008268485860&jrtk=3-1-1grj3o3s7k276801-1grj3ias7i38u800-637ceaa14d62d4f2-", "description": "At Cadence, we hire and develop leaders and innovators who want to make an impact on the world of technology.\nAt Cadence, we hire and develop leaders and innovators who want to make an impact on the world of technology.\nWe are looking for a Senior Software Architect for one of Cadence’s fast-growing, cutting-edge products in the domain of Hardware-Software verification. The role includes technical leadership and responsibility for entire product’s architecture and development, working in a global eco-system collaborating with different functions and organizations, as well as senior industry technical leaders.\nThe ideal candidate is an experienced senior software architect, hands-on, with analytical and problem-solving skills, HW functional verification expertise, and proven track record in building cutting-edge, large-scale software products.\nPerspec is the portable stimulus, system-on-chip (SoC) verification state of the art solution. It includes a new modeling language, constraints solver, smart GUI, analysis methods, debug tools, and more.\nThe role includes:\nLeading SW architecture across all product modules while working closely with the team leads.\nWorking with customers in order to find the best solution to meet their needs.\nDefining requirements based on customers’ needs.\nDesigning the visionary roadmap of the product while collaborating with the product marketing and field leaders.\nRequirements:\nB.Sc. (or above) in Computer Science Computer Engineering or Electrical Engineering or a related technical discipline.\nProfound understanding and proven experience in developing hardware verification tools.\nStrong SW professional with at least 15 years of experience working on complex SW projects, developing in C, C++, java or similar\nAbility to architect an end to end solution.\nExperience with B2B products and direct interaction with global customers.\nOutstanding communication and presentation skills.\nAbility to learn fast, with high tolerance for ambiguity\nExperience in defining complex large-scale systems\nVisionary and innovative attitude\nAdvantage:\nExperience with UVM/SV/PSS/e\nExperience with embedded and microprocessor architectures\nExperience in Software Product management\nExperience with IP/SoC verification aspects, tools, and methodology\nCAD development experience\nWe’re doing work that matters. Help us solve what others can’t.\nWe’re doing work that matters. Help us solve what others can’t.Show more Report"}, {"company": "JobInfo", "job": "SOC Architect", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=117&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1e9354ab&cb=1678899942782&jobListingId=1008356271000&jrtk=3-1-1grj3o59ck276801-1grj3ias7i38u800-54efa8ddf6942d5a-", "description": "Job Description:\nFor a startup that is reimagining high-performance computing, with offices in the center and in the North\nAdditional Positions:\nArchitect, ASIC designer/VLSI\nLocation:\nNorthern Israel, Haifa area, Tel Aviv - Center\nCategory:\nHardware\nJob Qualifications:\n\" 8+ years of experience working on complex, large-scale SOC architectures\n\" Knowledge and experience with one or more of the following: Microprocessor subsystems, Memory subsystem design and Cache coherency, On-chip interconnect, Debug methodology.\n\" Good understanding of ASIC design flow\n\n\" Experience with ARM, RISC-V, and/or MIPS CPU: advantage\n\" Experience with PCle, DDR, and/or CXL: advantage\n\" Knowledge in high-speed design: advantage\n\" Good understanding of SOC security aspects: advantage\n\" Excellent communication skills within and across teams and at the executive level\nCompany Occupation:\nHigh Tech\nCompany Size:\nLarge (150+)Show more Report"}, {"company": "Vayyar", "job": "Junior Internal Solutions Software Engineer", "city": "Yehud", "date": "30d+", "rating": "4.3", "link": "", "description": "Vayyar’s 4D imaging platforms are leading the way to a safer world. Not just a single product but bringing our knowledge into many domains.This journey takes us into many activities from chip design, through algorithms and embedded software to cloud and analytics.At the Vayyar internal solutions team, we build solutions to meet Vayyar's unique challenges.Developing products for internal use that help streamline and accelerate the work within our company.By embracing openness, transparency, and diversity, we aim to deliver maximum value in the best way we can.Work together with our peers and users to create a spirit of sharing and collaboration through our development work.Join us and you will architect, design, improve and implement tools enabling us to make our products a reality.In this role, you will have the unique opportunity to own and improve tooling and systems with a wide organizational impact.RequirementsComputer Science graduateHigh GradesHeld Student position for at least a yearExperience from the student position (not from the degree) with either of the following: python, java, C#, C++, go, rustPassion for product quality and attention to detailsExceptional problem solving and debugging skills.Independent, highly motivated, with good interpersonal skills.Advantage:Experience with end-to-end application development (application architecture, performance implications, integration with databases or web-based technologies)Experience with PostgreSQL or MongoDBExperience with Azure or AWSFamiliar with Matlab developmentFamiliar with CI/CD tools and processesJob Type: Full-timeShow more Report"}, {"company": "JobInfo", "job": "Lead SoC Architect", "city": "Israel", "date": "30d+", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=119&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f9eec62b&cb=1678899944854&jobListingId=1008296909849&jrtk=3-1-1grj3o79vk61t801-1grj3ias7i38u800-1a905bc754b7db72-", "description": "Job Description:\nFor a startup developing hardware components for use in datacenters, with offices in the Sharon\n\nWe are looking for an outstanding lead architect to join the architecture and system engineering team and to create and define a SoC and system architecture for a new type of SoC processing big data. The architect will be responsible for the hardware specifications and flow specifications of complicated modules in the chip and in the full system solution. The architect will work closely with the chip design, firmware and software teams. This is a rare opportunity to influence future processor architectures.\n\nJob Description\n\u0081œ Definition and specification of subsystems in the SoC which includes multi-core massively parallel processor, accelerators, network on chip and networking blocks.\n\u0081œ Breaking down the sub-system architecture into microarchitectural blocks, firmware, and SW components.\n\u0081œ Understanding the system in which the SoC is integrated to and designing the SoC to perfectly fit into the datacentre system.\n\nJob Description\nWorking with the chief architect on a full definition of an SoC which includes multi-core massively parallel processor, network on chip and networking blocks.\nUnderstanding the system in which the SoC is integrated and designing the SoC to perfectly fit into the datacenter system.\nDefine HW and system specification and break down the system architecture into microarchitectural blocks, firmware, and SW components.\nAdditional Positions:\nArchitect, System architect\nLocation:\nHybrid, Northen Sharon\nCategory:\nHardware\nJob Qualifications:\nBSc or higher degree in Electrical Engineering, Computer Science or Computer Engineering.Graduated with honors.\n\u0081œ 6+ years of experience as a system architect for large, high-end ASIC SoCs.\n\u0081œ Experience with multidisciplinary HW/SW systems.\n\u0081œ Team player with good communication skills\n\u0081œ Experience in defining requirements and architectures for advanced high-end systems.\n\u0081œ Advantage: Deep understanding of datacenter systems\n\u0081œ Advantage: Background in networks and protocols (e.g. Ethernet, IP, DDr4/5).\nCompany Occupation:\nHigh Tech\nCompany Size:\nStartUpShow more Report"}, {"company": "proteanTecs", "job": "Software Tech Lead", "city": "Haifa", "date": "30d+", "rating": "4.0", "link": "", "description": "About Us\nproteanTecs is a dynamic fast-paced start-up company, transforming the way the reliability of electronics is achieved. In a world where machines are gaining immense responsibility over our lives, sudden failure is not an option.\nWe have developed a cloud-based platform, which combines data created in chip-embedded Agents (IPs), with machine learning, to predict faults before they become failures. Our solutions provide unprecedented insights throughout the value chain, from Chip Vendors to System Vendors and Digital Service Providers.\nThe company was founded by seasoned industry veterans, including three former founders of Mellanox Technologies, with deep knowledge and experience in the electronics industry, and is backed by worldwide leading investors.\nWe encourage you to apply for this exciting opportunity and play a leading role at Israel's most promising startup. (By Globes - הסטארט-אפים המבטיחים של 2022 – גלובס (globes.co.il))\nproteanTecs, a trailblazer in the field of advanced electronics deep data analytics, is looking for an experienced Software Tech Lead to join our rapidly growing software development team to lead the technical direction of software development projects, working closely with cross-functional teams to ensure those project goals are met. We are looking for candidates with a strong background in software engineering, with a focus on building scalable, reliable, and maintainable systems.\nRequirements:\n\nBachelor's or Master's degree in Computer Science, Software Engineering, or a related field\n5+ years of experience in software development, with a focus on building scalable, reliable, and maintainable systems using Java and the Spring framework\nStrong experience in leading technical features\\projects and driving the technical direction of software development\nExcellent communication and collaboration skills\nExperience with agile software development methodologies\nProficiency in Java and the Spring framework\nGood experience with at least one of the cloud vendors: AWS, GCP, or Azure\nExperience with streaming or messaging services (like Kafka, RabbitMQ, or Flink)\nStrong experience with RDBMS databases\nExperience with Docker & Kubernetes\nProficiency in Python is a bonus, but not required\nResponsibilities:\n\nDrive the technical direction of software development projects\nCollaborate with a team of software engineers in the design and development of software solutions\nArchitect and design scalable, reliable, and maintainable software systems\nConduct proof of concepts (POCs) to explore new technologies and approaches\nDrive improvement of design processes, code, and product quality\nMonitor and suggest solutions to reduce technical debt\nStay up-to-date with industry trends and technologies and apply this knowledge to improve our software development processes\nCoach and mentor software engineers to help them grow in their careers and improve their technical skills\nPersonal skills:\n\nAs a Technical Leader at proteanTecs, you will have the opportunity to demonstrate your excellent communication skills by collaborating with team members and stakeholders at all levels of the organization. You will also have the opportunity to work effectively in a fast-paced, dynamic environment and handle multiple projects concurrently, skills that will be crucial to your success in this role.Show more Report"}, {"company": "JobInfo", "job": "Principal Hardware Security Architect", "city": "Central", "date": "30d+", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=121&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b419cd8e&cb=1678899947144&jobListingId=1008285276455&jrtk=3-1-1grj3o9hqncdu801-1grj3ias7i38u800-783c33dc6f83504d-", "description": "Job Description:\nFor a global semiconductor and software design company based in the Sharon area\nAdditional Positions:\nArchitect\nCategory:\nHardware\nJob Qualifications:\nB.Sc. in Computer Engineering, Computer Science, Electrical Engineering. Other degrees will also be considered with relevant experience\nAnother engineering / science degree (in different field) is an advantage\nExcellent and experienced Hardware Security Systems Architect\nproven experience in designing chip level HW architectures and specification documents for hardware systems (SoC)\nProven design/verification experience\nCreative, dynamic thinker, open minded and strong problem-solving skills\nFast learner of new technologies and standards\nGreat teammate with ability to work in a collaborative environment\nExcellent verbal, written and interpersonal communication skills\nExcellent written and spoken English communication\nCompany Occupation:\nData security, High Tech, Internet related\nCompany Size:\n500+Show more Report"}, {"company": "Oski Technology", "job": "Senior CPU Architect", "city": "Israel", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=122&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_92cd76e6&cb=1678899948532&jobListingId=1008267533232&jrtk=3-1-1grj3oastjigk801-1grj3ias7i38u800-d82c0ece2c77c26a-", "description": "We are now looking for a Senior CPU Architect!\nWe are seeking senior CPU Architects to create next generation CPU cores in support of a diverse array of NVIDIA products. If you love improving CPU performance through innovative CPU microarchitectural ideas; modeling them to determine merit; and then seeing them through implementation and bring up; then you should talk to us.\nWhat you'll be doing:\nDevelop cycle-accurate architectural performance and power models for the CPU core of a complex high performance system-on-a-chip.\nUse models to analyze architectural tradeoffs related to CPU Performance and Power, identifying performance bottlenecks on deep learning (DL) workloads, high-performance computing (HPC) workloads, as well as industry standard benchmarks like SPECInt and SPECFp.\nPropose micro-architectural alternatives that fit within area, timing and power constraints for the design.\nWork with the performance verification team to validate the model, and to root cause disconnects between model projections and design (RTL).\nWhat we need to see:\nMaster's degree with a focus on CPU microarchitecture, or equivalent experience.\n6+ years of relevant experience.\nA deep understanding of the state of the art of CPU microarchitecture and architecture.\nA track record of CPU microarchitectural innovation with experience in one or more of the following broad areas.\nFront End CPU Uarch (Fetch, Decode, Branch Prediction).\nMidcore CPU uarch (Rename, Allocate, Scheduler, Integer/Vector Exec).\nMemory Subsystem CPU Uarch (MMU/TLB, Address Gen, Load/Store Units, L1, L2 caches, Prefetch).\nA history of generating innovative microarchitectural ideas to improve performance ; actively doing the performance modeling and debug to demonstrate the merit and limitations of these ideas; enabling the realization of the ideas with close engagement with design.verification/postSi bringup teams.\nClose collaboration with the lead microarchitect of the core to cooperatively solve issues and help realize the overall perf/area/power targets of the CPU core.\nA strong ability to communicate and advocate the merits and drawbacks of the microarchitectural ideas to fellow microarchitects, and implementation leads in a variety of mediums, both verbally and through presentations and documents.\nAn enthusiasm, energy and drive in leading their part of the microarchitecture of the machine where they lead by doing.\nWays to stand out of the crowd:\n PhD in a relevant CPU microarchitecture area.\nAt least 4 years of industry experience in a core CPU microarchitecture.\nWith competitive salaries and a generous benefits package, NVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking and hardworking people in the world working for us.Report"}, {"company": "NVIDIA", "job": "Senior CPU Architect", "city": "Israel", "date": "30d+", "rating": "4.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=123&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ae057c98&cb=1678899950344&jobListingId=1008267388327&jrtk=3-1-1grj3ockgkbmp801-1grj3ias7i38u800-49f0e0b5be0b3abe-", "description": "We are now looking for a Senior CPU Architect!\nWe are seeking senior CPU Architects to create next generation CPU cores in support of a diverse array of NVIDIA products. If you love improving CPU performance through innovative CPU microarchitectural ideas; modeling them to determine merit; and then seeing them through implementation and bring up; then you should talk to us.\nWhat you'll be doing:\nDevelop cycle-accurate architectural performance and power models for the CPU core of a complex high performance system-on-a-chip.\nUse models to analyze architectural tradeoffs related to CPU Performance and Power, identifying performance bottlenecks on deep learning (DL) workloads, high-performance computing (HPC) workloads, as well as industry standard benchmarks like SPECInt and SPECFp.\nPropose micro-architectural alternatives that fit within area, timing and power constraints for the design.\nWork with the performance verification team to validate the model, and to root cause disconnects between model projections and design (RTL).\nWhat we need to see:\nMaster's degree with a focus on CPU microarchitecture, or equivalent experience.\n6+ years of relevant experience.\nA deep understanding of the state of the art of CPU microarchitecture and architecture.\nA track record of CPU microarchitectural innovation with experience in one or more of the following broad areas.\nFront End CPU Uarch (Fetch, Decode, Branch Prediction).\nMidcore CPU uarch (Rename, Allocate, Scheduler, Integer/Vector Exec).\nMemory Subsystem CPU Uarch (MMU/TLB, Address Gen, Load/Store Units, L1, L2 caches, Prefetch).\nA history of generating innovative microarchitectural ideas to improve performance ; actively doing the performance modeling and debug to demonstrate the merit and limitations of these ideas; enabling the realization of the ideas with close engagement with design.verification/postSi bringup teams.\nClose collaboration with the lead microarchitect of the core to cooperatively solve issues and help realize the overall perf/area/power targets of the CPU core.\nA strong ability to communicate and advocate the merits and drawbacks of the microarchitectural ideas to fellow microarchitects, and implementation leads in a variety of mediums, both verbally and through presentations and documents.\nAn enthusiasm, energy and drive in leading their part of the microarchitecture of the machine where they lead by doing.\nWays to stand out of the crowd:\n PhD in a relevant CPU microarchitecture area.\nAt least 4 years of industry experience in a core CPU microarchitecture.\nWith competitive salaries and a generous benefits package, NVIDIA is widely considered to be one of the technology world’s most desirable employers. We have some of the most forward-thinking and hardworking people in the world working for us.Show more Report"}, {"company": "", "job": "Principal Hardware Security Architect", "city": "Raanana", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=124&ao=1136043&s=58&guid=00000186e6392b4599eb3c5c837697ef&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c7464722&cb=1678899951460&jobListingId=1008217751825&jrtk=3-1-1grj3odo9nceu801-1grj3ias7i38u800-8862ffba65120e37-", "description": "As Principal Hardware Security Architect, you will be a part of Security Architecture team based in Ra’anana, Israel. You will be responsible for writing architectural specifications and analyzing and reviewing security related products for the Mobile, Infrastructure, Automotive and IoT markets.\n\nYou will join a small team of motivated and professional security and system architects who all share a passion for maintaining Arm’s leadership position and making an impact on the future Arm technologies. If you share a similar passion, we want to hear from you!\n\nWe are offering a hybrid approach to home and office working to provide an adaptable experience for all employees. We expect 2 or more days per week in office to build productive interaction with peers, but are flexible about home working.\n\nResponsibilities:\nDevelop security related system architectures that address the needs of Arm’s target market segments in Client, Automotive, Infrastructure and IoT, standardize key concepts but leave space for partner differentiation\nPerform security reviews of existing Arm and external designs\nWork with product teams and other Arm architecture teams to define the next generation security related products\nProvide guidance on system architecture and requirements to Arm engineering teams\nRepresent Arm in technical discussions with customers\nRequired Skills and Experience :\nB.Sc. in Computer Engineering, Computer Science, Electrical Engineering. Other degrees will also be considered with relevant experience\nM.Sc. is an advantage\nAnother engineering / science degree (in different field) is an advantage\nExcellent and experienced Hardware Security Systems Architect\n5+ years of experience in designing chip level HW architectures and specification documents for hardware systems (SoC)\nProven design/verification experience\nCreative, dynamic thinker, open minded and strong problem-solving skills\nFast learner of new technologies and standards\nTeam player with ability to work in a collaborative environment\nExcellent verbal, written and interpersonal communication skills\nExcellent written and spoken English communication\n“Nice To Have” Skills and Experience :\nExperience with Arm processors, CPU architecture and SoC subsystems\nExperience with deeply embedded systems, embedded software, low level drivers and hardware interfaces\nFamiliarity with cryptography, data security, network security, security standards, SoC security\nExperience in developing and analyzing complex systems\n\nArm is an equal opportunity employer, committed to providing an environment of mutual respect where equal opportunities are available to all applicants and colleagues. We are a diverse organization of dedicated and innovative individuals, and don’t discriminate on the basis of any characteristic.Show more Report"}], [{"company": "Noviopus", "job": "Front-end Developer", "city": "Rishon LeẔiyyon", "date": "10d", "rating": "", "link": "", "description": "An HR Tech startup that is developing the next generation of recruitment and finding a job system.We are looking for a Front-end developer to build several web applications.The job is open for new or inexperienced developers as well.The system deck is using a React/Redux, JavaScript, Node.js backend with MongoDB, PostgreSQL and Redis DBs.Need a skilled developer who has experience in creating material UI designed React/Redux webpages with API connections.Must have experience developing with React/Redux and APIs.Need to know how to work with Bitbucket and CircleCI/Cypress CI/CD auto testing systems.Development tasks are managed with Jetbrain YouTrack system.Job Types: Full-time, Part-time, VolunteerShow more Report"}, {"company": "uPress", "job": "Front-end Developer", "city": "Holon", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=1136043&s=58&guid=00000186e639f99dbf06650e528fef69&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e5764e2e&cb=1678899957078&jobListingId=1006479920529&jrtk=3-1-1grj3oj7ence9801-1grj3jueuhaol800-627e61c180f7a152-", "description": "למה כדאי לך להצטרף לצוות שלנו?\n\nכבר שנים ארוכות שאנחנו מובילים בתחום אחסון אתרי הוורדפרס, וזו יכולה להיות הזדמנות נהדרת עבורך להצטרף לצוות המנצח שלנו, אם אתה עדיין לא מכיר אותנו, אז הגיע הזמן.\nאנחנו צוות של אנשי אבטחה, מנהלי רשתות, מפתחים, מעצבים, אנליסטים, מאפייני UX/UI, אנשי שירות ומכירות. שעושים את ה-כ-ל בשביל לספק ללקוחתינו את הטכנולוגיה המתקדמת ביותר ופורצת הדרך שלנו, עטופה היטב בשירות ברמה הגבוהה ביותר כאשר המטרה שעומדת כל הזמן לנגד עינינו היא להמשיך להוביל ולפתח את עולמות האחסון בוורדפרס..\n\nביופרס העובדים מרגישים שהם שייכים לצוות איכותי של אנשים שפועל יחדיו עם המון .תמיכה וחופש ליצירתיות, לביטוי עצמי ולהשפעה עצומה על מגוון רחב של תחומים\nכחלק מהתפיסה הארגונית שלנו אנחנו שמים את העובד במרכז ומאירים דגש מיוחד על התפתחות אישית, צמיחה מקצועית ורכישת ידע, עיצוב קריירה אישית שמניבה פירות וסביבת עבודה נוחה ומשפחתית שמסייעת לכל עובד.\n\nאם אתה מחפש הזדמנות להצטרף לחברה עם אפשרויות קידום אדירות ורצון להוביל,להצליח, לפתח ולשנות את עולם הוורדפרס בישראל ובעולם . מקומך איתנו.\n\nמה אנחנו מחפשים?\n\nאנו מחפשים מפתח מוכשר עם תשוקה לחשיבה מחוץ לקופסא, שישפיע רבות על העסק שלנו.\nאנחנו מחפשים מישהו שיעזור לנו לתחזק את עשרות המערכות שפיתחנו, לפתח מערכות חדשות, מישהו עם ראש גדול שיודע לעבוד בצוות, להיות שותף ביצירה ולשתף מידע.\n\nמה אנחנו מצפים ממך?\nבניית קוד יעיל, ניתן לבדיקה וניתן לשימוש חוזר\nתרגום דרישות בכתב לתכונות הפועלות במלואן\nנסיון מוכח של שנתיים בפיתוח Front-end – חובה\nניסיון מוכח עם JavaScript (כולל ES6), CSS3, HTML5 – חובה\nשימוש בטכנולוגיות מגוונות עם דגש על React \\ Angular – יתרון\nיכולות עיצוב ארכיטקטוריות חזקות\nזיהוי ופתרון בעיות שונות ובעיות קידוד\nאנגלית כתובה ומדוברת ברמת שפת אם\n\nאנחנו אוהבים אנשים שחושבים בגדול ויודעים לעבוד בצוות, שמאמינים במטרה שלנו לבנות חברה ייחודית רבת השפעה לטווח ארוך עם מערכת ששואפת לאוטומציה מלאה.\n\nפרטי המשרה?\n\nהעבודה הינה במשרה מלאה במשרדי החברה.\nהמשרה פונה לגברים ולנשים כאחד וכתובה בלשון זכר מטעמי נוחות בלבד.\nשלח לנו קורות חיים לדואר אלקטרוני hr@upress.co.il עם הכותרת \"Front-end Developer\"\n\nפרטים שחשוב לנו לדעת עליך\nמקום מגוריך הנוכחי?\nתאריך תחילת עבודה מבחינתך\nפירוט הניסיון המקצועי שלך\nציפייות שכר (בשקלים ברוטו)\nאתר אינטרנט, בלוג, פרופיל מדיה החברתיתShow more Report"}, {"company": "eternitech", "job": "Jr. front-end developer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=103&ao=1136043&s=58&guid=00000186e639f99dbf06650e528fef69&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_eadb2d65&cb=1678899958845&jobListingId=1007803201400&jrtk=3-1-1grj3oku236hi001-1grj3jueuhaol800-4ae2ea081b64465d-", "description": "Position description\n\nEternitech is looking for Junior front-end developer, with at least 6 month of experience with Web development technologies\n\nRequired skills\n\nProgrammer from birth\n\nDeep understanding in client side languages and frameworks as Html, css, bootstrap, javasctipt, angular.js etc.\n\nExperience in one the following languages: PHP, C #, Ruby, Python – Advantage.\n\nUltra fast autodeduct\n\nHigh verbal abilities and intrapersonal skills.\n\nTeam player\n\nHigh level of English (spoken & written)\n\nPosition is offered to both men and womenShow more Report"}, {"company": "KMS Lighthouse", "job": "Front End Developer", "city": "Petah Tikva", "date": "19d", "rating": "4.5", "link": "", "description": "KMS Lighthouse is a global software (SaaS) company that drives smarter, better business interactions with its knowledge management solutions. We use advanced technologies and take an innovative approach to build knowledge management solutions. This an amazing opportunity to join a hyper-growing company and to make a real impact!\nKMS Lighthouse is an industry leader in knowledge management, working with Fortune 500 enterprise-level customers. If you're interested in the intersection of technology, innovation, and knowledge, this is the place to be.\nWe are growing its R&D center, and we are looking for a Front-End Developer to join our team:\nWork as part of a small agile development team, under the global development department – work with colleagues in UK, Europe, and the USA\nUse advanced technologies and tools such as Vue.js, jQuery, JIRA, etc.\nRequirements:\n\nExperience and a deep knowledge of at least one of modern UI frameworks: Vue or React (we work with Vue)\nThe ability to work with legacy code: knowledge of jQuery, ES5\nKnowledge of at least one of CSS preprocessor languages: SASS/LESS\nExperience with BEM and deep knowledge of HTML5 and CSS\nFamiliarity with Scrum and an Agile Development environment and tools like JIRA, Git, Confluence etc\nNice to have: experience with Unit testing, Webpack, nodejs, vue-clShow more Report"}, {"company": "", "job": "Frontend Developer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=1110586&s=58&guid=00000186e639f99dbf06650e528fef69&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_440c8f7a&cb=1678899961378&jobListingId=1008466534330&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj3oneu2i76001-1grj3jueuhaol800-424f861817b4e2ca--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNCKtKpYxsmASesiIgWN6tvrcerKIQAWqeAomeExbasTDgqhASLlTQAdVV9PABR_iS6PXDhyDDwbFq4bNDlaanEJOYRyu6uAVcvT66cY-GPTKCk3T6Hpbhi_ah6PET70Qvff-P3lL2Rkn5cXB_u6SttHZwZrMS_b7W2_Uxd_S-LTKfqgyJtvQ_PQxrexY1KSmDHk_9P7myeswmodqBMy7tyh7L4dDzSh94UvujMjTIvBD7hVxESfe1HY63ROU2aVfOnoO-tTHVHU0gcAN_j1Uc0iiEKGziCEveg60xJeA32rIAXF0RRxIifPhcqvNrvmKuCi_O_SMSkCuP_392E1C3ma1TMMC0OdUgE78G6t4pR66ecL0ZUAvd8ZGS8GuHHonFLe6X726-QTNAwIcQ3x8omOHfjDeAayAEOMk9itXCv6hAPhUIBOxG_3O_jrdOddrTYCGwNKHnCaaivBTwJXWnGpSKufsep8zHb4uo-jJzI5unXmbvWyplLX2U_Anh6eDoXNr3wqs-SViwyW_S0x92egFVKENSPf0KjgbfqZ1fyjs8DviyfqXxKes_TXrtlSSEhouVomDo9NbQpqPHjHVhdTESUn-FA1zC57rEPA4IjOZrvHsxr6n_bI044S7K3MoQlbnh6cd34rSXTZxi0DUpdyixJb02gJGO8%3D", "description": "A successful company located in Ramat Gan is looking for a Front-End Developer who has the passion and understanding of Web Design & Client-side development, to join our R&D team. Building and developing from scratch sites, landing pages, etc. Creation of user interface elements and widgets and web applications. Building responsive landing pages and more.\n\nWorking with the Design & marketing Dep. 2 years of experience as a Front End Developer-Must Extensive knowledge & experience in HTML5, CSS3, JavaScript- Must Proficient understanding of client-side scripting and JavaScript frameworks, such as Angular JS, Vue JS, ReactJS, etc. including jQuery Experienced in creating & building responsive design pages from scratch- Must Knowledge of Nodejs- an advantage Detail-oriented, team playerShow more Report"}, {"company": "Resonai", "job": "Front-End Developer", "city": "Tel Aviv-Yafo", "date": "27d", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=106&ao=1136043&s=58&guid=00000186e639f99dbf06650e528fef69&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_09fb8b20&cb=1678899962393&jobListingId=1008474372611&jrtk=3-1-1grj3ooe9kclc801-1grj3jueuhaol800-b720fa2bd0df1e36-", "description": "DESCRIPTION\nResonai is a spatial computing company transforming physical environments into intelligent digital spaces. Our computer vision platform, Vera, combines Augmented Reality and Artificial Intelligence to digitize the built world.\nWe are looking for a Web/Front-End Developer developer to join our team in a challenging position developing innovative visualization tools.\nREQUIREMENTS\nMinimum 2 years of web Frontend experience\nExperience with a major FE framework (Vue.js, Angular, React)\nBachelor's degree in Computer Science\nDesire to work with Vue.js\nAn advantage:\nExperience with Three.js or other 3D visualization tools\nUX skills\nExperience developing web for Mobile\nSKILLS\nAbility and desire to participate in a multidisciplinary team in a creative startup atmosphere\nIndependent with a \"Can-do\" attitude\nCuriosity, a drive to learn and explore new technologiesShow more Report"}, {"company": "YKM", "job": "Front end Developer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "2.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=107&ao=1136043&s=58&guid=00000186e639f99dbf06650e528fef69&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_46fb305e&cb=1678899963881&jobListingId=1006610029389&jrtk=3-1-1grj3opsrmfra801-1grj3jueuhaol800-ef9da792035e7e9f-", "description": "YKM, a leader in the digital industry, is looking for an experienced Front End Developer for a Full time Job.\n\nRequirements:\n\nAt least two years’ experience in developing Client Side applications for WEB\nProven experience with HTML5, CSS3, Ajax, jQuery Java Script, Photoshop, Cross Browser Support.\n Knowledge in CSS / HTML Responsive design with CSS3 media queries – an advantage\n Experience with libraries such as: AngularJS, Backbone, Modernizer – an advantage\n Experience with environment: RESTful services and WebAPI\n A team player\nTel Aviv\nJob Type: full-time\nYears of Experience: 2\nJob Level: mid_levelReport"}, {"company": "Ideo digital", "job": "Front End React Developer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=108&ao=1136043&s=58&guid=00000186e639f99dbf06650e528fef69&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e09384eb&cb=1678899969755&jobListingId=1008265115729&jrtk=3-1-1grj3ovjsi6hr801-1grj3jueuhaol800-c59c08c191bc4c0f-", "description": "roven work experience as a Front-end developer using React.JS & Redux\n\nHands on experience with markup languages (HTML)\nExperience with JavaScript, CSS and jQuery\nFamiliarity with browser testing and debugging\nIn-depth understanding of the entire web development process (design, development and deployment)\nUnderstanding of layout aesthetics\nAn ability to perform well in a fast-paced environment\nExcellent analytical and multitasking skills\nTeam player - Strong interpersonal communication skills\nExperience with working with a TFS environment is an advantage.\nExperience with Agile (Scrum) is an advantage.\nExperience with Server side .NET technologies is an advantage (MVC 5/6, MS-SQL, Etc.)Show more Report"}, {"company": "Top It Solutions", "job": "Front End Developer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=109&ao=1110586&s=58&guid=00000186e639f99dbf06650e528fef69&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ecf60f94&cb=1678899971703&jobListingId=1008394745945&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj3p1f1ncfu801-1grj3jueuhaol800-f0e615194fa3c705--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNA-DD5QYGBg6nlHM47bOJrWQf7u2fpMdzlOcqm9-rPRZr5a8ACnNGz8Zit542C6m4pAQXsPEfyvTKKINc13JJqnoEoOyCV_xK3GyJd1o0KfpYWZV37YoQOKJVcg-fIUJEckDOl5vrO0N2apc_4Gthss6AIuzJofVdK8YIqPwnQzNF7g5XDhSOEMONQzu6T_kVvEw2f7PXe8cR6TjxHgEoM41bYPnZAvA6jkk4YumoFvu_1g4YCTnlUcBgNzjQsNaE07BeB07triFYnXV07AWFl8wOogdgA_cUKfw_y8N3689FT6Dbk3KB5I9AfVYrSKvTJCOKhCKdRTfZ5LmCe1pNsMsR5tqSloFB9J2Gyq2ZI8BZUf4SQL2UDjr2lR5uFn6tJQd62kAalqd5Xikl1mx_vwERvFe1C0gUPrVmrsqVbG9yvslSdLE9QoQ_D4c1wNreM38dSYH8XMTqbVw0voZLvfdEzT2UDyF8Y7S9D3xg43qIjoj3P4f0LoLS8odNJS4tJ-xK3pnbOqZ-iujo2z-Kr05Rts5otki5MCzADPVk3Un5uLzfCqbFTGIs9MBBv3p_hkiwJl7P6eq_hIGa_1ivVq_5mEsIDVMh_rMFMd1CS1k_laL0NMs1qLcfWvG-KQlCCnVsvmI4iMYJybE9hHtM7udeBcNfawr34%3D", "description": "לארגון טכנולוגי גדול ומוביל במשק דרוש/ה Front-End Angular Developer תיאור התפקיד: פיתוח front בשיא הטכנולוגיה! בארגון מוביל במשק. עבודה בסביבה אג'ילית, דינמית ומעניינת. המשרה מתאימה גם למועמדים עם יחסית מעט ניסיון.\n\nהזדמנות של ממש עבור מפתחי front להשתלב בארגון טכנולוגי מעולה! ניסיון של שנה לפחות ב-angular, ברמת ה-core וה-api השונים שלו ניסיון של שנה לפחות ב-css3 ובלפחות אחת מהפלטפורמות הבאות (sass\\less) ניסיון עם rxJs ניסיון בעבודה עם chrome DevTools ניסיון בעבודה בסביבה אג'ילית – יתרון ניסיון בעבודה עם מוצרי אטלסיאן (jenkins\\bitbucket\\confluence) – יתרוןShow more Report"}, {"company": "Toonimo", "job": "Front End Developer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=110&ao=1136043&s=58&guid=00000186e639f99dbf06650e528fef69&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0da7c049&cb=1678899973276&jobListingId=1008143997957&jrtk=3-1-1grj3p32jkclj801-1grj3jueuhaol800-c0c2de81f92dbcd0-", "description": "Requirements:\nAt least 3 years of programming experience\nLikes to work as part of a team\nExperience with working in a startup environment\nFront End Developer experience\nCreative, motivated and hard worker\nFull stack developer experienced in all aspects of web\nHigh level of auto-deduction & self-management\nFamiliar with the MVC concept\nWorked with one of these: Backbone/angular/React\nDeveloped in HTML5, CSS3, jQuery, Ajax, RequireJs\nStrong “pure javascript” background\nChrome extensions knowledge – Advantage\nResponsibilities:\nDevelop and assume responsibility of core products & features\nWrite clean, maintainable and testable code & inspire others to do just that\nFollow up on bug fixes, enhancements, and new features\nBe deeply invested and involved with all aspects of running a successful SaaS startup, from customer focused product definition, to implementation and scalable deployment\n\nTo apply kindly send you CV to jobs@toonimo.com - See you there :)Report"}, {"company": "Wirex", "job": "Front-End UI developer", "city": "Israel", "date": "30d+", "rating": "2.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=111&ao=1136043&s=58&guid=00000186e639f99dbf06650e528fef69&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_eac3bac9&cb=1678899974321&jobListingId=1006115997581&jrtk=3-1-1grj3p434k62g801-1grj3jueuhaol800-82418f88a0a0c787-", "description": "Requirements:\n\nAt least 3 years of experience with JavaScript, HTML, CSS.\nWeb applications development experience\nHands on experience working with at least one of these: React, AngularJS, Vue\nHands on experience working with Bootstrap or Material-UI\nWorking experience with RESTful API\nDeep understanding and experience of Responsive web design\nFamiliarity with Node.js, TypeScirpt is an advantage\nFamiliarity with XPATH/XSL is an advantage\nDeveloping in Linux is an advantageShow more Report"}, {"company": "NeoGames", "job": "Front End developer", "city": "Tel Aviv-Yafo", "date": "22d", "rating": "4.1", "link": "", "description": "NeoGames is on the lookout for a front-end developer to join our Portals and Apps department!\nNeoGames is a global leader in iLottery solutions and services to national and state-regulated lotteries. We empower our customers to create the most successful iLottery programs with a complete solution that includes industry-leading omnichannel platforms, an innovative portfolio of the best-performing interactive games, and a full suite of business and technology services.\nRequirements:\n\n3 years of experience in front end development – Must\nStrong knowledge of React stack(ReactJs, Redux, etc) – Must\nStrong knowledge of modern technics with HTML and CSS – Must\nKnowledge of node.js and SSR - Will be a big plus\nKnowledge of PHP and MySQL – Will be a plus\nExperience with WordPress CMS - Will be a plus\nBachelor’s Degree in Computer Science / Software engineering - Advantage\nHard-worker, Responsible, excellent learning abilities,\nGreat communication and interpersonal skills\nExcellent English level\nResponsibilities:\n\nDevelop and maintain the company web applications.\nParticipate in all aspects of the development life cycle.\nThe position includes development on client-side. If candidate will show ability and willingness he can participate in server-side related tasks as well.Show more Report"}, {"company": "Unleash Labs", "job": "Front End Developer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=1136043&s=58&guid=00000186e639f99dbf06650e528fef69&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b575642c&cb=1678899977140&jobListingId=1008312736638&jrtk=3-1-1grj3p6rkkltk801-1grj3jueuhaol800-59930d09c0c70010-", "description": "Unleash is powering the productivity revolution by providing users with a centralized way to search through their cloud based apps and local desktop. A light weight search interface allows users to enter their search query and receive relevant ranked results which are yielded in seconds.\n\nAs a user centric company, we place a great deal of emphasis on users experience when building our product and have fun doing it!\n﻿\nWe are a fresh and energetic startup, post round A in funding ($12M), led by a strong team of second timer founders and top angel investors and VCs from the Sillicon Valley and Tel Aviv. Our expanding team is made up of enthusiastic and dedicated members working together to revolutionize the productivity world. We believe that collaboration across teams - where everyone is accessible, from our newest hires to the founders - combined with a vested interest in our teams well being are the keys to our successful working environment.\n﻿We are looking for a Front End Developer to be part of the application lifecycle from design phase to production and bug resolving. In addition, the role requires the development and engineering of all client related components of our product including desktop application, mobile web app and every client facing alternative that will be defined.\n﻿\nYour main responsibilities will include:\n\nDesign and plan features that will be defined by the Product Team\nDeveloping smooth and efficient code\nCollaborate with Back-end Engineers / DevOps Engineers / QA Engineer / Product Managers\nStay up to date with current best practices\nProvide training, help and support to other team members\nPerform code reviews for colleagues and team members\nBe aware of security concerns and resolve issues\nMitigate production incidents\n\nIf you are a bright, pro-active, ambitious and naturally curious person who shares our value of teamwork and hold these skills, send us your CV!Report"}, {"company": "TOMODO", "job": "Front End Developer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=114&ao=1136043&s=58&guid=00000186e639f99dbf06650e528fef69&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4912a85a&cb=1678899978495&jobListingId=1006849225220&jrtk=3-1-1grj3p83vpkdi801-1grj3jueuhaol800-bb248736c424abc6-", "description": "At TOMODO, every developer is familiar with our entire system. As a front end developer, you will be working on many different projects and challenges simultaneously. You'll build a friendly, cloud based, development environment. Handle cross browsers and cross third party services while mastering dynamic code injections. In addition you'll master the art of performance and scale in ways web developers rarely get to see.\nAt least 3 years of hands-on experience in web client development (JavaScript + HTML + CSS3).\nMust be familiar with server-side technologies (preferably Python / Ruby).\nAdvanced HTML & CSS skills, cross browser experience.\nSelf-learner with the ability to see a project through from A to Z.\nHacker / BSc / MSc in computer science or related fields / contributor to open source projects\nPassionate about technology and the web.\nAWS experience - a significant advantage.\nContact us at: hireme@tomodo.comShow more Report"}, {"company": "InspHire", "job": "Front End Developer", "city": "Ramat Gan", "date": "30d+", "rating": "5.0", "link": "", "description": "We are looking for a Front-End Web Developer who is motivated to combine the art of design with the art of programming to join a well-financed, energetic startup-like publicly traded company, led by experienced and well-reputed entrepreneurs in the blockchain-crypto space is. Responsibilities will include translation of the UI/UX design wireframes to actual code that will produce visual elements of the application. You will work with the UI/UX designer and bridge the gap between graphical design and technical implementation, taking an active role on both sides and defining how the application looks as well as how it works.\nResponsibilities\nDevelop new user-facing features\nBuild reusable code and libraries for future use\nEnsure the technical feasibility of UI/UX designs\nOptimize application for maximum speed and scalability\nAssure that all user input is validated before submitting to back-end\nCollaborate with other team members and stakeholders\nSkills And Qualifications\nProficient understanding of web markup, including HTML5, CSS3\nBasic understanding of server-side CSS pre-processing platforms, such as LESS and SASS\nProficient understanding of client-side scripting and JavaScript frameworks, including jQuery\nGood understanding of advanced JavaScript libraries and frameworks, such as AngularJS, KnockoutJS, BackboneJS, ReactJS, DurandalJS etc.\nGood understanding of asynchronous request handling, partial page updates, and AJAX\nBasic knowledge of image authoring tools, to be able to crop, resize, or perform small adjustments on an image. Familiarity with tools such as as Gimp or Photoshop is a plus.\nProficient understanding of cross-browser compatibility issues and ways to work around them.\nProficient understanding of code versioning tools, such as Git / Mercurial / SVN\nGood understanding of SEO principles and ensuring that application will adhere to them.Report"}, {"company": "נישה", "job": "Front End Developer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=1110586&s=58&guid=00000186e639f99dbf06650e528fef69&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c11eda2b&cb=1678899980551&jobListingId=1008417051133&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj3pa5n2inq001-1grj3jueuhaol800-92108372256b1933--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBqonlhNrMFnWn3MRm66ezbwjic7w5vrGyHThdYTVHCbD_72wJhTPS0w-tiEZhwCpym7QWNl_4WnEVRR_WmGiztgyvrZHXudN3lWGdTFDjt3OicJ1i8UYgKjmZq7dWrf_OXlaEyNMRInzLRG8p06AKTHKM0XQQL9iwogHi6Ve9r_TcXPCodzcJ0qz7HO6MhKye6i36xouHngPTN4A4yLuID3Px-OTbwNmEeB2oOfi6guoY-OWR2FWiOqeHWsfkdQiKgZtuST9FwdSj5q2Ob6sU0IHFNur-KteoCUhEhKAPb_ZmJAaoWoNYc8tqGqsFZqwMRYEKZc0y6Um1fh3bXqK702jpUlGZC1hL-F2oJS5I_i_-AUNkeP7XMUKQYuPj_D0tU8TG7EeK3PistBnmeA8A7mXY5PwZtcvlSMvRjMbS3xVO6xbHlH08OerLBO7PDCB8IId44ZabVcsiBfaAM7NKV5iT-uiKfcfCWUHcSGEa6YmKydBCwtGymNLHxpxL6o5xMp9B0OXoEFJ7qILTd5MiXel-mLpUKW4Zp36I-hYnOuE-bqWr24obdYhUtxO30wr18878XdQJZ-0VoXl_bpX6MtNMk3S0ooQH6ZU8SP7mh3Ao876i2USmjKKAA-afL4bzw--jVZFPxjmUZIWH1HVVKaCouDU7Bky4%3D", "description": "לחברה בעלת מוצר בתחום הנסיעה הבטוחה דרוש/ה Front End Developer עבודה 100% לצד ה- Client. תואר ראשון במדעי המחשב / מערכות מידע / תחום דומה - חובה 3+ ש\"נ בפיתוח ב- JavaScript - חובה שנה ניסיון בפיתוח ב- React - חובה ניסיון בשפות Python & Node.JS - יתרון ניסיון עם Mobile Application - יתרון משמעותיReport"}, {"company": "ZOLL LifeVest", "job": "ReactJS UI Client Developer", "city": "Herzliya", "date": "3d", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=117&ao=1136043&s=58&guid=00000186e639f99dbf06650e528fef69&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_bc0d85d9&cb=1678899981612&jobListingId=1008523747378&jrtk=3-1-1grj3pb6t21a3001-1grj3jueuhaol800-7e99631f81789ea0-", "description": "Location: Herzeliya, Remote\nItamar\nThe primary focus will be on developing user interface components and implementing them following well-known React workflows using Redux. You will ensure that these components and the overall application are robust and easy to maintain.\nQualifications:\nHands-on experience (+3 years) developing with the following web technologies:\nStrong proficiency in JavaScript, including DOM manipulation and the JavaScript object model.\nThorough understanding of React and its core principles & related ecosystem (such as Redux and Middlewares).\nDeep knowledge of CSS, layouts, graphs, animations, and related tools such as CSS Modules, antd, highcharts.\nFamiliarity with newer specifications of EcmaScript.\nUnderstanding of concepts like immutability, functional programming, OO design. Experience with RESTful APIs. Experience with common front-end development tools such as Babel, Webpack, Yarn.\nExperience with automated tests practices and tools such as Mocha, Jest, Enzyme, Selenium.\nAbility to understand business requirements and translate them into technical requirements.\nExperience in WebGL – big advantage Devops experience – advantage\nKnowledge in Cloud (AWS) and medical health environments - advantage.\nLocation: Hertzelyia Pituach, IsraelShow more Report"}, {"company": "Devalore", "job": "Front-end JavaScript Developer (React)", "city": "Petah Tikva", "date": "30d+", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=118&ao=1136043&s=58&guid=00000186e639f99dbf06650e528fef69&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c313381e&cb=1678899982676&jobListingId=1006017961321&jrtk=3-1-1grj3pc7mp2mh801-1grj3jueuhaol800-6753515729b50b44-", "description": "We are looking for a great JavaScript developer who is proficient with React.js. Your primary focus will be on developing user interface components and implementing those following well-known React.js workflows (such as Flux or Redux). You will ensure that these components and the overall application are robust and easy to maintain. You will coordinate with the rest of the team working on different layers of the infrastructure. Therefore, a commitment to collaborative problem solving, sophisticated design, and quality product are important.\n\nResponsibilities\nDeveloping new user-facing features using React.js\nBuilding reusable components and front-end libraries for future use\nTranslating designs and wireframes into high-quality code\nOptimizing components for maximum performance across a vast array of web-capable devices and browsers\nSkills\nStrong proficiency in JavaScript, including DOM manipulation and the JavaScript object model\nThorough understanding of React.js and its core principles\nExperience with popular React.js workflows (such as Flux or Redux)\nFamiliarity with newer specifications of ECMAScript\nExperience with data structure libraries (e.g., Immutable.js)\nKnowledge of isomorphic React is a plus\nFamiliarity with RESTful APIs\nKnowledge of modern authorization mechanisms, such as JSON Web Token\nFamiliarity with modern front-end build pipelines and tools\nExperience with common front-end development tools such as Babel, Web pack, NPM, etc.\nAbility to understand business requirements and translate them into technical requirements\nA knack for benchmarking and optimizationShow more Report"}, {"company": "Unleash", "job": "Front-End Developer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.3", "link": "", "description": "Unleash is powering the productivity revolution by providing users with a centralized way to search through their cloud based apps and local desktop. A light weight search interface allows users to enter their search query and receive relevant ranked results which are yielded in seconds.\nAs a user centric company, we place a great deal of emphasis on users experience when building our product and have fun doing it!\n\nWe are a fresh and energetic startup, post round A in funding ($12M), led by a strong team of second timer founders and top angel investors and VCs from the Sillicon Valley and Tel Aviv. Our expanding team is made up of enthusiastic and dedicated members working together to revolutionize the productivity world. We believe that collaboration across teams - where everyone is accessible, from our newest hires to the founders - combined with a vested interest in our teams well being are the keys to our successful working environment.\nWe are looking for a Front End Developer to be part of the application lifecycle from design phase to production and bug resolving. In addition, the role requires the development and engineering of all client related components of our product including desktop application, mobile web app and every client facing alternative that will be defined.\n\nYour main responsibilities will include:\nDesign and plan features that will be defined by the Product Team\nDeveloping smooth and efficient code\nCollaborate with Back-end Engineers / DevOps Engineers / QA Engineer / Product Managers\nStay up to date with current best practices\nProvide training, help and support to other team members\nPerform code reviews for colleagues and team members\nBe aware of security concerns and resolve issues\nMitigate production incidents\nIf you are a bright, pro-active, ambitious and naturally curious person who shares our value of teamwork and hold these skills, send us your CV!Report"}, {"company": "WebNews", "job": "JUNIOR FRONT-END DEVELOPER", "city": "Netanya", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=120&ao=1136043&s=58&guid=00000186e639f99dbf06650e528fef69&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_82362841&cb=1678899986313&jobListingId=1005947207550&jrtk=3-1-1grj3pfpekf19801-1grj3jueuhaol800-26e8955669cd376b-", "description": "Experience with HTML5/CSS3 – required\nExperience with JavaScript – required\nHands-on experience developing AngularJS/ReactJs – a significant advantage.\nExperience with typescript, es6, redux – an advantage\nHands-on experience in developing complex Web apps\nAbility to work in teams\nCV: jobs@webnewsltd.co.ilShow more Report"}, {"company": "שביט סופטוור", "job": "Front End Developer לארגון פיננסי מוביל", "city": "Southern", "date": "8d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=121&ao=1110586&s=58&guid=00000186e639f99dbf06650e528fef69&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d86e9181&cb=1678899987647&jobListingId=1008513907680&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj3ph3hkugi801-1grj3jueuhaol800-3447f0b7195d463e--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBMJW6bVHrIfmH7y9rrntT-d1OrE7MTmj2iddv9SzqrHQAa-3gf6Yjy1QCxxZo2xbxTPHmYBCYCzhCBwTvY8pm91zGR9bhHPHs8UIjiVSyAoZMiRinEJRbmTkjTCj13kyQJC7ksqWOGnGDIhr3UE8Td6KVjVrSUxHYE8kQhwQKANlyeMTVapKK01Mzr-0vCmq1v_ZIc_6xnGXJQoNqaAAeOTiTWnIOYLo4sIRJBwMVNKGklwtrpAuxmWt3A1rxz_vtW8RZEUVQS8ctLJHcy4YTPlkhZ8qWSv9pUKu4cRWP-MzljZDCbCOt03bnCpNBdkgZpQhlJuDECVBTea6Pl_GpPRv_oWy2-pKtgaPq2N1Gsy_BPPG0zKs3SNT8rrxkfo4FWVoXuPpMSkXojTv8gIkj3_NVlFksR3Z6G9KnD7Y6SbPouCzEqo3-NrZcLIcgG57tHGr04dnGud9xmLaqboUVQKExZdjeWwbpczFaGeVMra4YXYWvVQRJGSTC_WihTw6LzCU3mqDy1i0QWFdh0331GBVG11zo_u0QhcB87upyZb15-gaHh-OL0t5DjHfjtf2lP2Ns9iq0xVT58hwFMMiwn_Sa0VTIhi59bf8XPzj_Q9kQlWiAneajHgyNY8C0XghodzqFEqwKr9z6buw81CJ9kuT7dsi9NKEY%3D", "description": "לחברה פיננסית באזור המרכז דרוש מפתח front end בפריימוורק angular, אחריות כללית לביצוע משימות מקצה לקצה, עבודה כחלק מצוות איכותי ומקצועי. - ניסיון מעמיק של שנה לפחות בAngular גרסה 8 ומעלה - חובה - ניסיון של שנה לפחות והבנה מעמיקה ב CSS ו HTML - חובה, - ניסיון והכירות עמוקה עם RXJS - חובה - ניסיון בעבודה עם RESTful APIs - חובה - הכרות של Best Practices של עבודה בקליינט - יכולת למידה גבוהה ומוכנות להתנסות בטכנולוגיות חדשותShow more Report"}, {"company": "SQlink", "job": "Front End Developer לחברת אבטחת מידע מצליחה", "city": "Israel", "date": "30d+", "rating": "3.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=122&ao=1136043&s=58&guid=00000186e639f99dbf06650e528fef69&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_3b571ed1&cb=1678899989624&jobListingId=1008056119219&jrtk=3-1-1grj3pj1834ao001-1grj3jueuhaol800-87620311a3a51438-", "description": "תיאור המשרה:\n\n חברת אבטחת מידע מוכרת באזור המרכז מגייסת Front End Developer.\nהחברה עוסקת בפיתוח תוכנה לאבטחת אפליקציות ובזיהוי ותיקון חולשות אבטחה, עובדת מול מגוון לקוחות באופן גלובלי.\nבמסגרת התפקיד: הצטרפות ועבודה בצוות, כתיבת קוד מורכב, עמידה ביעדים, ועוד.\nהצטרף/י לתפקיד מאתגר בחברה מצוינת ומובילה בתחומה!\n\nדרישות המשרה:\nשנתיים ניסיון בפיתוח ב-Reactניסיון בעבודה עם אוטומציהניסיון בפיתוח בשפות HTML, JS, CSS\n\n\nמס' משרה:\n 136077Report"}, {"company": "eternitech", "job": "Frontend developer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=123&ao=1136043&s=58&guid=00000186e639f99dbf06650e528fef69&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6f679a51&cb=1678899991206&jobListingId=1006800394180&jrtk=3-1-1grj3pkimjc9p801-1grj3jueuhaol800-e12ac509a10d21be-", "description": "Position description\n\nEternitech is looking for a junior Front-end developer with as 1 year of experience of Web development technologies.\n\nRequired skills\n\nDeep understanding in Javascript language (ECMAscript 6).\n\nExperience in HTML, CSS, supporting browsers and platforms and Responsive programming for tablet and mobile web apps.\n\nExperience in one the following languages: PHP, C #, Ruby, Python – Advantage.\n\nExperience in one the following client side frameworks: backbone.js, angular.js, react.js – Advantage.\n\nB.A. in Computer Science / Software Engineering from a recognized academic institution.\n\nHigh verbal abilities and intrapersonal skills.\n\nTeam player\n\nHigh level of English (spoken & written)\n\nPosition is offered to both men and womenReport"}, {"company": "גב מערכות מרכז", "job": "Frontend Developer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=124&ao=1110586&s=58&guid=00000186e639f99dbf06650e528fef69&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ed8f4750&cb=1678899992433&jobListingId=1008238337974&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj3plp7mbi0801-1grj3jueuhaol800-7481319c84ad205c--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNCl8CSoDqXY5KQuZHvrhnx2KCNLBLFUQJztNpYC0RuVmrq5mj3olZ4GJcVq8be9VivRHhY13n_lhmC6P_mxU0_Tevy-LOriVy46d24C75Rw1Wo3WrcIKgeWa4N5ri-npGu-tdlKWzAHFKfS6bzTLNLENRmXoX0EQ-pOSXtBsaaQn_0U36pUiVMTyEpRKQ2VMHKV_vyHUC3Yv9qY6GWYjtzOkgboizYduVSe-FGnGxoiyGUUmkYyy9GlmGTKeWjsD4r4RlKEHA78iGEmGr_dRxENdl36xt7PY7UOTYyYXHoHrBNH8q4pA-P19V3p3PNhaK1itObJLlrb5jkLWA3Wc26NSksdh_3MnxYAtuznFpdQLsZu9d4SDpAIAOvWAKjIpBvkhGCyZKs5FcCoEsKCG_q2qhQijuLM8WxJ_iakR5wLgU09cUFqUoSX3NoSqhekN2qF27X0fBi0tDj1dUgOqFpXqRYYe_dM14nLGwJAqAC6KTZyhNEagUqG_mtjmyIU9PyGs6romsZSrWRC3RzQD2N64ybqdQWrLTzjqNMxHumDz8wOqxCLwArYbNNGQjrbLTyjOLdX-SgxRjfjlm4DZS-yNBQInREXFGDztjpsVFJ_PVRkJ173lSWi949mMTtBARrvvIb83Ce3RJ2pOzkXAhAA", "description": "Global company is looking for a Frontend Developer to integrate with with the company fronten development efforts. If you have proven experience in leading frontend development in fintech B2C companies, a strong technical understanding, and great task management skills, we are looking for you! As our leading Frontend Developer, you will personally perform and oversee all frontend-related aspects of our website and UI products. What would you do?\n\nDesign and develop new user-facing features. Implement business logic processes. Build new product interfaces. Translate UI/UX design wireframes to actual code.\n\nMaintain a focus on high code standards. Integrate with rest APIs Implement Analytics tools Collaborate with cross-functional squads on achieving business goals Requirements: 3+ years working in front-end web development - must Extensive programming experience in HTML5, CSS3, SASS, LESS, and Bootstrap, Foundation or Materialize Excellent JavaScript knowledge and programming experience with ES5/ES6 Solid understanding and development experience in Angular 8+ Webpack, Angular CLI Experience consuming REST APIs Experience with client-side architecture and design patterns Awareness of cross-browser compatibility issues and client-side performance considerations Solid understanding and extensive experience with version control tools like Git Strong problem-solving and ability to work independently Its nice to have: Experience with NodeJS and Expresses or Nests Experience with mobile app development frameworks like Native Script or React Native Experience developing REST APIsReport"}, {"company": "Hello Heart", "job": "Front End Engineer", "city": "Tel Aviv-Yafo", "date": "27d", "rating": "4.8", "link": "", "description": "About Hello Heart:\n\nHello Heart is the only digital therapeutics company to focus exclusively on heart disease, the leading cause of death for U.S. adults. Through a connected device and mobile app that uses AI, behavioral science, and personalized digital coaching to drive lifestyle changes, Hello Heart empowers people to embrace healthier behavior, which can reduce the risks of high blood pressure and heart disease. It also helps users catch blood pressure readings that are extremely high and encourages them to talk to their doctor to identify potential risk in time. Validated in peer-reviewed studies and trusted by leading Fortune 500 companies, Hello Heart is easy to use and works alongside an employer's benefits ecosystem. Founded in 2013, Hello Heart is a member of the American Heart Association's Innovators' Network and is part of the CVS Health Point Solutions Management program. Hello Heart is backed by leading VCs including Stripes, Khosla Ventures, IVP, Blue Run and Resolute. Visit www.helloheart.com for more information.\nAbout the role:\n\nWe are looking for an intellectually curious Front End Engineer who is passionate about code, high performance and cares about quality. You will work with knowledgeable and experienced developers with a large scale of skills and capabilities who are passionate about developing an innovative product which makes an impact.\n\nThe position includes working closely with the Product, Design and Data Science teams, taking full ownership of your work from conception to post-deployment, while continuously learning and evaluating cutting edge technologies in a fast-paced, collaborative environment.\n\nOur Technologies stack: React Native, Redux, React JS, Scala, Play, Microservices, AWS, Docker, Kubernetes, MongoDB, Redis, Postgres, Spark, Elasticsearch, Kafka, and more.\n\nResponsibility:\n\nDevelop code that is used daily around the world and actually saves lives!\nWork with our data science team on implementing their algorithms into our new and upcoming data driven solutions.\nCollaborate with Product Managers, Experience Designers and Data Engineers on all aspects of product development: strategy, brainstorming, user research, design, execution, AB testing, and iteration.\nTake part in making a major difference in our team and influence our technology stack.\nJoin a great team of people passionate about technology and doing good to the world.\n\nQualifications:\n\n4+ years of professional experience as a front end focused developer but experience with full stack, preferable React Native.\nBS degree in Computer Science or similar, or equivalent practical experience.\nExperience in one of the following: Scala, Java, Ruby, Python, Go.\nExperience with databases Postgres, MongoDB, etc - Advantage.\nFamiliar with cloud-based deployment: AWS, Docker, Serverless, etc - Advantage\n\nHello Heart has a positive, diverse, and supportive culture - we look for people who are collaborative, creative, and courageous. Oh, and if you want to see some recent evidence of the fun things we do at Hello Heart, check out our Instagram page.Show more Report"}, {"company": "SQlink", "job": "Front End Developer לסטארטאפ מדהים", "city": "Israel", "date": "30d+", "rating": "3.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=126&ao=1136043&s=58&guid=00000186e639f99dbf06650e528fef69&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_3aaded13&cb=1678899994833&jobListingId=1008412848723&jrtk=3-1-1grj3po49kf1s801-1grj3jueuhaol800-b8bb9cc15439aa1f-", "description": "תיאור המשרה:\n\n חברת סטארטאפ מבוססת מגייסת Front End Developer.\nהחברה פיתחה מוצר מוביל ומוכר בתחום התיירות.\nהתפקיד כולל הצטרפות לצוות הפיתוח המנוסה של החברה, עמידה בדרישות הר\"צ, פיתוח מורכב וחשיבה מחוץ לקופסא, ועוד.\nהזדמנות מצוינת להצטרף לתפקיד מאתגר ומתגמל!\n\nדרישות המשרה:\nניסיון של שנתיים בעבודה עם React/Vue.js/Angularניסיון עם TypeScriptמיומנוית בעיצוב UI/UX\n\n\nמס' משרה:\n 139541Show more Report"}, {"company": "Payoneer", "job": "Front End Developer", "city": "Petah Tikva", "date": "28d", "rating": "4.1", "link": "", "description": "We’re looking for a team player – collaborates with others, share knowledge via design and code reviews and tech talks.Takes ownership of solutions from design all the way to working in production. Cares about quality.Is this you?What’s the job?Building our main web application and products for millions of consumersImplement features and user interfaces of Payoneer’s consumer world, like viewing your financial activity, withdraw to bank, making inside payments and much more.Design and build efficient, reusable, scalable & testable front-end React features.Collaborate with our amazing Product Designers, Product Managers, and Software Engineers to deliver compelling user-facing products.Building the UI Infrastructure of a comprehensive REACT applicationTraining and mentoring capabilities*Have you done this kind of stuff?5+ years of HTML/CSS experience5+ years of JavaScript experience including asynchronous programming, single page apps, closures, types, and ES6.5+ years of experience using Redux and React (Context, Hooks, Router 5, Styled Components)Server development using NodeJS & WebpackHands on experience with web applications architecturesExcellent communication skills- High level of English is a must.Not a must but a great advantageFamiliarity in server-side technologiesFront End Team Lead: https://grnh.se/8b48004f1usFor more open positions at Payoneer : https://lnkd.in/d5HbQnpJob Type: Full-timeSalary: From 30,000.00₪ per monthAbility to commute/relocate:Petah Tikva, מחוז המרכז: Reliably commute or planning to relocate before starting work (Preferred)Experience:Programming: 4 years (Preferred)Show more Report"}, {"company": "eToro", "job": "Front End Developer", "city": "Bnei Brak", "date": "30d+", "rating": "3.7", "link": "", "description": "eToro is the world’s leading social trading network, providing millions of users from around the world a one-stop-shop solution for their trading, investing and asset management needs. Since 2007, eToro has positioned itself as a Fintech leader. Blockchain and crypto assets are core to eToro's vision and strategy, transferring financial services to the Blockchain.\nBe part of an amazing fast-paced team.\nDevelop and deliver a top-notch user experience.\nTackle technical challenges - performance, fault-tolerance, and live production issues.\nResearch and promote new technologies and tools.\nCreate self-contained, reusable, and testable modules and components.\nRequirements:\n\nProfessional Front-end developer with at least 4 years of experience.\nExpert level knowledge of Angular 8+, JavaScript, HTML, CSS/Less, TypeScript and ES6 - a must.\nExperience with Docker and Kubernetes - a plus. Familiarity with Git - a plus.\nExperience with NgRx- a plus.\nSub Department:\n\nComplianceShow more Report"}, {"company": "אנטריפוינט", "job": "Frontend Developer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=129&ao=1110586&s=58&guid=00000186e639f99dbf06650e528fef69&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_3df7ebfa&cb=1678899998999&jobListingId=1008235581344&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj3ps6ikbm0801-1grj3jueuhaol800-30216bb8049c5ba2--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tGRBbjy15RxGaEEw7KZU_HL-KfBTosWH5iXnbwSyHBqQpTKkksIsQAsiZvAyn6PhL8wyhPiatuEzGkpqrz8XZwJQXgwQ3kc1R0_bwMBeajkDeOxtXHlPPN0fmTilImOM3ZLM3ScEslkT3GK8jnMSemyUxmrDGIPeDrGCmsoo1VvPCUzzBxmpZMTx3ZyCMwddpOmM4FsS9Z6jQc3AcRSx3-6oN75L_Jw3en1NEAHSqNN9Q9NhhHrPYY6YNl2pIm-c0Q9THf4qeNLTj15SlUMtzMYV69949uJmsNWdDgEmOK_u2EXlUOvR1f4oQUSXlerrzYp_Kt2R4YUpW8foScT9g6IjRHvR92YwULOWCqdpaZdNF9nKOoSXjkoDE3tuJIql-aH4_CXgtMmD_jiwgNVGGNu3vYXa7BEYrW7FNeVGRcEMI-QdnS3Y54eX6LgYv3Kl63V8rmntWDRA9ANjny-PtTHQax5PBtfVYkk-tJk8rWfJQ9jI7D4PfyLhoWBV_Z4B6kp-sfiLqa4c2QMJgItbqCgXKmjCzDVoOOk3-pSUZbqZH4YwKq11aROTXCvojNtFIyCv-0k06WgNQzcH0zJJ2D8bcQYT_mkjlwxFQEi2BcWR_1eF3OiPx9-f51RmMJ0KYL_N913WjyYMlS-hWAfbZez8oRNTg_oSwxoWaA8UdNvNd6yIpxMK6f69svpnbAoFtQ%3D%3D", "description": "We’re looking for a highly capable frontend developer to integrate with our frontend development efforts. If you have proven experience in leading frontend development in fintech B2C companies, a strong technical understanding, and great task management skills, we are looking for you! As our leading Frontend Developer, you will personally perform and oversee all frontend-related aspects of our website and UI products. The position is located in Netanya city ; What would you do?\n\n\n; Design and develop new user-facing features. · Implement business logic processes. · Build new product interfaces. · Translate UI/UX design wireframes to actual code.\nMaintain a focus on high code standards. · Integrate with rest API’s · Implement Analytics tools · Collaborate with cross-functional squads on achieving business goals 3+ years working in front-end web development - must BS.c in Computer Science - a must Extensive programming experience in HTML5, CSS3, SASS, LESS, and Bootstrap, Foundation or Materialize Excellent JavaScript knowledge and programming experience with ES5/ES6 Solid understanding and development experience in Angular 8+ Webpack, Angular CLI Experience consuming REST APIs Experience with client-side architecture and design patterns Awareness of cross-browser compatibility issues and client-side performance considerations Solid understanding and extensive experience with version control tools like Git Strong problem-solving and ability to work independently Strong learning skills\n\nShow more Report"}, {"company": "שביט סופטוור", "job": "FullStack Developer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=130&ao=1110586&s=58&guid=00000186e639f99dbf06650e528fef69&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ec52d6c2&cb=1678900000337&jobListingId=1008383052341&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj3ptfojoqt801-1grj3jueuhaol800-57cc194442630bc5--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiND_Paqt2jTrZsg881g-taweJulP_Inlfm3D_hxpOCnHiemUUP8py3kUa-j8-QV6JZxe5gHPXu__-fPivcluCbO78C7U9g6kwgNJv92r57C0OHHoaXTUDqZ24R7CL8-b2YPEIMI_PixgtyEb0REQhOmums3NtDgM-DbiY-Il_Jj9Z1DMYk8rBTurnaAOAqc-WPj4ds2KguDW-vGywPk_9pmRgN5SoWgcUoK3mDLRXk7ic-6F_JS_FoDfVL5kyXiETLnceZSIVJo2eZJR3TNRFsrkKEO0voS98MDC3vMlFfm2a7a1Dw4-fSfcjRV2x6twd4R4AxRcPhlZJ_72v3hqwI65LVQTnouHJy0gGkreNYlCsoV7_6hw7dAKL-uy6R6PqoURefyQLMTdJS-mAdHXS74tgQPyhbSZPl0W4bPOtLOZ6d9-xn5EL_frH7dEVgHvHPhgM7tvpTHbkCQ3jp7C33beAlWbp8oyH4sKg3dQHcUweg6nv_kjqbfwGQy6kct3bq7vtiff9jOq6cbrtd63nYfyeM056l6KFZ8ExKkYRa9YQ0Z7wl1YxecFJ0PEQlAb0ZIwTJfSlRZV3EAB6MxJpz5i7oM87HYGMzEVlH9_EHQWVI_wUfPkS_co5CNKyeWEeYIbua2-M_GAHqL9aE3FZKXyNlOHOdaP8xM%3D", "description": "The ideal candidate will be responsible for developing high-quality applications. They will also be responsible for designing and implementing testable and scalable code. Degree in computer science - advantage Strong organizational and project management skills. Proficiency with fundamental front-end languages such as Angular HTML, CSS, and JavaScript.\n\nProficiency with server-side languages such as Java and .Net. Familiarity with database technology such as MySQL, Oracle, and MongoDB. Excellent verbal communication skills. Good problem-solving skills.\n\nAttention to detail.Show more Report"}]]