[[{"company": "Confidential", "job": "Director of Brand Management", "city": "Tel Aviv-Yafo", "date": "22d", "rating": "", "link": "", "description": "You’ll be managing the dedicated business unit managers with full ownership of P&L, drive the growth of the team and business and be responsible for developing, defining, and overseeing the store managers day to day activity. Main responsibility:Laed brand managers team and work cross functionally with multiple departments on product features and goals.Create and oversee store managers business KPI’s.Working with your brand managers to establish efficient and integrated workflows and working processes: monthly KPIs, inventory planning, strategic development of the brand etc.Inspiring, steering and developing your team a 360° point of view, this includes new product development, new channel launches, content & creative development, performance marketing and supply-chain & logistics optimizationScaling your brand(s) by driving profitable growth and developing expansion strategiesAnalyzing market trends and customer needs and defining product range development and extensionPartnering with internal/external stakeholders to develop a go-to-market strategy and facilitate successful product launches and international expansionAnalyzing PPC and other marketing campaigns; optimizing conversion, click-through-rate and advertising cost of saleEnsure all activities are in compliance with applicable rules, regulations, policies and proceduresAdditional responsibilities as requestedQualifications:5+ years of experience in a highly analytical role where you led a business unit, had P&L responsibility, engaged in strategic decision-making and drove revenue and margin growth (General Manager, Founder, Product Owner)Bachelor’s degree in Business, Marketing, or a related fieldEffective leadership and coaching skillsExcellent communication and relationship skillsDetail-oriented with strong analytical abilitiesExcellent mathematical, writing, verbal and computer skillsAbility to adapt to new tasks with little noticeStrong desire to winDeep understanding of project management and driving growth initiatives across multiple cross-functional teams such as marketing, content, supply chain and technologyDemonstrated ability to problem solve as well as create and execute growth / optimization initiatives through data-driven decision makingPositive energy, collaborative attitude, “no excuses, only solutions” mindset and ability to work comfortably in a diverse and international environmentAdvantage: Exposure to managing a portfolio of products or digital brands, preferably on Amazon or ShopifyJob Type: Full-timeSalary: 12,345.00₪ - 100,000.00₪ per monthAbility to commute/relocate:תל אביב -יפו, מחוז תל אביב: Reliably commute or planning to relocate before starting work (Preferred)Show more Report"}, {"company": "Gimmonix Technologies", "job": "Head of Account Management", "city": "Tel Aviv-Yafo", "date": "27d", "rating": "", "link": "", "description": "Job DescriptionOur Growth team at Gimmonix takes our business and products across the world. The team delivers significant revenue making a direct and meaningful impact to Gimmonix’s bottom-line and customers. The Head of Account Management is responsible for leading the Account Managers and team, who nurture existing clients by attending their requests and proactively upselling and cross selling our Solutions.Your roleYou'll have global scope and will work closely with clients technology and product management teams to develop a coherent strategy that is aligned with our brand and clients ’ objectives.You will be the voice of the customer, advocating for clients' needs. leading clients growth within our Solutions, defining and establishing the methodology of account management lifecycle.Looking for someone who’s demonstrated: strong data-driven business decisions, great team leadership and tried ability to deliver results under strict timelines. Your initiatives will expand the breadth of business, identify and develop business opportunities; lead collaboration with partners; spearhead internal cross-functional project development; and deliver on financial goals.ResponsibilitiesLeading and nurshiring new opportunities with existing clientele base, and managing Account Management team in a variety of areas such as client satisfaction, client retention and churn prevention,, account management, leading enterprise client projectsEvaluate opportunities, prioritize initiatives that encourage and lead to client usage growth of our Solutions Develop a plan for improving customer experience and drive initiatives with clients to increase business; take care of all solutions within the company to increase the connections between our network of clients.Identify potential improvements in the solutions that will lead to a higher conversion rate.Empower your team to incubate benefits that increase customer demand, are exciting for their customersDefine team and individual KPIs in the line with targetsUse data to identify, evaluate, and manage strategic business opportunities with significant potential incremental revenueOngoing communication of business performance and team progress on initiativesCo-develop a strategy with each supplier and stay aligned on goals, initiatives and targets to strengthen our external relationshipsCollaborate closely with product management, Customer support, Business Development and marketing teams .Lead deal development including prospecting, negotiating, and project development with current clients.Skills and Qualifications5-7 Years of Sales/Account Management experience in the travel industry with at least 2 years leading a team.Experience building a business from scratchExperience with travel technologyNative or close-to-native Hebrew and fluent English knowledge on a business levelExperience in an analytical role in an ecommerce, technology company, consulting, or product management preferredExtensive experience in identifying and prioritizing high-impact improvement opportunitiesExcellent communication, influencing and relationship building skillsDemonstrated ability to work through complex business problems and partner with internal clients with a consultative approach.Strong analytical/modeling skills with ability to convert raw data into actionable business insightsExcellent verbal, written and data visualization skills are a must-have.Ability to communicate in a clear and effective mannerAbility to prioritize among conflicting demands in a fluid environmentAbility to commute/relocate:Tel Aviv-Jaffa, מחוז תל אביב: Reliably commute or planning to relocate before starting work (Required)Show more Report"}, {"company": "Tailor Brands", "job": "Junior Product Marketing Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.4", "link": "", "description": "About Us\nWith over 30 Million users on our platform, we’re here to change the future of business. Our all-in-one platform makes starting a business affordable and accessible to everyone – we welcome more than 800k new business owners every month. From our products to our careers, there are endless opportunities for growth.\nOur team | Our core | Our dream fulfillers\nWhen we started Tailor Brands, we wanted to help people to accelerate their growth and fulfill their dreams. This also defines us internally; we put our focus on maximizing individual impact and creating an environment of absolute transparency.\nAbout the role\nAs a Junior Product Marketing Manager, you’ll be managing Tailor Brand’s email funnels, automation, pop-ups, and user journeys: from ideation, through configuration to analysis & optimization.\nYou’ll be Tailor Brand’s go-to person with everything related to email automation - collaborating with content, paid acquisition and product, orchestrating Tailor Brands’s automated communications aligned with business and brand goals.\nWe’re looking for an individual who’s a self-starter — someone who knows how to get things done but always seeks ways to innovate and test new ideas.\nManage email automation and email funnels, including content messaging strategy\nMonitor email performance, deliverability, analyze results, and enhance campaigns accordingly. Refine email marketing strategy to increase engagement, retention, and conversions\nManagement of triggered email campaigns throughout the customer lifecycle to maximize business KPIs\nInitiating, conducting and measuring A/B tests in emails\nPrioritize and manage multiple projects at once with exceptional attention to detail\nDrive competitive analysis and market research\nProvision of creative briefs for content & design teams to create assets for emails\nWork closely with Product Managers, Designers, Developers, and CS teams\nRequirements:\n\nPassion and knowledge about the Product Marketing field, especially Email Marketing experience, managing large scale global email campaigns\nAn analytical B.A./B.Sc. from a leading academic institution\nStrong analytical and project management skills\nTime management and attention to details\nExcellent interpersonal, communication and cross-group skills\nA passion for innovating and bringing new ideas to the table, and turning your approved ideas into actionable projects while seeing them through from start to finish\nFluency in spoken/written English\nNice-to-haves\nKnowledge & experience in HTML & CSS\nProven experience in the SaaS industry\nWe are located in Tel Aviv but Hybrid mode is on!\nOur team is currently working in hybrid mode. Those who prefer to work in our office can do so in a safe environment.Show more Report"}, {"company": "SysAid Technologies", "job": "Product Marketing Manager", "city": "Lod", "date": "29d", "rating": "3.9", "link": "", "description": "SysAid is a service automation company delivering software for organizations that want to get more done. Our SaaS ITSM (IT Service Management) and Asset Management solutions serve more than 5000 customers across the globe. We do the heavy lifting for IT and anyone delivering services in the digital workspace by leveraging automation, analytics, and AI.We are looking for a PMM, a strong candidate who is a product-oriented individual with extensive experience creating and executing marketing strategies and campaigns that increase product awareness and adoption.In this role, you’ll be able to partner with product management teams, develop and launch new products, drive measurable business results by crafting and executing the go-to-market plans, and sales and marketing materials, and will be ready to step into a key- role at a fast-growing and dynamic tech companyWhat you’ll do:* Be an expert in SysAid products and our market. Understand our customers’ interests and needsDevelop product marketing strategies including product launches, GTM, and targeted campaignsAnalyze personas to map out our customers’ needs and translate SysAid product capabilities into value propositionsEducate both internal and external stakeholders on our product features and their benefits.Work closely with sales and product teams to develop key messaging, value propositions and key differentiatorsCreate sales collateral and tools that align with the buying process and help move prospects & customers through the sales cycleCreate marketing materials (e.g. sales documentation, product videos, website copy, blog posts, ) that articulate the benefits of our productsAssist sales on calls when appropriate to provide deeper dives into the product.Speak and present both internally and externally to promote the story of our product.Conduct market analysis to obtain an understanding of the competitive landscape and help establish product differentiatorsRequirements:What we’re looking for:* 3+ years in a product marketing position for an enterprise software companyExperience marketing to IT and IT Service Management is a significant plusFamiliar with product marketing tactics (e.g. integrated marketing campaigns)Excellent communication and writing skills (in English) and an ability to sell ideas through professional presentationsAbility to create, update, and maintain various sales collateral and marketing materialsProven track record of executing successful product launchesExceptional project management skillsExperience in market and competitive analysisAnalytical mind and strong quantitative skillsPrefer working in a collaborative, cross-team capacityJob Type: Full-timeShow more Report"}, {"company": "Check Point Software Technologies Ltd.", "job": "Technical Product Marketing", "city": "Tel Aviv-Yafo", "date": "1 day ago", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=1136043&s=58&guid=00000186e6357e808825b08639dff975&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e7402776&cb=1678899688255&jobListingId=1008526320149&jrtk=3-1-1grj3gcn3kclj801-1grj3avmhi9he800-0555af49719a1f53-", "description": "Your Team\n\nCheck Point Product Marketing is looking for a top-notch Technical Marketing Engineer to expand the team. The Technical Marketing Organization works alongside Product Marketing and plays a key role in providing the technical aspects of every marketing campaign to our partners, customers, and SEs. This means setting the technical direction, validating campaign assets that are being developed, and establishing product demo environments.\n\nIn this role, you will work with best-in-class cybersecurity technologies and become the global subject matter expert for our Quantum Network Security and Threat Prevention related products. You will be setting up the relevant solutions in a lab environment, working closely with Development Heads, PM, PMM and SEs to properly document technical concepts and real-world use cases and to educate our employees and customer base.\nYour Impact & Responsibilities\nBuild out and manage lab environments to replicate customer environments.\nDevelop technical content including videos, blogs, white papers, datasheets and webinars.\nWork closely with Product Management on product feedback for future improvements.\nEvangelize our solutions portfolio to our customers through events, workshops, webinars and other external communications channels.\nDevelop thought-leadership materials designed to accelerate our business momentum and better engage customers.\nYour Knowledge & Skills\n2-5 years of recent and progressive Technical Marketing Engineering/Technical Product Marketing.\nExcellent English\nHands-on experience in setting up lab environments and building demo environments\ndelivering high-quality technical marketing collaterals with a creative flair to bring fresh ideas into marketing campaigns.\nStrong writing skills are essential - must be able to create a wide range of marketing content such as presentations, white papers, datasheets, solutions briefs, etc…\nExceptional communication and strong public speaking and presentation skills.\nAbility to communicate effectively to both technical and business-level audiences in a compelling and differentiating manner.\nComfortable operating in an ambiguous, fast-paced, complex environment with an ability to manage multiple projects simultaneously.\nProfound understanding of Check Point Products, broadly – an advantage\nBackground with cyber/network/cloud technologies – being Tech savvy – an advantageShow more Report"}, {"company": "Nexar", "job": "Technical Product Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": "Nexar is building the first over-the-top vehicle-to-vehicle network on the planet, to predict and prevent collisions. We use AI, machine vision, sensor fusion, real-time networking, and quite a few other buzzwords, to create a new, delightful, and really safe, driving experience, powered by your smartphone, with the potential of saving the 1,300,000 people who die on the road every year.On the way, we capture and understand driving the world’s roads probably better than anyone else, with drivers from dozens of countries using Nexar for their commute or as part of their job. Nexar offers its business partners data applications providing insights from the road by leveraging the knowledge extracted by performing deep analytics through deep learning at an extremely large scale (with billions of images captured per week). Nexar’s network provides crowd-sourced intelligence of how the road the world around the road looks like and how it’s changing day to day.We are looking for a talented, experienced Technical Product Manager to own and lead the full lifecycle of data applications, and the underlying data platform that powers these data applications for our automotive OEM partners.In this role, you will partner closely with engineers, designers, business leaders and our customers - to execute and deliver on Nexar’s product strategy, through entrepreneurial thinking, professionalism, teamwork, constant learning, and an appetite for success.ResponsibilitiesTechnical Product Management - Ideating, launching and iterating on Nexar’s data applications and data platform.Customer Development - Collecting, managing and responding to feedback; participating in discussions in key customer accounts; working closely with the sales and marketing teams to better understand applicability.Customer Research - Participating/guiding customer research on new areas of exploration; collecting data about our competitor’s capabilities; developing an informed point of view in regards to technology trends.Product Definition - Working very closely with engineering, research and testing teams in order to document user stories and precisely define capabilities; prioritising stories and maintaining a roadmap.Experimentation - Developing, testing and measuring hypotheses.Process Improvement - Actively implementing new ways to improve the products and processes at our growing companyRequirementsProven technical product management experience in a related B2B field, either enterprise software, packaged software, SaaS or on-demand.Track record of ownership and results, from inception to ongoing research and support, including roadmap prioritisation and delivery.Analytical understanding of business considerations and competitive landscape.Deep understanding of the technical trade-offs, architecture and unit economics of complex products and platforms, especially at a very large scale of data processing (comfortable thinking in Petabytes).Experience defining effective technical capabilities into products or solutions to address customer needs.Experience developing human-facing B2B products in areas of mobility, automotive, and mapping.Experience creating and maintaining a developer program and a family of APIs.A creative, flexible thinker - with a sense of structure. Comfortable with being out of your comfort zone.Ideally with a degree in computer science, electrical engineering or a related field.Curious. Energetic. Excellent communicator. Opinionated. Never violent.Things move fast and change fast. Keep up.Job Type: Full-timeSalary: Up to 45,000.00₪ per monthShow more Report"}, {"company": "Fiverr", "job": "Associate Product Marketing Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "", "description": "Fiverr is looking for an Associate Product Marketing Manager to join our Growth Team.\nWe're looking for someone who can plan, develop and implement marketing and user experience initiatives, aimed to create better experiences in order to increase retention and conversion rates, and influence uplifts in customer value and engagement.\nThe Associate Product Marketing Manager will be responsible for various plans and activities, from ideation through execution to post analysis, utilizing the available channels and initiating new ones, and monitoring and optimizing our customer performance.\nWe are looking for a motivated, innovative, and results-driven person, with a passion for marketing, user experience, and optimization.\nOur work model is hybrid, combining remote and on-site work. This allows us to get things done when and where we are most productive.\nRequirements:\n\n1 year of experience as a Product Marketing Manager - a must\nFamiliar with creating GTM strategies for new products and features and experienced in the execution of relevant marketing campaigns and activities.\nStrong analytical skills, highly capable of interpreting data, performing qualitative research, and translating results into actionable key takeaways\nFamiliarity with data system concepts, databases, BI, Usability tests and market research.\nExperience in working with multiple internal partners, including product, design, content, customer success, and support.\nExcellent written and verbal communication skills\nEnglish – Advanced, proficient at a high level\nAt Fiverr, we’re not about checklists. If you don’t meet 100% of the requirements for this role but still feel passionate about the position and think you have the right skills and qualifications to excel at it, we want to hear from you.\nWhat am I going to do?:\n\nBe the voice of (existing and potential) customers; aggregate and synthesize feedback and product ideas from user research, market insights, and extensive product understanding, to assess business impact and influence product development.\nCollaborate with product managers and cross-company partners to develop and launch successful products.\nBe responsible for the product’s GTM plans and implementations; manage all aspects of product launches such as messaging, internal communication, collateral, and rollout strategy.\nCollaborate in coordination of testing of new features and products for relevant target audiences. Track product launches and measure their success.\nOrganize and deliver relevant training to ensure internal teams are effectively educated, aligned, and informed on the product perspective messaging.\nEqual opportunities:\n\nAt Fiverr, we prioritize diversity. We celebrate difference and embed it into every aspect of our workplace and product, as well as our community. Fiverr is proud and committed to providing equal opportunity employment to all individuals regardless of race, color, religion, sex, sexual orientation, citizenship, national origin, disability, Veteran status, or any other characteristic protected by law. In addition, Fiverr will provide accommodation to individuals with disabilities or a special need.Show more Report"}, {"company": "DoorLoop", "job": "Senior Data Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=108&ao=1110586&s=58&guid=00000186e6357e808825b08639dff975&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b48f883b&cb=1678899692667&jobListingId=1008440987692&cpc=BA15C3E50D27FFE8&jrtk=3-1-1grj3gh10jc8t801-1grj3avmhi9he800-54ca41fb4a28cc75--6NYlbfkN0Bg8kaLZpGmonnt516iCDBz1BXXYWwUs3o81vaiU99V9TLG472jvwa0fELsyMFCbJIwFfNgDGDlDNBAZocAjRsGInWfsqI9DliyMkOIGBt6VFBNKJzzVXp24PE5wDbwrWxBpc4fD0-ClI7yXJVx1azSBMNPQwI6rbbkQ0RxWJ8tAPxpRQmsfPPhcGDSxMc-9L4uHDI3XM0uqLEohvSoMHK7WDw-uTvxwDo3QyFMwiCYAEzXPZCzNXDp3CC2ch5uQR_LHBv8KFrhKhDH8Xs_41J3j1-Q-65F0DMO-moEHwu1vXQQQlOpu6XWuY0WH40LhcXzwtoP34-ZnyOVoA4nulVT195m74oVM_4lEOmBWnl37O_P9vPbeIEN59EhsLI6ipHlUb-hgI_DQkaRzZAtVV3tlENQI84R-O_CUpdyM-YclHu_gWRiCaQ29N21sVKb-C5AB9gYqXuie9NIYvZfTiNrC0NFYX0dnSnwlm43vxfqe2asjmFv-09JaFfI6eo8GwELgszoHDffILcz2eczrRxI0dBOchrjbRynGlwdKiZHAQsveb4dLpJ-zxCCItybKg2vBgsfBYZi3wn_A7R_6xkGL83O9OoTPaM-l0v_al2FkA%3D%3D", "description": "About DoorLoopCertified as a Great Place to Work®, DoorLoop is a property management software used by landlords and property managers in over 100 countries.As a software company with $30M in funding, 3 offices worldwide (Miami, London, Israel), and tens of thousands of units being managed, we are one of the fastest growing tech companies.If you want to work with a team that values transparency, feedback, and growth, DoorLoop is for you.The RoleWe are looking for a super talented Senior Data Analyst to join our team in Tel-Aviv. If you are excited about what you are about to read, we invite you to apply!We are looking for someone who has a good understanding of relational databases, hands-on experience in SQL and/or Python, and data visualization tools such as Tableau and Power BI. You will be working closely with the product, marketing, customer success, and engineering teams, to improve conversions, LTV, churn, product A/B tests, and more. You will collect and analyze the data and help answer the toughest issues each team is facing in order to drive insights..Some additional qualities about you and this role:You will identify, analyze, and interpret trends or patterns in complex data sets to drive actionable insights.You will define and implement KPIs across different teams: product, business, marketing, and customer success.You will implement product features, measure their performance, and provide recommendations.Gain a deeper understanding of how customers use our product, and advise us on how to improve.You will translate product/business requirements, and create a clear visualization which \"tells the story\" using a BI tool or other platformQualifications & Requirements4+ years of experience as a Data/Business Analyst.B.S in one of the following: Industrial Engineering, Statistics, Mathematics, Economics, or a related field.An ability to understand complex business models and simplifyExperience in product analysis including working with BI events and performing A/B tests.High level of SQL is a must.Experience in BI visualization tools such as Tableau, Amplitude, or similar and performing A/B tests.Experience in data modeling, ETL development, and data warehousingTeam player, effective interpersonal skills, and good vibes. Ability to manage relationships with key partners and the ability to work independently.Experience in a fast-paced, dynamic work environment.Bonus PointsExperience in Python is a plus, but not a must.Experience working with Salesforce is a plus, but not a must.Benefits & PerksUnlimited paid time off with unlimited personal, vacation, and sick days.Annual company retreat in the US with our Miami team (all expenses paid).Career development with unlimited access to Udemy's courses and other growth opportunities.Monthly investment classes from our co-founders on how to invest your money in a diversified portfolio of real estate, stocks, crypto, NFT, & more.No micromanagement - We believe responsible people thrive on freedom.Great equipment - Ergonomic chairs, Mac or PC laptops, dual monitors, standup desks, and more.No rules - No dress code, policies, or handbooks. Just do great work & have fun!Job Type: Full-timeAbility to commute/relocate:תל אביב -יפו, מחוז תל אביב: Reliably commute or planning to relocate before starting work (Required)Show more Report"}, {"company": "Quantum Machines", "job": "Product Marketing - Student (Master physics)", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.6", "link": "", "description": "Quantum Machines is the global leader in control systems for quantum computing, providing the hardware and software tools researchers and businesses need in order to build quantum computers from the ground up. We are pushing the envelope in a field on the verge of exponential growth, bringing about opportunities like those made possible with the invention of classical computing 50 years ago.\nWe are assembling the strongest team of professionals in the world with the goal of revolutionizing how quantum computers are built and controlled, while accelerating their arrival. Come join a multi-disciplinary world-class team and work on a new class of problems at the cutting-edge of technology, science, and business.\nQuantum Machines is backed by top tier investors such as Battery Ventures, Red Dot Capital Partners, TLV Partners, and Avigdor Willenz’ investment group.\nWe are looking for one physics student (BSc or MSc) with a passion for communication and for writing technical-marketing content. The ideal candidates have taken quantum mechanics courses and are eager to learn about the challenges of the scientific and industrial community around quantum computing and control. You will be guided in learning about the key players of today’s quantum ecosystem and keeping up to date with research and industry efforts.\nResponsibilities:\nDevelop a deep understanding of the technology, ecosystem, customer challenges and industry trends, in order to create related content such as social media posts, white papers, web pages, brochures, presentation and more\nCreate sales tools as product brochures, case studies, product videos and product presentations\nProduce and review technical notes and product marketing material for QM - a thriving international quantum control company.\nWork closely with internal peers such as Product, R&D and CTO Teams to summarize into text that convey our value to customers in the best way.\nRequirements:\nBasic quantum mechanics university course (must)\nExcellent writing skills (must)\nAble to study independently and eager to learn\nAdvanced or technology-oriented quantum mechanics courses (plus)\nFluent in English (spoken and written) – Danish NOT required (plus)\nSome experience with scientific and technical writing (plus)\nExpecting 40%-60% as a part-time positionReport"}, {"company": "SMSEdge", "job": "Junior customer success manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=110&ao=1136043&s=58&guid=00000186e6357e808825b08639dff975&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_08c5dc94&cb=1678899695559&jobListingId=1007230867782&jrtk=3-1-1grj3gjrrkltk801-1grj3avmhi9he800-a8ad1dbe770d66ea-", "description": "Job Description\nDay-to-day responsibilities include:\nCommunicating with new and existing clients, understanding their needs and onboarding them.\nWorking with telecom companies to improve and add delivery channels.\nConnecting and negotiating with communication providers.\nReviewing and understanding key performance statistics, ultimately deriving conclusions and recommendations based on campaign performance.\nEnsuring customers see maximum success with their sms marketing campaigns.\nRequirements:\nEnergetic, with a can do attitude.\nCommunicative and a team player.\nAnalytical with ability to interpret data and analytics into meaningful insights.\nCreative, self-starter, who can multitask while working under pressure.\nEnglish - High Proficiency - MUST\nSend CV to: jobs@smsedge.io\nProduct Information\nPresentation - smsedge.com/presentation\nVideo - smsedge.com/video\n\nApply via email at: jobs@smsedge.comShow more Report"}, {"company": "Fiverr", "job": "Product Marketing Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "", "description": "Fiverr is looking for a Product Marketing Manager to join our Growth Team.\nWe're looking for someone who can plan, develop and implement marketing and user experience initiatives, aimed to create better experiences in order to increase retention and conversion rates, and influence uplifts in customer value and engagement.\nThe Product Marketing Manager will be responsible for various plans and activities, from ideation through execution to post analysis, utilizing the available channels and initiating new ones, and monitoring and optimizing our customer performance.\nWe are looking for a motivated, innovative, and results-driven person, with a passion for marketing, user experience, and optimization.\n﻿Our work model is hybrid, combining remote and on-site work. This allows us to get things done when and where we are most productive.\nRequirements:\n\n3+ years of experience as a Product Marketing Manager\nExperience in creating GTM strategies for new products and features and execution of relevant marketing campaigns and activities.\nStrong analytical skills, highly capable of interpreting data, performing qualitative research, and translating results into actionable key takeaways\nFamiliarity with data system concepts, databases, BI, Usability tests and market research.\nExperience in working with multiple internal partners, including product, design, content, customer success, and support.\nExcellent written and verbal communication skills\nEnglish – Advanced, proficient at a high level\nAt Fiverr, we’re not about checklists. If you don’t meet 100% of the requirements for this role but still feel passionate about the position and think you have the right skills and qualifications to excel at it, we want to hear from you.\nWhat am I going to do?:\n\nBe the voice of (existing and potential) customers; aggregate and synthesize feedback and product ideas from user research, market insights, and extensive product understanding, to assess business impact and influence product development.\nCollaborate with product managers and cross-company partners to develop and launch successful products.\nBe responsible for product’s GTM plans; manage all aspects of product launches such as messaging, internal communication, collateral, and rollout strategy.\nCoordinate testing of new features and products for relevant target audiences. Track product launches and measure their success.\nOrganize and deliver relevant training to ensure internal teams are effectively educated, aligned, and informed on the product perspective messaging.\nEqual opportunities:\n\nAt Fiverr, we prioritize diversity. We celebrate difference and embed it into every aspect of our workplace and product, as well as our community. Fiverr is proud and committed to providing equal opportunity employment to all individuals regardless of race, color, religion, sex, sexual orientation, citizenship, national origin, disability, Veteran status, or any other characteristic protected by law. In addition, Fiverr will provide accommodation to individuals with disabilities or a special need.Show more Report"}, {"company": "Seeking Alpha", "job": "Junior Partnerships Specialist", "city": "Raanana", "date": "13d", "rating": "4.4", "link": "", "description": "Seeking Alpha helps over 200K users to invest better and meet their financial goals faster. Our product is always evolving, so we are looking for a junior-level partnership manager to help us scale our affiliate and influencer programs, showcase our product, drive subscribers, and strengthen our brand.\nAs Seeking Alpha’s Partnerships Manager, you will be responsible for creating, growing, and managing our partnerships’ programs from the ground up, and updating the stakeholders regularly. You will report to the partnerships’ team leader.\nWhy we’re a great company to work for?\nSeeking Alpha is a company on the verge of Hyper-Growth, and it is exactly the right time to get on this spaceship before it leaves the atmosphere.\nWe have an awesome product. Our cutting-edge investing tools are helping 200,000 paying subscribers exceed their financial goals.\nWe care about work-life balance: We work primarily from home, provide lots of perks, and insist that you enjoy them.\nWe invest in people. We consider each employee a long-term investment, and we see value in continuously nurturing and training our teammates.\nRequirements:\n\nExcellent verbal and written communication skills in English\nStrong recruitment and negotiation skills\nSocial media knowledge- An advantage\nA hard worker and eager to learn\nStrong analytical skills\nLocation - You can be located anywhere in Israel to succeed in this position – our HQ is in Raanana, but we work most of the time remotely, and always will.\nResponsibilities:\n\nBuild the partnerships program with research, reaching out, closing deals, and monitoring partners’ activity. You will regularly analyze performance, identify areas of improvement, and recommend ways to increase partnerships-generated revenues.\nAmong other responsibilities, you will:\n﻿Initiate primary reach out with financial publishers, comparison engine partners, and influencers\nBuild the relationship, and function as the main POC for our partners\nCommunicate and monitor brand guidelines in various channels\nProactively monitor traffic sources on all campaigns in order to acquire the target ROI for all marketing campaigns\nSet and manage monthly, quarterly and annual goals for revenue growthShow more Report"}, {"company": "Plarium", "job": "Junior Survey Researcher", "city": "Herzliya", "date": "16d", "rating": "4.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=1136043&s=58&guid=00000186e6357e808825b08639dff975&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e9249376&cb=1678899699285&jobListingId=1008493539271&jrtk=3-1-1grj3gng8k615801-1grj3avmhi9he800-d2410d82e3b060b0-", "description": "About the department\nAbout Research department-The research department is responsible for the\n\nanalysis of players research, competitive offering\n\nand market trends.\nResponsibilities\nAs a Junior Survey Analyst, the new team member will perform\ncustomer research, based on questionnaires for product and marketing departments.\nThe researcher will present the findings to the internal\ncustomer and deliver a structured report.\nWhat we expectQuestionnaire writing experience -Must!!!Perform statistical analysis of surveys.Qualitative research as well; playtests, interviews,\ndiaries, etc.\nPresenting reports to all levels of managementWork with a wide range of internal clients\nDesiredAdvantage – Experience in Gaming companiesExperience with data analysis: Excel, SPSS, R,\nPython\nExperience with Power PointAdvantage: Background in academic research\nWhat we offer our Employees\nYour wellbeing: Flexible, hybrid work experience with talented professionals. Also, high work life balance derived from our people-oriented approach\nYour health: top notch health insurance to employees and immediate family. Furthermore, gym membership or a variety or workout options\nYour future: personal and professional tools to assist with your development and journey\nYour contribution: A variety of social and charitable initiatives, that we take pride in\nYour home away from home: A newly renovated office that includes breakfast every morning, a barista to give you your coffee during your workday, an in house gym and workout studio to balance all the delicious food and if you are a musician a fully equipped music room to play around in\nAnd an opportunity to work with the best of the best locally and globally in the gaming fieldShow more Report"}, {"company": "Kramer", "job": "Product Manager", "city": "Central", "date": "10d", "rating": "5.0", "link": "", "description": "Who are we?\nKramer is a leading player and pioneer in the Pro AV industry.\nKramer audio visual experiences power creativity, collaboration, and engagement. From AVSM to advanced cloud-based communication, collaboration and control solutions, Kramer creates audio visual experiences that are more engaging, more inclusive and more connected than ever before.\nAbout the role\nWe are looking for top talent expert, passionate and motivated Product Manager to join our team and deliver seamless technology experiences in a hybrid, always-on world and will influence and contribute to the growing Kramer PRO AV market and will be responsible for:\nManage one of the company’s core product lines\nBe the owner during the entire Product Life Cycle and related processes\nDefine the product line strategy & roadmap and its execution\nSecure product investment by building compelling business cases for innovative products\nHave full market knowledge on technology trends & competitors’ offerings\nDefine the customer value and differentiation\nInteract with the company’s customers and partners to define product requirements and plans\nPrepare relevant product documents and collateral, such as: Initiatives, Epics, product description and presentations\nOrchestrate R&D and sales teams in a high-technological and dynamic environment\nDefine the product line positioning and marketing messages\nDefine and manage the correct product readiness plan to ensure that the business is ready to sell, deliver and support the product\nRequirements:\nMinimum of 5 years of experience as a Product Manager in Software Products company\nBachelor’s degree in a relevant technology-related or equivalent experience\nMBA – an advantage\nDemonstrated success defining and launching excellent products\nProven experience working with customers and partners\nHas the drive to push products to new highs\nExcellent communication, presentation and teamwork skills\nProven ability to influence cross-functional teams without formal authority\nCan prioritize and make decisions in a changing agile environment\nBe fully proficient in English\nMust be able to travel 30% of the time\nit4ErDqgcYShow more Report"}, {"company": "Imagen", "job": "Marketing Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": "Imagen is developing a disruptive technology for the professional photo editing market. We use edited photos from each of our users, to create personalized AI profiles and to reduce and eliminate editing efforts. Creating a personalized profile based on user data gives great value to our users and creates many challenges.With a very strong market validation, a crazy month-over-month growth, and a top-tier VC backing us, we’re looking for the first team members to join our team. It’s an opportunity to be part of something huge and be a leader in a fast-growing company.What will you do:Lead the marketing data activities in the companyAnalysis and decision-making based on data insightsVisualize data with dashboards to address key questions for the company’s in-house teams like Marketing, Growth, Product, and moreDesign and execute BI ETL flowsRequirements:BA / BSc in Industrial Engineering and Management / Information Systems / Engineering / Economics / Statistics / Mathematics / similar background.3+ years of experience as a Data Analyst / BI Analyst / similar positions2+ years of experience with B2C data-driven productsStrong SQL experience querying large, complex data setsExperience in building BI visualizations and dashboards (Tableau – an advantage)Knowledge of Python for data prep and analysis – an advantageJob Type: Full-timeShow more Report"}, {"company": "lusha", "job": "Product Marketing Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=1136043&s=58&guid=00000186e6357e808825b08639dff975&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0062a403&cb=1678899703063&jobListingId=1008326149153&jrtk=3-1-1grj3gr4vkblj801-1grj3avmhi9he800-f724f4664fd772b9-", "description": "Description\nLusha is growing and we are searching for an experienced Product Marketing Manager to join our team!\nIf you are a skilled marketing professional who is motivated by customer insights, excited about product launches, passionate about the user journey, and thrives in a cross-functional, fast-paced environment - read on!\nAs a PMM, you will focus on launching new products and features, and develop product positioning and messaging that hits every stage of the funnel.\nYou will:\nTell stories about how our products work and drive value for our users and customers.\nCreate sales enablement collateral and content that helps onboard & guide our users.\nDevelop go-to-market strategy plans and execute launches across web, social, email, ads etc.\nOwn the lifecycle from awareness to advocacy to develop messaging that helps differentiate Lusha.\nManage and prioritize a workload of multiple projects with a variety of stakeholders.\nYou are:\nA storyteller. You have deep empathy for users and are able to adapt how you communicate to best engage your audience. You have excellent verbal and written communication skills.\nData-oriented. You like working with data and insights and pair that with your passion for users to generate balanced and thoughtful points of view for how to take our products to market.\nOrganized. You are able to manage highly interdependent, multifaceted projects and keep various work streams on track - even those with many moving parts.\nA self-starter. You know how to identify opportunities and take initiative.\nPassionate about technology. You are keen to learn about how things work and are able to explain technical concepts in ways that everyday people can understand.\nAmbitious. You are eager to make an impact. You thrive in a fast-moving, dynamic, growth environment and are able to operate at the strategic level and the micro-detail to get things right.\nA team player. You will collaborate across the Marketing team and with every team at Lusha. You are able to work with a range of disciplines to execute your work.\n4+ years of relevant work experience in marketing, product marketing, product management, or strategy.\nAt least 2 years of product marketing or go-to-market.\nB2B tech experience.\nMajor plus: experience with PLG companies that have a high-touch enterprise component.\nWhy Lusha?\nLusha connects you to your most relevant potential customers by creating simple, self-served products that provide access to meaningful and insightful B2B data. We offer ways to leverage data as an enabler for better, smarter, and faster conversions at every stage of the customer lifecycle. Lusha was named Top 100 G2 Best Software Company and Top 100 Fastest-Growing product in 2020. Based in the center of Tel Aviv, Lusha is a fast-growing startup that offers its 300+ employees the opportunity to take an active role in shaping the future of the company. While all of us are dedicated to that mission, we surely know how to have a good time.Show more Report"}, {"company": "Kramer", "job": "Product Line Manager (PLM)", "city": "Central", "date": "7d", "rating": "5.0", "link": "", "description": "Who are we?\nWe are audio-visual experts from around the world designing the future of engagement technology.\nOur audio-visual experiences power creativity, collaboration, and engagement. From signal management to advanced cloud-based communication, collaboration and control solutions, Kramer technology breaks down walls, bridges gaps, and makes people feel closer together even when they're far apart.\nWe believe that technology can amplify the human experience and help people reach their potential. Our vision for the future calls for fantastic thinkers and doers, from all corners of the world and all walks of life. We trust each other. We empower each other. We speak from the heart, and we always go the extra mile for our colleagues and customers.\nAbout the role\nWe are looking for Product Line Manager (PLM) to lead Kramer’s portfolio of Audio-Visual products.\nPassionate and self-motivated product leader with 5-8 years of experience in similar position.\nHighly innovated with substantial technical relevant knowledge, i.e., in Video distribution, Control, Networking, Audio, etc.\nCapable to define a winning product & strategy and to engage and collaborate with all departments (R&D, sales and Marketing WW)\nRequirements\nB.Sc. In EE/Computer Engineering\nMBA is an advantage.\nProven experience of defining new products in ProAV market with focus on HW - is big advantage.\nAutodidact and highly motivated person\nTeam player\nExceptional communication skills in English\nn1we74D6RfShow more Report"}, {"company": "Arbox", "job": "Product Marketing Manager", "city": "Bnei Brak", "date": "13d", "rating": "", "link": "", "description": "We are looking for an experienced Product Marketing Manager to join our growing Marketing team. As a PMM, you will be the link between Product, Marketing & Sales, responsible to develop product positioning and messaging informed by user research, market insights, and product understanding.\nA key part of your role will be to become an expert on Arbox’s customer pain points, requirements, and journey, plan go-to-market strategies, and ensure that we effectively communicate the value of our product.\nCome join our amazing marketing team and be part of our journey\n\nRequirements:\n\nYou are a self-starter, independent, and ambitious. Excited about pushing new initiates and managing ongoing projects, from a-z.\nYou are a team player with a can-do attitude and exceptional communication skills who can exchange feedback constructively, and who is comfortable working on new, changing, and fast-paced projects.\nYou are quick to adapt to new workflows and are not afraid of a challenge.\nYou know how to create and tell a compelling story while distilling complex concepts into clear, concise language and business value.\nA professional-level English speaker and professional writer who is passionate about quality marketing content, you are a critical thinker with an eye for detail.\nYou are curious and eager to learn new tools and technologies, and you keep up with the latest trends in the marketing world.\nAnalytical thinker with a passion for numbers, reports, analysis, and A/B testing.\nComfortable managing multiple projects simultaneously and working with others to meet deadlines, ensure quality and accuracy, and track results.\nMust-Have Experience\n1-2 years working in product marketing positions.\nExperience in Google Analytics, Google Tag Manager, Google Optimize or other A/B testing tools - advantage.\nUnderstands marketing metrics and KPIs and how to assess them.\nExperience in SaaS environments. - advantage.\nFluent English speaker.\nBring your Spark :)\nAbout Us:\n\nOur mission is to help small to medium owners transform from industry experts to business experts. Using Arbox allows our customers to simultaneously grow their businesses while focusing on doing what they do best – building their community and making their clients feel happy and fulfilled.\nDreaming big from the get-go, our SaaS product has been a game-changer for our hyper-growing worldwide client base with millions of end-users.\nArbox has an energized, innovative, fun, and supportive culture. We look for positive, friendly, creative, and dynamic people with a passion to succeed and join this amazing journey!\nWhat your Arbox day will look like:\n\nConduct market research to understand trends, competitive landscape, and target personas.\nWork across teams to plan and manage launches of new products, features, and capabilities.\nShare ideas and provide input for new business opportunities and product capabilities.\nTell a story: drive product messaging and positioning that stand out in the market.\nWork closely with sales, and customer success to identify needs, and sharpen product differentiation, competitiveness, and offerings based on feedback from customers, sales, and competitive offerings.\nAnalyze, package, and optimize the product funnel and lead journey.\nContribute to content, email, social media, and community strategy.Report"}, {"company": "VectorBuilder, Inc.", "job": "Israel Territory Manager (BioTech Company - PHD in Biology Preferred)", "city": "Tel Aviv-Yafo", "date": "1 day ago", "rating": "2.7", "link": "", "description": "VectorBuilder is a rapidly growing biotechnology company specializing in advanced genetic engineering solutions for research and medicine. In particular, VectorBuilder has established itself as a global leader in a range of products and services related to gene delivery, including vector design and optimization, vector cloning, virus packaging, library construction and screening, stable cell line generation, and GMP manufacturing of clinical-grade plasmids, mRNAs, proteins and viruses.One highlight of VectorBuilder's innovative solutions is a revolutionary online platform for designing and ordering custom vectors. This award-winning platform has become highly popular with researchers around the world and has grown into an industry standard for its rich functionalities, extensive experimental validations, and easy-to-use graphical user interface. By leveraging the popularity of this platform, VectorBuilder has built a comprehensive portfolio of offerings covering virtually all gene delivery needs from bench to bedside.We are currently seeking a Territory Manager to oversee the Israel area to join our team!Qualifications:Degree in Molecular Biology, Biochemistry, Genetics or related field (Ph.D. highly preferred)High self-motivation, ability to work independently and as a collaborative team playerExcellent communication, negotiation, and sales skillsAbility to interact with customers with confidence and easeFluency, both verbal and written, in EnglishStrong attention to detailHighly desired but not required:Experience in account management or marketingMinimum 2 years of Pharmaceutical/Biotech/Medical device experienceExperience in molecular biology techniques especially DNA cloning and virus packagingExperience with selling and presenting detailed scientific subjects in a clear and understandable mannerExperience working with HubSpot is a plus but not requiredKey responsibilities:Increase sales within the designated territoryAct as a point of contact for existing and potential customers within assigned territoryCommunicate with clients via email, phone, video call, webinar, virtual product shows/conferences (and in the future: in-person meetings, presentations, product shows/conferences) to promote VectorBuilder offeringsDiscover and reach out to new potential clients (cold calling)Answer customer questions about features, pricing, and additional servicesCultivate strong, long-lasting client relationshipsCollaborate with sales representatives from different territories to share best practices and support a cohesive sales approachDemonstrate strong product/service knowledgeWork closely with internal departments to provide high-level technical support and guidance to customersMaintain high customer satisfaction levels through excellent customer serviceCompensation is based on experience. Ranges from $40000.00-$80000.00 USD per year.Job Type: Full-timePay: 142,000.00₪ - 287,000.00₪ per yearAbility to commute/relocate:Tel Aviv-Jaffa, מחוז תל אביב: Reliably commute or planning to relocate before starting work (Required)Application Question(s):Please list your minimum and desired salary.If offered the position, how soon are you able to start?Education:Undergraduate (Required)Experience:Sales: 1 year (Preferred)Pharmaceutical/Biotech/Medical device: 2 years (Required)Willingness to travel:25% (Preferred)Report"}, {"company": "OPSWAT", "job": "Director of Product (MetaAccess)", "city": "Herzliya", "date": "8d", "rating": "3.3", "link": "", "description": "OPSWAT is a global cyber security company providing solutions for enterprises since 2002 to identify, detect, and remediate advanced security threats from data and devices coming into and out their networks. Trusted by over 1,000 organizations worldwide and with over 30 anti-malware engines, 100+ data sanitization engines and more than 25 technology integration partners, OPSWAT is a pioneer and leader in data sanitization, vulnerability detection, multi-scanning, device compliance, and cloud access control.\n\nOPSWAT. Protecting the World's Critical Infrastructure\nThe Position\n\nThe Director of Products will be responsible for all go-to-market activities for OPSWAT's IT Security MetaAccess product. This is a hands-on leadership position with the responsibility of planning and launching new and existing products to scale existing businesses. Reporting directly to the VP of Products, this person will play a key leadership role to help the company continue its hyper growth and achieve overall business objectives.\n\nWhat You Will Be Doing\n\nWork closely with sales, marketing, product management and others on product strategy and its alignment with the go to market plans.\nLead cross-functional teams to launch and promote our products and solutions.\nDefine ideal customer profiles, target personas. and value propositions for relevant market segments.\nDevelop and execute GTM programs and integrated marketing campaigns that drive demand.\nCreate thought leadership content, including white papers, webinars, emails, presentations, press releases, customer case studies, and product videos.\nDevelop sales enablement tools, including training, battle cards, playbooks, and value messaging guides.\nResearch competitive products and create competitive analysis materials to enable sales.\nProvide content for and represent the company at various speaking engagements, conferences, press interviews, industry analyst briefings, etc.\nWhat We Need From You\n\n8+ years B2B product marketing or product management experience, including 5+ years in cyber security.\nProven track record of collaboration with marketing and sales teams to drive results.\nStrong interpersonal skills, ability to influence others and lead cross-functional teams.\nCyber security domain experience is required, preferably experience in Enterprise Security, CISSP, CWP, CSPM.\nDemonstrable background in writing marketing content (white papers, website content, data sheets, etc.).\nBachelor's degree required (MBA preferred).\nExcellent written and oral communication skills.\n\nOPSWAT is an equal opportunity employer. We celebrate diversity and are committed to providing an environment where equal employment opportunities are extended to all employees and applicants, free of discrimination and harassment of any type. All employment decisions are based on individual qualifications, job requirements, and business needs without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other category protected by federal, state, or local laws.Show more Report"}, {"company": "Radware", "job": "Product Marketing Manager – Temporary", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=121&ao=1136043&s=58&guid=00000186e6357e808825b08639dff975&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_5ab0dc27&cb=1678899711249&jobListingId=1008414862437&jrtk=3-1-1grj3h350k62n801-1grj3avmhi9he800-d6e98accec8b36cf-", "description": "Product Marketing Manager – Temporary - (2300000V)\nThe Security Product Marketing Manager will be part of Radware's Global Portfolio Marketing team, responsible for the go-to-market activities of Radware’s leading security products.\nWe are looking for an experienced content creator who can work across our different product lines and create compelling and strategically correct assets which go straight to the customer pain points.\nKey responsibilities include:\nResponsibility for all product marketing activities for specific product lines.\nCraft compelling messages that translate technical details into benefits for the user.\nBuild marketing assets (presentations, datasheets /brochures, whitepapers, and so on) to support Radware’s products/services.\nCreate demand generation content such as blogs, social media posts, case studies, etc.\nSupport the Sales organization with development of internal and external sales tools and training.\n\nWhat do you need to succeed?\n2+ years experience in product marketing or product management with marketing responsibilities.\nBackground in content creation and writing with attention to quality and detail.\nExcellent English presentation and writing skills.\nStrong team player – great interpersonal and cross-group working skills to interact with colleagues, cross-functional teams, and third parties.\nPassionate about technology and ability to understand it.\nBSc/BA Computer Science, Engineering, Business, Marketing, or equivalent experience; MBA is an advantage.\n\nWe'll be happy if you also have knowledge and experience in cybersecurity, DDoS or application security, or certifications in information technology such as CISSP or CISM.\nLocation and Logistics:\nThe position is based in Tel Aviv, with a hybrid work model\n\n#LI-ML1\n\nPrimary Location: IL-IL-Tel Aviv\nWork Locations: Radware Israel, Tel Aviv 22 Raoul Wallenberg Street Tel Aviv 69710\nJob: Product MarketingShow more Report"}, {"company": "EntryPoint", "job": "Product Marketing and Content Leader", "city": "Israel", "date": "30d+", "rating": "3.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=122&ao=1136043&s=58&guid=00000186e6357e808825b08639dff975&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_fcbf951a&cb=1678899712540&jobListingId=1008425286392&jrtk=3-1-1grj3h4enkcmq801-1grj3avmhi9he800-d3d8b8ed82cd29a0-", "description": "Product Marketing and Content Leader\n15/03/2023\nCoordinate between product teams and marketing for effective delivery of our uniqueness;\nDevelop content strategy and campaigns aligned with short-term and long-term marketing targets\nCollaborate with marketing and design teams to plan and develop content, style and layout\nCreate and publish engaging content\nEdit, proofread and improve writers’ posts\nLiaise with content writers to ensure brand consistency\nManage content distribution, including online channels and social media platforms, to increase lead generation and web traffic\nEnsure compliance with law (e.g. copyright and data protection)\nStay up-to-date with developments and generate new ideas to draw audience’s attention\n\nRequirements\n\nProven record as product marketing\nBackground in selling B2B solutions and/or SaaS solutions, preferably communications solutions\nTeam management – advantage\nBackground in Telecommunications – advantage\nHands on experience with MS Office\nSelf-employed personality with good organizational and time-management skills\nKnowledge of SEO and web traffic metrics and social media\nExcellent writing skills in English\nAttention to details\n\nמספר משרה: 4441Show more Report"}, {"company": "Check Point Software Technologies Ltd.", "job": "Product Marketing Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=123&ao=1136043&s=58&guid=00000186e6357e808825b08639dff975&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4b8befae&cb=1678899713765&jobListingId=1008264786226&jrtk=3-1-1grj3h5kck6ec801-1grj3avmhi9he800-6e8d303f45ea1fdb-", "description": "Your Team\n\nWe’re looking for a self-starter Product Marketing Manager with 3-5 years experience taking cyber security solutions to market. Harmony is one of Check Point’s fastest growing suite of products and we are looking for a motivated and creative, hands-on expert to join our team.\nYour Impact & Responsibilities\nDrive product launch and develop go-to-market plans, manage the development of sales enablement tools and training for field sales force and reseller partners.\nDevelop the sales tools (PPTs, feature briefs, case studies, white papers, product brochures) to support the sales process of the company’s solutions and drive clarity and consistency of message.\nDevelop thought-leadership materials designed to accelerate our business momentum and better engage customers.\nPresent our products and solutions in formal and informal settings.\nEvangelize our solutions portfolio to our customers through events, webinars and other external communications channels.\nDrive sales enablement activities; act as key contact with the sales organization driving communications of product direction, positioning, key messages and sales collateral.\nTravel for presentations, training, tradeshows and events – up to 25%\nYour Knowledge & Skills\n3-5 years of experience as a Product Marketer at a cyber security vendor - MUST\nExcellent English (English as a mother tongue – preferred)\nWork experience within enterprise security or networking targeting large enterprise customers is highly desirable.\nHands-on experience delivering high-quality marketing materials with a creative flair to bring fresh ideas into product positioning and marketing campaigns.\nStrong writing skills are essential - must be able to create a wide range of marketing content from scratch (presentations, white papers, datasheets, brochures, etc.).\nExceptional communication and strong public speaking and presentation skills.\nAbility to communicate effectively to both technical and business-level audiences in a compelling and differentiating manner.\nComfortable operating in an ambiguous, fast-paced, complex environment with an ability to manage multiple projects simultaneously.\nBA/BS or equivalent experience.Show more Report"}, {"company": "Craft.io", "job": "Director of Content Marketing", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=124&ao=1136043&s=58&guid=00000186e6357e808825b08639dff975&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b36c02d2&cb=1678899714919&jobListingId=1007651948249&jrtk=3-1-1grj3h6o0k60l801-1grj3avmhi9he800-6d7365b44e3e07cc-", "description": "About Craft.io\n\nCraft.io is revolutionizing product management with an end-to-end platform for product professionals.\n\nWith Craft.io, product professionals enjoy a single source of product truth where they create their product strategy and roadmaps, collect and analyze valuable customer feedback, prioritize features and tasks, write specs, and monitor the work of the dev teams.\n\nThousands of product professionals from companies like SAP, Kimberly-Clark, Danone, Sysco, Novartis, and Marks & Spencer use Craft.io, and we are proud to provide them with everything they need to become better at what they love doing - building and shipping great digital products.\n\nAt Craft.io, we work hard but try not to take ourselves too seriously. We are highly adaptable and constantly evolving, passionate about our product, and live to bring value to our customers consistently. Our work environment is dynamic, innovative, and fun, backed by a solid product, strong leadership, and a well-funded future.\nAbout the Director of Content Marketing role\n\nWe’re looking for an experienced content writer, a veteran in creating content for B2B SaaS companies with proven success in creating great content and executing a marketing penetration strategy.\n\nOur ideal candidate is someone who can develop a content strategy, create a content plan and calendar, write great content for a wide variety of marketing materials, and manage freelance content writers.\n\nBottom line: if you’re a hard worker as well as a visionary, Craft.io may be the right place for you.\nWhat will you actually do?\n\nBecome an expert in the Product Management software space, know our competitors, and learn where we can beat them\nPlay a key role in the Craft.io branding process and positioning\nDevelop and implement a content strategy\nOwn and create all Craft.io content and marketing materials\nWrite a lot of content, both long-form and short-form, such as eBooks, guides, reports, case studies, website content, landing pages, blog posts, ad copy, emails, press releases, articles, and more\nManage content publication cycles, including graphic designers, writers, and web developers\nTake the initiative and remain flexible - this is a startup, after all :)\nNative-level English - must have\n2+ years experience as Content Marketing Manager working for B2B SaaS company - must have\nExperience with writing for enterprise software companies as a target audience - must have\n\nExperience with different types of writing: newsletters, customer stories, white papers, etc. - must have\nExtremely organized with high attention to detail and a love for being deep in the weeds - must have\nExperience communicating with freelance writers, internal stakeholders, and management - must haveShow more Report"}, {"company": "Nebius", "job": "Product Marketing Manager", "city": "Tel Aviv-Yafo", "date": "15d", "rating": "", "link": "", "description": "Nebius Israel is a new brand in Israel. The Nebius Israel platform combines the technical advantages of cloud hyperscalers with an unparalleled level of transparency and compliance, made possible by collaboration with trusted local partners in a joint venture. We offer a unique opportunity to join the first steps of Nebius Israel, grow with us and make a powerful impact.\nNebius Israel is looking for a superstar, results-oriented Product Marketing Manager. In this role, you will be responsible to build dedicated go-to-market plans for the Israeli market that will generate demand, progress the pipeline, enable higher close rates, shorten the deal cycle, and monetize our customer base. In this important role, you will interface, collaborate with and leverage team members across the product, business, R&D, Finance, and functional marketing teams to educate and enable our customers, partners, and sales team on the value of the Nebius Israel services and solutions.\nYour job is to:\nLead product-related marketing campaigns and activities\nDrive market research and competitive analysis\nDevelop product messaging and positioning that differentiates our services and solutions. A clear understanding of our target markets, buyer personas, competition, partner ecosystem, and our products.\nBuild go-to-market plans per product/use case including messaging/positioning. Content creation and sales enablement tools.\nDevelop both business and technical product-related content, including whitepapers, solution briefs, presentations, videos, webinars, case studies, and more.\nPlan and execute feature launches cross-functionally with Sales, Marketing, and Support teams.\nDevelop sales enablement materials to arm the sales team with competitive intelligence that drives sales productivity and pipeline conversion\nWhat we expect from you:\n5+ years of product marketing experience in B2B companies / cloud hyperscalers\nAt least 2 years of experience in a market-facing role (e.g. delivering presentations to customers and prospects, conducting competitor analysis, and market research)\nExceptional ROI-tracking skills, able to prove what is or isn't working\nMust be a strong public speaker, comfortable in front of large, senior-level groups, and a solid writer\nExcellent people and management skills to interact with staff, colleagues, cross-functional teams, and third parties\nUnderstand and resolve complex technical, strategic, and business issues\nStrong analytical and project management capabilities\nFluent in English and Hebrew – verbal and written\nPrevious experience in the Cloud ecosystem – a significant advantage\n\nAs an employer we provide our employees with ambitious challenges, exceptional and thoughtful colleagues, and a competitive compensation and benefits package.\nWe strive to find the most talented, enthusiastic, self-driven individuals to achieve our common goals together in a fast-paced collaborative environment.\nLooking for a new challenge? Join us now!Report"}, {"company": "Investing.com", "job": "Product Marketing Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=126&ao=1136043&s=58&guid=00000186e6357e808825b08639dff975&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0e7524ce&cb=1678899717406&jobListingId=1008452133841&jrtk=3-1-1grj3h90ukf20801-1grj3avmhi9he800-82b132d1e06c0955-", "description": "Investing.com, the leading global financial news & data platform, is on the lookout for a talented Product Marketing Manager with a proven track record of excellence & creative thinking to join our marketing team and serve as a focal point between Investing’s Product and Marketing teams.What you’ll be doing:Collaborate and become the liaison for product managers to fuel decision-making with marketing understanding and insightsBuild the marketing story and go-to marketing plan of product launches, aligning key stakeholders and cross-functional teamsInitiate adoption and retention initiatives with different stakeholders (CRM, ASO, UA, Social, Content) to hit KPIs that achieve overall successAnalyze user needs and behavior, identify market opportunities and turn insights into action items – from product requirements to concepts and marketing initiativesLead ad-hoc product campaigns and optimize product and marketing funnelsWhat you’ll bring:2+ years of product marketing experienceHigh-level understanding of the mobile apps world, especially in the B2C fieldBackground in digital content, communications, or PR (Advantage)Analytical and quantitative / statistics skills to support data-driven decision-makingProject management, exceptional communication, and presentation skillsSelf-driven, problem-solver, motivated with strong interpersonal skillsAbility to work well in a team environmentB.A/B.Sc in communication, marketing, business management, or economics from a leading universitiesEnglish level – ProficientWho we are:Investing.com was founded in 2007 and now has over 350 employees worldwide.With 60 million monthly unique visitors, 4 billion page views, over 500 million sessions, and over 300,000 financial instruments covered, Investing.com is one of the top two global financial websites. Investing.com offers unlimited access to cutting-edge financial market tools such as real-time quotes and charts, customized portfolios, personal live alerts, calendars, calculators, and financial insights, free of charge. In addition to the global stock markets, Investing.com also covers world indices, ETFs, commodities, bonds & interest rates, cryptocurrencies, futures, and options“. Investing.com strives to be a one-stop-shop for traders and investors with apps available.What we offer:The chance to join one of the leading financial markets platforms in the worldChallenging assignments in a global environmentHigh-energy working environmentExcellent benefitsAs with all Investing.com positions, we’re looking for someone who is self-motivated and meticulous, with a creative and resourceful mind, bright and proactive, and that works well independently and as part of a team.As part of our Privacy Policy, your resume and information will be kept confidential.Job Type: Full-timeShow more Report"}, {"company": "InspHire", "job": "Head of Product", "city": "Herzliya", "date": "6d", "rating": "5.0", "link": "", "description": "An International B2C company is looking for a brilliant Product Guru to join its management team, someone with marketing and UX experience and with a technical background to manage and lead the company's product department.\n\nThe Head of Product and the product team will be responsible for various plans and activities, from ideation through execution to post analysis, utilizing the available channels and initiating new ones, and monitoring and optimizing our customer performance.\n\nResponsibilities:\n\nOwn web/mobile product features roadmaps from end to end.\nCollect and analyze requirements, write clear and detailed MRDs, PRDs, UI/XU & flow, wireframes, define AB test and user stories, prioritize backlog and handle development/engineering.\nManage a team of 4 product owners remotely.\nAnalyze the success of the feature once it's released to production, responsible for the usage data and patterns, and run tests to optimize & improve performance and business results\nWork closely with all relevant cross-functional teams (R&D, Marketing, Content, SEO, Design, BI/BA, etc.) to guarantee smooth, efficient implementation\nFind opportunities for key initiatives to improve the customer experience.\nManage ongoing maintenance and improvement of product features\n\nRequirements:\n\nAt least 5 years of experience as a Product Manager or Product marketing in the ecommerce field or B2C Industry.\nManagerial experience - manage a team of 4 product owners.\nDeep understanding of the customer journey and marketing (UI/UX)\nStrong analytical skills, highly capable of interpreting data, performing qualitative research, and translating results into actionable key takeaways\nFamiliarity with data system concepts, databases, BI, Usability tests and market research.\nExperience in working with multiple internal partners, including product, design, content, operation, customer support.\nTechnical Skills: ability to talk with R&D on technical language, understand SDLC / possible technical possibilities and limitations, experience with multi-project integrations.\nExperience with AB testing\nGoal-oriented, highly motivated, takes full ownership of projects.\nMover & shaker, who adapts well to a dynamic and rapidly changing environment\nStrong organizational and analytical skills, high attention to details\nGreat communicator who is able to clearly convey messages in written and oral form (in English)\nDeep understanding of the digital marketing and performance marketing terms.\nRussian language - is an advantage.\nAbility to partner with cross-functional disciplines and to influence effectively\nA problem solver – highly inventive thinker that will provide insightful, innovative solutions to any problem\nProject management abilities and passion for digital products.\n\nIf you feel the above describes you perfectly- Apply now!Show more Report"}, {"company": "Nayax", "job": "Product Marketing Manager", "city": "Herzliya", "date": "30d+", "rating": "4.1", "link": "", "description": "Nayax is looking for an experienced Product Marketing Manager to join our successful marketing team. The Product Marketing Manager’s responsibilities include leading the development and execution of product marketing plans, providing ad-hoc support to account teams throughout the sales lifecycle for all marketing-related elements, as well as continuously planning, building, and executing marketing collateral, customer-facing activities, enablement plans, and sales tools.\nThe Product Marketing Manager will be part of the Product Marketing team and will report to the Senior Product Marketing Manager.\nIN THIS POSITION YOU WILL:\nConduct market research to understand our consumers’ preferences then target and segment our customers effectively based on this research.\nCreate marketing collateral that will enable the sales team, and educate them through relevant materials (such as value proposition, SWOT, objection handling, battle cards and more.)\n Oversee product launches, feature releases, and product positioning.\nRequirements:\n\nWE ARE LOOKING FOR SOMEONE WITH:\nBachelor's degree or equivalent experience in a related area\n2+ years' of product marketing experience\nStrong verbal, written, and presentation skills\nUnderstanding of payments / Fintech domains and ecosystem – strong advantage\nAble to research and understand strategies to implement with sales and in the field\nContent writing experience – strong advantage\nFluent English – written and spoken\nGood Hebrew level\nADVANTAGES:\nUnderstanding of payments / Fintech domains and ecosystem\nContent writing experience\nWhy You Will Love This Job\nYou will have a leading role in defining marketing strategy and content creation for the industry’s most advanced solutions and practices\nYou will use state-of-the-art marketing tools and practices\nYou will have the opportunity to work in a multinational environment for the global market leader in its field\nYou will have a central and noticeable role in the company with frequent presentations, webinars, and discussions with stakeholders\nWho we are:\n\nNayax is a leading global end-to-end retail technology platform for unattended & attended commerce. Our mission is to simplify commerce and payments for retailers while driving growth, optimizing operations, and enhancing consumer engagement.\nNayax Israel is located in the prestigious Herzliya Hills, just a short drive north of Tel Aviv or a very short walk from the train station.\nOur open space offices accommodate our 400+ employees and when we’re not hard at work, you can find us enjoying an afternoon coffee on the balcony. We’re the largest Nayax site, housing over 20 different departments.\nFor a glimpse of what it's like to work at Nayax, check out our Instagram account! https://bit.ly/3G3QDc4.\nCheck out Nayax's page under \"Best Cool Israeli Companies 2022\" by Secret Tel-Aviv: https://bit.ly/3LqzElA.\nNayax is constantly growing and we are always on the lookout for enthusiastic, innovative and eager individuals to join us in our growth!Show more Report"}, {"company": "Artlist", "job": "Product Marketing Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.7", "link": "", "description": "Artlist is a creative technology company providing video creators with high-quality music, sound effects, footage and digital assets for video, as well as powerful video and image editing software. With our revolutionary license and cutting-edge creative tools, we’re on the fast track to becoming the ultimate 360 degree solution for video creators.\nToday, Artlist is the go-to licensing provider for creators in over 160 countries. Among our 16M clients are Google, Apple, Nike, Coca-Cola, Ikea, Mercedes, Samsung, Wix, Netflix, Dior and more.\nArtlist consists of:\nArtlist.io, a royalty-free musicSFX, stock footage and creative asset platform\nMotionArray.com, an all-in-one marketplace for creators that offers video templates, presets, music, SFX, stock footage, motion graphics and stock photos\nFXhome, a cutting-edge video, VFX and image editing software\nWe are looking for an experienced and motivated Product Marketing Manager.\nIn this role, you will be responsible for developing and executing marketing strategies and go-to-market plans of our new features and products. You will work closely with the product development team to understand the features and benefits of our products and will be responsible for positioning them in the market. You will also collaborate with various teams to optimize and improve user journey and to drive product launches\nWake up to this:\nAnalyze, package and optimize user journey from first exposure and into life cycle while constantly suggesting ways to improve KPIs.\nDevelop go-to-market plans for new and existing products and features.\nLead cross-functional execution and planning to support product launches and scaled adoption efforts.\nCollaborate with the product team to understand the features and benefits of our products and to develop messaging and positioning.\nResearch and understand the competitive landscape, target audience and personas to correctly position the offering in the context of our USPs.\nAnalyze product performance and customer feedback using A/B testing, interviews and other tools to inform product roadmap and marketing efforts.\nCommunicate the vision and value of Artist Business and develop the messaging and marketing tools that facilitate the process.\nCollaborate with various teams, including content marketing, design, UA, data and sales to drive product awareness and adoption.\nRequirements:\n\n3+ years of experience as a Product Marketing Manager or similar experience in Saas /B2C companies.\nDemonstrated experience developing and executing go-to-market plans.\nExperience with project management and the ability to juggle multiple projects at once.\nStrong analytical skills and ability to use data to inform decisions.\nFamiliarity with data system concepts, databases, BI, A/B testing and market research.\nExcellent communication and presentation skills.\nExperience in working with internal interfaces: marketing, product, design, customer service and sales.Show more Report"}, {"company": "Seperia", "job": "Head of Product Marketing", "city": "Herzliya", "date": "15d", "rating": "4.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=130&ao=1136043&s=58&guid=00000186e6357e808825b08639dff975&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_5c6b36b3&cb=1678899721567&jobListingId=1008496371526&jrtk=3-1-1grj3hd8njiih801-1grj3avmhi9he800-cd29d8ed85917c91-", "description": "Who We Are:\n\nSeperia builds and operates global fintech review sites. From 2003, we have been driving millions of sales to our partners (advertisers). We do it by focusing on value added content, wrapped within an engaging web product and matched with high-intent traffic.\n\nWe’re looking for an ambitious and talented Head of Product Marketing to join the team.\n\nWhat You Will Do:\n\nLeading a small team of Project Managers, including (but not limited to): hiring, training and responsibility for personal development.\nDrive the execution of our products (review sites) through their entire lifecycle: market research, competitive analysis, planning, positioning, roadmap development and ongoing product optimization.\nManage communication with international brands, evaluate their performance metrics, and drive product monetization.\nAnalyze users’ needs, web page performance, market trends and partnerships from an ROI perspective.\nEstablish project management processes, data-driven & measurability as a culture in your team.\nWork closely with external development teams to track progress and ensure timely and high-quality deliverables.\nWork closely with marketing teams, design and finance.\n\nWhat You Need:\n\nGreat written & verbal communication skills (Hebrew & English) – must.\nAn independent and performance-oriented attitude with the ability to drive people and processes.\n2+ years of experience in web product management, marketing project management or global website management – must.\nManagerial experience – must.\nWeb-savvy individual.\nTechnical capabilities & experience working with developers.\n\nExtra beneficial skills:\n\nExperience in managing websites via WordPress.\nKnowledge in online advertising.\n\nWhat We Offer:\n\nHuge potential for growth. Our company is growing and we’re looking for someone who can grow with us.\nFreedom – we care less about formalities, and more about results. With a dynamic, informal environment, we keep excellence, innovation, and results at the forefront.\nUpside – as a performance product company, we develop global-level, scalable marketing assets with no glass ceiling. You can enjoy a growing upside.Show more Report"}], [{"company": "CrowdStrike", "job": "Sr. Data Analyst - EASM, Israel", "city": "Tel Aviv-Yafo", "date": "27d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=101&ao=1110586&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9236282c&cb=1678899722963&jobListingId=1008474161609&cpc=663B5FE45D73772E&jrtk=3-1-1grj3hekhp2md801-1grj3bp2uhaol800-92fa3d746e7cd967--6NYlbfkN0BJMW_X9OCLkZ04_weh8WkR-IGNb1MhigwTP7XGwrJOFwZb96yIISkY_qENr62JHCGUCwODXE_Z1C9yCnPYeMWnhHT6BJpJwdl_Zg7EDZghHCbCfwjtYZP3qbdwWIatLi8Jhy8tum7mIXby9h-DxirksY-09TZVT01QgJTf8ZXm6WzHjT7M8XJ25etS7t4hwv6XtNSglSCimDPDMpQsEYJcN4LYfm6Q9VlskumurOfdteyB37jOBfOKNviE1XQ-WWP60c3u7Cbc7t1PwZ7ceNKdIEavpzg6L6_LDJTSyj_yTAzk7SQuhA3ALtbrNZeUQ3dc-q62rCL4-X6J0FbGtUke4fJcSVqfsN92Imk4He3z87OnIwgYRTjJOotsgGQj0aUe533q3IJGRA65RAc1iaxroozYdRaLaLTgjnlSUsdqBTKjRhSekaGHgZJQYx5EO69UBvXcfQLw-X1TXC-wlh4kgU7C9c5UH_dLtSrZVcWlUkqJ7dew7SxhwvcytMEML95z3ChxAUFsYz1OndwPF-EY1tAddiVbVOFex2HoKPHrosgh2RHTSO0x0x_YBBED_BQKrt0IOb1lZbGj4uHPoOquCJNqfQR_g_4wDtFBP2odhsBApBqLtRwd4TYiglUEnX9pD_l5EEBvzpyzCKckCjXp-0hwmF2F6U6yeinYaFzetEffu0Ww5frvylsz1JcI4OqO324cLM3xVQ%3D%3D", "description": "#WeAreCrowdStrike and our mission is to stop breaches. As a global leader in cybersecurity, our team changed the game. Since our inception, our market leading cloud-native platform has offered unparalleled protection against the most sophisticated cyberattacks. We’re looking for people with limitless passion, a relentless focus on innovation and a fanatical commitment to the customer to join us in shaping the future of cybersecurity. Consistently recognized as a top workplace, CrowdStrike is committed to cultivating an inclusive, remote-first culture that offers people the autonomy and flexibility to balance the needs of work and life while taking their career to the next level. Interested in working for a company that sets the standard and leads with integrity? Join us on a mission that matters - one team, one fight.\nAbout the Role:\nCrowdStrike is seeking an experienced Senior Data Analyst to join our team. The successful candidate will work with a world-class team of engineers to analyze vast amounts of data and make discoveries.\nAbout the team:\nYou will be joining to the EASM Engineering team a.k.a. CrowdStrike Falcon Surface\nFalcon Surface pinpoints unknown, exposed internet-facing assets so security teams can best secure their digital perimeter. It enables security teams to detect, prioritize, and manage all of their exposed internet-facing assets that are centralized or remote across on-premise environments, subsidiary, cloud and third-party vendors with no agents or deployment required.\nMore information about Falcon Surface\nhttps://www.crowdstrike.com/products/security-and-it-operations/falcon-surface\n\nDescription:\nAs part of the EASM Engineering team a.k.a. Falcon Surface, you will be involved in continuous data improvement, identify online assets, and take part in defining the latest product requirements and changes.\nYou will be a team member that gathers and delivers data and intelligence to help organizations.\nInterviewing process: online\nKey responsibilities:\nEnhance the accuracy of data by contributing to our platform’s asset association techniques\nExtract insights from large databases, as well as identify anomalies in large datasets\nContribute to the classification and security scanning capabilities of CrowdStrike’s Falcon platform\nCollaborate with several teams to help define cross-platform security features\nConduct web research for solutions and identifications of common web services\nParticipate in the architectural security reviews of immensely scaled CrowdStrike products\nJob requirements:\n5+ years of experience as a data analyst\nKnowledge of computer networking and web technologies like cloud computing, applications, and servers\nScripting skills, with Python preferred\nExperience working with a database\nExperience with Linux or Unix-like operating systems\nSelf-starting learner with the ability to adapt to multiple requirements\nDemonstrable critical thinking skills\nExcellent communication and team collaboration skills\nAbility to write coherent reports with key takeaways and suggestions\nFluency in English\nAdditional preferences:\nExperience working with ElasticSearch and Kibana is preferred but not required\nExperience working with data analytics in the cybersecurity landscape is preferred but not required\nIf you're passionate about cybersecurity and have a strong background in data science or data analysis, we encourage you to apply for this exciting opportunity to join CrowdStrike as a Senior Data Analyst.\n#LI-DS1\n#LI-YA1\n#LI-MZ1\nBenefits of Working at CrowdStrike:\nRemote-first culture\nMarket leader in compensation and equity awards\nCompetitive vacation and flexible working arrangements\nComprehensive and inclusive health benefits\nPhysical and mental wellness programs\nPaid parental leave, including adoption\nA variety of professional development and mentorship opportunities\nOffices with stocked kitchens when you need to fuel innovation and collaboration\nWe are committed to fostering a culture of belonging where everyone feels seen, heard, valued for who they are and empowered to succeed. Our approach to cultivating a diverse, equitable, and inclusive culture is rooted in listening, learning and collective action. By embracing the diversity of our people, we achieve our best work and fuel innovation - generating the best possible outcomes for our customers and the communities they serve.\nCrowdStrike is an Equal Opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected veteran status, or any other characteristic protected by applicable federal, state, or local law.Show more Report"}, {"company": "DoorLoop", "job": "Senior Data Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=1110586&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_83e78549&cb=1678899724039&jobListingId=1008440987692&cpc=BA15C3E50D27FFE8&jrtk=3-1-1grj3hflvihkr801-1grj3bp2uhaol800-54ca41fb4a28cc75--6NYlbfkN0Bg8kaLZpGmonnt516iCDBz1BXXYWwUs3o81vaiU99V9TLG472jvwa0fELsyMFCbJIwFfNgDGDlDNBAZocAjRsGInWfsqI9DliyMkOIGBt6VFBNKJzzVXp24PE5wDbwrWxBpc4fD0-ClI7yXJVx1azSBMNPQwI6rbbkQ0RxWJ8tAPxpRQmsfPPhcGDSxMc-9L4uHDI3XM0uqG6kmtQ9qJcUW_mei_GGjIJ37Yo8diBJ_eKRXqdW5cKKf_0AgN3sxEgHWX-QJUCgJ8Z8B5N3O7bUQ_imLW34Pl7gSM3YQSMkMPz5HkJmQSE5RCjsgdh0z-FD9xirpLsqRbO-hzzIxLj1VdUT--Igirif02hOgJEcudVsqsQC2RdlFQZkxVP-4IiUECdXgU1DiF3Rn4eqnOkO-JXEQZsJrkYVtVD-BsDm_VDDv5pL7mRhsAe1KVQpooTPf0xr4shT0AJ_ZUi_nyiNi-XRRhFp_CWkyk6WekNWQO8ft01u7QPMcJbPYqQ_00uNtfjNoZ_JJ2BuLnPX52944ntmP530hF226S22_nTuANJSHZsl1xLcb_jvlP-2JbLt2DHi3uJfGRrUw3IqSTFPCuYvpLBENDpV4I1x9-GpJA%3D%3D", "description": "About DoorLoopCertified as a Great Place to Work®, DoorLoop is a property management software used by landlords and property managers in over 100 countries.As a software company with $30M in funding, 3 offices worldwide (Miami, London, Israel), and tens of thousands of units being managed, we are one of the fastest growing tech companies.If you want to work with a team that values transparency, feedback, and growth, DoorLoop is for you.The RoleWe are looking for a super talented Senior Data Analyst to join our team in Tel-Aviv. If you are excited about what you are about to read, we invite you to apply!We are looking for someone who has a good understanding of relational databases, hands-on experience in SQL and/or Python, and data visualization tools such as Tableau and Power BI. You will be working closely with the product, marketing, customer success, and engineering teams, to improve conversions, LTV, churn, product A/B tests, and more. You will collect and analyze the data and help answer the toughest issues each team is facing in order to drive insights..Some additional qualities about you and this role:You will identify, analyze, and interpret trends or patterns in complex data sets to drive actionable insights.You will define and implement KPIs across different teams: product, business, marketing, and customer success.You will implement product features, measure their performance, and provide recommendations.Gain a deeper understanding of how customers use our product, and advise us on how to improve.You will translate product/business requirements, and create a clear visualization which \"tells the story\" using a BI tool or other platformQualifications & Requirements4+ years of experience as a Data/Business Analyst.B.S in one of the following: Industrial Engineering, Statistics, Mathematics, Economics, or a related field.An ability to understand complex business models and simplifyExperience in product analysis including working with BI events and performing A/B tests.High level of SQL is a must.Experience in BI visualization tools such as Tableau, Amplitude, or similar and performing A/B tests.Experience in data modeling, ETL development, and data warehousingTeam player, effective interpersonal skills, and good vibes. Ability to manage relationships with key partners and the ability to work independently.Experience in a fast-paced, dynamic work environment.Bonus PointsExperience in Python is a plus, but not a must.Experience working with Salesforce is a plus, but not a must.Benefits & PerksUnlimited paid time off with unlimited personal, vacation, and sick days.Annual company retreat in the US with our Miami team (all expenses paid).Career development with unlimited access to Udemy's courses and other growth opportunities.Monthly investment classes from our co-founders on how to invest your money in a diversified portfolio of real estate, stocks, crypto, NFT, & more.No micromanagement - We believe responsible people thrive on freedom.Great equipment - Ergonomic chairs, Mac or PC laptops, dual monitors, standup desks, and more.No rules - No dress code, policies, or handbooks. Just do great work & have fun!Job Type: Full-timeAbility to commute/relocate:תל אביב -יפו, מחוז תל אביב: Reliably commute or planning to relocate before starting work (Required)Show more Report"}, {"company": "חיבורים", "job": "Data Analyst לחברת סטארט אפ", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=103&ao=1110586&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b3b27979&cb=1678899725658&jobListingId=1008452058011&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj3hh8kj479801-1grj3bp2uhaol800-e5057a5dcd4bcdea--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNCSxNFK3B17GFLjAII83y_JYkZTnLSoqWY0iWqXHY12qfkW2NHGmZJz1BAO7gVIEAESAu8qinmMiWubjdy-mnma9nMxyRVtZD_4KTSjqPEV0vfV6961jzIOZym6CwV7JyiJZVtmmR2d1sCmlo4jetYbZC_--ziUyl5Llpg74KPZ6Po2x5Hn8VoQ6xI46JWH_90zbaenOp0NNs9XBVlRSoaMjXx77-ms7IsNxyCufOAFCuQU8872nF3B0Ue256-CCryLwmhwHfqa0v_wM-vgogvZbnu96dEtrmlemweNxLnzPjne_BjcR33w9N2v-H6x6YWGC_Jc6nyPEkGiZkP0g_Am1XkuQmZI8ubQHfn_PKou0wuNNqbSRTe_zr4AIj0W78bP7noKeFz0TulAszTQ6oMDvQ_g_0GRIJvc0-PDzdakFxgwMTaXJeQc9piU3jsDrpRyjF5C5ciwNEueqiz7j0Lz9FaAhSb8FT89rgmtGzuduKUlEudfbwGF5lk-y4coBZaiprKCSGoNkaQFZEUbf49s1sTNlnULZjI6nhWWCU9whoQKxzbmxJaZzA9qwb6vDqH4LqRLIipFhXjHkSPPWztqEOD5Xt2KCvZbCZSX2ZIiaj7SrnZ0ZcO_x-YQXFJl2kspZnBHjvqVtU26Os_1VZJz5Uw3kJIGqi4%3D", "description": "Compiling, analyzing, and reporting data. Investigation of data anomalies. Analyze large datasets, and provide useful actionable recommendations. Provide supporting data for prioritizing new features and initiatives.\n\nAnalyze product behavior and performance for configuration tuning per customer. Finding influencing factors and estimate their effect on the KPIs. Bachelor degree in Industrial Engineering, Statistics, Mathematics, Economics, ora related field Good numerical reasoning skills Expert level in Excel High level of spoken and written English. Team player with excellent communication and interpersonal skillsReport"}, {"company": "Plarium", "job": "Junior Survey Researcher", "city": "Herzliya", "date": "16d", "rating": "4.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=104&ao=1136043&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_64f8309e&cb=1678899727857&jobListingId=1008493539271&jrtk=3-1-1grj3hjd8mfpe801-1grj3bp2uhaol800-d2410d82e3b060b0-", "description": "About the department\nAbout Research department-The research department is responsible for the\n\nanalysis of players research, competitive offering\n\nand market trends.\nResponsibilities\nAs a Junior Survey Analyst, the new team member will perform\ncustomer research, based on questionnaires for product and marketing departments.\nThe researcher will present the findings to the internal\ncustomer and deliver a structured report.\nWhat we expectQuestionnaire writing experience -Must!!!Perform statistical analysis of surveys.Qualitative research as well; playtests, interviews,\ndiaries, etc.\nPresenting reports to all levels of managementWork with a wide range of internal clients\nDesiredAdvantage – Experience in Gaming companiesExperience with data analysis: Excel, SPSS, R,\nPython\nExperience with Power PointAdvantage: Background in academic research\nWhat we offer our Employees\nYour wellbeing: Flexible, hybrid work experience with talented professionals. Also, high work life balance derived from our people-oriented approach\nYour health: top notch health insurance to employees and immediate family. Furthermore, gym membership or a variety or workout options\nYour future: personal and professional tools to assist with your development and journey\nYour contribution: A variety of social and charitable initiatives, that we take pride in\nYour home away from home: A newly renovated office that includes breakfast every morning, a barista to give you your coffee during your workday, an in house gym and workout studio to balance all the delicious food and if you are a musician a fully equipped music room to play around in\nAnd an opportunity to work with the best of the best locally and globally in the gaming fieldReport"}, {"company": "SQLink", "job": "Data Analyst לחברת תקשורת מובילה", "city": "Tel Aviv-Yafo", "date": "3d", "rating": "3.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=1110586&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_49b865a7&cb=1678899729148&jobListingId=1008523595169&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj3hkl8klt1801-1grj3bp2uhaol800-238823863999af6b--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tGRBbjy15RxGaEEw7KZU_HKuBVxwnK2mazmK7baW_0w6QdWCshfrgikjjXoEQJyrsaPTxMAIWJZ276XUt5xlbO2uGilr1PbHhepvUl7c1nbtYiT6KQQLzQ-RnclDy1qydEvbNObl-oK0pEwTwFLWahfqwDqIYa9Yb4JDzM07QLrybm5PsG6mET2M3fNhDmehC_akv6BLOJnKeB59r544C26uyIP_86jtEUOS4JrhAQuATtVr7_IccHm6G6oSXNlGdhY42vcvxPwJyOrKMs9x1mX_YGQivFTUgEppwdfEvT-uAlMD6VPx-9yj5-Ok6O9f6sB0mkdxLBYm8d_c4UUVBsPp2ktHVmtoUFK0dKW6G3hYR7s-a3V9a5RCfe1VetJ6gLsTiCR0lHolv-2WqemDSpfBmNclirwmGQpQ_wjKKczDtCAFv5UNsoCAImcgFY_wAOngOwsKBshtlF7anAccPJTQCp6lVg8zZwdjC60HoTQ5IqQYWVDMh1s_7H-2isFKDTlgNi9fULkXd6CbG6NjSsh1tMmgsYWTXnPv5tzp3A0ZLiG0ln3zNIJg-Txls5H1nwzzJmtj2F2Fbd35JSrpjLloXvkI2_N9i39EmTkdzsU1fznPJciQNVgT2oVu8vTSp9-QQhuby44R6HjuseqAW-XtQ2R69wa6hJaxFXdI3jFdO6miJgLzutS47dvUb-yvYA%3D%3D", "description": "חברה מבוססת וחדשנית באזור המרכז מגייסת Data Analyst. במסגרת התפקיד, ניתוח נתונים, זיהוי מגמות והזדמנויות חדשות ב-Data, הגדרת מטרות עסקיות, עבודה עם כלי אנליזה, ועוד! הזדמנות להיות חלק בחברה מצליחה ולהשתלב בתפקיד בעל אתגר מקצועי. - SQL ברמה גבוהה - ידע ב-Python - תואר רלוונטי - עבודה עם כלי אנליזה וויזואליזציית נתונים: BOXI, PWBIShow more Report"}, {"company": "Nym Health", "job": "Medical Data Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.0", "link": "", "description": "At Nym, we’re passionate about simplifying healthcare by automating the accurate interpretation of clinical language.\nOur interdisciplinary team has developed an innovative technology that can understand clinical language and provides an entirely new way of analyzing and decoding medical records into clear, concise, and actionable information. This ultimately ensures clinical and administrative teams can spend more time focused on patient care.\nAt Nym, the future is bright. Our engine currently processes over five million charts annually in more than 150 emergency department and urgent care settings across the US. We are backed by top-tier VCs and growing rapidly, with offices in NYC and Tel Aviv.\nCome join us!\nRole and Responsibilities:\nNym is looking for a Medical Data Analyst to join our growing Implementation group, reporting to our Squad Lead. The ideal candidate will be responsible for ensuring the successful implementation of new clients and analyzing both historical and real-time client data while supporting the on-going configuration of Nym’s CLU engine according to the client’s needs and specifications.\nAs a Medical Data Analyst, you will:\nAnalyze and understand clients’ business objectives and needs while customizing Nym’s CLU engine accordingly.\nEnsure the successful integration of Nym’s products for the client.\nSupport Nym’s clients throughout the technical integration process, including identifying bugs and recommending fixes and improvements.\nWork with our multidisciplinary R&D team (Software Engineers, Linguists and Medical Doctors, Product team, and Customer Success team.\nProvide technical solutions for alerts and incoming escalated tickets from our customers, including extensive troubleshooting and root cause assessment.\nFind workarounds and solutions for technical challenges – doing whatever it takes for the customer to get the best service out of our product.\nPerform configuration changes, deployments, and product expansions for our customers.\nDevelop automation tools and scripts to make your work more efficient.\nRequirements:\n\nHands-on SQL or Pandas skills.\nFamiliarity with medical terminology.\nAbility to work as part of a team in a fast-growing start-up.\nHigh performer in challenging situations.\nFluent in English – both written and spoken.\nPython knowledge and experience- Strong advantage.Report"}, {"company": "Finaro", "job": "BizOps Analyst - Student", "city": "Herzliya", "date": "30d+", "rating": "4.6", "link": "", "description": "Finaro is a global cross-border payment and banking solutions provider empowering international commerce through brilliantly simple payments.\nOur passionate team, exceptional tech capabilities, product innovation, and customer-centric approach drive us to simplify complexity and create multidimensional solutions that generate growth and give our customers peace of mind. At Finaro we manage critical internet-scale finance transaction services. Stability is a core value, and the BizOps analyst’s main responsibility is to deliver information-based analytics to achieve stability.\nAs part of our continued growth, we are looking for a BizOps Analyst student (60%).\nIn this role, you will operate Finaro’s core systems, analyze data lakes, build new monitoring methods and deliver better visibility and stability to Finaro’s information services.\nResponsibilities:\nDevelop methods with IT and business units to support the information system’s stability.\nMonitor business applications’ health using a variety of technologies.\nBecome an application expert and support business issues and bugs around it\nBuild Kibana (ELK) base dashboards and SQL-based reports.\nAnalyze systems malfunctions in real-time using multiple analyzing and Big data tools.\nProduce Root Cause Analysis post incidents and manage the process of proper fixes and future mitigation.\nManage real-time incidents, communicate with IT operators, Business users, and management, act as a focal point and lead the incident to proper resolution in the most responsible manner.\nRequirements:\n\nAnalyst - Strong analytical skills with the ability to collect, organize and analyze significant amounts of information with accuracy.\nStrong problem-solving skills and attention to details\nSQL - mandatory. Firm knowledge in SQL coding.\nKibana – knowledge in Kibana analysis, create reports/dashboards - advantage\nResilient – be able to sustain critical incidents.\nPossess excellent organizational and interpersonal communication skills.\nWorking in a Production environment – a strong advantage\nB.Sc. in Industrial Engineering/math/information system or other quantitative fieldsShow more Report"}, {"company": "Rewire", "job": "Data Analyst Engineering Entry-level Full-time Details", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=108&ao=1136043&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_601c7fdc&cb=1678899733902&jobListingId=1008283064863&jrtk=3-1-1grj3hp9gm6rr801-1grj3bp2uhaol800-3a90945e160c43f3-", "description": "Rewire is a young and dynamic start-up creating an International Financial Services Platform for migrants. Rewire provides a game-changing, all-in-one, transparent, cost-effective, and simple solution. The BI team supports the firm's growth plans and enhances its position as a market leader.\nWe are looking for a business analyst who lives and breathes data to join our BI team and become our Israel business unit department analyst!\nSomeone eager to learn and with a true passion for the data industry. Can see beyond numbers, ask the right business questions and is curious to investigate and gain insights, ready to solve problems and identify trends and opportunities. As a Data Analyst, you will directly impact the company’s business performance by delivering valuable insights and analysis.\nYou will:\nWork closely with multiple departments, translate complex data into actionable insights, and identify areas of optimization and growth.\nProvide analytical support for management’s decision-making.\nDesign and create BI dashboards, reports, and ad-hoc analyses to provide insights and business performance monitoring.\nWeekly cadence of Biz readings both wide and deep dive to support our Biz decisions.\nReal time view to help us monitor our IL activity and performance.\nSupport Biz model creations and potential Biz opportunities.\nWork closely with the Marketing, Community team and CX team to process and provide insights to customer behavior and preference.\nCreating and maintaining with the Community team, Product and Marketing competitive analysis framework to monitor our position in the market, possible threats and opportunities.\nMaintain our unit economics view and management.\nREQUIREMENTS\nB.Sc. in Industry & Management, Mathematics, Statistics, Economics or equivalent\n2-3 years experience working as a data-analyst or business analyst.\nExperience working with BI visualization platforms (Looker, PBI, Tableau etc.)\nBasic sql knowledge.\nAble to model and transform data and present data in a useful business context.\nBusiness oriented view.\nAbility to translate business requirements into technical requirements.\nStrong \"storyteller\" that can leverage data and analytics in a business environment to influence decision making\nIndependent\nExcellent communication skills with fluent English - MUST\nAdvantage:\nHands-on experience with Looker.\nExperience working in the fintech industry.\nKnowledge of statistics and experience using statistical packages for analyzingShow more Report"}, {"company": "Datagen", "job": "Data Analyst", "city": "Tel Aviv-Yafo", "date": "3d", "rating": "4.0", "link": "", "description": "At Datagen, we’re simulating the world for producing high-performance synthetic data to develop the next generation of computer vision AI applications. We work with some of the most innovative companies in the world in domains like automotive, AR/VR, home security, robotics, retail, and more. We’re looking for talented people who want to take a key part in pushing forward this amazing new technology.\nWe are looking for an experienced Data Analyst to join our team. As a Data Analyst, you will work closely with the different teams to proactively find and act on existing opportunities, using the most powerful resource - data. You should have a strong analytical background, high proficiency in SQL and data visualization, and a strong understanding of business processes. You can tell the story behind complicated numbers in a simple way, and use quantitative analysis methods to do so exceptionally.\n\nIn this role, you will:\n\nExtract and analyze datasets using BI tools to drive key business decisions.\nBuild reports, dashboards, and metrics, in addition to monitoring the integrity and validity of the data reported.\nUse Snowflake to build ad-hoc queries to investigate the underlying data and provide on the go answers.\nSee beyond numbers and help to inform, influence, support, and execute our business decisions.\nIdentify data anomalies and make recommendations to support new and existing business processes.\nUncover actionable insights and make recommendations that will influence the company's strategic and tactical decisions.\nMonitor key metrics, identify business trends and forecasts.\n\nFor this role, you must have:\n\n3+ years of experience as a Business/Data Analyst or a similar role (preferably with a B2B).\nBachelor’s degree in a quantitative field (e.g. engineering, sciences, math, statistics, business, or economics).\nFully proficient in SQL and MS Excel, with high-level analytical and problem-solving skills, and exceptional attention to detail.\nStrong data reporting and visualization experience (e.g. Tableau,Qlik Sense, PowerBI).\nExperience in analyzing data to draw business-relevant conclusions and actionable insights to a range of stakeholders.\nAbility to work independently as well as in a team and manage multiple tasks simultaneously.\nStrong written and verbal communication skills in English.\n\nEven better if you have:\n\nExperience with Tableau.\nExperience with Snowflake or other cloud-based services.\nExperience with Python, R, or any other scripting language.\nDatagen is committed to being an equal-opportunity employer. All applicants will be considered without regard to race, color, gender, sexual orientation, religion, disability, or any other characteristic protected by law.Show more Report"}, {"company": "Ingima", "job": "Data Analyst", "city": "Raanana", "date": "2d", "rating": "3.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=110&ao=1110586&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_8d894ae3&cb=1678899737168&jobListingId=1008525852491&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj3hsg2jm57801-1grj3bp2uhaol800-8f714cf22edf7a8e--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tGRBbjy15RxGdG2GQysKyHDEIcoXvHl9O50tv3NEsNCTVeJmfwicpsIeQGSIXPnrXAVsjK2nZOVd0-muHCtm4gXfoZC79YF15iychy9cLDa-aekVWSOUVC2ZkNXxz-A7r3LcVIP67d696QpjN0y3b9nXIt91Q8_wkzW6PBeUwTZnUac2bNJhteEhvgap1WaWbsPBw_uHDB8E0ehOt5mJo4g9WQsmEpdom8iTrMuqHmSmt-MLNAw1t_d5lK08bGedN2hAPNvdFc82F0wLQ5mB60igfQbO6YRLPxhKx2SntFjlYEJhl9a8BwTm1cQiYlENyPyBDLXyPNefby6UMgCeBv0X9ZjSK2lsKWefYX4fSGZs_OSa6hlWlVVhsh9CG0mF5oIVQy46B2wCaswqtaOFnuhxHpFwJvU1UMlKLo8apNTEMUC7BNG3Rzf5YeuS2zXOZqb_kGpZ-s4mDGxcKR2xFD-d_0Y17bi8_qi3wI3rqWW4p1fQSWMyJqhPotI1qo-qU5_-Eef-fQ4qNqtHjetEVvmPsJe6X1IiJw4XLGnPvvsYWPz88Hd6TTFnxe_Z89UkwhIB8ceoO6_9oE5llO0u1z4mav3tppWchU1eSGm2ufsuVKMB9eWQkA4kn80foTDYDf5tjga3cTfMp64-4AmwnCDhHFNE-cQqBwPbFBTG7rn_mzzm5swTT4c%3D", "description": "העובד/ת י/תשמש כאנליסט/ית בצוות אנליזה וניהול המידע באגף מערכות מידע, בכפיפות לר\"צ אנליזה וניהול המידע. האנליסט/ית י/תהיה אחראי/ת על שליפות מידע וניתוח הנתונים עבור המנהלים הבכירים במטה ובארגון מכלל החטיבות (רפואה, תפעול, סיעוד ושירות/שיווק), וכן הוספת תובנות עסקיות מתוך ראייה תהליכית רחבה. העובד/ת י/תהווה אוטוריטה מקצועית בנושא כריית הנתונים (נאמן מידע) במחלקת דאטה ואנליטיקה עבור כלל האנליסטים בארגון. הגדרת דרישות עסקיות מול לקוחות והפקת מידע רלוונטי בהתאם לדרישות, מתוך הבנה לעומק של התהליכים העסקיים הקיימים בארגון, וכן ראייה רחבה לצורך מענה מיטבי ומדויק.\n\nניתוח נתונים בהתאם לדרישה וכן פרו-אקטיבי על ידי כריית נתונים, ניתוחם ויצירת תובנות עסקיות ללקוח היכרות מיטבית עם מחסן הנתונים וביזור המידע בארגון לכלל האנליסטים בארגון יישום והטמעת מתודולוגיות עבודה ובקרה על שלמות המידע שימוש נרחב בכלי SSBI השכלה אקדמאית במדעי המחשב / בהנדסת תוכנה/ הנדסת תעו\"נ / מתמטיקה / הנדסאי תוכנה - חובה ניסיון קודם של שנתיים לפחות כ-DATA ANALYST - חובה ידע וניסיון מוכח ב- SQL ברמה גבוהה (כולל שאילתות מורכבות, פונקציות שונות) - חובה ידע וניסיון מוכח ב-Excel ברמה גבוהה (VLOOKUP, נוסחאות מורכבות וכו') - חובה הכרות עם כלי תחקור שונים (PowerBI, Qlik וכו') - יתרון ידע וניסיון ב-Python - יתרוןShow more Report"}, {"company": "MalamTeam3", "job": "Business data analyst", "city": "Tel Aviv-Yafo", "date": "27d", "rating": "3.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=111&ao=1110586&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0ea3e6dd&cb=1678899738628&jobListingId=1008475909124&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj3htttk25d801-1grj3bp2uhaol800-225ba89e87d45367--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNCafcKOCh7xil9QVsxtDpwCG97ACljwkYsvcgMyMmktwkMWaZdvEyWFkBwT_93fQ9crX0MX4g3SclxcnCESPQ9-godjtzGF1OXURQpipN_TIL83HkiR9zZpupkH81ZLf7uxTH2G540k-3igcV8IaKiszYKi3zZNsoQeuCA1nfR11BRtam1uUi0DftLveQkK83bSnsKWh5yYJfYchMk6XpaX-hluOk70tO4ds0jaFvEKq1ivzihGgUJrjbe1ZNJIAN_cznMq2Cv27yvn92fq7sLOz1I0wGpppAZfRy4EXxAGsBSIqJkTxbdsRmERMy7ozWkV8TYsn9GChjrJoi2WHcnVjiQq4rYPGATmuFqQt0qxh-QukYKmhiE0gQFjWbYKJbEt5Tl1G4f4w9SQPQeXC5fvvU_Mjraod1KeefFGwOu9ZfT-7aIxfppqyD6nMLXQoMlRzF4mbHKuK6NkBK4YfVzpr8bJiHdS1V_gOp-ai2mMb3HNnb9_1fTeVsez5owzAqHwRIPELM50rUemrGJkiA77AExaAQmiwHSJmVJOXihZXkAPMUDyF1BO9igsms4GvjVBasHZlMoQE43hcZjPuijb2q5yhXz33TAOBIgOcz8Xuz2Bz8UuDMZXr_WU2mgSaCZwiwv4CCt9uu9UMYsQfill5yC2r6_2PXw%3D", "description": "ארגון פיננסי מוביל בתחומו במרכז מחפש Business data analyst למחלקת ה-Bi. התפקיד כולל פיתוח והפקת דוחות ב-Bo ובאקסל, שליפת נתוני שאילתות מידע מורכבות מבסיסי נתונים שונים. כמו כן, פיתוח דשבורדים למשתמשים העסקיים ואפיון צרכים של משתמשי הדוחות. - ניסיון של שנתיים לפחות ב-SQL - ניסיון של שנתיים לפחות בניתוח נתונים - ניסיון של שנתיים לפחות באקסל ברמה גבוהה ובoffice -ניסיון של שנתיים לפחות בעבודה עם בסיסי נתונים טבלאיים (יתרון לteradata)Show more Report"}, {"company": "", "job": "אנליסט | אנליסט נתונים Data Analyst", "city": "Petah Tikva", "date": "2d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=112&ao=1136043&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4fae1431&cb=1678899739866&jobListingId=1008523942322&jrtk=3-1-1grj3hv4hk61p801-1grj3bp2uhaol800-56a8343c0bef39be-", "description": "לחברת מי עדן דרוש אנליסט/ית נתונים!!!מקום העבודה:מטה החברה - פתח תקווהדרישות התפקיד:תואר ראשון באחד התחומים הבאים: כלכלה / מנהל עסקים / תעשיה וניהול חובה· שליטה גבוהה באקסל, power point, ניסיון בעבודה עם בסיסי נתונים גדולים חובה· ניסיון בעבודה עם כלי bi - יתרון להיכרות עם מערכו, power bi , tableau· יכולת אנליטית והסקת מסקנות ממספר רב של מאגרי מידע .· עבודה ולמידה עצמאית ומאומצת - חובה· אנגלית ברמה גבוההשעות עבודה:משרה מלאה א'-ה'שעות: 08:00-17:00נדרשת נכונות לשעות נוספות במידת הצורךלפרטים נוספים ושליחת קוח|** לפנייה למשרה יש להגיש מועמדות **|Report"}, {"company": "Horizon Technologies", "job": "DATA ANALYST", "city": "Ramat Gan", "date": "30d+", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=1136043&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6a188e72&cb=1678899741372&jobListingId=1008348401229&jrtk=3-1-1grj3i0jek61k801-1grj3bp2uhaol800-b9947844f7dd57e9-", "description": "DATA ANALYST?? אנחנו מחפשים אותך!!!\n\nכאנאליסט תעזור ותתמוך בבניה וניהול מוצרי הליבה הדיגיטליים, תוך תמיכה בהמשכיות עסקית ,צמיחת החברה וסיפוק מענה לצרכי הלקוחות.\n\n\nתחומי אחריות:\n\nניתוח אנליטי שוטף של שכבות מידע (פאנלים) אנליטיות ומכלול מקורות המידע\n\nעבודה מול מערכות מידע בהגדרת הדרישות של שכבות מידע חדשות, אפיון וביצוע בדיקות לווידוא שלמות ואיכות נתונים\n\nשימוש בכלים טכנולוגיים שונים לחקר נתונים ויצירת תובנות אנליטיות, דוחות ודשבורדים\nעבודה מול אגפים עסקיים – ליווי, הכוונה ושיתוף בתוצרים ובתובנותShow more Report"}, {"company": "Sensi.ai", "job": "Data Analyst", "city": "Tel Aviv-Yafo", "date": "16d", "rating": "5.0", "link": "", "description": "About the role:\nThis role contains a critical component in AI-driven machine learning. We are looking for a precise and object-oriented individual in the quantitive field of data classification to join our team.\nOur insight is to train AI/ML algorithms to provide our clients with precise predictions.\nAs a data analyst, you will annotate, create and analyze various complicated datasets and draw intelligent conclusions to support our mission.\nRequirements:\n\nExperience of 2+ years with writing SQL queries\nExperience of 2+ years with Python (Pandas, NumPy)\nExperience in data tagging\nExperienced in work with 3rd party service providers\nGoals-oriented team player\nStrong analytical skills and knowledge of analytical strategiesShow more Report"}, {"company": "nSure.ai", "job": "Product Data Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "", "description": "nSure.ai is an advanced payment fraud prevention platform for sellers of digital goods, gaming, crypto, and fintech. Its bespoke ML models help merchants to realize their true business potential, increase revenue, decrease costs, minimize churn, and mitigate fraud expenses.\nAs a Product Data Analyst, you will proactively guide business growth based on data analysis and statistical research, and have a significant impact on decision making. Conduct end-to-end data analysis that includes requirement specification and data collection, pre-processing, analysis, in addition to owning ongoing deliverables and presentations.\nYou will explore and investigate creative solutions for a variety of unprecedented challenges with the objective of constantly improving performance. Develop processes and tools to monitor and analyze model performance and data accuracy as well as define KPIs to measure product and initiative performances.\nYou will take ownership by working independently as well as leading large projects with significant potential impact, through collaboration with internal stakeholders to ensure delivery of the intended outcomes.\n#LI-Hybrid\nRequirements:\n\nWhat you'll need to be a successful Product Analyst at nSure.ai:\nBachelor’s degree in Economics, Statistics, Industrial engineering or a related field.\n2+ years of experience as a product analyst - a must.\nDetail oriented.\nLoves working with numbers.\nSQL & Python experience\nPassionate about understanding how the business works, curious and eager to stay on top of changes in a fast paced business environment.\nProactive, independent and communicative.\nFast learner, natural curiosity and intellectual horsepower to deeply understand new topics and pick up new skills in a very short time.\nStrategic problem solver\nCreative, someone who is able to come up with different interpretations for the same data.\nLoves the startup spirit and would like to join the ride.Show more Report"}, {"company": "AlignTech", "job": "Data Analyst", "city": "Petah Tikva", "date": "1 day ago", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=1136043&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_96456ff3&cb=1678899749424&jobListingId=1008526257358&jrtk=3-1-1grj3i8euncdr801-1grj3bp2uhaol800-7f5fce202a8c0c49-", "description": "Join a team that is changing millions of lives.\nTransforming smiles. Transforming lives. Transforming an industry.\nAt Align Technology, we believe a great smile can transform a person’s life, so we create technology that gives people the confidence to take on whatever’s next. We revolutionized the orthodontic industry with the introduction of the Invisalign system, and we have never lost sight of that spirit of innovation. Our teams are constantly pushing the boundaries of what’s possible.\nReady to join us?\nAbout this opportunity\nThis role focus on learning from our install base, helping us improving our quality and customer experience.\nThe Data Analyst will turn data into information, information into insight and insight into business decisions. He/she will develop analysis and reporting capabilities, monitor performance and quality control plans to identify improvements.\nInterpreting data, analyzing results using statistical techniques\nDeveloping and implementing data analyses and data collection systems\nIn this role, you will…\nInterpret data, analyze results related to our install base\nUse statistical methods to analyze data and generate useful business reports\nIdentify, analyze, and interpret trends or patterns in complex data sets\nAcquire data from primary or secondary data sources working closely with BI team\nCreate dashboard and ad hoc reports to the customer satisfaction team\nFilter and “clean” data by working closely with the professional services team for NPI projects\nWork with management to prioritize business and information needs\nDefine new data collection and analysis process to improve our visibility to our Install base\nForecasting and preparations for long terms for service and business aspects\nImprove customers utilization by review trends and changes\nImplement new method and tools such as machine learning, Azure, etc, and look for opportunities for new technologies\nIn this role, you’ll need …\nProven working experience as a data analyst or business data analyst 1 years\nBSc in Mathematics, Economics, Computer Science, Information Management or Statistics or similar.\nKnowledge of and experience with reporting packages (Business Objects etc), databases (SQL etc), programming (XML, JavaScript, or ETL frameworks)\nKnowledge of statistics and experience using statistical packages for analyzing datasets (Excel, SPSS, SAS etc)\nStrong analytical skillswith the ability to collect, organize, analyze, and disseminate information with attention to detail and accuracy\nStrong communication skills, working with global teams and clearly presenting data and findings\nStrong technical knowledge and understanding of our platforms and flows\nKnowledge in Power BI/ Tableau or any other data visualization SW\nSW Develop skills – advantage\nExperience with Big Data – advantage\nFamiliar with Databricks / AWS services – advantage\nKnowledge of Python/spark – advantage\nSound like a good fit?\nGreat! Click the Apply link below to let us know you are interested. Not the right fit? Don’t worry, there are lots more opportunities. Please consider sharing this opportunity with others in your network.\nAbout Align\nInvisalign clear aligners, iTero Intraoral scanners, and OrthoCAD digital services that help dental professionals achieve the clinical results they expect and deliver effective, cutting-edge dental options to their patients.Show more Report"}, {"company": "ONE ZERO Digital Bank", "job": "QA Data Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.5", "link": "", "description": "One Zero is looking for an individual with a strong attention to detail and a passion for customer service to join our dynamic team as a Quality Assurance (QA) Data Analyst. The successful candidate will be responsible for executing manual tests, analyzing results, reporting observations, and collaborating with cross-functional teams such as Back Office and Engineering to improve our internal products. The role will evolve as the candidate grows with the company.\n\nRequirements:\n\n2+ years of recent experience in data qualityStrong attention to detail and ability to analyze edge casesProficient in SQL, including complex queriesExtensive experience with REST APIs and advanced querying of search enginesStrong technical skills and knowledge of computers and smartphonesIn-depth understanding of end-to-end processes and the data flow through themMultitasking and excellent time management skillsStrong communication skills, both verbal and writtenLogical and critical thinking skillsIndependent and solution-oriented approach\nResponsibilities:\n\nConduct and supervise manual tests for customer insightsIdentify and track defects from discovery to resolutionPerform data analysis using SQL on data and insightsProvide primary support for all QA aspects of releases, testing for internal clients, and coordinating QA resources internally and externallyWork with data warehouse architects, data scientists, and backend developers in developing and executing test scenariosAssist the Customer Success team with investigationsParticipate in daily stand-up meetings and document processes\nAdvantages:\n\nFintech experience, particularly in the banking domainShow more Report"}, {"company": "One1", "job": "Data Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=118&ao=1136043&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6b6d8872&cb=1678899752321&jobListingId=1008411843849&jrtk=3-1-1grj3ib9pk24q801-1grj3bp2uhaol800-797c8f6b1c2dcb40-", "description": "BI/BIG DATA\nתל אביב\n38628\nאנחנו מגייסים עם מעל שלוש שנות ניסיון לצוות ה-BI שלנו! אנחנו מגייסים\nאנחנו מגייסים עם מעל שלוש שנות ניסיון לצוות ה-BI שלנו!\n\nאנחנו מגייסים דאטה אנליסט.ית עם הבנה עסקית ויכולת ניתוח גבוהה\nהתפקיד כולל איפיון צרכי משתמשים וכתיבת מסמכים עסקיים וטכנולוגיים.\nבניית אלגוריתם עסקי וסטטיסטי תפקיד המשלב עבודה עצמאית\n\nדרישות התפקיד:\nמינימום שנתיים ניסיון מעשי בפיתוח והרצה של מודלים סטטיסטים\n-SQL ברמה גבוהה - לפחות 3 שנות ניסיון\n-3 שנות ניסיון עם מערכת BI (יתרון ל- Tableau, Power BI)Show more Report"}, {"company": "Octopol", "job": "Data Analyst", "city": "Raanana", "date": "30d+", "rating": "3.6", "link": "", "description": "Octopol is a pioneer company that integrates statistics modules and algorithms with a passion to sports, mainly soccer.\nWe are looking for a data analyst to join our research department. The data analyst function will support several stakeholders in Octopol.Working with the research team and be the one to look and understand the bigger picture.Learning the data gathering mechanism.Face and solve business problems by analyzing data and provide insights to the business, covering a range of topics.Develop complex logic flows to identify predefined events and generate desired insights.Support the researchers on their projects.Responsible for conducting both recurring and ad hoc analysis for business stake holders.Research and integrate new tools and methods to enrich datasets.\nRequirements:\n\nRequirements+2 years of experience as Data Analyst.High hands-on SQL skills (MySQL, SQL server)background in programming (R or Python).knowledge in statistics.\n Added bonuses if you have:interest in FinTech, Algo Trading – a big advantage.interest in sports (soccer in particular)Show more Report"}, {"company": "accessiBe", "job": "Data Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.7", "link": "", "description": "accessiBe is the market leader in web accessibility, making websites accessible to people with disabilities. As we grow, we are looking for a Data Analyst to join our Growth Division. As the first analyst in our company, you will be responsible for defining and executing various analysis projects, assisting different teams in the Growth, Sales, and Marketing department, identifying trends, presenting business opportunities, and evaluating other activities according to our business KPIs.\nWant to make a real impact? Click here and find out how!\n\nClick here to learn more about accessiBe's #companyculture\n\nWhat you'll be doing:\nBuild and maintain reports, dashboards, and KPIs to monitor performance.\nWork closely with different departments to understand their data needs, and present solutions.\nUse data from different marketing and sales platforms to perform complex analysis projects\nFind technical solutions for cross-platform data deficiencies, and own implementation and execution\nRequirements:\n\n3-5 years of experience in Data analysis, preferably in a SAAS company - A must\nFamiliarity with B2B and sales-related metrics\nHigh familiarity with Salesforce - A must\nFamiliarity with different marketing platforms such as Google Ads, Google Analytics, Facebook etc - A strong advantage\nStrong technical orientation, ability to work with technical teams on data-related tasks\nSelf-learner, Self-starter, problem-solver\nExcellent written and verbal communication skillsShow more Report"}, {"company": "Identiq", "job": "Fraud Data Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.8", "link": "", "description": "We are looking for experienced Fraud & Data experts to join Identiq’s Analytics team!\nIdentiq’s Fraud Analytics team is key to the success of Identiq and our customers. In this role, you will be best positioned to impact our product and how our customers benefit from it.\nIf you are excited about data and love to have a significant impact wherever you are, then come help us transform how fraud risk management is done around the world!\nRequirements:\n\n2+ years experience working with and analyzing large, complex data sets\n2+ years experience in fraud and risk management - an advantage\nHands-on experience with SQL and R/Python\nA customer-oriented, collaborative and proactive attitude\nVery high proficiency in English - verbal and written\nExperience in working with Sales teams - an advantage\nWillingness to travel abroad occasionally\nAbility to work in flexible hours\nResponsibilities:\n\nIn the first 6 months, your main mission is to successfully show the value of our product by running evaluation analyses with our strategic clients.\nIn your role, you will be working with customers, development, and customer success teams, to guarantee the successful onboarding and fraud prevention benefits of Identiq’s customers while providing insight to the Identiq product and development teams.\nDuring this time, your day-to-day will include the following challenges:\nPerform comprehensive analysis in order to demonstrate the benefits of the Identiq network to our strategic customers.\nWork with the Risk teams of our strategic customers to help them fully onboard into the network and make sure their use of it is optimal\nFind creative solutions to complex problems, involving a deep understanding of both technical, business, and analytical objectives\nIdentify, prioritize, track, and communicate data issues internally and externally\nCollaborate with a team of A-player analysts and engineers to help develop the next generation of Identiq’s solutions\nAs Identiq moves into later product stages, our team’s mission will expand to supporting other analytic domains according to company needs (research, client support, etc), and your knowledge and drive will guide our product’s evolution.\nAbout Us:\n\nIdentiq is a fast-growing startup set to change the fraud prevention and identity verification market. Unlike traditional identity verification vendors, the Identiq protocol can validate users’ identities without exposing any personal data whatsoever, guaranteeing absolute end-user privacy. The largest companies in the world are joining us these days to form the first fully anonymous global identity verification network. Imagine companies being able to treat new customers as if they have been knowing them for years while creating a better user experience.\nWhy join Identiq?:\n\nWe are creating the world’s first network for Anonymous User Verification, a brand new paradigm in the fraud-fighting space\nYou’ll get the chance to work with a highly experienced and knowledgeable team, dedicated to helping foster your personal and professional growth\nWe strive to do what is right, even if it’s not what is easy, and we absolutely love itShow more Report"}, {"company": "Healthy.io", "job": "Data Analyst- Maternity Leave Replacement", "city": "Tel Aviv-Yafo", "date": "22d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=122&ao=1136043&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_27163349&cb=1678899759079&jobListingId=1008483203800&jrtk=3-1-1grj3ihquk61u801-1grj3bp2uhaol800-e724e70f55b7418e-", "description": "About the position\nHealthy.io is the first company to successfully turn the smartphone camera into a clinical-grade medical device, enabling faster treatment and improved care for patients worldwide. Our products combine computer vision and machine learning technology with best-in-class UX design to create new clinical pathways through smartphone-powered urinalysis, digitized wound management, and beyond.\nHeadquartered in Tel Aviv with 250 employees across London and Boston, we are growing fast as we serve more and more patients across ever-expanding areas of healthcare.\nWe are seeking a data analyst to join our research group and assist in the development of cloud and edge device solutions. The ideal candidate will provide data insights to support the optimization of our products and user experience, as well as manage our in-house annotation team. We are looking for a team player with strong analytical and problem-solving skills.\nImportantly, successful candidates should be able to handle viewing and analyzing medical images.\nRequirements\n2+ years of experience as an analyst of user-facing products or similar roles.\n2+ years of hands-on experience writing SQL queries and working databases\n1+ year of hands-on experience with data visualization tools\nCapable of developing quantitative KPIs to support product decisions\nAbility to understand complex data and turn it into actionable insights\nStrong written communication and story-telling skills in English\nCapacity to multitask and prioritize effectively, working cross-function with other teams, and thriving in a high-pressure environment\nPreferred Qualifications\nExperience with Tableau\nExperience with the product life-cycle / working with Product teams\nExperience with BigQuery\nExperience scripting in Python\nRole & Responsibilities\nBe the focal point for all data-related tasks within the Research Group\nOwn the communication with the annotation team and manage their workflow\nWork closely with other members of the group to create dashboards and reports across our products\nPerform ad-hoc performance analysis of new algorithms to support product and business decisionsReport"}, {"company": "Finonex", "job": "Product Data Analyst", "city": "Herzliya", "date": "30d+", "rating": "3.8", "link": "", "description": "We are growing and looking for a brilliant Data Analyst to join our fast-growing company and Data department.\nAs part of this position, you will work closely with multiple business units/products which are from Finonex's internal innovation home or post Acquisitions products.\nYou will support all analytical needs of these units, such as: defining the analytical layer, marketing & product analytics needs, and mostly on business questions.\nRequirements:\n\n3+ years of experience as a business analyst (online industry advantage)\nVast knowledge and hands experience in SQL including complex queries from multiple data sources- Must\nExpert level with reporting platforms and data visualization - Must (Pyramid strong advantage)\nExcellent analytical skills\nHigh presentation and communication skills\nFluent in English communication, written and verbal.\nOn this role you will:\n\nSupport several different units and products by nature\nData analyst focal for Business units & engineering related teams\nProactively provide insights that will lead the business growth\nAbility to module and simulate new features & opportunities estimated impact\nBuild and maintain reporting and dashboards\nManage multiple tasks at a time in fast-paced\nConduct deep dive analysis with actionable recommendations and conclusions\nWill be nice that you have:\n\nExpert level in working with Big data tools (advantage)\nExperience with GA and Product analytics tools (Mixpanel/ Amplitude/Heap)\nExperience in the online industryReport"}, {"company": "Tectu", "job": "Data & BI Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=124&ao=1136043&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_126091ac&cb=1678899762668&jobListingId=1008401770511&jrtk=3-1-1grj3ilchklui801-1grj3bp2uhaol800-9521be01e6a16bea-", "description": "Tel Aviv, Israel\n\nJob Type:\n\nPart Time\n\nAbout the Company\nAt Tectu, you can make a real impact! As a Data & BI Analyst you will play a lead role in delivering data and business strategies, solutions and processes to support the data oriented projects. The ideal candidate is passionate about delivering cutting edge solutions to support the changing business needs and technology landscape. You will be working closely with others on our Product and Engineering teams to define and deliver these solutions.\nIf you are data obsessed, passionate about technology, self-motivated and a disciplined freelancer, we would love to speak with you. The ideal candidate has both a willingness and desire to work in a dynamic environment, is able to apply Agile methodologies in day-to-day activities, and who enjoys working both independently with little oversight and in a team environment.\nAbout the Role\nAt Tectu, we work with various customers, providing advanced tech solutions to solve different problems and needs. As a Data & BI analyst at Tectu, your day will most likely vary according to which projects you’re involved in, but generally you’ll be performing the following activities:\nIdentifying or diagnosing a problem to analyze\nCollecting appropriate data from various sources\nCleaning and preparing the data for analysis\nAnalyzing the data for insights, patterns, or trends\nInterpreting the results of the analysis with reports and dashboards\nCollaborating with stakeholders and presenting key findings\nResponsibilities:\nBe an integral part of the team defining data strategy and capabilities roadmap for various customers\nWork closely with data engineers to effectively plan and build data engineering tools, data warehouses and data lakes\nProvide core contributions to multiple products, projects, solutions and processes through all stages of the development lifecycle\nPerform analysis to assess quality and meaning of data\nUse statistical tools to identify, analyze, and interpret patterns and trends in complex data sets that could be helpful for the diagnosis and prediction\nUse data visualization tools (e.g. Tableau, PowerBI, Looker, Qlik) to build dashboards and drive insights\nAnalyze local, national, and global trends that impact both the organization and the industry\nPrepare reports for the management stating trends, patterns, and predictions using relevant data\nQualifications\nRequirements:\n5+ years of experience as a Business Intelligence Analyst and Data Analyst\n2+ years of experience in advanced analytic related multivariate and A/B testing, digital revenue attribution, cohort analysis, lifetime value analysis, media mix optimization, customer segmentation, and marketing effectiveness\n3+ years of experience working with data visualization tools, such as Tableau, PowerBI, Looker, QlikSense, etc\nStrong mathematical skills to help collect, measure, organize and analyze data\nStrong analytical skills and SQL proficiency\nTechnical proficiency regarding database / DWH design development, data models, techniques for data mining, and segmentation.\nProficiency in statistics and statistical packages to be used for data set analysis\nAdept at using data processing platforms like Spark & Presto\nKnowledge of how to create and apply the most accurate algorithms to datasets in order to find solutions\nAccuracy and attention to detail\nAdept at queries, writing reports, and data visualization\nSoft Skills:\nStrong work ethic and strong core values (honesty, integrity, creativity)\nSense of urgency, ownership mindset, and customer focus\nInnovative problem solver who takes initiative never stops thinking about ways to improve\nAbility to self-learn new skills and technologies\nAdvantage:\nBSc in highly-quantitative field (Analytics, Computer Science, Industrial Eng, Mathematics, EE) is preferred\nData driven mindset\nAble to create and communicate the 'big picture' in a clear way.\nFamiliar with best practices of the data and software engineering lifecycle\nKnowledge of programming languages like Python, R, MATLAB, or otherReport"}, {"company": "Wix", "job": "Performance Analyst", "city": "Tel Aviv-Yafo", "date": "10d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=125&ao=1136043&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_648d59a6&cb=1678899764446&jobListingId=1008509563844&jrtk=3-1-1grj3in4bncfv801-1grj3bp2uhaol800-c622c305ab3cde28-", "description": "We are:\n\nWix’s Acquisition team. We’re a dynamic, dedicated and fun group that plays a crucial role in Wix’s online marketing efforts to introduce new users to Wix’s incredible suite of products. Our efforts attract over 200 million active users and we continue to add 2 million new users every month. We’re looking for a passionate Online Performance Analyst who can help us leverage data analytics and shape and enhance our online advertising strategy.\n\nYou are:\n\nAn analytical expert with a head for numbers, and you're not afraid to dive into data to uncover insights. Your goal-oriented approach and ability to work independently make you a valuable asset to any team. You’re passionate about the power of analytics and believe that data should inform decision-making processes. Your ability to identify and pursue new business opportunities sets you apart from others in your field.\n\nBonus points if you’re an expert in Excel.\n\nAs a PPC Analyst, you will:\nManage PPC advertising campaigns on Google AdWords, Facebook, and other platforms, translating the outcomes into easy-to-understand results\nAnalyze results and optimize performance according to various KPIs\nCultivate fresh ideas and discover new opportunities based on big data analysis\nStay up-to-date with the latest Google AdWords/Facebook Advertising features and integrate applicable ones into the team’s strategy\nDraw on the data to spearhead relevant initiatives that support business objectives\nApply NowShow more Report"}, {"company": "Similarweb", "job": "Data Analyst - Advisory Services", "city": "Tel Aviv-Yafo", "date": "22d", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=126&ao=1136043&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ac64affc&cb=1678899766687&jobListingId=1008483242429&jrtk=3-1-1grj3ipa7k619801-1grj3bp2uhaol800-06a6560bdbfd2026-", "description": "Similarweb is the leading digital intelligence platform used by over 3500 global customers. Our wide range of solutions power the digital strategies of companies like Google, eBay, and Adidas.\n\nWe help our customers succeed in today's digital world by giving them access to data-driven insights, competitive benchmarks, strategic analysis, and more.\n\nIn 2021, we went public on the New York Stock Exchange, and we haven't stopped growing since!\n\nWe are looking for a Data Analyst !\n\nWhat does the day to day of a Data Analyst (Advisory Services) at Similarweb look like:\n\nApply your expertise in quantitative analysis and data mining to turn data into insights.\nConduct research and develop tools which will help answering client's' business questions by using Similarweb's raw data sets and algorithms.\nCreate custom reports according to strategic clients business needs.\nPartner with Engineering teams to establish an infrastructure to scale solutions.\nPartner with Advisory Services team of Consultants to answer strategic business questions and deliver custom data products seamlessly\n\nWhat will I bring to the team?\n\nAt least 2 years experience with SQL for data analysis - Must\nExperience in Python scripting - Must\nExcellent verbal and communication skills (in English) - Must\nHadoop/Spark/AWS Infrastructure experience - Big Advantage\nProficiency in Online Marketing/Online Services- Advantage\nAt least 2 years work experience in Online/Tech Company - Advantage\nTeam player, autodidact, fast learner with excellent analytical, research and business skills.\n\nWhy you'll love being a Similarwebber:\n\nYou'll actually love the product you work with: Our customers aren't our only raving fans. When we asked our employees why they chose to come work at Similarweb, 99% of them said \"the product.\" Imagine how exciting your job is when you get to work with the most powerful digital intelligence platform in the world.\n\nYou'll find a home for your big ideas: We encourage an open dialogue and empower employees to bring their ideas to the table. You'll find the resources you need to take initiative and create meaningful change within the organization.\n\nWe offer competitive perks & benefits: We take your well-being seriously, and offer competitive compensation packages to all employees. We also put a strong emphasis on community, with regular team outings and happy hours.\n\nYou can grow your career in any direction you choose: Interested in becoming a VP or want to transition into a different department? Whether it's Career Week, personalized coaching, or our ongoing learning solutions, you'll find all the tools and opportunities you need to develop your career right here.\n\nDiversity isn't just a buzzword: People want to work in a place where they can be themselves. We strive to create a workplace that is reflective of the communities we serve, where everyone is empowered to bring their full, authentic selves to work. We are committed to inclusivity across race, gender, ethnicity, culture, sexual orientation, age, religion, spirituality, identity and experience. We believe our culture of equality and mutual respect also helps us better understand and serve our customers in a world that is becoming more global, more diverse, and more digital every day.Show more Report"}, {"company": "InspHire", "job": "Product Data Analyst", "city": "Herzliya", "date": "30d+", "rating": "5.0", "link": "", "description": "We are looking for a product data analyst to join an international game development company founded in 2009, dedicated to creating the best mobile and social experience for hardcore and casual gamers worldwide. With over 250 million registered users, this company is consistently ranked among top game developers.\nThe company employs more than 1,500 individuals worldwide and is headquartered in Herzliya Israel, with eight offices and development studios across Europe and the United States. The company's games are available on iOS, Android, and all major social networks.\nThe Business Performance department is responsible for enhancing the business success of the company by ensuring excellence in the performance on all business aspects including marketing, games & product design, retention, monetization, etc. The department builds, operate, and optimize the processes across the entire company through the top of the art analytical capabilities & product understanding.\nResponsibilities\n• Leverage data to understand the company's products in depth, identify areas of opportunity, and execute projects to drive growth and engagement of the company's users\n• Work closely with the product teams to analyze existing features and ensure a successful implementation of new features.\n• Use data to fine-tune and balance the game’s economy, providing economy analysis and drive metrics for revenue optimization\n• Evaluating and measuring A/B testing results and trends among players\n• Build and maintain reports, dashboards, and metrics to monitor the performance of products\n• Be an expert on industry trends and the competitor landscape to evolve the company's thinking\nWhat we expect\n• 2+ years of experience in product analytics in the Online/Gaming industry\n• BA/B.Sc. in Statistics / Math / Engineering / Economics or other quantitative fields\n• Strong SQL with experience in querying large, complex data sets.\n• Strong Excel skill\n• Advanced knowledge in statistical tools and models- advantage\n• Proven experience leading data driven projects from definition\n• High level of analytical and problem-solving skills with strong attention to details\nDesired\n• Experience working with Qlikview – advantage\n• English: Advanced\n• Core competencies: Professionalism, Responsibility, Collaboration and Teamwork, Initiative and Creativity\nPersonal Requirements:\n• Ability to collaborate with colleagues across different disciplines and locations to achieve results\n• Passion for gaming\n• High level of verbal and written English.Show more Report"}, {"company": "Credorax", "job": "BizOps Analyst", "city": "Herzliya", "date": "30d+", "rating": "4.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=128&ao=1136043&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_49d5ceda&cb=1678899770616&jobListingId=1008328375499&jrtk=3-1-1grj3it3ijfmj801-1grj3bp2uhaol800-0c5b6b8dc30970ab-", "description": "Location: Sapir Street 6, Herzliya, Israel\nAre you brilliant?\nFinaro is reimagining the payment industry.\nIf you value friendship, learning, and getting things done; if you consider yourself creative, enthusiastic and passionate about solving problems – We want to meet you!\nFinaro is a global cross-border payment and banking solutions provider empowering international commerce through brilliantly simple payments\nOur passionate team, exceptional tech capabilities, product innovation, and customer-centric approach drive us to simplify complexity and create multidimensional solutions that generate growth and give our customers peace of mind.\nWe work with some of the biggest industry giants including Plus500, WOLT, Kiwi.com, Air Baltic, Payrexx, Revolut, Go2Mobile and Hero Gaming. With a growing global staff of 350 employees, main offices in Israel and Malta, and presence all across Europe, in China, Hong Kong, and North America, the future looks fantastic.\nThe future looks Finaro.\nDescription\nFinaro is a global cross-border payment and banking solutions provider empowering international commerce through brilliantly simple payments.\nOur passionate team, exceptional tech capabilities, product innovation, and customer-centric approach drive us to simplify complexity and create multidimensional solutions that generate growth and give our customers peace of mind. At Finaro we manage critical internet-scale finance transaction services. Stability is a core value, and the BizOps analyst’s main responsibility is to deliver information-based analytics to achieve stability.\nAs part of our continued growth, we are looking for a BizOps Analyst student (60%).\nIn this role, you will operate Finaro’s core systems, analyze data lakes, build new monitoring methods and deliver better visibility and stability to Finaro’s information services.\nResponsibilities:\nDevelop methods with IT and business units to support the information system’s stability.\nMonitor business applications’ health using a variety of technologies.\nBecome an application expert and support business issues and bugs around it\nBuild Kibana (ELK) base dashboards and SQL-based reports.\nAnalyze systems malfunctions in real-time using multiple analyzing and Big data tools.\nProduce Root Cause Analysis post incidents and manage the process of proper fixes and future mitigation.\nManage real-time incidents, communicate with IT operators, Business users, and management, act as a focal point and lead the incident to proper resolution in the most responsible manner.\nRequirements\nAnalyst - Strong analytical skills with the ability to collect, organize and analyze significant amounts of information with accuracy.\nStrong problem-solving skills and attention to details\nSQL - mandatory. Firm knowledge in SQL coding.\nKibana – knowledge in Kibana analysis, create reports/dashboards - advantage\nResilient – be able to sustain critical incidents.\nPossess excellent organizational and interpersonal communication skills.\nWorking in a Production environment – a strong advantage\nB.Sc. in Industrial Engineering/math/information system or other quantitative fieldsShow more Report"}, {"company": "Beach Bum", "job": "Data Analyst", "city": "Raanana", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=129&ao=1136043&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c9a9f8d4&cb=1678899771745&jobListingId=1008151028899&jrtk=3-1-1grj3iu82jorq801-1grj3bp2uhaol800-2b171b7950f6bad9-", "description": "You're invited to Join Beach Bum, the greatest gaming family that brings a new twist to classic games by introducing them to the world of online casual games.\n\nJob Description:\nBe the data and analytical lead on all kinds of projects, while working closely with Product & CRM teams.\n\nExtract and analyze large and multi-dimensional datasets in gaming environment using a variety of BI tools.\n\nDesign, execute, measure and optimize the core business models.\n\nDevelop and run quantitative analysis, reports and more with the end goal of supporting our monetization efforts.\n\nIdentify business gaps and suggest solutions to impact the business KPIs.\nRequirements:\n1-2 Years’ experience as a data analyst\n\nBachelor of Science (B.Sc.), Industrial engineering and management\n\nVery strong analytical capabilities\n\nFully proficient in SQL – must\n\nSuper strong Excel skills - must\n\nExperience with Tableau – advantage\n\nEnglish at a high level\n\nTeam player, responsible and trustworthy\n\nAbility to see the \"big picture” and prioritize among many requestsShow more Report"}, {"company": "Intango", "job": "Business Analyst", "city": "Tel Aviv-Yafo", "date": "16d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=130&ao=1136043&s=58&guid=00000186e635e3b49fd6635eb345eede&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_191b7166&cb=1678899772993&jobListingId=1008495381181&jrtk=3-1-1grj3ivdtpkep801-1grj3bp2uhaol800-4c29c117af2124c8-", "description": "Intango IL\nAbout The Position\nWe are looking for a bright Business Analyst to join our talented and fun team!\nIntango develops an industry leading and advanced online advertising platform, offering a variety of solutions to serve customers and business partners worldwide.\nYou will join our Business Analysis team, provide analysis in various fields according to different and changing business needs, and will take an active part in leading our business strategy based on analysis-based recommendations.\nYou Will\nAnalyze data and provide actionable insights for both product and business users.\nTake part in planning and executing business projects from the analysis aspects - analyze POCs, work closely with all stakeholders (Business, Product, R&D, etc.) to understand use cases or stories.\nPerform ad-hoc analysis to support concrete business decisions.\nDesign and manage dynamic dashboards\nConduct meetings and presentations to share ideas and findings.\nSee beyond numbers, and leverage data and analytics’ influence on business decision-making and strategies.\n\nRequirements\nWe’ll need:\n 1+ years of Analysis experience in a tech or online company, preferably in online advertising.\n Excellent Excel proficiency including Power Query functions.\n Experience with BI and data visualization tools (Power BI / Tableau)\n Fluent English (Oral and written)\n BA degree in Economics / Statistics / Business Administration or related fields.\n Familiarity with SQL – an advantage.\n\nThe person we're looking for\nThe person we’re looking for:\nHighly proactive with a “Can do” mentality, fast learner and independent.\nStrong analytical skills, creative and curious.\nExcellent team player with strong communication and collaboration skills.\nStrong business acumen and passion to create an impact on business results.\nOrganized and detail oriented, yet agile and easily adaptive to changing conditions.\nAble to meet deadlines and work in a fast-paced environment with changing priorities, exceptional time management and organization skills.\n\nImportant to know:\nWe work in a hybrid model – 3 fixed days from the office, and 2 days you can choose to WFH or from the office.Report"}], [{"company": "lusha", "job": "Marketing Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=101&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_be280958&cb=1678899774440&jobListingId=1008336620449&jrtk=3-1-1grj3j0t9kf19801-1grj3cg4j227a000-00d8ce117abd2aae-", "description": "Description\nLusha is growing and we are searching for a Marketing Designer to join our marketing team! If you are a skilled designer with strong web design skills, who is passionate about the craft of creative converting ideas and thrive in a fast-paced environment continue reading\nWhat will you be doing?\nAs a Marketing Designer, you will focus on creating disruptive assets that accelerate Lusha’s growth as part of our demand generation efforts.\nYou will:\nBuild and update marketing assets that overwhelm and engage our potential users\nConstruct creative concepts and communicate them in a clear way\nOwn brand design projects A-Z dealing with brand identity, UX/UI design, digital assets, and interaction design work\nWork collaboratively within the marketing team to gather information, understand the end goals and strategize visual communication approaches, with the business goals in mind\nCreative ownership of our website and landing pages - design page layouts, ensuring they are pixel-perfect, inspiring, and user-friendly\nPlan design projects and build marketing assets that engage our potential users (Web, social media, email marketing, and internal branding)\nWork closely with the acquisition team and monitor relevant KPIs to optimize the design toward success.\nTranslating product functionality and technical details into beautiful visuals\nEnsure consistency with our brand voice, style, and tone.\nApply a performance-based approach to over-deliver KPIs.\nYou are:\nCreative thinker. Able to clearly conceptualize ideas and deliver multiple executions to bring them to life.\nOrganized. Excellent organizational skills and ability to prioritize and meet deadlines.\nSelf-starter. Curious, fast learner, fast to respond, and hands-on.\nData-oriented. You like working with data and insights and pair that with your passion for users to generate balanced and thoughtful points of view on how to take our products to market.\nAmbitious. You are eager to make an impact. You thrive in a fast-moving, dynamic, growth environment and are able to operate at the strategic level and the micro-detail to get things right.\nA team player. You have great communication skills. You love working with people.\nAdaptive. You understand different marketing platforms require different techniques.\nDegree in Visual Communication – A must\nA strong online design portfolio that consists of web-based marketing campaigns and strong graphic principles - A must\n3+ years of experience in designing and developing innovative concepts for stunning campaigns across all channels - A must\nStrong communication skills and a team-oriented approach\nAbility to execute brand strategy into compelling marketing assets\nAbility to communicate complex concepts through simplified visuals\nExperienced in supporting multiple marketing channels at scale\nExperienced in creating and optimizing digital marketing assets for lead generation purposes\nStrong typography skills and attention to detail\nHands-on experience in Adobe Suite, Figma\nA \"people person,\" a team player with a 'can-do' attitude\nExperienced in video editing & After Effects experience - a plus\nStrong demonstrated Illustration skills - a plus\nWhy Lusha?\nLusha connects you to your most relevant potential customers by creating simple, self-served products that provide access to meaningful and insightful B2B data. We offer ways to leverage data as an enabler for better, smarter and faster conversions at every stage of the customer lifecycle. Lusha was named Top 100 G2 Best Software Company and Top 100 Fastest-Growing product in 2020. Based in the center of Tel Aviv, Lusha is a fast-growing startup that offers its 300+ employees the opportunity to take an active role in shaping the future of the company. While all of us are dedicated to that mission, we surely know how to have a good time.Show more Report"}, {"company": "Appdome", "job": "Marketing Designer( UI Designer)", "city": "Tel Aviv-Yafo", "date": "10d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_69e27aa0&cb=1678899775429&jobListingId=1008509555461&jrtk=3-1-1grj3j1rr2i79001-1grj3cg4j227a000-01721ebb0fc8da73-", "description": "Tel- Aviv · Full-time\nAbout The Position\nWe are looking for a talented UI Designer who is passionate about creation and creativity.\nAs a UI designer at Appdome, you should have strong user-centered design principles, an eye for detail, and the ability to work collaboratively with cross-functional teams including marketing, sales, product design, and developers. Be involved in a wide range of projects – from creating sales materials to more traditional web design and marketing assets\nDesign cross-platform experiences, new layouts, visuals, and illustrations\nRequirements:\n1-2 years of proven experience in interactive design\nA complete portfolio of visual design examples.\nAdvanced proficiency in visual design software, such as Figma & Adobe Creative Suite\nAbility to work across the entire design flow: sketching concepts, design, prototyping, and implementation\nConceptual thinking both in visual and interactive design\nStrong graphic design skills & a sense for extraordinary, pixel-perfect design solutions\nIllustration skills - an advantage\nKnowledge of HTML and CSS in design assets, WordPress - an advantage\nResponsibilities:\nEstablish the look and feel for various interfaces, including the website\nWork within brand guidelines to create layouts that reinforce a brand’s voice through its visual touch-points\nDesign logos, icons, and infographics\nJuggle multiple projects while effectively managing timelines and expectations\nWork with a component library\nIf you are a skilled designer with a passion for creating amazing user experiences, we want to hear from you!\nOnline portfolio / PDF – mandatory\nCompany Overview\nAppdome’s mission is to protect every mobile app in the world and the people who use mobile apps in their lives and at work. Appdome provides mobile brands with the only patented, centralized, data-driven Mobile Cyber Defense Automation platform, delivering rapid no-code, no-SDK mobile app security, anti-fraud, anti-malware, anti-cheat, anti-bot implementations, configuration as code ease, Threat-Events™ threat-aware UI/UX control, ThreatScope™ Mobile XDR, and Certified Secure™ DevSecOps Certification in one integrated system.\nWith Appdome, mobile developers, cyber and fraud teams can accelerate delivery, guarantee compliance, and leverage automation to build, test, release and monitor the full range of cyber, anti-fraud, and other defenses needed in mobile apps from inside mobile DevOps and CI/CD pipeline.\nLeading ﬁnancial, healthcare, m-commerce, consumer, and B2B brands use Appdome to upgrade mobile DevSecOps and protect Android & iOS apps, mobile customers, and mobile businesses globally.\nNice To Know\nOur Israeli R&D site is located in Tel Aviv next to Hashalom train station.\nHybrid work model.\nFlexible working hours.\nToday, Appdome's customers use their platform to secure over 50,000+ mobile apps and with protection of over 1B mobile end users projected by the end of 2023.Show more Report"}, {"company": "ironSource", "job": "Product Designer", "city": "Tel Aviv-Yafo", "date": "3d", "rating": "4.3", "link": "", "description": "Grow Product Studio is looking for an UX/UI Product Designer to help shape and craft our complex platform systems into products that are simple and intuitive. You will design end-to-end user experiences and optimizations – from early prototypes to final implementation and you will also contribute to the development of our product style guidelines and design system.\nSo if you breathe UX/UI - let’s meet!\nRequirements:\n\nBachelor’s degree in Visual Communication from Bezalel, Shenkar, HIT, or Wizo\n3+ years of experience designing a complex system/platform\nYou have experience collaborating closely with R&D\nProven knowledge of Figma (design and prototyping), Sketch, and Adobe Illustrator\nExperience with user research and user testing\n***Submissions without a portfolio will not be considered***\nRole:\n\nBrainstorm and design new features and take concepts through to production\nDesign pixel-perfect complex system/platform user interfaces\nBuild, communicate, and present design ideas and be responsible for the product’s design language\nCollaborate with other designers, as well as product managers, developers, sales and marketing, and other stakeholders to deliver the best design solutions and help deliver outstanding user experiences and sales materials\nProduce all assets needed for the development teams and make sure that the work is delivered as it was designed\n\nBusiness Unit:\n\nDesign & Creative\n\nAdvantages:\n\nYou have a positive attitude and great social skills with a willingness to put aside ego for the sake of what's best for the team\nYou possess the ability to adapt, switch gears, and thrive in a fast-paced environment\nYou have excellent organizational skills and ability to prioritize and meet deadlines\nExperience creating and build a design system library\nYou have a high level of written and spoken English\nGreat people skills, fun person to be aroundShow more Report"}, {"company": "Connecteam", "job": "Marketing Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=104&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_350d35fd&cb=1678899778509&jobListingId=1007523364265&jrtk=3-1-1grj3j4sap6eo801-1grj3cg4j227a000-659ef5c67532f9e4-", "description": "We Are:\n\nConnecteam is a TLV-based startup that is rapidly growing.\n\nOur mission and what our product is all about - is to change how 80% of the world's global workforce—the deskless workers, operate in their day-to-day job roles.\n\nOur marketing team is growing, and we are looking for a marketing design wizard. We want you to join our marketing department at one of Israel's most promising startup companies!\n\nYou Are:\n\nA creative person with real passion for design and outstanding conceptual and visual design skills.\n\nA natural-born leader with engaging visual storytelling abilities, a deep knowledge of brand and design experience, and an understanding of digital marketing across multiple channels.\n\nYou enjoy working closely with marketing and creative teams in a fast-paced startup environment.\n\nOwnership & Responsibilities:\n\nBuild and update marketing assets that overwhelm and engage our potential users and employees\nConstruct creative concepts and communicate them in a clear way\nOwn brand design projects A-Z dealing with brand identity, digital assets, and interaction design work\nCollaborate with other stakeholders to gather information, understand the end goals and strategize visual communication approaches, with the business goals in mind\nCreative ownership of our website and landing pages - design page layouts, ensuring they are pixel-perfect, inspiring, and user-friendly\nPlan design projects and build marketing assets that engage our potential users (presentations, data visualization, newsletters, banners, etc.)\nWork closely with the acquisition team and monitor relevant KPIs to optimize the design toward success, applying all learning to future work\nTranslating product functionality and technical details into beautiful visuals\nCreating campaigns, ads & web pages for our paid acquisition and SEO activity\nQualifications:\n\nDegree in Visual Communication – REQUIRED\nA strong online design portfolio that consists of web-based marketing campaigns and strong graphic principles - REQUIRED\n3+ years of experience in designing and developing innovative concepts for stunning material campaigns across all channels - REQUIRED\nStrong communication skills and a team-oriented approach\nAbility to execute brand strategy into compelling marketing materials\nAbility to communicate complex concepts through simplified visuals\nExperienced in supporting multiple marketing channels at scale\nExperienced in creating and optimizing digital marketing assets for lead generation purposes\nStrong typography skills and attention to detail\nHands-on experience in Adobe Suite, Figma\nA \"people person,\" a team player with a 'can-do' attitude\nFamiliarity with online marketing basic metrics & KPIs - Advantage!\nJoining Connecteam Is The Smart Move:\nWe build our people up. Every team member is treated as a long-term investment and we recognize the value in always nurturing and training them so they can go above and beyond in their skills and job duties.\nWe make an impact on our customer's business. We are on a mission to provide managers of all business types and sizes with the tools they need to communicate, operate, engage, and run their deskless workforce. Our product offers them an effective and affordable solution to run their business.\nWe get the job done. Connecteam employees are passionate in executing their job duties so they can drive the company forward and provide real value to our customers.\nWe have fun! From weekly happy hours to holiday parties, we always enjoy each other's company (and good food, of course). Connecteam is like one big, happy family!\nEveryone is welcome. Connecteam is committed to building an encouraging, caring, and supportive environment. We share a responsibility to support our team and enrich their lives.\nTogether we will shape the future of work!Show more Report"}, {"company": "Xtra-Mile", "job": "Graphic Designer", "city": "Raanana", "date": "17d", "rating": "4.5", "link": "", "description": "Xtra-Mile, a leading lifecycle marketing agency specializing in B2B, is seeking a creative and talented graphic designer to join our studio team\nResponsibilities:\nDesigning marketing campaigns starting with the creative stage all the way through to the final product.\nCreating banners and ads for the various media platforms\nDesigning bulk e-mails, invites, landing pages, websites, presentations, brochures, and other printed materials.\nRequirements:\n\nDigital marketing design experience - required\nFully proficient in Adobe (Illustrator, Photoshop, and InDesign) - required\nProficient in PowerPoint – a significant advantage\nProficient is joint design software (Figma XD) - a significant advantage\nAnimation software experience - a significant advantage\nAbility to think outside the box, fast grasp, and dynamic teamwork\nHigh working proficiency in EnglishShow more Report"}, {"company": "DGN Games", "job": "Marketing Graphic Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=106&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_28e0b8ad&cb=1678899780806&jobListingId=1008257158133&jrtk=3-1-1grj3j736h7jb801-1grj3cg4j227a000-35d65f5f07d0668d-", "description": "DESCRIPTION\nWe are looking for a talented and innovative graphic designer to join our Marketing Art team in TLV,\nfor a full-time position.\nThe designer will be responsible for creating artwork and brand design concepts for different platforms such as in-app and canvas.\nCreativity, independence, and critical thinking with strong and open communication capabilities is required.\nDue to the nature of this position, no candidate will be considered without a diverse portfolio submission.\nCandidates identified to continue in the process will be asked to complete an exercise in addition to a formal interview.\nRESPONSIBILITIES\nStore pages and icons design, creation of all elements of app store presence\nProduce high-quality in-app & digital marketing assets.\nWorking closely with internal stakeholders to ensure that the visual identity is in line with the global marketing industry.\nDriven design and execution of marketing and branding materials for all games that meet and set deadlines.\nREQUIREMENTS\nPortfolio with Examples of marketing art assets.\nAt least 2 years of experience in graphic design.\nGaming company experience – MUST!\nExperience working with deadlines, and a deadline-driven mentality to complete tasks.\nStrong sense of graphic design from all aspects and orientation with the latest trends in the industry.\nAbility to work in a wide range of styles.\nSolid understanding and comfortability with Adobe Photoshop, dimension, and Illustrator.\nKnowledge of HTML+CSS – advantage.\nHigh degree of self-motivation and discipline.\nExceptionally organized with high attention to detail.Report"}, {"company": "MAËLYS", "job": "Brand Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "", "description": "MAЁLYS is one of the fastest-growing D2C beauty brands in the world. We are breaking the mold of the body care industry with innovative targeted body care solutions for specific skin concerns, an intricate and unique combination of data and marketing, and a seriously sassy and bold brand voice.\nWe are a team of people who want to make lasting, impactful changes, who live (and love) to see results, who innovate with passion, and who love a good sense of humor. Is our vibe your vibe? Then keep reading…\nAs a Brand Designer, you will have the opportunity to channel your creativity by creating engaging designs for our digital content. You will be part of a growing brand and in a role where you can see your impact and immediate results.\nYour life at MAËLYS will look like…\nConduct a full design cycle, from collecting inspiration to creating a pixel-perfect UX/UI.\nExecute design and conceptual tasks as assigned with significant attention to detail.\nContribute to, and collaborate with fellow designers on design concepts and the brand experience.\nDevelop visual concepts for digital campaigns, product marketing, and customer marketing.\nYou will thrive in this role if you have…\n1-3 years of experience as a Creative/Marketing/Graphic Designer (preferably in a product / eCommerce company).\nA strong portfolio demonstrating design thinking and execution skills.\nExcellent knowledge of Figma.\nKnowledge in Adobe Creative Cloud - Photoshop, Illustrator, (After Effects - an advantage.)\nStrong understanding of typography and hierarchies.\nStrong design, color, and composition abilities.\nProficient in English.Report"}, {"company": "PowerLink Software Ltd", "job": "Marketing Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=108&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_85ec8f3a&cb=1678899783358&jobListingId=1008270614038&jrtk=3-1-1grj3j9i1khpv801-1grj3cg4j227a000-53cebd94db61097c-", "description": "We are looking for a true leader who is passionate about people and technology. To be successful you should be curious and an excellent communicator who can earn employees' and clients' trust in order to succeed.\nLead the entire Customer Success department - account managers, professional services, and support teams.Create an environment that encourages and empowers team growth.Shaping and maintaining our customer relations strategy.Build long-term relationships with customers and identify revenue opportunities by maintaining a database of customers.Work in cooperation with sales, product, R&D, and other departments in defining end-to-end processes that align with the business goals.Set KPIs for the teams and provide performance feedback.\nAbout Us:\nPowerlink is an end-to-end business management platform tailored for your business-specific needs. From marketing to sales to customer service, and more, Powerlink makes it easy for your entire business to work together. Each department is powerful on its own, but together they can be explosive. Powerlink was built from the ground up by developers who already knew back in 2011 that there had to be a better way to improve customer relations and decided to develop a software for every need aimed to keep customers delighted. After conquering the local market with more than 2000 satisfied Israeli customers from various industries, we are ready to go global.\n\nOur Customer Success department includes:\nTechnical Support team - the first point of contact for customers.\n\n\nAccount managers team - developing long-term relationships with customers, building loyalty, and ensuring higher customer retention and satisfaction.\n\nTechnical product experts - sharing their extensive knowledge for designing solutions for strategic customers.\nWe are looking for a true leader who is passionate about people and technology to lead the CS department through this adventure.\n\nAre you up for the challenge?\n\nThe Role:\nYour Experience & Skills:\n5+ years of experience in the Customer success world.\n‍\n2+ years of experience in leading a customer-facing team or other managerial experience.\n‍\nProactive, service-minded and enjoy working with people.\n‍\nA technological degree and work experience within a technological environment.\n‍\nA business-oriented thinker with a problem-solving attitude, who can see the bigger picture.\nCapable of translating data into action and explaining how Customer Support is progressing according to KPIs.\nMotivational leader who knows how to deliver exceptional customer service.\nA down-to-earth approach, understanding that it's all about the people.\nExcellent written and verbal communication skills in both Hebrew and English.\nWe Appreciate Those With:\nSay what they think.\nIndependent and proactive in a fast-paced environment.\nFast learner.\nHas excellent interpersonal and presentation skills\nProven track record of building client relationships and being client facing.Show more Report"}, {"company": "FORTVISION", "job": "Marketing Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=109&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_637505b2&cb=1678899784453&jobListingId=1007751597894&jrtk=3-1-1grj3jall2bmk001-1grj3cg4j227a000-671ce323d53d9fce-", "description": "We are looking for a designer with a passion for digital media, video, engaging content and marketing. Do you have what it takes to be a part of one of the fastest growing technology companies? Apply now and we’d be more than happy to have a conversation with you.\nYou are:\nAn experienced designer who lives and breathes design. You have experience in online design & web, and a deep understanding of Adobe Photoshop and Sketch You’re an out-of-the-box, conceptual thinker who is artistically talented and pays close attention to detail when creating your designs. An excellent communicator, you’re capable of collaborating with team members to deliver stunning results. Your portfolio is pretty impressive (remember to include it when you send your CV). And last but not least, you’re looking for a full-time job .\nAs a Web Designer, you will:\nDesign, work on and manage large-scale, high-end design templates and campaigns using FORTVISION platform that reach of millions of users every day.\nDesign online marketing campaigns.\nCreate engaging marketing material designs.\nDevelop innovative branding and marketing concepts for presentations.\nProvide hands-on support and guidance to sales and marketing team, and promote a transparent line of open communication.\nSkilled in HTML/CSS on a designer level (big advantage).\nMulti-task several projects at any given time under tight deadlines.\nMail your CV to jobs@FORTVISION.comShow more Report"}, {"company": "CONTROP", "job": "Marketing Designer", "city": "Hod HaSharon", "date": "23d", "rating": "2.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=110&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0242aca5&cb=1678899785714&jobListingId=1008482590742&jrtk=3-1-1grj3jbsnk6ei801-1grj3cg4j227a000-beb5fb54aba6ea36-", "description": "Business and Headquarters\nJB-381\nלמחלקת השיווק של חברת קונטרופ דרוש/ה מעצב/ת גרפי/ת עם ידע בעריכת וידיאו\n\nתיאור התפקיד:\n\nיצירת חומרים גרפים ועריכת וידיאו עבור רשתות חברתיות, תערוכות, ברושורים, ואירועי רווחה\nעדכון ויצירת מצגות\nעריכת סרטונים שיווקיים\nתחזוקת אתר החברה\n\n\nדרישות:\n\nתואר רלוונטי: תקשורת חזותית או הכשרה רלווטנית אחרת\nשליטה בתוכנות: פוטושופ, אילוסטרטור, פרימייר- חובה\nמינימום שנתיים ניסיון בעיצוב גרפי ועריכת וידיאו- חובה\nשליטה בתוכנות אופיס בדגש על Power Point- חובה\nידע בצילום יתרון\nאנגלית ברמה גבוהה\nיחסי אנוש מצויינים\n\nנא לצרף תיק עבודות לקורות החייםShow more Report"}, {"company": "Finonex", "job": "Platform Product Manager", "city": "Herzliya", "date": "19d", "rating": "", "link": "", "description": "About the role:Finonex is looking for a talented and passionate product manager to join our team in our office in Herzliya, Israel.As a product manager, you will be responsible for our web and mobile trading platform.You will work closely with cross-functional teams including engineering, marketing, and design to identify and prioritize opportunities for growth in our international markets and lead the development and execution of product strategies and initiatives that drive engagement and revenue.Our work model is hybrid, combining remote and on-site workIn this role you will:Ownership of product requirements, driving the product life cycle in an agile methodology.Define roadmap, take it from vision to reality and prioritize product requirements.Manage the full product life-cycle, from product definition through launch to maintenance - ideation, scope, specification, prioritization, design, implementation, quality assurance, launch, and iteration.Define and build metrics and OKRs and drive growth in multiple aspects of the product.Highly analytical with attention to detail, able to complete extensive market research.Analyze usage patterns and solve problems.Keep investigating for new tools and services that can help deliver better productsPlanning the features with a designer, to create the best UI & UX.You have:4+ years of experience in product management in B2C productExperience with defining and measuring product and usability KPI'sA great sense for user experience and designStrategic thinking with good planning skills.Ability to manage lifecycles of several products simultaneously.Technological orientation and understanding of the development cycle.Excellent English level with excellent verbal and written skills.Ability to explain complex requirements in simple terms, excellent communicator (both written and verbal).Experienced in driving collaboration across multiple disciplines - Product, UX, R&D, Marketing, CS and Sales.Self-driven and organized with the ability to effectively prioritize and execute multiple initiatives.Strong leadership, organizational and execution skills.Will be nice that you have:Work experience in a trading on-line companiesWork experience in SAS platformsJob Type: Full-timeShow more Report"}, {"company": "PayEm", "job": "Marketing Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.6", "link": "", "description": "PayEm is a global procurement and spend management platform that automates finance and procurement processes from request to reconciliation. By reducing friction and tedious tasks for finance and procurement teams, our clients increase productivity, reduce risk and lower operating costs to contribute to business growth. This is an exciting opportunity with a rapidly growing company.\nThe ideal candidate is a creative thinker by heart that is not afraid to work on multiple projects and channels.\nAs a Marketing Designer at PayEm, you will focus on creating disruptive assets that accelerate PayEm’s growth as part of our demand generation efforts. Projects include designing sponsored ads, branded content, social media assets, emails, landing pages, all kinds of online campaigns, branded internal needs, and much more.\nPrimary Responsibilities\nRequirements:\n\n3+ years of experience as a Creative/Marketing/Brand Graphic Designer\nA strong online design portfolio consisting of web-based marketing campaigns and strong graphic principles\nMastery of the Adobe Creative Suite (Photoshop, Illustrator, InDesign, AfterEffects), Figma\nAbility to work effectively under deadlines\nPlan /design projects and build marketing assets that engage our potential users (social media, email marketing, and internal branding)\nEnsure consistency with our brand voice, style, and tone.\nExperience collaborating with multidisciplinary product and marketing teams.\nImaginative, creative, and curious.\nStrong project management skills and the ability to manage multiple projects at once\nWork collaboratively within the marketing team to gather information, understand the end goals and strategize visual communication approaches with the business goals in mind\nAdvantages:\n\nSaaS B2B experience\nWeb / SVG animation experience a plus, using applications such as Adobe After Effect, Lottie positive\nAbout The Role:\n\nDesign and create creative concepts across media: including websites, social ads, email marketing, brand guidelines, etc.\nParticipate in campaign strategy meetings and campaign planning; testing concepts and exploring design and messaging solutions\nBuild upon and grow PayEm’s brand and personality while maintaining our brand style guide for all teams to utilize & reference\nCollaborate with cross-functional teams on project planning, marketing campaigns, sales enablement needs, and digital initiatives from start to finish\nCreate cohesive marketing experiences while developing high-quality assets that power successful campaigns and channel results\nContinuously research new creative campaigns, ad formats, design concepts, and graphic design trends\nIdentify best practices and data-driven insights for creative experimentation\nAct as a champion for high-caliber design throughout PayEm\nExpert knowledge of the creative process and project management\nHighly organized and able to work with a broad team of cross-functional stakeholders\nAbility to manage multiple projects, timelines, and resourcesShow more Report"}, {"company": "Seperia", "job": "Project Manager", "city": "Herzliya", "date": "30d+", "rating": "4.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_81ef6716&cb=1678899789838&jobListingId=1008454526356&jrtk=3-1-1grj3jfu5kblb801-1grj3cg4j227a000-2dd7a7e97e40b648-", "description": "Seperia builds and operates global fintech review sites. From 2003, we have been driving millions of sales to our partners (advertisers). We do it by focusing on value added content, wrapped within an engaging web product and matched with high-intent traffic.\n\nWe’re looking for our next Marketing Project Manager.\n\nWhat You Will Do:\nWork with the product designer, the acquisition team, and developers to create, manage and expand our leading, user-centric review sites.\nCommunicate with international brands on a monthly basis – manage the partnerships, evaluate their performance metrics, and drive product monetization.\nPerform hands-on research, analysis, planning, and execution of tasks.\nWork across interfaces to complete various tasks, through tools such as WordPress, Google Analytics, and BI systems.\nLead broad initiatives related to the product.\nWhat You Need:\nGreat written & verbal communication skills (Hebrew & English) – a must.\nAn independent and performance-oriented attitude with the ability to drive people and processes.\n1+ years of experience in product (marketing) management, project (marketing) management or global website management.\nA web-savvy mindset.\nExperience in managing websites via WordPress – advantage.\nTechnical capabilities & experience working with developers – advantage.\nWhat We Offer:\nHuge potential for growth. Our company is growing and we’re looking for someone who can grow with us.\nFreedom – we care less about formalities, and more about results. With a dynamic, informal environment, we keep excellence, innovation, and results at the forefront.\nUpside – as a performance marketing company, we develop global-level, scalable marketing assets with no glass ceiling. You can enjoy a growing upside.Show more Report"}, {"company": "8fig", "job": "Product Design", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": "8fig is a growth platform built to propel e-Commerce brands to new heights with cash flow planning technology and continuous, uncapped capital. Founded by supply chain experts, our growing data-driven, client-obsessed team is driven by our purpose to democratize online retail and scale eCommerce sellers to 8-figures in revenue.\nWe are seeking a highly experienced and talented Product Designer with at least 3 years of experience in user experience and interactive design. The ideal candidate possesses strategic thinking and a comprehensive understanding of the product development process, from research and prototyping to design and usability testing. Strong communication, organizational, and analytical skills are essential, as the candidate will be expected to continuously learn and focus on solving complex product problems.\nKey Responsibilities:\nConducting user research to understand the needs and pain points of the target audience.\nCreating user personas and journey maps to guide design decisions.\nDesigning wireframes, prototypes, and high-fidelity mockups.\nConducting usability testing to validate design solutions.\nCollaborating with cross-functional teams, including product management, engineering, and marketing.\nCommunicating design decisions and rationale effectively to stakeholders.\nStaying up-to-date with industry trends and best practices in UX design.\nProviding design guidance and mentorship to junior designers.\nParticipating in the entire product development process, from research to launch.\nContinuously iterating on designs based on user feedback and data analysis.\n\nRequirements:\n\n\n3+ years of experience working as a UX designer on SaaS products\nMaster of design tools such as Sketch and Figma\nStrong understanding of user-centered design principles and techniques\nStrong portfolio demonstrating a track record of creating intuitive and user-friendly software\nExcellent interpersonal skills\nExperience with A/B testing and working with data intensive products\nAbility to work in a fast-paced, dynamic environment\nStrong analytical and problem-solving skills\nStrong attention to detail and ability to work with ambiguity\nExtra Points:\nInterest and background in fintech\nExperience selling products on Amazon, Shopify, BigCommerce…\nStrong public speaking skills, including confidence and stage presence\nIf you're still nodding your head in agreement and this seems like a good fit, don't hesitate to reach out—we're looking for you!Report"}, {"company": "Loox", "job": "Creative Designer", "city": "Ramat Gan", "date": "30d+", "rating": "5.0", "link": "", "description": "We're on the lookout for a designer with an exceptional eye for detail, a knack for web design, and a collaborative spirit to be part of our team. If you're an excellent designer and a team player, come join us!\nAs a Creative Designer at Loox, you will:\nHelp develop and elevate our existing brand to ensure all creative materials are top-notch.\nUse Webflow to design and build the company website, along with landing pages and other digital assets\nCreate captivating visuals and imagery that will support different departments including marketing, education, HR, product, and others.\nCollaborate with relevant stakeholders across different departments to deliver outstanding designs.\nWhat you'll need:\nBA in Visual Communication or comparable experience\nExperience working with Webflow - a must\nPrior experience working on web, marketing, or brand design\nA strong grasp of image making, typography, and composition, and a good conceptual mindset\nAttention to detail, a keen eye for aesthetics and trend-savviness\nExperience in Figma and Adobe Suite\nGreat time-management skills and ability to deliver top-quality results\nA self-learner and a highly motivated self-starter\nExcellent communication skills in both English and HebrewA portfolio showcasing your skills, diversity, and attention to detail is a mustShow more Report"}, {"company": "SAR Technologies", "job": "Platform product manager", "city": "Herzliya", "date": "19d", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7f15bee5&cb=1678899794062&jobListingId=1008489520861&jrtk=3-1-1grj3jk20klvm801-1grj3cg4j227a000-ee38b6c86cda5eab-", "description": "Finonex is looking for a talented and passionate Platform product manager to join our team in our office in Herzliya, Israel.\n As a product manager, you will be responsible for our web and mobile trading platform.\nYou will work closely with cross-functional teams including engineering, marketing, and design to identify and prioritize opportunities for growth in our international markets and lead the development and execution of product strategies and initiatives that drive engagement and revenue.\nOur work model is hybrid, combining remote and on-site work\nIn this role you will:\nOwnership of product requirements, driving the product life cycle in an agile methodology.\nDefine roadmap, take it from vision to reality and prioritize product requirements.\nManage the full product life-cycle, from product definition through launch to maintenance - ideation, scope, specification, prioritization, design, implementation, quality assurance, launch, and iteration.\nDefine and build metrics and OKRs and drive growth in multiple aspects of the product.\nHighly analytical with attention to detail, able to complete extensive market research.\nAnalyze usage patterns and solve problems.\nKeep investigating for new tools and services that can help deliver better products\nPlanning the features with a designer, to create the best UI & UX.\nYou have:\n4+ years of experience in product management in B2C product\nExperience with defining and measuring product and usability KPI's\nA great sense for user experience and design\nStrategic thinking with good planning skills.\nAbility to manage lifecycles of several products simultaneously.\nTechnological orientation and understanding of the development cycle.\nExcellent English level with excellent verbal and written skills.\nAbility to explain complex requirements in simple terms, excellent communicator (both written and verbal).\nExperienced in driving collaboration across multiple disciplines - Product, UX, R&D, Marketing, CS and Sales.\nSelf-driven and organized with the ability to effectively prioritize and execute multiple initiatives.\nStrong leadership, organizational and execution skills.\nWill be nice that you have:\nWork experience in a trading On-line companies\nWork experience in SAS platformsShow more Report"}, {"company": "FIVE Product Definition", "job": "PRODUCT DESIGNER hired", "city": "Petah Tikva", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=117&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b75c007e&cb=1678899795221&jobListingId=1007013697177&jrtk=3-1-1grj3jl61p6dv801-1grj3cg4j227a000-5a6c19db763ced3e-", "description": "We are looking for a truly talented Product Designer with innovative and unique creative vision; one with excellent ability to understand and design highly complex screens, and with pixel perfect design skills.\n\nYou’ll be responsible for all interface design aspects for digital products, and work closely with Design, Product, Marketing and Dev teams to create design solutions for complex digital products in various fields and platforms.\n\nRequirements:\n\nProduct design portfolio\nMastery of various design tools (tech-savvy skills – advantage)\nStrong attention to detail\n\nJob location: Petah Tikva\nJob type: flexible\nMail to: designer@5ive.co.ilShow more Report"}, {"company": "WSC Sports", "job": "Visual Designer", "city": "Giv`atayim", "date": "30d+", "rating": "4.4", "link": "", "description": "WSC Sports develops an AI-based automation solution for real-time sports content creation and distribution and is the fastest-growing sports-tech company in the world.\nWhy WSC Sports:\nYou’ll work in an awesome environment alongside some of the most innovative people around, using cutting-edge technologies and tools (video editing, AI, data, etc.), and have the opportunity to directly influence the products and tools used by our clients who include sports giants such as the NBA, Bundesliga, FIBA, ESPN and more. And that’s just the beginning of what WSC Sports has to offer!\nWe are looking for a Visual Designer to join our design team.\nAs a Visual Designer at WSC Sports, you will work on company-wide projects to apply brand guidelines as well as contribute to expanding our visual language. You will create video content, graphics, and animation for a variety of digital platforms.\nWhat you’ll do:\nCreate and execute concepts, artwork, animation, and video content which may include:\nTypography, image-making, and layout work for promotional and marketing content\nEvent branding and materials for both live and digital events\nContent design (posters, GIFs, etc.)\nMerchandise\nIllustrations, animated or static compositions for campaigns (social media posts, email marketing, etc.\nRequirements:\n\nWhat you’ll need:\n3+ years of design experience, an advantage to being familiar with the startup environment\nB.Des degree or an equivalent\nProficient at After Effect and basic video editing\nIn-depth understanding of typography, iconography, color, space, being able to create a compelling and consistent visual experience.\nThe ability to partner with other creative team members and key stakeholders to create content used across a variety of platforms (web, mobile, video, and more). For this purpose must be proficient at creating storyboards and have storytelling skills\nStrong understanding of design systems.\nWhy should you apply:\nYou will join a small close-knit team- https://www.behance.net/WSCSports\nYou’ll get to work at the company with cutting edge technology- https://www.geektime.co.il/wsc-sports-raised-23m/\nYou could be a part of our great company culture, that puts people first- https://www.instagram.com/wsc_sports/?hl=en\nWork Model:\n\nHybridShow more Report"}, {"company": "Genesys", "job": "Product Designer (UX/UI)", "city": "Tel Aviv-Yafo", "date": "1 day ago", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=119&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a70c88e3&cb=1678899798185&jobListingId=1008527139477&jrtk=3-1-1grj3jo2rkugi801-1grj3cg4j227a000-b3d079c1be7ebabb-", "description": "It's fun to work in a company where people truly BELIEVE in what they're doing!\nWe're committed to bringing passion and customer focus to the business.\nExceed.ai is a Conversational Marketing platform, powered by Artificial Intelligence, that automates the lead qualification, nurturing process, and meeting schedule for Sales and Marketing teams to save them time and allow them to focus on building relationships with prospects and customers, having meaningful conversations and being creative. As the Exceed Product Designer, you’ll help build the next-generation, cloud-based customer experience platform. This role will be responsible for creating compelling and delightful experiences employing Design thinking methodologies and best practices. You will help define product features as well as user interactions and flows, creating wireframes, prototyping, documenting, and user testing the designs. As a confident communicator, you can work laterally to engage with senior stakeholders across the different disciplines with ease.\nThis is a fixed term contract for a duration of 6 - 9 months.\nLocation: For this role, we are open to candidates being based either on-site full time, or working Hybrid 50/50.\nIn this role the primary responsibilities include (but are not limited to):\nProduct designs as needed to ensure ideas are realized to their fullest potential through the effective use of user centered design and information principles.\nParticipate as a design lead to cross-functional teams that include, project management, product management, software developers, and QA.\nParticipate in product and feature ideation and conceptual development for web solutions, also taking into account responsive design considerations.\nProduce conceptual models, flow charts, conceptual sketches, wireframes, IAs, design prototypes, and design specifications.\nDesign and specify user interfaces using participatory and iterative design techniques, including observational studies, customer interviews, usability testing, and other forms of requirement’s discovery.\nCreate digital assets that effectively communicate product function and intent, user interaction, and screen hierarchy.\nEffectively communicate research findings, conceptual ideas, detailed designs, and design rationale both verbally and visually to stakeholders and team members.\nWork closely with development teams to ensure that design specifications are implemented.\nManage multiple projects at one time, switching focus between projects as required to manage priorities.\nRequired Qualifications:\n2+ years proven experience designing data-intensive software applications for a global audience.\nStrong knowledge of interaction design processes and methodology particularly as applied to desktop & mobile products.\nThrive in a fast-paced work environment that requires independent self-direction with an aptitude for team collaboration and open communication.\nProactive and takes ownership for producing positive results.\nContributes as a valued team member and colleague with leaders at all levels.\nDemonstrates personal self-awareness and desire for continual learning and personal development.\nMust possess the presentation skills and professionalism to project a professional image, both internally and externally.\nHave developed UX and/or User Interface (UI) designs for IT professionals.\nExperience working closely with engineering to champion design at every step.\nHave an online portfolio showing a mix of UX/UI design experience.\nProficient in industry standard design tools such as XD or Figma. (Figma is our tool of choice)\nPreferred Qualifications:\nB.S or M.S. in any of the following: HCI, Interaction Design, Industrial Design, Visual Design, and/or related fields.\nExperience with AI or machine learning capabilities.\nCovid-19:\nSafety for our employees and our communities is a key priority for Genesys. We continue to experience rapid growth during the Covid-19 pandemic and are conducting remote hiring and onboarding processes. All hiring and onboarding processes are being conducted remotely at this time.\nAs our Covid-19 task force and internal teams plan to reopen our global offices, the policies and procedures continue to be updated.\nReasonable Accommodations:\nIf you require a reasonable accommodation to complete any part of the application process or are limited in the ability or unable to access or use this online application process and need an alternative method for applying, you or someone you know may complete the Reasonable Accommodations Form for assistance. Please use the Candidate field in the dropdown menu to ensure a timely response.\nThis form is designed to assist job seekers who seek reasonable accommodation for the application process. Submissions entered for non-accommodation-related issues, such as following up on an application or submitting a resume, may not receive a response.Show more Report"}, {"company": "Beach Bum", "job": "Graphic Designer", "city": "Raanana", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=120&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9d66277f&cb=1678899799860&jobListingId=1006020925231&jrtk=3-1-1grj3jpn0j479801-1grj3cg4j227a000-f07a6146c5e0a05e-", "description": "You're invited to Join Beach Bum, the greatest gaming family that brings a new twist to classic games by introducing them to the world of online casual games.\nWe are seeking a talented CRM Graphic Designer who is excited about the game industry. We need your skills to focus on exploring and executing the best marketing materials while managing the whole creative process from end to end. You will use your amazing skills in shaping the visual language and communications and help us to engage potential players in creative & inspiring ways.\nResponsibilities:\nDesigning marketing materials for all marketing activities while maintaining the brand's language\n\nOwn the creative process from ideation through production to implementation\n\nBuild and maintain relationships with outsource providers\n\nLearn and develop new creative ideas and formats based on market research\n\nCooperate with the studio's art and CRM teams\n\nRequirements:\n1+ Years of experience in Marketing/CRM design\n\nexperience in the gaming industry - advantage\n\nVast knowledge in Photoshop - A must\n\nGood knowledge in Illustrator & After Effects - A must\n\nAbility to work in a fast-paced environment\n\nGood English\n\nGood communication and interpersonal skills\n\nMulti-task several projects to meet deadlinesReport"}, {"company": "Wix", "job": "3D Motion Designer - Brand R&D Team", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=121&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_8a7ecacb&cb=1678899801049&jobListingId=1008237413869&jrtk=3-1-1grj3jqskmfq3801-1grj3cg4j227a000-4f056aa0707b386b-", "description": "We are:\n\nWix’s Marketing Design studio. We’re continuously developing a world-class brand to communicate and engage with a wide range of audiences. Our creative, energetic and diverse team plays a hands-on role in elevating the brand with rich and sophisticated designs across all of Wix’s products, reaching more than 200 million users around the world.\n\nYou are:\n\nA 3D designer with 1+ years of experience, who’s willing to commit to our brand’s highest standards and push them even further. You’re a creative conceptual thinker with a beautiful online portfolio consisting of strong graphic design principles. You’re proficient in Cinema 4D as well as in Redshift render engine.\n\nYou have a strong interest in animation, image making and illustration. You have hard surface, texturing, and shading abilities (UVs, rigid and cloth simulation are an advantage).\n\nYou follow graphic and motion design web trends. You pay close attention to details and aesthetics and know how to create eye-catching, robust, interactive designs. You’re also an excellent communicator and team player.\n\nYou’ll get bonus points if you’ve worked in a digital agency and have excellent spoken and written English. You’ll get additional points if you know Houdini.\n\nAs a 3D Brand Designer you will:\nCollaborate with the rest of the Design Team to produce high-end renders.\nPartner with Designers and Creative Directors to produce style frames and designs\nHelp develop and establish brand aesthetic qualities in a variety of different feels\nPartner with our marketing motion design studio in developing assets for videos and animated sequences\nPartner with the Creative Technology department in order to generate real-time ready assets\n\nWe’re proud to be an equal opportunity employer. Wix was built around the idea that everyone has the right to be successful, online. This same vision defines us as an employer: creating a work environment where everyone is welcome, and anyone has the right to succeed.\n\nApply NowShow more Report"}, {"company": "InspHire", "job": "Crypto Affiliate Manager (Optional to Remote)", "city": "Herzliya", "date": "30d+", "rating": "5.0", "link": "", "description": "An international financial services group specializing in online trading and investment is looking for a Crypto Affiliate Manager to join its Marketing team. The Marketing team is a very international group of 10+ nationalities based in Montenegro, Cyprus and Israel. We welcome successful candidates with a proven track record and experience working as an Affiliate or IB manager for at least 2 years.\nThe hiring team is ready to learn from you, share its knowledge and provide amazing working conditions for your best performance. Apply now!\nWhat Will you Do :\nRecruit new affiliates\nMaintain existing affiliate\nMaintain and monitor affiliate programs and activities.\nLook for new IBs\nAffiliate support\nSearch for affiliates/traffic brokers and negotiate with them to cooperate with the company's affiliate program on its condition.\nCoordinate with designer regarding preparing conversion promo materials for Affiliates for specific GEO's (landing pages, teasers, banners).\nWrite marketing briefs and work with the creative team to develop assets for campaigns\nInitiate new campaign ideas and bonus offers for affiliates\nRepresent the company on international events (exhibitions, meetups, seminars, etc)\nGerman, Italian or Spanish speaker\nRequirements\nKey Skills Required:\n2 years as an Affiliate manager or 1 year as Affiliate manager +2 years of Sales/Retention in forex/crypto industry\nFluent English + German, Italian or Spanish language\nDeep understanding of affiliate and partner marketing channels\nHighly organized, strategic and execution-focused with the ability to multi-task\nAbility to operate independently and to meet established deadlines with exceptional attention to detail\nProven ability to prioritize tasks, handle multiple projects and frequent reporting\nAttention to detail, accountability and pride in the quality of work\nCreative thinker has technological knowledge and deep business understanding (smart creative)\nAbility to collaborate with and influence both internal and external partners\nAbility to travel when needed to conferences and team meetings\nProficiency working in Microsoft Excel, knowledge of affiliate networks\nExceptional planning and project management skills\nOutstanding verbal and written communication skills\nStrong interpersonal skills, curiosity, positive attitude, drive and collaborative spirit\nAbility to succeed in a fast-paced, matrixed environmentShow more Report"}, {"company": "accessiBe", "job": "Creative Web Designer - Temporary", "city": "Tel Aviv-Yafo", "date": "8d", "rating": "4.7", "link": "", "description": "accessiBe is the market leader in web accessibility that makes websites accessible to people with disabilities. accessiBe is more than a workplace, it’s a passion. Each day you’re surrounded by people who share the same goal and values, who work endlessly to break down accessibility barriers. We care about all people, regardless of their ability. We hire people that are determined to succeed and who are not afraid of rapid change. Our core values showcase who we are, and we strive to focus on excellency and sincerity.\nWe are seeking a talented, Creative Web Designer and Illustrator to join our Design Department. In this role, you will work collaboratively with other designers, developers, and product managers to create visually stunning web designs and illustrations that meet business requirements and user needs. You will be responsible for the design and creation of user interface elements, graphics, and illustrations that will be used in web applications and digital products.\nWant to make a real impact? Click here and find out how!\n\nClick here to learn more about accessiBe's #companyculture\n\nWhat you'll be doing:\nCollaborate with cross-functional teams to understand business requirements and user needs and iterate design concepts based on your findings\nDesign and create visually appealing web layouts, graphics, branded icons, and illustrations using Figma and Adobe Creative Suite, and other relevant design software\nDevelop wireframes, prototypes, and high-fidelity mockups for web and mobile applications\nWork closely with developers to ensure designs are implemented accurately and efficiently\nProduce high-quality illustrations and infographics for various marketing materials, web pages, and social media platforms\nEnsure all designs are optimized for different screen sizes and resolutions\nContinuously stay up to date with the latest design trends and technologies\nContribute to the development of the design system using components and variations in Figma and contribute to design standards, style guides, and best practices.\nRequirements:\n\n3+ years of experience in visual web design and illustration\nProficiency in Adobe Creative Suite and other design software\nExperience working in an Agile environment and collaborating with cross-functional teams\nExcellent communication and problem-solving skills\nStrong understanding of typography, color theory, and composition principles\nA portfolio that showcases your visual design and illustration skills\nBachelor's degree in graphic design, web design, or a related field\nIf you are passionate about visual web design and illustration and enjoy working in an Agile environment, we would love to hear from you!\nPlease submit your resume and portfolio for consideration.Show more Report"}, {"company": "FORTVISION", "job": "Strategic Partners Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=124&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6c5a4813&cb=1678899806334&jobListingId=1006136614520&jrtk=3-1-1grj3k00mpkev801-1grj3cg4j227a000-98d0e4ca616332cc-", "description": "We are looking for an all-star Strategic Partner Manager to join our Tel Aviv team . This person will be directly responsible for managing advertisers' agencies and identifying up-sell /optimization opportunities at scale. The ideal candidate will be sales oriental, entrepreneurial, analytical, designer, creative and have strong relationship management skills.\nResponsibilities and skills:\nBuild a strong relationship with the media planners within each agency\nIdentify upsell opportunities at scale within each agency and their customers\nDrive the entire sales process, from introduction, demos / meetings to closing deals\nProvide feedback to customers on product offering and how to best service advertiser's needs\nHelp customers with campaign strategy & optimization and increase customer satisfaction\nTroubleshoot and resolve issues in a timely manner\nIdentify opportunities to improve products and the customer experience\nRequirements:\n2+ years’ of experience in ad agency with deep understanding of brand strategy and performance campaigns- a must!\nExperience in a lead generating / sales planning / strategic planning preferably at a digital media/agency company - a must!\nExperience in client-facing in the digital media /online publisher space - preferred\nProven communication, presentation, phone etiquette and general sales skills (mainly cold-calls).\nExperience in structuring and negotiating deals within the digital media space.\nA true passion for marketing, interactive & engaging content, native advertising and a strong sales drive.\nStrong analytical skills to collect business intelligence by conversing with clients and identifying trends.\nAbility to effectively prioritize and manage tasks within a fast-paced environment\nDemonstrated ability to work and collaborate within a high-performing team\nSelf-motivated, entrepreneurial, and comfortable dealing with ambiguity\nMail your CV to jobs@FORTVISION.comShow more Report"}, {"company": "Cardo Systems", "job": "Graphic/UX Designer – Temp position", "city": "Raanana", "date": "30d+", "rating": "4.2", "link": "", "description": "Cardo Systems, the global market leader in the field of wireless communication systems for motorcycle & ski helmets, is looking for a creative and energetic Graphic/UX designer to join our marketing team.\nFull-time, temporary position (9 months for maternity leave replacement) in a hybrid model (from the company's offices at Raanana/from home), reporting to the Director of Corporate Marketing.\nJob Description:\nThe ideal candidate will continue developing the company-wide design language that is in tune with both the market esthetics and the company’s brand pillars, control all up-to-date design tools for online and offline use, and become an integral part of a dynamic marketing team.\nAs part of your creative job, you will be required to interpret our marketing needs into design/UX solutions that create an impact and drive our brand forward. To complete your tasks, you are expected to be responsible for company-wide design language and master a variety of products, for both online and offline use, for example, company website product packaging, brand guidelines, company collateral, infographics, presentations, exhibitions, video art to name but a few.\nRoles & Responsibilities:\nThink creatively and lead the development of new design concepts, graphics, and layouts\nCultivate a solid body of work\nWork with a wide range of media and use graphic design software\nPrepare rough drafts and present your ideas\nAmend final designs for comments and gain full approval\nWork as part of a team with other marketing team members\n\nRequirements:\n\nRequirements:\nMin. of 3 years experience in graphic design roles – a must\nExperience working with Adobe: XD, InDesign, Photoshop, and Illustrator software – a must.\nAbility to perform independently and under pressure\nDemonstrable graphic design skills with a strong portfolio\nPossession of creative flair, versatility, conceptual/visual ability, and originality\nPrior experience working in consumer electronics companies and/or global companies – an advantage\nProfessionalism regarding time and deadlines\nAbility to interact, communicate, and present ideas\nEnglish – high proficiencyShow more Report"}, {"company": "Connecteam", "job": "Creative and Social Media Lead - Digital", "city": "Tel Aviv-Yafo", "date": "6d", "rating": "4.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=126&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b0097279&cb=1678899808734&jobListingId=1008519162488&jrtk=3-1-1grj3k2avp6dk801-1grj3cg4j227a000-6e313cf2cfcae3cd-", "description": "Marketing\n\nWho Connecteam is:\n\nConnecteam is a TLV-based startup that's on a mission to change the work experience for 80% of the world's global workforce - the frontline employees.\n\nOur business management platform helps thousands of businesses thrive by taking away the daily hustle and complexities of managing teams, so they can have the peace of mind to grow and run their business.\n\nWhat is Connecteam Digital?\n\nOur goal is to extend our vast knowledge from working with tens of thousands of customers, on business and employee management to every business owner and manager, by creating and delivering educational value and entertaining organic content via digital platforms.\n\nAs Connecteam Digital's Creative and Social Media Lead, you will be in charge of guiding and approving creatives and leading the Social Media channels plan (both Connecteam's and Connecteam Digital's).\nYou will work directly with our Head of Digital and be in charge of developing the social media strategy and growing all of our channels further, social media content publishing strategy, and engagement while being involved in the creative process for our Digital and social content.\nWhat's the job?\n\nAs Connecteam's Creative & Social Media Lead, you will be the leader of our Social Media team and the creative in social media and Digital's content series to help reach a mass audience and deliver value content to our current customers and similar target audience while growing our followership.\n\nWe see our developing Digital and social media division as a crucial channel to be able to deliver high-quality educational content to reach the maximum exposure of our current customer and targeted audience to become the leading content creator in that field!\n\nWe are looking for a strong strategic, operative and creative mind to be able to lead the social media strategy that includes regular posts, valuable content, engagement strategis, involvement, activities, collabs and contests, noise, RTM, rapid responses, intelligence, social listening.\n\nWhat you'll be doing:\n\nExecute the Social Media Strategy - both Connecteam's regular pages and Connecteam Digital's pages\nBuild and Manage the social media team\nWork closely with the Head of digital\\content and the digital content creator\nBe involved in the content creator's creative process and approval\nIn charge of aggregating and publishing content via social media from all stakeholders\nApprove posts before published\nExecute commenting and social listening strategy\nManage and execute publishing plan according to Gantt and editorial calendar\nWork with the Studio and Digital team's production stakeholders (videographer, producer, designer, etc.)\nIn charge of growing our accounts reach, engagement and followership\nIn charge of making social media noise, contests, activities, etc.\nIn charge of being highly involved on social media on behalf of Connecteam's channels\nEnsure consistency in the brand's voice, messaging, and style\nFollow up on results, optimize and improve forward\nOpen and manage more social channels\nBe on top of Social Media changes, updates, and new features to utilize\n\n\nWhich qualifications you'll need:\n\nNative written and spoken English - MUST\n+4 years of Experience in Leading and building roles of Digital and Social Media in Media, TV, Radio, Journalism, News, etc. - MUST\nProven record of developing, leading and growing Social Media teams\nStrong builder skills and strategic mindset\nStrong creative mindset\nStrong understanding of the Social Media space, algorithms, strategies and tactics\nInterest in the business world and helping business owners and managers grow their businesses\nSolid understanding of the digital space\nHigh-performance execution\nAutodidact and a can-do mentality\nExcellent interpersonal and organizational skills\nAbility to work under pressure and meet tight deadlines\nAbility to collaborate and work with diverse stakeholders\nEnthusiastic to learn and grow\nFlexible and agile\nHiring process with us:\n\nAt Connecteam, we aim to complete our hiring processes at lightning speed, keeping the time between when we receive your CV and you (hopefully) sign with us super short, communicative, and transparent.\nJoining Connecteam Is The Smart Move:\nWe build our people up. Every team member is treated as a long-term investment and we recognize the value in always nurturing and training them so they can go above and beyond in their skills and job duties.\nWe make an impact on our customer's business. We are on a mission to provide managers of all business types and sizes with the tools they need to communicate, operate, engage, and run their deskless workforce. Our product offers them an effective and affordable solution to run their business.\nWe get the job done. Connecteam employees are passionate in executing their job duties so they can drive the company forward and provide real value to our customers.\nWe have fun! From weekly happy hours to holiday parties, we always enjoy each other's company (and good food, of course). Connecteam is like one big, happy family!\nEveryone is welcome. Connecteam is committed to building an encouraging, caring, and supportive environment. We share a responsibility to support our team and enrich their lives.\nTogether we will shape the future of work!Show more Report"}, {"company": "Spike", "job": "Head of Design", "city": "Herzliya", "date": "30d+", "rating": "3.1", "link": "", "description": "Spike is looking for a super creative and independent Head of Design to lead and deliver innovative and effective design solutions for Spike’s ongoing activities.\nWhat will you do?\nLead the development and evolution of the company's brand identity, ensuring that all of Spike’s creative assets align with the brand guidelines and values.\nApply Spike’s visual language to all of our assets in a coherent, on-brand style.\nDesign (hands-on) all of Spike assets: website, landing pages, app store pages, social media, display ads and campaigns, blog posts, videos, decks, etc.\nOversee the Design team (currently one motion designer).\nWork closely with Marketing, CS, Product, and Dev teams around all creative needs.\n\nRequirements:\n\nYour background and experience\nGraphic design degree, with an impressive portfolio of marketing collaterals.\n4+ years of working as a Marketing designer preferably in tech companies.\nExtensive experience with web design (must!), UI/UX, and working with dev to build and QA all of the company’s online projects to perfection.\nExperience in designing various creative materials such as ads and banners, mobile app campaigns, social posts, App store pages, blog posts, and more.\nProficiency with essential design tools: Figma, Adobe Photoshop & Illustrator etc.\nGreat understanding of motion design concepts and processes, from storyboard creation to execution.\n\nAbout the company:\n\nAbout Spike:\nWorking with multiple workflow and communication apps can be overwhelming, time-consuming, and let’s be frank – annoying. And yet, you need all of them.\nThat’s why we made Spike — a place where you can email like chat, collaborate with your team, create notes, docs, plan, organize and keep it all together in one place – your inbox.\nSpike is used by over 100,000 teams worldwide, including teams at Philipps, Shopify, Fiverr, Zillow and more.\nSpike is backed by some of the world’s best investors - Insight Partners, NFX, Mozilla and more.\nSpike is located in Herzliya and this is a full-time positionShow more Report"}, {"company": "Lightricks", "job": "Marketing Studio Designer", "city": "Jerusalem", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=128&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7da6fe50&cb=1678899813029&jobListingId=1008459100383&jrtk=3-1-1grj3k6j4k60u801-1grj3cg4j227a000-e1f47f0b0a7c7901-", "description": "Creative & Design: Creative MarketingJerusalem\nWho we are\n\nLightricks is a pioneer in innovative technology that bridges the gap between imagination and content creation. With a mission to push the limits of technology to reimagine the way creators and brands express themselves, the company brings a unique blend of cutting-edge academic research and design to every user experience. Our photo and video editing tools, including Facetune, Videoleap, and Photoleap, offer endless possibilities and inspiration, while our creator services, Popular Pays, provides content creators the ability to partner with brands to monetize their work and offer brands opportunities to scale their content through tailored creator partnerships. We focus on putting creators in the center and empowering them from the moment inspiration strikes.\nThe Marketing Studio is an internal studio for the Lightricks Marketing department. We create stunning visuals for many marketing channels and build visual guidelines for all the Marketing Creative teams. We define the apps’ brand values in the various marketing campaigns.\nAs Marketing Studio Designer you’ll be working on a wide range of projects such as AppStore & Google Play Store visual language, newsletters design, social media materials and more. If you’re passionate about image making, typography, motion graphics & design trends - this is the opportunity for you!\nWhat you will be doing\nCreating visual assets that will appear on our app stores.\nCreating newsletters that engage and inspire our users.\nCrate design guidelines that highlight our brand's vision and fit marketing needs.\nCreating visual content for our social media channels such as instagram & TikTok.\nCollaborate with our product marketing managers & copywriters to refine the messaging we communicate within the content.\nKeep track of the latest design trends and research the market to distinguish ourselves from our competitors.\nKeep branding consistency within the Lightricks brand and our products.\nHave fun. Be creative.\nYour skills and experience\nBachelor's Degree in Visual Communication.\nExceptional online portfolio.\nStrong fundamentals in design, image making, typography, motion and attention to details.\nHighly proficient in Photoshop, Illustrator & Figma. After Effects - a plus.\nSelf-starter, self-motivated, ability to work independently and in a team environment.\nAbility to work under pressure and time constraints.\nStrong communication skills, both in Hebrew & English.Show more Report"}, {"company": "TechSee", "job": "Marketing Graphic Designer (Maternity leave replacement)", "city": "Herzliya", "date": "30d+", "rating": "4.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=129&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ff0f2c03&cb=1678899818038&jobListingId=1008441234902&jrtk=3-1-1grj3kbfbjm57801-1grj3cg4j227a000-2de17dc341b5e725-", "description": "About the Company:\nTechSee is the leader in Visual Engagement. TechSee is revolutionizing the technical support and field services industry through Augmented Reality and AI technology. A proven leader in the market, Techsee has hundreds of customers including Vodafone, Orange, Hitachi, and dozens of Fortune 500 companies. TechSee is rapidly expanding globally and is backed by leading venture capital firms like Salesforce Ventures, Telus, and OurCrowd.\nEmployees at TechSee are supported through a flexible work environment that allows for working from home or coming into one of the many WeWork offices.\nThe opportunity:\nTechSee is an established technology innovator, providing the world’s largest brands with interactive visual assistance at true global scale.\nThis is an opportunity to join a dynamic team that works with top global brands in the US and Europe. We are looking for a creative and highly skilled graphic design lead to join our growing global marketing team.\nThis role will work with the Marketing team to create a wide range of visual assets to drive the company’s sales and marketing performance.\nResponsibilities:\nManage the end-to-end design process, prioritizing and communicating as needed with all relevant stakeholders.\nMaintain and refine our visual brand language across all branded assets.\nGenerate graphic materials for marketing and sales collateral: presentations, brochures, white papers, emails, webpages, infographics, trade show booths, advertising, etc.\nEmpower the team with the guidelines, presentation and document templates and branded assets to enable content creation with minimal design oversight.\nEdit basic marketing videos and motion graphics (GIFs)\nAssist with other marketing-related and company projects as required\nRequirements:\n3+ years of experience in graphic design for a B2B marketing team in the tech sector.\nExperience presentation and document design as well as print requirements.\nStrong experience empowering teams do create their own assets in Google Slides, Docs, Canva\nFamiliarity with WordPress, Elementor, HTML, CSS – advantage.\nBasic knowledge of video and audio editing software (Primer, After Effects) - advantage.\nPassionate about turning marketing concepts into creative, visual deliverables.\nStrong team player, with excellent communications and interpersonal skills, experience with project management (Asana experience a plus)\nHighly organized, creative thinker and problem solver\nEnglish mother tongue\nAvailable to collaborate with partners and teams in the US during their morning hours.\nWhy work with us?\nOur culture encourages collaboration and emphasizes success, personal and professional development.\nTraining & Career path: Formal development of your skills, including leadership skills in addition to learning TechSee’s market-leading AI and AR solutions,.\nCompensation: Strong benefits and an ownership (equity) in a high-growth SaaS venture\nTools: Provide you with the resources needed to achieve your goals and development skills.\nWork environment: Hybrid work environment, with frequent virtual social activities to promote employee engagement.\nCulture: TechSee is a fun and exciting place to work, empowering its employees to bring out-of-the-box thinking to generate cool new ideas. Our culture encourages inclusive teams and emphasizes care and collaboration.\nSuccess: TechSee has established a global presence, trusted by Tier 1 enterprise customers across the telecom, consumer electronics, manufacturing, insurance and many other industries. Our product is used in the by companies like TELUS, Verizon, HIPPO, Lennar, Vodafone, Hitachi, Samsung, Heineken and more!\nThe company is headquartered in Tel Aviv with oﬃces in New York, London, and Madrid.Report"}, {"company": "Silverfort", "job": "Product Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.9", "link": "", "description": "Silverfort is a Tel Aviv-based cyber-security start-up that develops a revolutionary identity protection platform. Using patented technology, our product enables strong authentication across entire corporate networks and cloud environments, without any modifications to endpoints and servers. In addition, we use advanced behavior analytics to apply adaptive authentication policies and prevent cyber-attacks in real-time.\nOur mission is to provide industry-leading unified identity protection solutions for hybrid and multi-cloud environments. We develop cutting-edge cybersecurity technology that solves urgent customer needs today and is also a game changer for years to come.\nSilverfort has happy customers worldwide, strong market validation (including several industry awards), strategic partnerships with the largest security vendors in the world, and significant funding from leading VCs.\nIn this role and as the first Product Designer at Silverfort, you will be responsible for leading the design of our product, working closely with our engineering, product, and marketing teams to create intuitive and visually appealing user experiences.\nRequirements:\n\n3+ years of demonstrated experience with end-to-end (UX and UI) product design in a B2B product company\nExperience in designing dashboards and making complex data accessible and intuitive to take action upon\nExcellent human relations and a high level of service\nStrong skills in design software such as Sketch, Figma, or Adobe XD\nA strong portfolio that showcases aesthetic awareness and design problem-solving abilities\nAdvantage - experience working in a cyber security company\nResponsibilities:\n\nGenerate clear ideas, concepts, and designs of creative assets\nConduct a full design cycle - from collecting inspiration through creating a pixel-perfect design, ending with delivery, and supporting development\nCreate and improve our design system\nWork closely with the engineering team to guide them through the successful implementation of your design\nStay up to date with the latest UI trends, UX patterns, techniques, and technologies\nWe are an enterprise product that thrives to have a cutting-edge user experience\nDrive adoption with intuitive user flowsShow more Report"}]]