[[{"company": "Global-e", "job": "QA Engineer - IL", "city": "Petah Tikva", "date": "6d", "rating": "3.2", "link": "", "description": "We're looking for a QA Engineer to join the Global-e Core R&D department and take a significant part in the delivery of Global-e's core system.\nWe’re looking for someone who's passionate about technology and software testing, with end-to-end experience in testing web applications in a complex, cloud-based environment.\nThe core group is responsible for the most important components of the system providing a multi-tenant, fully customizable checkout experience; APIs for e-commerce platforms integration; end-to-end payments solutions that involve third-party integration in a secured payment environment.\nRequirements:\n\nAt least 3 years of proven experience in manual testing web applications\nProven experience with writing and executing STP / STD / STR\nProven experience in writing SQL queries (MSSQL)\nExceptional interpersonal skills\nStrong ability to deep dive into the problem and find the root cause\nPrevious experience with e-commerce systems - strong advantage\nExperience with Postman -advantage\nB.Sc. in Computer Science or other technical fields – advantage\nExperience working in SCRUM methodologies – strong advantage\nGlobal-e is an equal opportunity employer. Our team is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and welcome applications from people of all walks of life. Our people play the key role in our success, and we are always looking for more driven, talented, and ambitious individuals to join our growing international family.Report"}, {"company": "BUFFERZONE Security", "job": "QA Engineers", "city": "Herzliya", "date": "30d+", "rating": "3.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=1136043&s=58&guid=00000186e64138dca5381d1b475b8a99&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_254614ff&cb=1678900465117&jobListingId=1006729600525&jrtk=3-1-1grj483btkhoo801-1grj42ea0227a001-c1bae74f345d1b04-", "description": "We are looking for motivated and talented people to join our team. If you are looking for a challenging position in a fast-paced start-up environment, please send your CV to us at careers@bufferzonesecurity.com.\nBUFFERZONE’s QA team is responsible for verifying that all product releases meet the highest standards. As a member of the QA team, the QA engineer will be responsible for planning, writing and executing product test plans, both manual and automatic. The job requires a good understanding of the MS Windows environment, Windows applications, client-server systems, and security applications.\n\nResponsibilities\nPlanning test cycles according to Product Requirements, Design Documents and work plans\nWriting detailed and creative manual and automated test plans\nCreating and executing tests\nProviding technical support for the product when needed, mostly in English\n\nRequirements\nExcellent English – spoken and written\nSelf-motivated and independent learner\nTeam-oriented, methodical and organized\nEnergetic and willing to work in a fast paced environment\nPrior experience with Active Directory, networks, file sharing systems, security software\n2-3 years experience in QA – an advantage\nBachelor’s degree in Computer Science, Engineering or equivalent technical field experience – an advantage\nPrior experience with JIRA – an advantageShow more Report"}, {"company": "ironSource", "job": "Manual QA Engineer", "city": "Tel Aviv-Yafo", "date": "24h", "rating": "4.3", "link": "", "description": "ironSource Aura, a revolutionary large-scale mobile platform, is looking for a great QA Engineer to join a new emerging team that will be working on our main product. Our team uses the latest and greatest technologies to build scalable products which reach and influence millions of users around the world. The team’s technological stack includes Web, Android, Frontend, Backend, Data and more.\nWe value team players with technical excellence and a sense of ownership who know how to choose the right tool for the right task.\nRequirements:\n\n1-2 years of experience in manual mobile QA\nStrong analytical and problem-solving skills\nExperience in writing QA test plans\nAbility to multitask and work on multiple technical areas simultaneously\nA great team player, who loves to be part of a technical team\nExcellent written and verbal communication skills, fluent written and verbal English\n\nRole:\n\nJoin a top-notch engineering team and work on disruptive products\nAssure that our millions of users around the world will receive state of the art products\nWork with product and engineering to define testing plans and scope\nPerform functional testing for new features, regression testing, and track defects\nBusiness Unit:\n\nR&D\n\nAdvantages:\n\nB.Sc in CS/Engineering/Mathematics/Physics or equivalent\nExperience with testing tools such as adb, fiddler and logcat\nExperience in mobile testing\nExperience with SQL\nExperience with writing test plan\nExperience with Android studio + adb commandsShow more Report"}, {"company": "ESN Global Media", "job": "QA Engineer", "city": "Ramat Gan", "date": "20d", "rating": "4.1", "link": "", "description": "We are looking for a QA Engineer to join our team.\nFor this position, you'll need to have great technical skills, prior experience testing consumer products, and a comprehensive understanding of QA workflow and technology in general.\nYou should have a keen eye for detail and excellent communication skills. If you are also adept at executing test cases manually and are passionate about quality - we'd like to meet you.\nRequirements:\n\nAt least 1 year experience working as a QA engineer with consumer-based productsExperience in running manual tests on web and mobile applicationsLove of process, documentation, and methodologyStrong interpersonal, relationship management, and facilitation skillsExcellent written and verbal communication skills in EnglishAbility to drill down into the smallest of details while guarding the true essence of the productShow more Report"}, {"company": "Unleash Labs", "job": "Junior QA Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=1136043&s=58&guid=00000186e64138dca5381d1b475b8a99&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_65eb2e88&cb=1678900469469&jobListingId=1008312736637&jrtk=3-1-1grj487jskblo801-1grj42ea0227a001-688b85a5fdbf4a2e-", "description": "Unleash is powering the productivity revolution by providing users with a centralized way to search through their cloud based apps and local desktop. A light weight search interface allows users to enter their search query and receive relevant ranked results which are yielded in seconds.\n\nAs a user centric company, we place a great deal of emphasis on users experience when building our product and have fun doing it!\n﻿\nWe are a fresh and energetic startup, post round A in funding ($12M), led by a strong team of second timer founders and top angel investors and VCs from the Sillicon Valley and Tel Aviv. Our expanding team is made up of enthusiastic and dedicated members working together to revolutionize the productivity world. We believe that collaboration across teams - where everyone is accessible, from our newest hires to the founders - combined with a vested interest in our teams well being are the keys to our successful working environment.\n﻿We are looking for a Junior QA Engineer to join our R&D team and continue growing our product!\n\nYour main responsibilities will include:\n\nPlanning and execution of tests on both Front and Backend sides as well as integrations with external services\nExecuting hands-on manual tests of the companies products on different OS\nUse a variety of tools for debugging and executing tests\nReporting and tracking issues (bugs and tasks)\nWorking collaboratively with other team members from the Product and Development teams\nReport to QA Team lead\nRequirements and Qualifications:\n\nGraduate of a software testing course or a relevant academic degree\nAt least 1 year of experience as a manual software tester\nUnderstanding of client/server model\nExperience working with Linux & Mac\nGood inter-personal skills\nIf you are a bright, pro-active, ambitious and naturally curious person who shares our value of teamwork, and you hold these skills, send us your CV!Report"}, {"company": "Via", "job": "QA Engineer", "city": "Tel Aviv-Yafo", "date": "2d", "rating": "3.9", "link": "", "description": "Via is using technology to transform transportation around the world. From changing a single person's daily commute to reducing humanity's collective environmental footprint — we've got huge goals.\n\nAs a QA Engineer, at Via, you will be a part of the end-to-end quality assurance team, working in close collaboration with our product and development teams on new product launches. in this role you will act as the critical link between technical teams and implementation with our partners. You'll be a powerful part of Via's testing service, making sure we deliver reliable and delightful products.\n\nWhat You'll Do:\n\nBuild and run organized processes of manual QA testing\nDevelop and execute test plans covering sanity, functional, regression, and performance tests in an end-to-end environment\nInvestigate, identify and report bugs discovered in our flows\nValidate and test a wide variety of technologies and platforms\nCreate documentation, implement new QA processes and improve existing ones\nVerify that real-world use cases and user expectations are simulated and met during the validation process\n\nWho You Are:\n\n1- 3 years experience working as a QA engineer with consumer-based products\nYou have experience in running manual tests on web and mobile applications\nYou have a love of process, methodology, and documentation - specifically in writing test documents like STD, STP, STR\nAbility to work across multiple new projects simultaneously - you're organized, independent, and eager to learn\nYou're a team player with strong interpersonal, communication, and relationship management skills\nAbility to drill down into the smallest of details while guarding the true essence of the product - you are passionate about the end user experience\nExperience in a fast-paced environment with a rapidly growing product\n\n\nWe're Via, and we build technology that changes the way the world moves. We pioneered the TransitTech category to ensure that the future of transportation is shared, dynamic public mobility — the kind that reduces carbon emissions across congested cities, minimizes reliance on private cars, and provides everyone with accessible, efficient, and affordable ways of getting around.\n\nWith the addition of Remix into our portfolio, we created the first end-to-end TransitTech solution for cities and transit agencies, offering world-class software, service design, and operational expertise to fundamentally improve the way the world moves.\n\n\nWe're committed to building and nurturing a team as diverse as the communities we serve. Bringing transportation equity to the world begins with championing equal opportunity in our own offices. All backgrounds, identities, and voices are welcomed and celebrated here.\n\nReady to join the ride?\n\nVia is an equal opportunity employeReport"}, {"company": "vFunction", "job": "Manual QA Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=107&ao=1136043&s=58&guid=00000186e64138dca5381d1b475b8a99&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_cfd5acd2&cb=1678900472203&jobListingId=1008459641601&jrtk=3-1-1grj48aa3p2kk801-1grj42ea0227a001-e4ee805f76f58597-", "description": "vFunction is the first and only AI-driven platform for architects and developers that intelligently and automatically transforms complex monolithic applications into microservices, restoring engineering velocity and optimizing the benefits of the cloud. Designed to eliminate the time, risk, and cost constraints of manually modernizing business applications, vFunction delivers a scalable, repeatable factory model purpose-built for cloud native modernization.\nWith vFunction, leading companies around the world are accelerating the journey to cloud-native architecture and gaining a competitive edge.\nWe are a first-of-a-kind, cloud-native modernization platform that uses dynamic analysis, static analysis, data science, and automation to enable organizations to transform 100s of Java monolithic applications a year into microservices and provide continuous modernization.\nJob Description:\nWe are looking for a Manual Quality Engineer to join our team, to help us test and improve our product.\nAs part of the role, you will work closely with the R&D team and our PM. Your role includes testing API, creating, executing, and maintaining automated UI tests, and investigating test results on daily basis. We expect you to raise issues, flag problems, find bugs and errors, work professionally with R&D teams, and help troubleshoot issues. You will proactively bring new ideas and promote innovation, design test strategies, and test plans and document technical issues.\nRequirements:\n3+ years of proven experience as a Quality Engineer\nExperience in UI and REST API testing.\nStrong knowledge of Unix/Linux OS, SQL, and Networking.\nAbility to handle complex technical environments and troubleshooting.\nAbility to write technical documents.\nAbility to work independently and in a team.\nBe organized and detail oriented.\nGood verbal and writing in Hebrew and English (A Must)\nPreferred Skills:\nExperience testing in a Java code environment.\nExperience working with public clouds.\nKnowledge of JVM tuning and profiling.\nKnowledge of Docker, Kubernetes, or other containerization platforms.\n\nPlease contact us with questions or to apply.Show more Report"}, {"company": "Aiola", "job": "QA Engineer", "city": "Herzliya", "date": "1 day ago", "rating": "5.0", "link": "", "description": "At aiOla, we live by our mission - to bridge the gaps between Human Intelligence and Artificial Intelligence while connecting the “AI promise” for the masses. aiOla provides you with real-time, natural language ontology-driven, user-friendly, multi-sourced business insights, and intelligence on the go. With vital intelligence at their fingertips and fast access to everything they need to know when they need to know it, your frontline employees are supercharged for success.\nOur growing team of Product, Data Science, Data Engineering, Analytics, and Customer Success professionals in Israel and in the US is composed of passionate, bright minds and uncompromising ambition, boasting hundreds of years of collective experience!\naiOla's unique culture is shaped by its people - with exceptional individuals, eager to learn from one another and create extraordinary solutions. Surround yourself with visionaries and creators, enthusiastic about generating a real impact on everything they do, and you will never cease to learn and grow. Join Us in Pushing the Limits of Human Intelligence!\nResponsibilities:\nTake responsibility from the spec phase to post-production support\nCreate detailed, comprehensive, and well-structured test plans and test cases.\nTake an active role in version testing and pre-release processes\nPlan, analyze, design and execute manual and automated e2e tests of new and legacy features\nCreate new automated tests\nInvestigate customer issues\nBe a part of agile team\nWork closely with other QA engineers, developers, product and architects.\n\n\n\nRequirements:\n\nBSc in Computer Science.\nExcellent analytical and problem-solving skills\nAttention to detail, self-learner, with good communication skills\nStrong knowledge of QA Documentation and methodologies - Advantage\nPrevious Experience writing automated tests - Advantage\nExperience in TS/JS programming languages - AdvantageReport"}, {"company": "Viber", "job": "QA Engineer - Temp Position", "city": "Ramat Gan", "date": "20d", "rating": "4.4", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=109&ao=1136043&s=58&guid=00000186e64138dca5381d1b475b8a99&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a9a0f795&cb=1678900474959&jobListingId=1008487597890&jrtk=3-1-1grj48d0ejrp9801-1grj42ea0227a001-6a4d66cf9a71125e-", "description": "Viber is one of the most popular apps in the world, and the most downloaded app to have come out of the start-up nation. Working with Viber is a unique opportunity to influence the hundreds of millions of people using our messaging app.\n\nThe QA Team at Viber tests innovative features and products at the user level, both manually and with automated tools. We work with development engineers to understand technical implementations and with the product team to define the desired user experience.\n\nAs a QA Engineer at Viber you will be responsible for understanding the domain and the product in detail, coming up with the test strategy, planning, and test cases, all while focusing on delivering the best possible user experience.\nThis position is a temp position for 9 months\n\nResponsibilities\nReview product and technical documentation to ensure the requirements that meet the goal are unambiguous and verifiable\nPlan and execute test plans, test cases, and produce test reports\nPush for and strive to resolve issues without compromising quality\nMaintain effective communication between all project members at all testing stages to ensure all information regarding product quality has surfaced\nWorking with automation tools – writing test cases and monitoring results\nRequirements\n2+ years of QA experience\nTest planning and design (STP, STD, and STR) experience\nDeep understanding of QA processes and test methodologies\nMobile testing experience\nApplications testing experience\nEnglish proficiency – both speaking and writing\nStrong technical background\nExcellent written and verbal communication skills\nAdvantages\nAutomation tools/test writing experience\nBasic knowledge in coding/scripting in any language\nAcademic degree in Engineering, Computer Science or related field\nISTQB course/certification\nAbility to understand client and server logsShow more Report"}, {"company": "Unleash", "job": "Junior QA Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.3", "link": "", "description": "Unleash is powering the productivity revolution by providing users with a centralized way to search through their cloud based apps and local desktop. A light weight search interface allows users to enter their search query and receive relevant ranked results which are yielded in seconds.\nAs a user centric company, we place a great deal of emphasis on users experience when building our product and have fun doing it!\n\nWe are a fresh and energetic startup, post round A in funding ($12M), led by a strong team of second timer founders and top angel investors and VCs from the Sillicon Valley and Tel Aviv. Our expanding team is made up of enthusiastic and dedicated members working together to revolutionize the productivity world. We believe that collaboration across teams - where everyone is accessible, from our newest hires to the founders - combined with a vested interest in our teams well being are the keys to our successful working environment.\nWe are looking for a Junior QA Engineer to join our R&D team and continue growing our product!\nYour main responsibilities will include:\nPlanning and execution of tests on both Front and Backend sides as well as integrations with external services\nExecuting hands-on manual tests of the companies products on different OS\nUse a variety of tools for debugging and executing tests\nReporting and tracking issues (bugs and tasks)\nWorking collaboratively with other team members from the Product and Development teams\nReport to QA Team lead\nRequirements and Qualifications:\nGraduate of a software testing course or a relevant academic degree\nAt least 1 year of experience as a manual software tester\nUnderstanding of client/server model\nExperience working with Linux & Mac\nGood inter-personal skills\nIf you are a bright, pro-active, ambitious and naturally curious person who shares our value of teamwork, and you hold these skills, send us your CV!Show more Report"}, {"company": "Rivery", "job": "QA Engineer", "city": "Ramat Gan", "date": "30d+", "rating": "5.0", "link": "", "description": "Rivery’s SaaS platform provides a fully-managed solution for data ingestion, data transformation, data orchestration, reverse ETL and more with built-in support for your data operations development and deployment lifecycles.\nRivery’s data solutions are used by some of the world’s biggest brands, enterprises, and startups in over 20 countries. Our platform helps data professionals, CIOs, BI analysts, and marketing experts solve complex data challenges. As our company grows, we are looking for the brightest minds across multiple disciplines to join our teams in the US, UK, and Israel.\nWe are looking for a QA Engineer to join our growing R&D department.\nAs part of your role in Rivery you will work closely with all R&D engineers, helping them test their developments, define DODs and improve the stability and quality of our service.\n\nIn this role you will:\n\nDesign, develop and execute test scenarios for our service\nWrite test documents such as STP, STD, STR\nUse different testing techniques such as system, integration & API, UI testing\nRequired skills:\n\n3 + years of experience as a manual QA engineer\nExperience with UI and API testing\nKnowledge in various DBs such as MongoDB, MySQL, Postgres etc.\nAbility to self-learning and a passion for discovering & learning new things\nHigh attention to details\nStrong knowledge in QA processes and methodologies (experience in writing and executing STP, STD, STR)\nFamiliarity with formal testing tools like swagger, postman, wire mocks etc.\nAdvantages:\n\nPython knowledge\nWillingness to expand to automated testsShow more Report"}, {"company": "Lemonade", "job": "QA Engineer", "city": "Tel Aviv-Yafo", "date": "24h", "rating": "3.6", "link": "", "description": "We're looking for an experienced QA Engineer who is passionate about technology and inspired by great UX.\n\nYou'll be instrumental in bringing features to the finish line while collaborating closely with developers, as well as with the Product, Data, and Machine Learning teams—all with the goal of delivering a seamless, joyful experience for our customers.\n\nIn this role you'll\nAnalyze user stories to identify test cases, ensuring an appropriate mix of manual and automated test coverage\nMentor others and promote effective quality assurance strategies and best practices\nUse data to assess the quality and identify improvement tasks that should be prioritized\nProvide an assessment of delivery readiness and collaborate with other teams to ensure timely release\nHelp maintain our outstanding customer experience by having a diligent eye for UI details\nWhat you'll need\n4+ years experience as a QA engineer\nHands-on experience running manual tests on multiple platforms for user-facing products\nAbility to create beautifully written test plans, define testing strategies, and document knowledge\nExperience in coaching and mentoring junior QA engineers\nSuperior analytical skills, with a problem-solving attitude\nExcellent written and verbal communication skills in English\nExperience with Postman and API requests\nExperience with UI or API automation tools (Cypress, Testim, Loadmill, etc.) is a major advantage\nAbility to work in an office environmentShow more Report"}, {"company": "RecrutiX", "job": "QA Engineer - database products", "city": "Israel", "date": "1 day ago", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=1110586&s=58&guid=00000186e64138dca5381d1b475b8a99&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_adb20a1b&cb=1678900479661&jobListingId=1008528078902&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj48hiqkblv801-1grj42ea0227a001-d5ed8ddda10520fb--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBV4Er2R3GvIzh06eqkk7BZDY4tHmMKCQ2iU2nXWIgrtECFE02siKSB6P4R9GP0Oc7yo4RjsT5ZbhoFMkpH7AI0dH74FebC-zrW_RHhuE9tG-TdnZaCbdf0fuwREsPKk6a4hH6uVqNgY0rhZ42GU72yfM96ITA9UDZGpVHhbvoddWnFG2s9dht3nWH_-J3aPinOaZwNO786dqchcwjqR3vP9HB3rTmLGFuINhvK_gUEuFLDAnl_o7JcMQUuz6ctkO-COPC01bYRzlPpZB1MD1CMYUsg7x0-9Pc3rhuVBGioakXrI5ytqI1lcU0rQ82o1bmHkSyI4SY2yTfp92523lqATUjOIs4O7G1JfbH4-ArkjWIlxTqVIKtJOasDvJU-54Hw4_Q3efZHYv5ugVcCJlXFhdNou2jv7fgUf1117F_7iLdwVW3REMYOrhyMWLgrYxMtv158d-KTqALr4zlZVUXJIIQDn_LkL-pjtjUf7GALo5xPErZ1e85NrL0ZG_a76mZSSk9uOoOQJ2WHZLzakRPKt7tbln86VHjFSjf3IKC9K0Iuh4-A443ygxur5MmRCXkfcIEbxZdmXyzC2f_4YSrCaM43Edpo-IvcvVrmPUW_gQ2xIZmD3VFZJU2MCBkef8PmVwi-BAKBhRTLe_Cmiu16ciDUGLpnDyU%3D", "description": "We are looking for a talented QA Engineer to join our Engineering team and help build the company’s cloud cybersecurity solution for the automotive industry. This role is full-time and is Herzliya Israel based. Responsibilities Interface daily with our R&D teams to identify and resolve problems found during testing Work in close cooperation with product management architects and developers Deeply understand the business and technical requirements of existing and new products Work according to high execution standards, while adhering to project goals and ensuring high quality Create and execute manual Tests 3+ years experience as a QA Engineer Experience with database products such as PSQL - a must Proven experience in functional, regression, and integration testing Ability to write clear, concise, and comprehensive test plans Ability to research and resolve technical issues Highly organized and able to consistently deliver excellent quality on a timely manner Self-directed, flexible, and adaptable Excellent English communication capabilities (verbal and writing) Strong team player Knowledge and previous experience working with cloud platforms (primarily Azure and AWS) Practical knowledge of application security and vulnerabilities - an advantage Experience with Selenium-based tools - an advantageShow more Report"}, {"company": "Zota Technology Limited", "job": "QA Integrations", "city": "Tel Aviv-Yafo", "date": "20d", "rating": "3.6", "link": "", "description": "We are:\n\nZotapay is a payment gateway technology hub, serving as a one-stop-shop for online businesses, enabling them to accept payments from anyone, anywhere. We are connected to over 1000 financial institutions worldwide, allowing us to centralize a range of global and local payment methods, on one payment page.\n\nAbout the opportunity:\n\nThe Integration Team is looking for an Integration Engineer with a passion for managing integration projects and cooperating with different parties. Your mission will be to complete payment gateway integration project with our providers.\nWhat you will do:\n\nKeep engagement up with a high-speed development process and ongoing deliveries - executing and adjusting your project plans accordingly\nManual QA and verification of integrations and workflow\nWork closely with the development team and gateway providers to deliver new products\nReport bugs and work out the solutions\nProvide information on the completed integration to the operation team\nAssist on side-tasks related to product improvement\nRequirements:\n\nAt least 1 year of tech project management or manual QA experience\nKnowledge of tools, concepts, and methodologies of QA – nice to have\nFamiliarity with REST API documentation, Postman, JSON, Browser stack\nPassion for troubleshooting and constant self-learning\nAbility to quickly learn new features and adapt to innovations\nSharp attention to detail\nFluent in spoken and written English\nGreat team player with the ability to work with minimal supervision\nSpecific skills\nWhat happens after you apply?\n\nOur HR team is invested in creating the best candidate experience possible, so we will be in touch, once we have reviewed your CV, regarding any next steps.\n\nIn the meantime, you can check out our website and social media pages to learn more about us.Show more Report"}, {"company": "code value", "job": "QA Engineer", "city": "Herzliya", "date": "7d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=115&ao=1136043&s=58&guid=00000186e64138dca5381d1b475b8a99&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_529698a2&cb=1678900481839&jobListingId=1008514797496&jrtk=3-1-1grj48jnhk62o802-1grj42ea0227a001-c24e13cdf29344a9-", "description": "About The Position\nAbout Us:\nCodeValue, founded in 2010, is a leading dynamic software development and consulting services company.\nWe deliver tailor-made innovative solutions and services ranging from focused product and technology analysis, to comprehensive development and in-depth consultancy.\nOur solutions address varied needs across every domain, from startups and mid-size firms, government agencies, public and private enterprises, and global corporations.\nTechnology is at the heart of everything we do. We consider ourselves lucky since we are able to turn our hobby into a prosperous career. Being a dynamic software development and consulting company means we never stop learning, evolving… Growing. Join us and always be one-step ahead!\nRequirements\nWe're looking for responsible, hardworking, willing to work in a dynamic and demanding environment, Independent, fast learner, motivated team player.\nSkills:\nAt least 3 years of hands-on experience in a similar role.\nTesting experience with event driven and microservices architecture.\nExperience with API testing.\nStrong knowledge in QA processes and methodologies (experience in test planning, test design, test strategy, and test execution).\nStrong analytical abilities and troubleshooting skills.\nAbility to quickly learn new concepts and software.\nA responsible and dedicated worker, willing to work in a dynamic and demanding environment.\nMotivated team player who helps drive the team forward.\nFamiliarity with formal testing tools like swagger, postman, wire mocks etc.\nNot a must but a great advantage\nGood knowledge and Experience in SQL.\nExperience with Scrum methodology.\nExperience with Mongo DB, Rabbit MQ.\nStrong web technology skills and experience with testing web applications.Show more Report"}, {"company": "Eitan Medical", "job": "SW QA Engineer", "city": "Netanya", "date": "7d", "rating": "3.6", "link": "", "description": "Eitan Medical is a fast-growing global medical device company, developing and manufacturing innovative drug delivery and infusion solutions across the continuum of care – from the hospital to the home. We are looking for an excellent SW QA Engineer to join the R&D team.\nJob Description:As a software testing Engineer you will be responsible for designing, planning and execution of test scenarios.Responsibility for finding defects and failures during system development and verification by manual and automatic testingInterface with the project's development teams to deliver a high quality product to be used on people.\nDirect Manager: SW QA Team Leader\nRequirements:\n\nEducation:\no QA course and / or ISTQB certification or a scientific degree - advantageJob skills:\no 1-2 years of experience in writing and running manual tests\no Experience in converting software requirement specification documents into testing documents.\no Experience in writing Software Test Plan - an advantage\no Knowledge in automation testing – an advantage\no Past experience in a medical device company – big advantage\nComputer skills:\no Knowledge of all major Office applications (Word, Excel, PowerPoint);\no SQL DB – writing and running queries (Join Level)\nLanguage skills:\no Fluent English - writing and verbal.\nPersonality: Highly motivated, able to work under pressure and meet aggressive schedulesShow more Report"}, {"company": "Vulcan Cyber", "job": "Manual QA Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.8", "link": "", "description": "Vulcan Cyber helps cybersecurity teams stay on top of their game with end-to-end cyber risk management. Some of the world’s biggest companies turn to Vulcan to go beyond scanning data and actually mitigate cyber risk.\nEvery day, we work to become the essential tool for cybersecurity teams worldwide. We're looking for people who can make us better, keep us on our toes and help us transform the industry for good.\nRight now, we’re looking for a Manual QA Engineer to join our team in TLV.\nIf you're a Vulcan, you have big ideas, live for the challenge, and love what you do and the people you do it with. You know that the best perk isn't the free food, the dog(s) in the office, or the remote working policy (don't worry, we have those too). It's the feeling that you're an integral part of building something great.\nFeeling the vibe? Keep reading.\nWe are seeking a skilled Manual QA Engineer to join our team and help us improve the quality and efficiency of our releases. The main goals of this position are to identify and troubleshoot bugs, and to ensure that our products meet the needs and expectations of our customers. The ideal candidate will have a strong understanding of testing methodologies, the ability to analyze and translate business requirements into effective test cases, and the ability to work effectively in a fast-paced agile environment.\nWhat you'll do:\nAnalyze and translate business requirements and user stories into test cases, testing suites, and testing scripts.\nTroubleshoot customer scenarios and reproduce them in-house.\nDesign and implement tests, debugging, and review system requirements.\nAct as a quality gate for releases.\nWhat you have:\nAt least 3 years of experience testing complex web applications.\nDeep understanding of various testing methodologies.\nStrong analytical and technical skills.\nWorking experience in a high-paced agile environment.\nWhat we'd love to see:\nExperience with testing tools such as Postman and Cypress.\nStrong problem-solving skills.\nCybersecurity experience.Show more Report"}, {"company": "מיקרופוקוס", "job": "QA Automations Engineer", "city": "Israel", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=118&ao=1110586&s=58&guid=00000186e64138dca5381d1b475b8a99&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d7a177e0&cb=1678900485850&jobListingId=1007892433967&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj48nkjkhr2801-1grj42ea0227a001-22a0f2c931f77a9a--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNCyO9D9YVC0ZKip1rXlUIpC9ugSsv6CUIXBvXnHzS3FmrSVX7mxugvN5FdNF8QMLo58n6SEYGVoG7-STGxeOF29teL83Ph4yBab6EIQSlbSUcVODxdYwshKv-vpNmyjeiDS53DNlrUB3seE5K9nF-W7MZuoO9ffp7_d51V1Jbiqp1dWDe3U6wNbnptVwOWhbO1SSC2pMEWl3cm6Rr8f7xgp7qMIpBee04HfdUoQi4vnEVEhSv-wmKiNfhWpXMn6oPG9KsLwEtDh7W-notIoDzwJeUWsucUjiJOJRznidOefM3SwSXvK6qcYyYS8Pq1qFBCBqQ7hecS-T3_pu0G3062yuZH7xm4nobZYX7PKUcZMuCr6sB00zMIjFh_o_m0uDR3ZmIkxI1PZNVFCI2VUznL8ZTRVTZ3aMRz6tSvZy9RqcIUD2PuXs2VHj3kAW-Bsnh7aLQ_x38Q0_LH-lpSh_rPA1prX0oiuR0RnErQaBBsY0qkkz2FlHNr1ByH_seqrOjKTK8NLWub6XvGNHl6HLIVcPFu14X6TcHrjkJ50LsX2PJ6xsCBiAeEj2IqLFxc5PYkzX2WiVx5Dryt4mxX8oYe7jWh_GX9BNA0U2yAlt_0hAFJX9CYEE2yW8awqmmw0qg3ExAXRCm5CXFU9gmWiPP01umY51uZvVqE%3D", "description": "We are looking for a talented Software Quality Engineer to lead our rapid agile plans and join the growing R&D team which builds our LoadRunner Cloud products suite. Responsibilities: Take full testing ownership and lead the quality of OneAnalysis Product Write automated tests over existing automation framework as well as contributing to extend the frameworks according to product needs File defects with appropriate supporting information for development to investigate and prepare a fix Work with Developers during the entire product lifecycle, Participate in the Agile/SCRUM process Cooperate with UX, UI and functional architect for specifications, user interaction and graphic design Work according to high execution standards, while adhering to project goals and ensuring high quality Bachelor’s Degree in Computer Science (or equivalent) Demonstrate a strong sense of ownership which drives you to find ways to do things better, faster, and more efficiently Good understanding of the Agile software development lifecycle Solid English communication capabilities (verbal and written) Demonstrate strong knowledge with test strategies, test design and test types Experience with UI testing, and preferably with framework development Experience with JavaScript, TypeScript Experience with Protractor - big advantage Experience in test automation – Prefer, at least 2 years of experience Experience in manual testing – Must, at least 2 years of experienceShow more Report"}, {"company": "Splitit", "job": "QA Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.0", "link": "", "description": "About Splitit\nOur mission is to help consumers responsibly enrich their lives by leveraging the credit they’ve already earned in a new and impactful way. Today consumers want control of how they pay for the things they want and need. Splitit is the only Installments-as-a-Service solution that enables consumers to use their existing credit to break payments into smaller, bite-sized pieces to pay over-time with no interest, applications or fees. That keeps money in the hands of shoppers to use as they want. By helping shoppers pay small we help businesses grow big. That’s a win-win. Splitit operates globally, with teams distributed around the world with offices in Atlanta (HQ) , Melbourne, and Tel Aviv.\nSplitit is looking for an experienced QA Engineer that lives and breathes technology to help us achieve the best quality through manual testing and monitoring. You will be a part of the QA team who are responsible for Splitit’s product quality while executing at a fast pace. You will be part of the execution process, as well as responsible for improving it, and make business critical decisions.\nThis role requires excellent communication skills, as well as deep technical knowledge. Ultimately, you will ensure that our products, applications, and teams work flawlessly.\nResponsibilities include:\nMaintain and improve the quality driven execution of the organization, including its processes and procedures.Drive the company's quality strategy with the evolution of the company and its highly technical product.Help in driving the culture of quality, helping teams to be more independent and efficient in delivering with high quality.\n\nProfessional Requirements:\n2+ years of experience as a QA Engineer.Experience in project management and QA methodology.Knowledge in testing methodology, product lifecycle.Experience working with web apps.Experience in Functionality, usability, performance, Sanity and regression tests.Experience in writing and executing SQL queries.Familiarity with Postman and API tests.Ability to work and make decisions under pressure.\n\nPersonal Requirements:\nHighly organized and accurate, good eye for detailResponsible and dedicatedA team player with excellent interpersonal relationship skillsAble to work independentlyExcellent English skillsReport"}, {"company": "ONE ZERO Digital Bank", "job": "QA Engineer", "city": "Tel Aviv-Yafo", "date": "8d", "rating": "4.5", "link": "", "description": "ONE ZERO is seeking a skilled Quality Assurance (QA) engineer to develop and execute exploratory tests. This role involves designing and implementing tests, debugging and defining corrective actions, reviewing system requirements and tracking quality assurance metrics (e.g., defect densities and open defect counts).\nRequirements:\nA minimum of 3 years of experience as a quality assurance engineerKnowledge of QA processes and methodologies (experience with test planning, test design, test strategy, and test execution)Experience in testing Mobile applications- both iOS & AndroidExperience with API testing tools (Postman, Playground, etc.)Ability to read logs and identify critical informationExperience with project management tools (Jira, TFS)The ability to communicate in English (verbally and in writing)Strong analytical abilities and troubleshooting skillsAdaptability to new concepts and softwareSelf-motivated and capable of dealing with ambiguity in order to solve problems\nResponsibilities:\nDevelop and execute testing plans leveraging comprehensive knowledge of complex system business logicConduct end-to-end (E2E) testing of mobile (iOS, Android) and service components with a holistic understanding of the entire systemAnalyze & debug logs and tracesInvestigating production issuesCollaborate closely with Product and R&D teams to ensure that high-quality deliverables are achieved.\nAdvantages:\nA fintech background is a big advantage\nScrum methodology experienceAutomation testing and framework experienceExperience with SQL/Oracle DB, MongoDB\nExperience with sniffers such as: Charles, Wireshark etc.Report"}, {"company": "myteam", "job": "Junior Manual QA Engineer - AVA", "city": "Israel", "date": "15d", "rating": "4.3", "link": "", "description": "AvaTrade company, located in Herzliya is looking for a Manual QA\nThe Role / Responsibilities:\nWrite and execute manual tests.\nUse bug-tracking systems to submit, track and manage defects.\nAnalyze the results of the tests performed and provide meaningful reports to the project team.\nMaintain software testing artifacts.\nUse queries to create test data and analyze results.\nWork with other testers and key stakeholders to ensure coverage for each software release.\nAssist with the analysis of story-level requirements.\nClarify functional requirements.\nRequirements:\n3 years in Software Quality Assurance-Must\nExcellent understanding of the Test Life Cycle\nAbility to multi-task and learn quickly is a must.\nGood knowledge of HTML, CSS, web and mobile standards is required.\nWorking with log analytics tools (like Cora Logix/Sumo Logic)\nExcellent understanding of web-based Client/Server architecture\nExperience in SQL query writing\nExperience with e-Commerce systems and CRM systems.\nExperience with TFS/Jira\nExperience with Scrum/Agile methodologyReport"}, {"company": "Intercontinental Exchange", "job": "Manual QA Tester", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=122&ao=1136043&s=58&guid=00000186e64138dca5381d1b475b8a99&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_34e9c79e&cb=1678900490475&jobListingId=1008331138566&jrtk=3-1-1grj48s4ikf2u801-1grj42ea0227a001-06208f3442bd8580-", "description": "Job Purpose\nMarket Data is looking for an Experienced QA Engineer to join our team in Tel Aviv. Be an integral part of all the product development lifecycle: plan the testing activities, set bugs, manage specific modules testing plans and assist to R&D. Responsible for building and executing test strategy and plans across multiple product lines in the fields of high frequency and large-scale market data.\nResponsibilities\nTake responsibility from the spec phase to post-production support:\nCreate detailed, comprehensive, and well-structured test plans and test cases.\nPerform the manual test plan, Identify, document and track bugs\nplan production deployment perform post production sanity.\nLead the production support of this development.\nEnrich the automation with the new feature tested\nKnowledge and Experience\nExperience as a QA Engineer testing complex server-side application (not only API testing)\nunderstanding of the server components integration and load limitation\nStrong knowledge of QA Documentation and methodologies.\nKnowledge in SQL- ability to understand, read and write SQL queries\nSolid knowledge of software quality assurance methodologies (ISTQB certificate advantage)\nExperience with the full product release cycle\nSchedule\nT his role offers work from home flexibility of up to 2 days per week .Show more Report"}, {"company": "אביבית דבוש גיוס והשמה", "job": "QA Automation Manager /QA Automation Developer", "city": "Israel", "date": "2d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=123&ao=1110586&s=58&guid=00000186e64138dca5381d1b475b8a99&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_02d98e17&cb=1678900491548&jobListingId=1008525853156&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj48t6hk25h801-1grj42ea0227a001-1e4c12acfa4eb587--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNAySOC0vL1bnH0kYBOB2o0TojTOD6nq89bkB8TMtTSR0KiDIoy7Glov9IW3CwY9UxDsj0EggtZlNxfOUTQkioFq51mPN3WbfKwPpK977n4S5MohORzPrarCYnNIzZS-wcd2m_t6X8RUyBtaVIhbKauQt4RofNamkMLqYXr1pK2OOxfr5CcqZPPiVnEi0MTZtmASQ8JNi-4PuBXIaYziMBELCF2DbfS7aBldSBSOYPMBL_4Nuj1ls-MyXU-i0jabdAycuSWCRxd49puR3w-prTVjA-vMykKUCGsxvUI5iAr0jvSuDHhrUq5nPe65bvN2tKAu2z8fa70VZ9HkapWqDhTEPF35PNw6wCn4tTmPKfRpLhP90dz2GdWKnP_phFuLsXaBroMX3WkFFufoIgZ3IdyHh_HcOITvp0GLPHTlb0TKIoMmoRESELcweyaIm_tDHlqUR6Rnk3VVJUZvu9dN6pkAq-ZDTWEqEHo5m5igH4QXME1Z99ExfIoGzFNTnP1SjVsmd8NZfVp_7nGfrBjWFtXaHquy_vVRWwTFFbbc5yiVU60hp-5iMlHD-D7O6O6H-9F6qMfJuKEvkqywcxyCU6YNwK9V8ii04mOpMGHz_BzIyw63msz_zcyCOarmWsAa9nNp5OQp2HYgz9SFf0562CECr2PWbELWPN4%3D", "description": "QA Automation Manager 5+ years of proven work experience in QA Automation – Must 2+ years of proven work experience in Managing QA Automation teams – Must Solid knowledge of software QA and Automation methodologies, tools, and processes. – Must Experience in Building / Maintaining / Enhancing infrastructure for QA Automation - Must Solid knowledge of Linux OS and Monitoring/Testing Linux resources (Memory, CPU, Limits, Etc.) – Must Experience coding in Python – Must Solid Experience in SQL – Must Proven experience in a cloud environment (AWS/GCP/Azure) Experience working in an Agile environment Experience working with a large scale system Proven work experience with Databases B.Sc. in Computer Science or Information Systems Senior QA Automation Engineer At least 3 years of SW Engineering experience with an Object-Oriented Programming language (Python/Java/C++/C#/etc..) Automation testing experience (methodologies, tools, and processes) Experience with a Software source control system (Git/Mercurial) Basic knowledge in Linux/Unix operating systems Ability to multitask, display flexibility, and work independently. Strong analytical skills.\n\nAbility to see the big picture and at the same time to pay attention to details A team player with excellent communication and interpersonal skills Experience in CI/CD process and Test Management Systems - advantage Understanding of the networking principles (e.g. DNS, routing) - advantage Familiar with Cloud Providers technologies - advantage.Show more Report"}, {"company": "Nayax", "job": "QA Engineer (Embedded)", "city": "Herzliya", "date": "6d", "rating": "4.1", "link": "", "description": "Nayax is looking for a QA Engineer to join the Embedded group. You'll work in a fascinating and diverse multi-disciplinary environment, utilize your testing skills together with your passion for technology and help create an exciting and unique product released in high quality.\nYou should apply if you are a communicative, analytical, problem solver, tech savvy, who doesn't fear a challenge. We offer a great working environment in a successful company and development opportunities going forward.\nThe QA Engineer will report to Embedded Software QA Team Leader.\nIN THIS POSITION YOU WILL:\nPlan, conduct, and monitor manual testing and inspection of features and physical products.\nWrite test plans.\nInvestigate customer complaints.\nCollect and compile statistical quality data.\nAnalyze data to identify areas for improvement.\nPrepare reports to communicate outcomes of quality activities.\n\nRequirements:\n\nWE ARE LOOKING FOR SOMEONE WITH:\n0-1 year of experience as a Manual QA Engineer.\nKnowledge in STD, STP, STR documentation.\nKnowledge of tools, concepts, and methodologies of QA.\nProficient in English - a must.\nAttention to detail.\nGood analytical and troubleshooting skills.\nA good team player – a must.\nADVANTAGES:\nProduct or industry-specific experience (payment/embedded)\nKnowledge with SQL\nKnowledge with Jira\nExperience with Python for automated scripts\nWHY YOU WILL LOVE THIS JOB:\nYou will have the opportunity to work in a multinational environment for a global market leader.\nInterested in automation? In the near future we plan on becoming fully automated.\n\nWho we are:\n\nNayax is a leading global end-to-end retail technology platform for unattended & attended commerce. Our mission is to simplify commerce and payments for retailers while driving growth, optimizing operations, and enhancing consumer engagement.\nNayax Israel is located in the prestigious Herzliya Hills, just a short drive north of Tel Aviv or a very short walk from the train station.\nOur open space offices accommodate our 400+ employees and when we’re not hard at work, you can find us enjoying an afternoon coffee on the balcony. We’re the largest Nayax site, housing over 20 different departments.\nFor a glimpse of what it's like to work at Nayax, check out our Instagram account! https://bit.ly/3G3QDc4.\nCheck out Nayax's page under \"Best Cool Israeli Companies 2022\" by Secret Tel-Aviv: https://bit.ly/3LqzElA.\nNayax is constantly growing and we are always on the lookout for enthusiastic, innovative and eager individuals to join us in our growth!Show more Report"}, {"company": "LiveU", "job": "QA Engineer", "city": "Kfar Saba", "date": "30d+", "rating": "4.4", "link": "", "description": "What’s LiveU\nLiveU is driving the live video revolution, providing live video streaming for TV, mobile, online and social media. Let your audience become part of your story with high-quality and flawless live video, transmitted from anywhere in the world, through the use of our patented bonding and video transport technology. LiveU creates a consistent bandwidth and a reliable connection so you can acquire, manage and distribute high-quality remote live broadcasts.\nLocation: Kfar-Saba, Israel\nWe're looking for a motivated and diligent QA engineer with at least 1 year of experience ,to join our growing team.\nYou will be working closely with cutting edge technology in a fun and dynamic environmentResponsible for the quality of the Core functionality of all LiveU's productsRepresent the QA discipline in a scrum team, create, review and execute manual and automated test plansFocal point for specific features from start to end of development\nRequirements:\n\nB.A degree in any field\nExperience in embedded system testing\nAt least 1 year of experience in a similar role\nLinux: system administration, networking and debugging\nOpen and flexible to work in an Agile culture\nFamiliarity with defects tracking systems and tests creation tools\n Cognitive and interpersonal skills\nIndependent and fast learner\nCuriosity, problem finding and solving skills\nEffectively communicates in a dynamic and fast-paced team\nExcellent communication skills in both Hebrew and English\nAdvantages:\nWorking with docker\nWorking with GIT\nISTQB certification or other QA course graduate\nBasic capability of scripts writingShow more Report"}, {"company": "Imomony", "job": "Manual QA Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "2.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=126&ao=1136043&s=58&guid=00000186e64138dca5381d1b475b8a99&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_3fbb444b&cb=1678900494865&jobListingId=1006775189270&jrtk=3-1-1grj490e0joq9801-1grj42ea0227a001-186af7b048d2367c-", "description": "We’re looking for magnificent, creative and curious Manual QA Engineer to join our great QA team\nQualifications:\nIf you have:\n\n2-3 years of experience in Manual testing from Internet / Online companies\nIn Client -experience / Server and Web security, Writing STP, STD and STR Documents\nFamiliarity and experience with SQL\nExperience working in an Agile / Scrum – an advantage\nExperience working around Linux / Unix- an advantageShow more Report"}, {"company": "קווליטסט", "job": "Manual QA Tester", "city": "Israel", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=127&ao=1110586&s=58&guid=00000186e64138dca5381d1b475b8a99&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e53332be&cb=1678900495976&jobListingId=1008451918422&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj491gs34av001-1grj42ea0227a001-112425d27b61c6e4--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBh999vSCxEVZCJ4KPH77PMzjalCdn_JC5vsVZAxqHEYFDpDP224AHWdDn8pbxdx8TUCwYXRxLdNyrjFnW9N1cu2I_DJ-Sefe7yumbH6zXOnbmn-piW1hj5oQ9jrVSZuOtYy7Iwr1lGmivat4nbT-PAtgUQlpyXFQZ55ecXvKFVfge0DReBNSjdXrrNvbwSzyqtJDtYELD811WdZxcmOZEm61rySkCihf7tA1kE0TrkiNVmWQnBfbwOqcB9qmk0qeolG61LXkzHAN0WzKmh_ALG5KWiLnnSE0PvY--vQSCfJ4m04NwVYF9UjvSn2ZI219RjROuPpcfehYbI_vaiPDn0reRy50DwASu4dgpBYimwUi42hkKZ3pNiVbXG8hEQ9bLk0NpFLqniYDyfhFXYpbsGmPh0zeDScZC93PGCLY2UyvJtf7kcDNyxo__99RQoIO0U-mT8CfCKMuHnh5RVNfZ57mT9PlYVYHhzwRbInOQ4TmJXtC3HbxbstgxqgdLqy3ozIqxF-v3azbBRLqmFwUIh1Z3_4Eu2LNvBVsyaabUVoVkZ857LRXsT0svi5ow6VHfbj3RPKtdopd_k3vik-rFXLtqUztpf31PVQPTahm6QlXGWsaFbp5PXQmCMy73Q8kdZWLrRBDJROaLCWc4vh7K9Hh6GmVpEsvQ%3D", "description": "Qualitest is looking for a talented QA engineer to work with one of Israel's leading Defense industries. This position is located in Haifa At least one year of experience in QA system testing At least one year of experience Reading system requirements and writing tests according to them Quality Center or any other bug tracking tools Someone who is looking for a long-term job Testing and supporting development of precise guided munition products. Review and analyze system specifications as well as execute test cases (manual) and analyze results. Report bugs and errors to development teams and help troubleshoot issuesReport"}, {"company": "Munters", "job": "Manual QA engineer", "city": "Petah Tikva", "date": "30d+", "rating": "3.8", "link": "", "description": "Looking for the perfect job Climate? Come join us at Munters.\n\nOur controllers are the #1 product in the climate control and agriculture field.\n\nWe also keep our internal atmosphere worm and familial.\n\nIf this sounds interesting, your place is with us.\nWhat will you do?\nDesign and execute manual tests based on specifications\nRunning tests on a multidisciplinary product\nUse different testing techniques such as system, integration & API, UI testing\nUse bug tracking system, to submit, track and manage defects\nWrite test documents such as STP, STD, STR\nHelp troubleshoot issues\nDesired Skills and Experience\n2+ years of experience as a manual QA engineer\nAbility to self-learning and a passion for discovering & learning new things\nHigh level of English\nHigh attention to detail\nExcellent communication skills\nAdvantages\nQA Course\nFamiliarity with: bug tracking systems\nISTQB certification\nExperience in software quality assurance testing on a multidisciplinary system\nExperience in Agile development methodologies\nExperience in testing WEB applicationReport"}, {"company": "Medulla", "job": "לחברת סייבר סקיוריטי מעולה דרוש/ה QA Engineer", "city": "Israel", "date": "30d+", "rating": "3.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=129&ao=1110586&s=58&guid=00000186e64138dca5381d1b475b8a99&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_3f942e82&cb=1678900498103&jobListingId=1008333133789&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj493htma4r801-1grj42ea0227a001-88932f7fa52cc988--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNDufml3-demlxrWTocDeqnLuRQe-DQ5bnAvAcHn54vgtf_DGPHmDN1pTZIW8Owc5T4MgAvo-_JAhEs7Oj1yWNZ4JSMXXuU4ao8gg4HglHnhVGP91EDUu4GwZ5tg3QZKCDEV7egyi8hGBqyFFQqQzb_oFDig1dPemYSDRDZuIhC6DmcC7s78HVXz5P2M0lAMlygKSjhY0LC8ThpMUfAUgl7JNTnfvdKHYfkyxhbewgVzaxHpwGPXa6rabWoS_bL8SgiINyYqfc1khYPFVqYb99js9xo040CYEoEOZ4i6r95jsSTQm4JWOQ935RynUTz2ZffQe99pypF7fNWuxRp5J8PtuJ4ZFxQ9wdFt5nrMttry-frMYiUcNlbHZaIU9kD6czF7UG45vsmj5GxhScl3se5C8dxFeLoPthSlRBJzh4R7OZ7R6lFa0g6go6qfLJdaGnK-7f_LUMvc79LTX0-BAeg6n7rbhnV__GWHH_Le-aUSXAuk93OJAI_Hpdq57PnrBQIYojCeWvDwCcH76X-mSUp7Xpa2csdyrX7lpEg46EMcpofXdqc5dXmBgkvHYDim4r_1EQU_iSnO1bfAOt8UO_JY1R2ssH3tMusXbcdFNb5lCvR8Ujn7khvU1kIq2rGqHhXQky93psiIg3wF89OvN4vvH3QXPWesvsU%3D", "description": "חברת סייבר סקיוריטי בתחום הרכבים האוטונומיים מחפשת QA Engineer למשרה מעניינת ומאתגרת המשלבת בדיקות ידניות ואוטומציה ועבודה על מערכות מורכבות. **משרה היברידית הממוקמת בהרצליה לפחות 3 ניסיון בבדיקות- חובה SQL- חובה ניסיון עם WEB- חובה הבנה במוצרי saas- azure, aws . דאטה בייס -יתרון משמעותי. ניסיון עם תשתיות אוטומציה וסלניום- יתרוןShow more Report"}, {"company": "אנטריפוינט", "job": "QA ENGINEER", "city": "Southern", "date": "29d", "rating": "3.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=130&ao=1110586&s=58&guid=00000186e64138dca5381d1b475b8a99&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_cef64fea&cb=1678900499755&jobListingId=1008470436895&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj4956kjm5o801-1grj42ea0227a001-51bd15173f1c085a--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tGRBbjy15RxGaEEw7KZU_HLkpz7fXyhUyZD4sCVu0vCr8HyXNusnycnLr-zB7we-orlGgtl7eYAW7MMS2beTTiH6RpRZuogsF0o6fJpG03JrOp2Lfeco-1hx1F8qMgWRfegnXClOffbhZpvauKR-cTMZsSP0xK23aGn5IzJz70xFbRHzcpVdztxzeDjhwD7qrLwCBmkOIdHoRc4UAEDoCZ_E3wFq0Cyt9bZkHYxhHsUgdPK7kBrN-GX7pVzeP7tWk3IzcOucoL8I31htXJXNrFGec_YrC0PITbCpJotequZ83B17_UHpC3KVAMzZZ7sVrYeXiFB3b0UoeWRc8hWBjsTiqX8vVw68whEtzWA-6_7hfafaYWVZZDKbUhCXa5TpiU-cH1DZ7U4-ibM3gux4tUgQMjlkTQo5uVwRT6T8STGFUAUlMhfwDvtYAaxjeKzC0u8IyOKzuJj5SZdr7MoGgZmzqge5oiBIPaQKsPs3kZaig3FqBZXAL_3Fc34EXqAgRcXmgbom6hSjpTubh7Fyba1FusPc5P5PutuE7-9FhlrdooJicE-0cJdxD51KHOZuCBP63nb8JF_lasWC16kZUBSL0BZTAonfXTqgp-FIe09hdkLbJoGz4l9W5AZiByxk4IxXqXIV6Qt40yKuJkfaPifgIHTRbFxrU8gTYoEMUQRnM4I9-xyYe0GtgtGCoF0G_A%3D%3D", "description": "לחברת מדיה הממוקמת בתל אביב דרוש/ה QA ENGINEER עם ניסיון ב WEB&MOBILE למשרה מלאה. 3+ ניסיון QA ידני ניסיון בבדיקות אתרים/וואב אפליקציות ניסיון בבדיקןת אפליקציות מובייל ניסיון בכתיבת מסמכי הבדיקות (STP, STD, STR)Show more Report"}], [{"company": "CrowdStrike", "job": "C++ Windows Sensor Engineer - Data Security, Israel", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=101&ao=1110586&s=58&guid=00000186e6418308bf92147c0eb17bea&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_45f6919c&cb=1678900501768&jobListingId=1008414783574&cpc=9BE7264F9E667C9B&jrtk=3-1-1grj4975gkltp801-1grj4317e227a000-0b71b029fbaaa0c2--6NYlbfkN0BJMW_X9OCLkZ04_weh8WkR-IGNb1MhigwTP7XGwrJOFwZb96yIISkY_qENr62JHCFeH7fHADQaV5Q8ssq_J0de5IYCbVEiRyTI7Kb1sZt28DnvkXJMeDE7QJHEJOLHl85jdw6oDqs_lmSvQrY-hFfblHX7bp842-IiAu9EuIMU1EYo0I5b-0l74wVJyX-0bnaeRdPXeNh9wTA_qJK-Na15eVdbKJ3dxp_DmENsyL2-x-S38hZ3jnZ-Uyjwdr65RKFH27VEbwGb4RokFeFGnRWZT_RMIPvlSAy1E6G6oyqH_zQvcHIVuETlSZL1ep5f6QLRSJ-BMX6v0rXlhPnZREE3gW_O8zHnUmoNFLdfaY0gdFA6gkoXRuYX2kPe6TxEeh48klZazg--TSu7pJncIBCTQz15Kkb7Nun-OWOiK4PRV34y185vT4aHGnHxdrmRy8cezbtqH1uo7baROaV9NJR0PiWa-m13Nk-K_aNPUDBuvAekdAYjkU19avBRHJ6djVqs92oYcCX84OxUCSn06rNsdKOraM8AaxKPzo95yWowBCm9X4Gd_XpOQrPVfaw2kLCgZLeFr2FJ6s7hhqRJ5-Ouk4ZohhC2PSfruU9wnj0k6qDmiG-JVSMVnNJD4SMZaQF3ROVB9zKLCoe6wYvpGJZSx2qPefu3AXNLbagwJ4Me4JL1GE8wcTA3bx4h328MBvvLlOVdTwLkqLkYlFrasBM0oEV1-zEdLfP3pw6fdVljMw%3D%3D", "description": "#WeAreCrowdStrike and our mission is to stop breaches. As a global leader in cybersecurity, our team changed the game. Since our inception, our market leading cloud-native platform has offered unparalleled protection against the most sophisticated cyberattacks. We’re looking for people with limitless passion, a relentless focus on innovation and a fanatical commitment to the customer to join us in shaping the future of cybersecurity. Consistently recognized as a top workplace, CrowdStrike is committed to cultivating an inclusive, remote-first culture that offers people the autonomy and flexibility to balance the needs of work and life while taking their career to the next level. Interested in working for a company that sets the standard and leads with integrity? Join us on a mission that matters - one team, one fight.\nAbout the Team:\nYou’ll be joining our Data Security Product Group, whose mission is to build a unified data security system which enables customers to identify and investigate insider threats, identify access to and movement of sensitive data, and ensure regulatory compliance by mitigating data loss risk.\nAbout the Role:\nCrowdStrike Falcon Host is a two-component security product. One component is a “sensor”, which is a driver installed on client machines that observes system activity and recognizes malicious behavior, then provides on-box prevention capability and remote telemetry to the Falcon Host cloud. The cloud component aggregates sensor telemetry for each customer’s network can correlate malicious behavior across multiple machines and presents our customers’ operations teams with a prioritized summary of the threats detected in their environments.\nJoin CrowdStrike and become a key leader in building the most innovative endpoint security solution in the world. Our sensor development team is responsible for building the endpoint sensor which deploys on multiple platforms including Windows, Mac, and Linux. As a Software Engineer, you will be expected to have ownership over major components and development projects. You will be required to assist with architecting solutions and support in implementing our core features. Features will cross-cut most core OS subsystems such as file system, memory and process, and networking. Many features are also built in a way that they will have shared components across multiple platforms. You need to be able to lead projects efficiently while maximizing performance and minimizing costs, making sure high standards are being followed when it comes to design, coding quality, and unit and component testing.\nResponsibilities:\nProvide partnership on the sensor development team involved in architecture, strategy, in building and improving next-generation Anti-Virus and Enhanced\nDetection and Response Security Software\nDevelop new product concepts\nSupport development teams in designing and building software with cross-platform deliverables (Windows, Mac, Linux)\nOwn features from design to delivery including participation in product demo at the end of the sprint\nCollaborate with multi-functional teams in various locations\nRequirements:\nIn depth knowledge with C++ and Windows development\nStrong low-level OS internals in either Windows, Mac OS, or Linux\nExperience debugging memory corruptions, process contentions and system performance\nExperience working with teams to ship major features and releases.\nLead, mentor, communicate, collaborate, and work effectively in a distributed team.\nPreferred Requirements:\nOS system expertise for core concepts and subsystems\nKnowledge in Security\nStrong background in scalable, light-weight and highly performing systems\nFamiliarity and experience with Agile process\n#LI-YA1\n#LI-MZ1\n#LI-DS2\nBenefits of Working at CrowdStrike:\nRemote-first culture\nMarket leader in compensation and equity awards\nCompetitive vacation and flexible working arrangements\nComprehensive and inclusive health benefits\nPhysical and mental wellness programs\nPaid parental leave, including adoption\nA variety of professional development and mentorship opportunities\nOffices with stocked kitchens when you need to fuel innovation and collaboration\nWe are committed to fostering a culture of belonging where everyone feels seen, heard, valued for who they are and empowered to succeed. Our approach to cultivating a diverse, equitable, and inclusive culture is rooted in listening, learning and collective action. By embracing the diversity of our people, we achieve our best work and fuel innovation - generating the best possible outcomes for our customers and the communities they serve.\nCrowdStrike is an Equal Opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected veteran status, or any other characteristic protected by applicable federal, state, or local law.Show more Report"}, {"company": "CrowdStrike", "job": "Sr. Sensor C++ Windows Engineer - Data Security, Israel", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=1110586&s=58&guid=00000186e6418308bf92147c0eb17bea&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a110f7bc&cb=1678900503217&jobListingId=1008423542364&cpc=24589B7DFBADF147&jrtk=3-1-1grj498i7kclj801-1grj4317e227a000-31dc5dfc4e448001--6NYlbfkN0BJMW_X9OCLkZ04_weh8WkR-IGNb1MhigwTP7XGwrJOFwZb96yIISkY_qENr62JHCH2LykahT18vvzPAhujoXjuM5KC3Y-91QFJbpYm2iGPIpjzeCjA9AwNc_MZe1zizxCMPYSPS0tI7vM-1_24SRmO5XeHIr90hML9YRIdU4-qCpL9pmFobhu0wCckS-9cg8tFeJqahu33tWSL3y3No_23au20T_XAvKoPXbdRsqzbJQFrB2ZDZTYxgRcbHmwQSJPkfZq4alJzeGoFOG-zuIdCZmCg4fz0HKWwelc5Lz46GH-gMczO2hK3g8T_xpd9yHOr1uDCN_F45_wtbsoHb17o7VnW5cWQqnrsDgvD521ZFQ3Cf465lxnFn4TJ-O7RpMdm1snMYtPMJV7fkPoAO0l3KiZ70Q_krn6e82SBvZKFEPC5GNEHR3UUlTFTXjhpzLpUe14XnzIjsO9ppQ-Ot_Zpz7zmOCjIbD3eDSR_CdFPHLlsMQg6rA2oZptWs6kyLEGY-7gFm3Gvu8tl_MTr5uYi5W_Kat0E-aUjplCuScMuoJAgQMKZsKw4lG4KD68KUrrjkGNwdV2Y20oPTP9gLAH7zCp-fY2w8ErHhEYWV7E-tIIHACvLryeQ4yYlUNvpPJ0GcGMsiPSZRzdLKimGLiq4Q5tt-8KTAaW4uNDcDU5suMdCPcz3Q3AhHYJBDMye9_BEHrWyvrZRwZ0pzK97VFCrAy68TQVFPR1_o_FRlQvFQg%3D%3D", "description": "#WeAreCrowdStrike and our mission is to stop breaches. As a global leader in cybersecurity, our team changed the game. Since our inception, our market leading cloud-native platform has offered unparalleled protection against the most sophisticated cyberattacks. We’re looking for people with limitless passion, a relentless focus on innovation and a fanatical commitment to the customer to join us in shaping the future of cybersecurity. Consistently recognized as a top workplace, CrowdStrike is committed to cultivating an inclusive, remote-first culture that offers people the autonomy and flexibility to balance the needs of work and life while taking their career to the next level. Interested in working for a company that sets the standard and leads with integrity? Join us on a mission that matters - one team, one fight.\nAbout the Role:\nYou’ll be joining our Data Security Product Group, whose mission is to build a unified data security system which enables customers to identify and investigate insider threats, identify access to and movement of sensitive data, and ensure regulatory compliance by mitigating data loss risk.\nCrowdStrike Falcon Host is a two-component security product. One component is a “sensor”, which is a driver installed on client machines that observes system activity and recognizes malicious behavior, then provides on-box prevention capability and remote telemetry to the Falcon Host cloud. The cloud component aggregates sensor telemetry for each customer’s network can correlate malicious behavior across multiple machines and presents our customers’ operations teams with a prioritized summary of the threats detected in their environments.\nJoin CrowdStrike and become a key leader in building the most innovative endpoint security solution in the world. Our sensor development team is responsible for building the endpoint sensor which deploys on multiple platforms including Windows, Mac, and Linux. As a Software Engineer, you will be expected to have ownership over major components and development projects. You will be required to assist with architecting solutions and support in implementing our core features. Features will cross-cut most core OS subsystems such as file system, memory and process, and networking. Many features are also built in a way that they will have shared components across multiple platforms. You need to be able to lead projects efficiently while maximizing performance and minimizing costs, making sure high standards are being followed when it comes to design, coding quality, and unit and component testing.\nResponsibilities:\nProvide partnership on the sensor development team involved in architecture, strategy, in building and improving next-generation Anti-Virus and Enhanced\nDetection and Response Security Software\nDevelop new product concepts\nSupport development teams in designing and building software with cross-platform deliverables (Windows, Mac, Linux)\nOwn features from design to delivery including participation in product demo at the end of the sprint\nCollaborate with multi-functional teams in various locations\nRequirements:\n7+ years of experience with C++ and Windows development\nStrong low-level OS internals in either Windows, Mac OS, or Linux\nExperience debugging memory corruptions, process contentions and system performance\nExperience working with teams to ship major features and releases.\nLead, mentor, communicate, collaborate, and work effectively in a distributed team.\nPreferred Requirements:\nOS system expertise for core concepts and subsystems\nKnowledge in Security\nStrong background in scalable, light-weight and highly performing systems\nFamiliarity and experience with Agile process\n#LI-YA1\n#LI-MZ1\n#LI-DS2\n#LI-Remote\nBenefits of Working at CrowdStrike:\nRemote-first culture\nMarket leader in compensation and equity awards\nCompetitive vacation and flexible working arrangements\nComprehensive and inclusive health benefits\nPhysical and mental wellness programs\nPaid parental leave, including adoption\nA variety of professional development and mentorship opportunities\nOffices with stocked kitchens when you need to fuel innovation and collaboration\nWe are committed to fostering a culture of belonging where everyone feels seen, heard, valued for who they are and empowered to succeed. Our approach to cultivating a diverse, equitable, and inclusive culture is rooted in listening, learning and collective action. By embracing the diversity of our people, we achieve our best work and fuel innovation - generating the best possible outcomes for our customers and the communities they serve.\nCrowdStrike is an Equal Opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected veteran status, or any other characteristic protected by applicable federal, state, or local law.Report"}, {"company": "SentinelOne", "job": "Junior Windows Low Level Engineer - Engine team", "city": "Tel Aviv-Yafo", "date": "21d", "rating": "4.8", "link": "", "description": "About Us:\n\nSentinelOne is defining the future of cybersecurity through our XDR platform that automatically prevents, detects, and responds to threats in real-time. Singularity XDR ingests data and leverages our patented AI models to deliver autonomous protection. With SentinelOne, organizations gain full transparency into everything happening across the network at machine speed – to defeat every attack, at every stage of the threat lifecycle.\n\nWe are a values-driven team where names are known, results are rewarded, and friendships are formed. Trust, accountability, relentlessness, ingenuity, and OneSentinel define the pillars of our collaborative and unified global culture. We're looking for people that will drive team success and collaboration across SentinelOne. If you're enthusiastic about innovative approaches to problem-solving, we would love to speak with you about joining our team!\nWhat are we looking for?\n\nOver the top talented people who are capable of leading a feature through the whole development lifecycle. People that can explore, design, recommend and develop from scratch innovative ideas and drive a sophisticated product to production.\n\nWhy us?\n\nYou will work on real-world problems and make an impact by protecting our customers from cyber threats. You will be joining a cutting-edge project and will be able to influence the architecture, design, and structure of our core platform. You will tackle extraordinary challenges and work with the very BEST in the industry.\n\nWhat will you do?\n\nAs part of our development team, you will have the chance to develop, test and debug the most complicated real world problems. To successfully deal with this challenge, you will continuously enrich your knowledge and experience with Windows OS internals and EPP\\EDR eco-system. The Platform team is in charge of complex low-level areas, such as the agent's Anti-Tampering (self-protection from a malware attempting to harm the agent), network sensors, and other kernel-side features.\n\nWhat skills & knowledge should you bring?\n\n2+ years of experience as a software developer in the area of low level programming.\n2+ years' experience in C and C++.\nConstant will to learn and improve.\nGreat communication skills.\nAbility to work independently and with peers from different time zones.\nOut-of-the-box thinking\nHands on experience with Windows low-level development and debugging of Windows applications - an advantage\nPrevious experience of working on a production-grade product with a wide scale deployment - an advantage\nWindows Kernel development experience - an advantage\nPrevious experience with security-oriented development, reversing or malware analysis experience – an advantage\n\nSentinelOne is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.\n\nSentinelOne participates in the E-Verify Program for all U.S. based roles.Show more Report"}, {"company": "MalamTeam1", "job": "Network Engineer", "city": "Southern", "date": "3d", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=104&ao=1110586&s=58&guid=00000186e6418308bf92147c0eb17bea&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7866a20a&cb=1678900506310&jobListingId=1008523741001&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj49bjpk61k801-1grj4317e227a000-8fd321c984706269--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNCRmKdXEH06QjH_bEeSjzUtbrq-WomcVYZqbkdxqEYnIffT9cX8_GmfjuSOlawRt3uL6JTq02MGKBc8X9Wm_NujAwzSfzOveMJvxaiHL9ZhGY_HI-goiXkgTpoqqFhY-EZwaaStsLWbfsOMubXzt7PTw_GzlSbOhFeCSvqlfmsCx3gzOU5RpjzdnC-Qh4pP2QdZIqWh9UybyGRVw7CZyr7NVQYD2VypUKAiZ03gGB-TFjDBwVVwV3EIntTHV6USMIfLegZdjbKnbtclOC8ZgJlB5RWYpMgGUhK2iECIduiw9qoP9s0cDSvZQhI74VeRjA6gERIUHAB0sknySAllNS-G2Th4fIQsyfZlXmjMm0unJqxDVGqroS84CXQBRMbZQWrSmTOzBVPSYycdzfcRopXZtgADxs2PM55Sg7MobFZ-x7fkcjLjxIJNhUAtKraI_rOwXn_zihqcPZpd5PavIp0jl9jqOXJ3XLd1cP-LIVk2O6tVHsnTXZB-7lO8Q6iBWrJK1hID1xs-8JGf7LD5MCFnEHI8VgQi0vh0pTTi0zUZIfSYmWT1vWKXCrRmnMOqXtIG57iCb6tAF5GlV9kmz_U9nZu1YcILJWqSex5_TsdBpAWC2H8kAlMAuycUZRdJPJnGVtGwdy0ezYo3HxXA2BdDHd94OSkroyU%3D", "description": "חברת Malam Team מצרפת לשירותיה איש/ת תקשורת לצוות המנצח שלו! התפקיד כולל תכנון רשתות התקשורת כולל הקמה ותפעול , כתיבת מסמכי איפון והצגת סקרי תכנון. בואו להיכנס לארגון גדול , יציב ומתקדם טכנולוגית המקפיד על יחסי בית - עבודה. - בעל הסמכה רלוונטית בתחום - 5 שנים ומעלה בעולמות התקשורת.\n\n\nעבודה עם סוויצים וראוטרים. - ניסיון בכתיבת מסמכי אפיון והצגת סקרי תכנון. - ניסיון עם רשתות אלחוטיות - יתרון משמעותי - ידע ב SDN ואוטומציה לרשתות תקשורת - יתרון\n\nShow more Report"}, {"company": "Deloitte", "job": "Network Engineer", "city": "Israel", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=1110586&s=58&guid=00000186e6418308bf92147c0eb17bea&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9298e7e4&cb=1678900507380&jobListingId=1008308706902&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj49cjdkf1q801-1grj4317e227a000-51c8275cf7f1ee92--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBfB50HFqKVh-1pddeCoX4_LQP_TA-haz7xJRr4fDT3o4zkNuV9WKxHeT9nmZ9gvEhcXJlkguHts4MVOJaTbGN4k2FWTK_qzk1f-GQe6YEEHBGd8qra3ygKi5eH--ANYov5bZGYmrDTCjotYKO7q1gwwbv-vUIJxiXlRZuWl56Zo54u51-phVH3y6BF3cy27pqn5M2N3wy0qIa5spwGa6UAklBSV2busFNqcT7TOxFSSWCj3aSbNwLw5S3l_EUlHknZTo81rhLcOXzjBCQ_6haU6MpCoUNSb1LSFwpST1XNKGC8XixzzygbkTK6v25icPmbxwoHXzSnOqSTu5mnGGG_PRdPW7rpVu2YKepxvV23AfhGUZNXyOsJupESGZcf4N3sA9JxGSvOAprUoRxQgs8_7r0qYC9TsT1jI1-D7bI58gh2IzStUvFyI523t_v0EQgS1O7aX4sy2OJ3Xz8z8hDFnUeieMR-T7k0TqiktZATiY_YTK9YJBhyWMqP0yoq2skDICI6uJZLIRrC3rKZvZknbaZYUwx_69yAXmxvGW8BZtK2Oh4ICHYnR8qul-0BtdG2675rEdMYGLF01oeV5MmNjkbuF0S2PHAMeb2Uh0PQEzI6Nx4P0b3ewNM6UmiPOZ-lr3kUtCVC957bzuOHiC5GHmOBxd14Gjk%3D", "description": "The incumbent focuses on providing operational and project support ensuring that the network is highly available. Assists in the planning and evaluation of existing network platforms and systems. Is involved in the development of technical standards, interface applications, evaluation of new products and network problem resolutions. Serves as a liaison between technical teams and internal clients to establish new network connectivity request and assists with ongoing maintenance.\n\nTechnical Skills • Network Engineer - Cisco, LAN, WAN, WLAN. • Deep knowledge of Networking / Dynamic Routing Protocols. • Upgrade software on hardware such as Switches, Routers and Wireless. • Technical and non-technical Documentation | Visio.\n\n3+ year of experience in ISP or global company and multiple cultures. • Excellent time management and attention to detail is essential. • Knowledge of agile methodology. • Good written and verbal communication skills.\n\n\nVery good English level. •CCNA/CCNP, CCIE advantage. Education & Experience •Bachelor’s degree or equivalent experience: degree in computer science, mathematics, engineering, or other technical degree preferred. • Master’s degree preferred\n\nShow more Report"}, {"company": "AMBITION", "job": "לסטארט אפ ברעננה RT Embedded Senior SW engineer", "city": "Israel", "date": "8d", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=106&ao=1110586&s=58&guid=00000186e6418308bf92147c0eb17bea&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7b7129f0&cb=1678900508494&jobListingId=1008513907567&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj49dmr34ag001-1grj4317e227a000-de371d9bd780b695--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBMJW6bVHrIfl3RYaK1TX-lE-6WqxPV3yi_d6rw72iHdpUgXTQ8CGh8IiO-VqWjs3_KMpEfM2SumU3509N9Fm9ow7CZlk3QMHUItPSyYJCTM37058N2nevtFq4Ebuq61_YOOs1Eh-9Olygl2iKNd3-61L4SZSyg3mFHg-xdOvXBSGUwwDbhuRpoTETNT8KY4QI30yM8_QRS8VYhYT4fumrZB1LHZLNfJuqfeEe02ShD2QpsXb9DihW_iaNZUbV0SGYs4utNeQ5cUxt3nRfliuo6twKsr8fxU5jELJCj_gITJb2P73h53GsEt38rRma8m8_wlnNR5YVqxEuhwRn-WfJEJ8zZzswn8pv7_kfF_SclpQIw2L8B42qdv_jx5lH58H5BfuO9wBE6AFGY9mxir3nLmMp_tLeCk3uNKkrjWS0RErC7wpKxCeCihIvkr0WmKm73QrJ2dd5kqTvUJ5YJ3PkL3y6AEC55Am3SUtC9DaqaFNOBlKmJhe9cRy7iRiJ8qqKVH_jMyprrMF381uUeN15oZv76gOiIdA6DICWiFicbs2HgB0DcHSQmETtRTQnMKV-Fn7MSHx-fVUSdZfdSO4bsZdLVzi4_M3DnKqlG5HrHNAdNQokUUyFoAY5AUj6uoS55PvI6JIQb-JNOP8bqFXR8qCBuNgNfj98%3D", "description": "לסטארט אפ ברעננה RT Embedded Senior SW engineer לסטארט אפ ברעננה RT Embedded Senior SW engineer 5+ years of relevant experience in C/C++ programming. B.Sc. degree in Computer Science or a related field from a known university. Experience with development of data network communication protocol stacks (TCP/UDP/PHP/html etc.).\n\nGood knowledge of communication systems architectures. Experience with real time embedded systems.Show more Report"}, {"company": "neogames Systems", "job": "Network Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=107&ao=1110586&s=58&guid=00000186e6418308bf92147c0eb17bea&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_401a0153&cb=1678900509912&jobListingId=1008375485161&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj49f38k61j801-1grj4317e227a000-4ef91e6a74f3bce8--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNC2i8QquvrlB6nL86rMEkbAOcDfbboMaK0gACXbluJGS21FbYefV9lgkpIBXOvy7gRZzWBL-1GqjYiyrl0kz20ZnzB3_geLoHayIegquEvH4fpgDrQDQMoDrUcGHkB9v8gPisK9p24mfkGsreRPGHDFtbnxdVZfNf8Xfyp2VXTDDhq4VSlyaPW3vt7-MVKTyF-NJb5ncuEhc7MyWb2ceyEQvZv2E7vYjATc8x5ECAIW1-D17dXjCngch_qd5rtudSHIzwuUt2-20tcdZqVS-B1eXSe9HQrRa0cEZklHs2wUI4UNj6Ddr-IxBRJmQJfmc_PkoZTX6tgujQ0WqLNxGDTFdaVKqnQICQFxpXY1gvEugW-vrIdXf0fHtvheHML43cFKv6CLYS_80NaJYzE_dLLwQtEk4i2L98lyVloNPE6ckT607MrllO1s_5Pm-vpaecZn-gaqR2E7vj02F-mo8Y7c1FWIGBsdYIRZ-rxXkBTmcWpZ7t6nejjv4L-adMYHOaX9nyKwldq4PXibqvVA3I4DiyxQlFT31P8vh6uDGSsdJDbHu04p6RiceG6CRdpa9tIBC0qeUF3zu1hYDCEEFs9A7ANlXaRcS8ggw2mPNAwsOjSCCORRK3GTLOYeo1lMn0w5flalPXW_pFEwNT7zZl9QQYb65No4QX4%3D", "description": "We are NeoGames, a global leader of iLottery solutions and services to the national and state-regulated lotteries. We are on the lookout for extraordinary people, who will be eager to learn, to be a part of a team and share our vision. We are hiring a Network Engineer to join us. Responsibilities : • Managing production data centers infrastructure • Maintaining support and setup network and security Requirements : • At least 3 years’ experience as a network administrator in a production environment • At least 3 years' experience with Firewalls, Routing and Switching with protocol , IPsec, Gre and BGP (deep knowledge) • Knowledge in HA and high SLA environment • Knowledge with load balancing equipment (preferred F5 BIG-IP) – Advantage • Experience with open source monitoring tools – Advantage • Knowledge in network security (IPS, WAF, DDOS) – Advantage • Experience with scripting languages - Advantage • Excellent problem-solving skills and a strong customer service attitude • Fast & self-learner, hardworking, team player, organized and responsible, dynamic, motivated • Fluent English level •Ability to be on Call 24/7 – MustShow more Report"}, {"company": "אלביט מערכות", "job": "Network Emulation Development Engineer", "city": "Raanana", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=108&ao=1110586&s=58&guid=00000186e6418308bf92147c0eb17bea&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ed85d995&cb=1678900511205&jobListingId=1008452057963&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj49gcg2jq3001-1grj4317e227a000-73120a3c0dc92423--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tGRBbjy15RxGaEEw7KZU_HKLxk4J980KdHpdiqjW0uOdctgEDKSVm_RFIUzYifyb-lvCkJJp2T6MKzG9Tvjy1_M_NsJIKcGThsHKOm5ntt6gHq2KOR8j4pd7E_c0NK2ktqDGMjV42BFdivNJyT2_TSyKz7teT_fhKuANdSu290h6yB2T2e5yZDDf7jTifgs8oksGkCxgKEAL2zfyrnCds6lUGtysvlsPaUgz1c1Rkqc7rXfnpLb0lHWYERZiXXS0roqLT6BRIl1nZ9_kfObDzp9hxAUVz9tiC3ouQxEGgpDXQ20ddVe1Mqli8zy2-zyqWh6PJ3ltvq0zgTEpgenftpRFyJ2PDpODU8PihWQE2y2FPap8NaVxkJs7HZTSMSp2072KzIGT5gvHaKsyOtKufAxIq96XFE_XzISwl8AfAxs5uTMdOzCo8Rq9MhI6sTP3YdUGArwCg2gyJbYjj6IA_4weUgT6Y8AgMGzjvUYypoHKQVP9-G_OHGN62jRAbGk-7O4duaFm3UfFdXrlmUoe9TGW4GG_mIZGOqoy5QP9szrFZZ65s-aIvbIcYPFLzTgXjKSedlRfEDHox9oAPRBtieCtAqTUXYc0sUJVpfAQbGeCcO6OtSQaTk0uD6knGRBC_i5W3zMxUN6mhRGn0LNKwG-QGADr2lbg2khQey4vqVtrR_0btSGfHTR3ZxbTp_57zw%3D%3D", "description": "Elbit System in Natanya, Radio Department group develops and integrates complex MANET (Mobile Ad-Hoc Networks) systems for tactical communication at the battlefield The MANET systems can contain dozens and even hundreds of Radios that needs to communicate and transfer data, voice and video services throughout the network under tactical environment In order to develop those networks we use intensively network simulations which models the radios and their behaviors within the network As part of the work you will be characterizing, implementing and validating the network’s protocols You will be part of a team that develops capabilities and to analyze large amount of networks with aspects of capacity, QoS, Immunity against communication attacks and to prevent cyber-attacks Engineering graduate in communication and electrical diploma Software development skills in C++ Python knowledge – with efficiency code understanding Second degree is an advantageShow more Report"}, {"company": "", "job": "אבטחת מידע", "city": "Holon", "date": "10d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=109&ao=1136043&s=58&guid=00000186e6418308bf92147c0eb17bea&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9c2fc0bf&cb=1678900512215&jobListingId=1008509283661&jrtk=3-1-1grj49hbepkel801-1grj4317e227a000-ce7b775581c59ae9-", "description": "i'm hiring for : security engineera global technology company in the field of information security and cyber, requires a security engineer.implement information security solutions with at least three years of experience implementing data security and cyber solutions.expert knowledge of enterprise firewall technologies is required.working knowledge of web application firewalls, db firewalls, load balancers, and proxies.experience with dlp solutions.(forcepoint, symantec).experience with edr solutions. (cortexxdr, cisco edr, fortiedr).experience with the design and configuration of a network dmz.demonstrated experience in computer security combined with risk analysis, audit, and compliance objectives.experience working with information security practices, networks, software, and hardware.expert knowledge of tcp/ip, common protocols and standards.experience with ot cyber solutions ips/ids systems.location : holoncvs : |** לפנייה למשרה יש להגיש מועמדות **|Show more Report"}, {"company": "בי נט ייעוץ והשמה כ''א בע''מ", "job": "Sr. AI/ML Engineer (GPU/CUDA specialist)", "city": "Southern", "date": "7d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=110&ao=1110586&s=58&guid=00000186e6418308bf92147c0eb17bea&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_8f00e2b0&cb=1678900513206&jobListingId=1008515729961&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj49ibfncd2801-1grj4317e227a000-031d866211d4428a--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNDj56dqzv9PCllgB4xesjMoiCNl98UIOzNggUDiaWCc600O81ag76uSFUcPIPiW7t2Uo6uKLL0kocaZEE0XPXqrU2vkUzbEuCNExFfMrPAzBsba91TP4Iq8bqpl4iytZ5Fh1lOZtaXuJ9ApTaO1ImRLkMHC4leYK0Eij40xF2jm4MgkyxLN4LClOCV7dMvmwvnVnnXP1FHzixzYbP1Pybcc2A30pF66KT4bCbZvqV43rV1t4gWIWJaPA-2nzvYrTgEra1Gut-sixTiJov4ug9AgYGLg29hFFROs90n32jGXfvWloD739WqDrKJGF3JYj2nK-Zf5rHan4fDuYPHsj2cK1sNXGah_UG4i3BBVlQW2eGisrf9vFJchm66XlnI4OhAPE3VdU_plmA7LIyLsFsj7d414kuAjowTZms9iGIGzaG1K3RisoQAzJlMFQVZU-nZJ2fPDzbfs0DpPRdpk0qtz4hV7JM8eG95rlBs0bjk8iPp9nopVP7MCT4rMQJit15f_QYt0YTEKisGL2vyOpxvmzFp5IWcNmEi33_AOpgy2zffoInLbztZenjXUlXWFOlFae6jEmQUVyz5T7FIjm-88E0WDx0LGwIuzTiYX8lg-I_gorVt6LlNFjnZFySB-2KiGa31H3H-wQaBJ7sYlPExTY9YW8aN-dHc%3D", "description": "Compan’s redefines the future of crowd security by scanning for concealed items among many people at a distance with completely touchless, non-invasive, and safe technology. Our groundbreaking near-field electromagnetic imaging will protect the public’s right to safety and security without sacrificing their freedom of movement: No gates, no metal detectors, and no stopping each and every person for an inspection. Instead, checking everyone at once, in the open, and in motion. The company is backed by world-class investors, with a proven track record, has completed extensive PoC, and is on its way to commercialization.\n\nWe are looking for a passionate hands-on ML/AI specialist proficient with current trends and state of the art methods for object detection and tracking. **Please Apply your CV in WORD Document • B.Sc. in computer science / SW engineering / electrical engineering. • 5+ years programming experience in C/C++/Python, as well as hands-on experience debugging complex real-time software.\n\n\nExperience writing real-time coding, including complexity analysis and performance optimization • Experience with Multi-threading, OOD and Design pattern • Demonstrate a deep understanding of the Linux operating system including networking (network services) and scripting (Bash) Nice to have • Experience with parallel programming on NVIDIA GPUs using CUDA\n\nShow more Report"}, {"company": "דיסקל תשתיות ומערכות מידע בע\"מ", "job": "Network Engineer / Level 4 Analyst", "city": "Israel", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=111&ao=1110586&s=58&guid=00000186e6418308bf92147c0eb17bea&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_af577703&cb=1678900514614&jobListingId=1008461832677&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj49jnbkhpv801-1grj4317e227a000-277bfeadde76f2a8--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNCvpRe2xv4C4Cnc87GelriFi3QKnL7GwZOu3w-dywOGBinguwXt_024_12rXUTYN-pml95g1gTEukp-mtX-c60-HdDJj-uUxFdJZ9FlF7-EbcIq30W9sdYw561TI7JI0kz68jywZazgXuqfmnAQWMuNA8dawP4soqeMWorXjX59EpGe63nuzgKKLTp_Y_C5mb2GoSDbW1QMb0yz7ySyNYci-RYLCv-Xkwu54Beqxa5LzDGPEtttOHHuf_aQgn4AU1Q0J9FCDJWuHDZLGn8z0PREKjUxUTlPrXd7C1qrnjFMuQ-nOpV1rg063QOJcNY1qO9H-SVeilbxVj-fHgxj4IEhtFaucKjGTZjvcbdu1Eq5XxQ0J_uRmNOfRudZjHIK33rS8dccHyjBLZZollk4aOXB4MBJ5nD4zR2SfII_xcV13yx6QHi-utc2yZBQLnwDxGMGOVajjqZTAu4tM5sTHmyFZZOPUdh9D3NESWQBuLNLZLqRHRyIKIYOnly7XAdcdXxN7r9FeMVfniryQ3G7Gven3hd0IeLUYnLJoEPFPP_iqqtEpF9BOEH78iQ58hppKzWoKWwccrcPuy7_60omkF_Wzl56-5cvyswrCw-OmooiLi8KVvkKjxItBLikVCmV4Ax9VQhgbWHGtBchR3POS7cSqzR3N0UlYOM%3D", "description": "A leading international consultancy company is looking for an experienced Network Engineer / Level 4 Analyst for a temporary, full time position in Tel Aviv, adjacent to the Savidor Merkaz railway station. ** The position is for the duration of 3-5 months, but may be extended ** The incumbent focuses on providing operational and project support ensuring that the network is highly available. Assists in the planning and evaluation of existing network platforms and systems. Is involved in the development of technical standards, interface applications, evaluation of new products and network problem resolutions.\n\nServes as a liaison between technical teams and internal clients to establish new network connectivity request and assists with ongoing maintenance. • 3+ year of experience in ISP or global company and multiple cultures. • Network Engineer - Cisco, LAN, WAN, WLAN. • Deep knowledge of Networking / Dynamic Routing Protocols.\n\n\nUpgrade software on hardware such as Switches, Routers and Wireless. •CCNA/CCNP preferred. CCIE advantage. • Technical and non-technical Documentation | Visio.\nExcellent time management and attention to detail is essential. • Knowledge of agile methodology. • Good written and verbal communication skills. • Very good English level.\n\nEducation •Bachelor’s degree or equivalent experience: degree in computer science, mathematics, engineering, or other technical degree preferred. • Master’s degree preferred.Show more Report"}, {"company": "SentinelOne", "job": "Windows Low Level Engineer - Platform team", "city": "Tel Aviv-Yafo", "date": "24h", "rating": "4.8", "link": "", "description": "About Us:\n\nSentinelOne is defining the future of cybersecurity through our XDR platform that automatically prevents, detects, and responds to threats in real-time. Singularity XDR ingests data and leverages our patented AI models to deliver autonomous protection. With SentinelOne, organizations gain full transparency into everything happening across the network at machine speed – to defeat every attack, at every stage of the threat lifecycle.\n\nWe are a values-driven team where names are known, results are rewarded, and friendships are formed. Trust, accountability, relentlessness, ingenuity, and OneSentinel define the pillars of our collaborative and unified global culture. We're looking for people that will drive team success and collaboration across SentinelOne. If you're enthusiastic about innovative approaches to problem-solving, we would love to speak with you about joining our team!\nWindows Low-Level senior Engineer - Platform team\n\n\nWhat are we looking for?\n\nOver the top talented people who are capable of leading a feature through the whole development lifecycle. People that can explore, design, recommend and develop from scratch innovative ideas and drive a sophisticated product to production.\n\nWhy us?\n\nYou will work on real-world problems and make an impact by protecting our customers from cyber threats. You will be joining a cutting-edge project and will be able to influence the architecture, design, and structure of our core platform. You will tackle extraordinary challenges and work with the very BEST in the industry.\n\nWhat will you do?\n\nAs part of our development team, you will have the chance to develop, test and debug the most complicated real world problems. In order to successfully deal with this challenge, you will continuously enrich your knowledge and experience with Windows OS internals and EPP\\EDR eco-system. The Platform team is in charge of different complex low-level areas, such as the agent's Anti-Tampering (self-protection from a malware attempting to harm the agent), network sensors, and other kernel-side features.\n\nWhat skills & knowledge should you bring?\n\n6+ years of experience as a software developer in the area of low level programming.\n3+ years' experience in C and C++.\nHands on experience and In-depth understanding of OS design and internals, preferably Windows.\nHands on experience with Windows low-level development, and development and debugging of Windows applications\nDeep hands on familiarity with standard debugging and profiling tools for Windows.\nPrevious experience of working on a production-grade product with a wide scale deployment\nWindows Kernel development experience - an advantage\nWFP or Device driver development experience - an advantage\nPrevious experience with security-oriented development, reversing or malware analysis experience – an advantage\nPython knowledge - an advantage\nGreat communication skills\nAbility to work independently and with peers from different time zones.\nOut-of-the-box thinking\n\nSentinelOne is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.\n\nSentinelOne participates in the E-Verify Program for all U.S. based roles.Show more Report"}, {"company": "פרולוג'יק בע\"מ", "job": "Network engineer", "city": "Israel", "date": "30d+", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=1110586&s=58&guid=00000186e6418308bf92147c0eb17bea&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d3b60b5f&cb=1678900517390&jobListingId=1007939318296&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj49mdkma4r801-1grj4317e227a000-d1f2610eafb21c90--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNC3nPnwTfa9pjE4KIB7QgTWDumTLlnnO3We5lnQz-ktPFy_Je121EscIbNzN19HzSQo7Mbij7KhUcyRyjouzIQlemc7cGMnT61TFNmREJr7rxnMTsuDzIZOIcoFW_o_hJJOhws1DbwzpE1VrOdB6RnXVAIPSoi4qV0aFKJ_0jF2XFnARkbG-EqUhzTbP9VZZ2iSUZltEO4HE3QNCcNoNOL23-7Jkt5XUVnBQr-TiAKYySvIkAllsfYvNNd1-KZ_Ff__ZMTsr6bd0izs9I9RbOAIX0EMotW_MtA7BEqey2wmUUhlAXAUMUJuSrMpO1ORSkWy6sMjZd6yenT_QD3KdDXTu-JxuK9jy4pfBJAdDKY3lcd3GYIlYGmqpG2Rl7ga_nnEO7RmMFdhksWt_a1wzc9IAXHL5JUSnLT-hrfDCsNyGocdxHnBfJQDwBKtCUXXMMGozYXNcen5P8Up-vpnUuEM7ztAy6eT1-3ID0KFHnS3quzg8ZDtqVDsgD5QphqfEJG_dbPmi3ipihPbL_GmPe2wx_5xGYbSHi-g-ahU-81XNMmo0jkKewyLQqUN_XQv8MvKHpU8i1bwNdq6-FZ1UACBa0cTQY4fI23PTQuzDOItJuzV_aLu4RAmJGtP-ljh3udXrx2_r62ugh_lJOhT0rD33Z2M1LCmNQY%3D", "description": "לחברתנו דרוש/ה Network engineer כחלק מצוות דינאמי למשרה מלאה ולטווח ארוך, במתכונת היברידית - ידע וניסיון נרחב בתחום רשתות תקשורת LAN ו-WAN בארגונים גדולים- חובה - ניסיון מעשי בציודי CISCO, JUNIPER, CHECKPOINT, RADWARE ובמוצרי תקשורת ואבטחת מידע - ידע וניסיון במוצרי אבטחת מידע- PROXY, DLP, IPS, NAC, WAF, NSX, SSL-VPN, NLB - ניסיון עם F5 LTM- יתרון משמעותי - הסמכות בתחום התקשורת ואבטחת מידע- יתרון - נכונות לכוננויותShow more Report"}, {"company": "רד תקשורת מחשבים", "job": "Technical Support and Solution Engineer", "city": "Southern", "date": "9d", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=114&ao=1110586&s=58&guid=00000186e6418308bf92147c0eb17bea&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_800d4df6&cb=1678900518514&jobListingId=1008511844179&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj49ngcjm57801-1grj4317e227a000-44fd5a8d6f65bfc7--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tGRBbjy15RxGaEEw7KZU_HI5a6udzcwmkthNLIQJ-sEHu6eHn-0tL-euoigwk4BHeVBpPsLsOELKahRNb2GBNEbIDJ00ddXT25GBtwBqGabxDtbs78ePIklbGZAiP98X2j1pwF0jl4do1XGWA-cNPEQkgo-lmUYY8OF7wUPAfeIs8rWs8WCscVF1dKrtHhv1uFkYayamY47snPghVuSG4m4IDIqKoglvKHDkgc7e-zTFwcvPP7k_bL3V2FwvU2IclJ1ON0aYPj9MfJlObg5NK4jfOt7s7_puqVCokiuDTCLFw1Km9p4EnnU04LNNt8a91JCSq2FbQMHBNZeh_fOGtBsGg0aXb_ql4QNTxDEJlwK5v-iHXZ6jSmqOvWeq8Vo3-W4rsenL-0imaMRSqfvaUew4TMmcovpwJvfavvfOagh_F7PL6AWkPqCgYTOtiTMtVT-a-fa6yhZg2kSl5_XTqCRcrUHwDOrxG_83N5ky3LngdryVHQ60hCWCLdv-mcWFLsHCaKoYMRPAkn-MiNXKNjxHB-svewS8BCxd6arvEbTTzwMcXx14v-e_m4TVXNfsMG1q6W3hg4FVjcpIRuliPEy8QCZKYkhmA2ls2vbdPMcQEuJ7fv221TTnSMe1HkOBqCR7rJBdo3V3s5n2rpzjc3ihKWRWpmIfC1n7xe6TQY9BpHZiqMXXkcMW0oud_bLDcA%3D%3D", "description": "RAD’s International Services department is looking for a Technical Support and Solution Engineer to support our products and customers worldwide. The role will be based at the RAD headquarters in Ramat Hachayal, Tel Aviv. Hybrid option twice/week. Responsibilities: · Provide both post-sales and pre-sales solution support activities · Perform staging, demonstration of proof of concepts (PoC), installations, homologation, commissioning, troubleshooting and trainings for partners and customer clients abroad or remotely · Perform testing of solutions along with troubleshooting techniques to identify and resolve issues · Perform root cause analysis of issues · Contribute to knowledge base of the team · Create documentation for partners and clients · Provide status and resolution communication to both internal and external stakeholders · Experience in a technical support role with an equipment vendor, software vendor, or systems integrator for multi-vendor solutions · Bachelor’s degree in electrical engineering, computer engineering, computer science or equivalent experience · Technical knowledge and experience with some of the hypervisor technologies and software for building and managing virtualized services, such as: Very good knowledge of VMWare, Linux Systems, KVM Knowledge of cloud management products, deployments, and migrations OpenStack knowledge is a plus · Experience with firewall, router, load-balancer, and SD-WAN- bare metal or VNFs · Understanding of ethernet and IP networks: network design, routing protocols, L2/L3 and network security · Network testing methodologies including test set usage and automation: Ixia or Spirent.\n\n\nExperience with Rest API, Ansible, SNMP, Radius, TACACS+, LDAP · Experience working with external customers · Excellent written, verbal and presentation skills in both English & Hebrew · Great interpersonal skills and ability to gain collaboration of colleagues, partners, and third-parties · Ability to travel abroad when necessary to support customers\n\nReport"}, {"company": "neogames Systems", "job": "NOC Engineer (Work in shifts)", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=115&ao=1110586&s=58&guid=00000186e6418308bf92147c0eb17bea&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b26c1732&cb=1678900519702&jobListingId=1008426119936&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj49oljkf20801-1grj4317e227a000-bba4d691eb06c285--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNDTbcJRj2n6S003AKVh2DlHXew3qYsHJt1PmPx_vq792gZoPu3HYymZY41v59_dxPyEx0IfSX8YX-rP8pBsHts00sElfoDBKDrsNu_svWmXxo0Y4xIPvojDBRnacqqXCo2CfbztTjIBmz2tWOLy4iBri-Rw-24X4VBHpv_sfBbnurBLNvdFxFpfphwMieFtqjrB9Sd3P1eVok6CDSbYSqELzbLpejUQFN46e1z__mnvyjlQ1pvfKZeJeumjDElVEeGwm1rQlIgopV45vzY05V-FhUEGvab0mt7fIm4BcS0EbJ1_Xk4IhuFZ9cctKZlIgpjzo2DhAGWEEsZDLpyQqs6HECOJR71f9N_GJGNcnJirfc-XaAOku0tivBqFJbQaIK70xjqy1vWarUGb0VLOaJjaNmIbz3H1qJRkacr8UsT398Qr5ngPfl3x3k9rqM7sF-QZTg5rJVPZRnd-oSZx6yiO1P1yp0dI9C5ifQLUMAS_pVUoXP0xlm0iA_PrnyIc7Sus6xTvJ0dT3Q4DmbGrf4nvH0Hj57ywNC_ZYTN7I6y2dBW2GFdlhS839cdSJKj6m85oO3bIPGhfkah14uN8hTQ-OUtp42wXEn9zgzQlgwZHDYszdRBZES6lgoeW4l_cL5wH3i4TedHRBUuIS0V6dGLZijDjW0lohjI%3D", "description": "NeoGames , a world-leading provider of solutions and services for iLottery and iGaming operators, is looking for a NOC Engineer for work in shifts to join our NOC team. Responsibilities : The NOC (Network Operation Center) engineer is responsible for monitoring and supporting company production systems. He/She will verify service availability, send out status updates, identify root causes of production issues, coordinating operations and engineering teams in order to identify errors and anomalies. Requirements : - Ability to work in 24*7 shifts including weekends and holidays - Technical troubleshooting ability - Fluent English (verbal and written) - Strong interpersonal and communication skills - Computer Science/Software Engineering /Industrial and Management degree / Students - Ability to write technical protocols and procedures for system alerts and malfunctions - Previous experience or knowledge in Microsoft servers (MCP level) - Must - Previous experience or knowledge in SQL - Must - Knowledge in the following script languages: Powershell/Bash/Python - An advantage - Previous experience with monitoring and logging tools - An advantageShow more Report"}, {"company": "Hello Heart", "job": "Front End Engineer", "city": "Tel Aviv-Yafo", "date": "27d", "rating": "4.8", "link": "", "description": "About Hello Heart:\n\nHello Heart is the only digital therapeutics company to focus exclusively on heart disease, the leading cause of death for U.S. adults. Through a connected device and mobile app that uses AI, behavioral science, and personalized digital coaching to drive lifestyle changes, Hello Heart empowers people to embrace healthier behavior, which can reduce the risks of high blood pressure and heart disease. It also helps users catch blood pressure readings that are extremely high and encourages them to talk to their doctor to identify potential risk in time. Validated in peer-reviewed studies and trusted by leading Fortune 500 companies, Hello Heart is easy to use and works alongside an employer's benefits ecosystem. Founded in 2013, Hello Heart is a member of the American Heart Association's Innovators' Network and is part of the CVS Health Point Solutions Management program. Hello Heart is backed by leading VCs including Stripes, Khosla Ventures, IVP, Blue Run and Resolute. Visit www.helloheart.com for more information.\nAbout the role:\n\nWe are looking for an intellectually curious Front End Engineer who is passionate about code, high performance and cares about quality. You will work with knowledgeable and experienced developers with a large scale of skills and capabilities who are passionate about developing an innovative product which makes an impact.\n\nThe position includes working closely with the Product, Design and Data Science teams, taking full ownership of your work from conception to post-deployment, while continuously learning and evaluating cutting edge technologies in a fast-paced, collaborative environment.\n\nOur Technologies stack: React Native, Redux, React JS, Scala, Play, Microservices, AWS, Docker, Kubernetes, MongoDB, Redis, Postgres, Spark, Elasticsearch, Kafka, and more.\n\nResponsibility:\n\nDevelop code that is used daily around the world and actually saves lives!\nWork with our data science team on implementing their algorithms into our new and upcoming data driven solutions.\nCollaborate with Product Managers, Experience Designers and Data Engineers on all aspects of product development: strategy, brainstorming, user research, design, execution, AB testing, and iteration.\nTake part in making a major difference in our team and influence our technology stack.\nJoin a great team of people passionate about technology and doing good to the world.\n\nQualifications:\n\n4+ years of professional experience as a front end focused developer but experience with full stack, preferable React Native.\nBS degree in Computer Science or similar, or equivalent practical experience.\nExperience in one of the following: Scala, Java, Ruby, Python, Go.\nExperience with databases Postgres, MongoDB, etc - Advantage.\nFamiliar with cloud-based deployment: AWS, Docker, Serverless, etc - Advantage\n\nHello Heart has a positive, diverse, and supportive culture - we look for people who are collaborative, creative, and courageous. Oh, and if you want to see some recent evidence of the fun things we do at Hello Heart, check out our Instagram page.Show more Report"}, {"company": "SPL – Software AG", "job": "Network Security Engineer לארגון בטחוני (משרה 11404)", "city": "Southern", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=117&ao=1110586&s=58&guid=00000186e6418308bf92147c0eb17bea&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_87a568e3&cb=1678900522361&jobListingId=1008091196429&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj49r7pmfqf801-1grj4317e227a000-4dde0518bea92e0e--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tCjX7o1y-kWCixrjUB_PGkaxdLYUoxEFSpwRJIOj1v-vaFL25M2klMSRaqdugT3Vs6-oP8dUUaldIYqI9Dnw3JxzZAzFYnW6M1083cUa8XLa1ZA38Dv7emfkP4089WUzNFLkR6Ccol3G0Y9L_3K6EG_gno6516BztmT1zOkGp5DP3N32-hdWMQn_WpYNBio2Xz0g5D3QPkq66PVee123eubpbbcS0K8NxuF0-uEKk0V_6nAIk25SbRc0R4hUPIQvRwyhgT9Z0ow8-a6mgnMckI4alexU9kcmau4Nf8kxP6JrXBQpSo_riraBlFqrUGqklLjkA9WZn-aux0AN1_iNVDOrdkcfsBqq_yXhowwuOpieKl1ieHury4XiCUCw0tGoMtgvu0MR8H9mWp2nT5JXSe__bPaWZmrL19_P74V9OGUGJh-sGBkhHrwfKyAnWZOfZAsETrC__LmVSeXUCEo6wcX82fLUyG4rEp0zwApuSK3vGmoM_soXYRufwwFeO0iUwpT-0aVzcxyKgMeK0zXu1eMuRLudzVGx3syJWWhaR1GpLWCfJywzP5VZsxRHpjHXIhEtCx4lihQyLxMMaJ8KJk6mqRU1D51Z5p_9k4ukrO1FuYfWWYs26M-LIEDo1Xp76jSoJrkOA0F-H8Bl1Wj0RBRX6ijbzUcWgoqJ_biMmTF_4lUQjtn9egU%3D", "description": "חברת Software AG-SPL מגייסת Network Security Engineer להשתלבות בארגון בטחוני באזור המרכז. התפקיד כולל: תכנון, אפיון ויישום אבטחת תשתיות תקשורת בסביבת ה-Data Center, ה-LAN וה-WAN. יכולת כתיבת מסמכי HLD ו-LLD בשילוב עבודת Hands-On. ניטור וניתוח תעבורה ברשת למטרות אבטחה ו-Troubleshooting.\n\nלפחות שנתיים ניסיון בתחום. ידע מעמיק באבטחת מידע ברמת ה- Network בדגש על מוצרי IPS, FIREWALL וזיהוי אנומליות של החברות המובילות בתחום, כגון: CheckPoint, Fortinet, Cisco, Palo-Alto וכדומה. ניסיון בפיתוח ויישום כלי אוטומציה וסקריפטולוגיה (Python Perl וכדומה) ורכיבי שו\"ב, רשת ואבטחה. ניסיון וידע בתחום השו\"ב תקשורת ואבטחה.\n\nידע מעמיק בפרוטוקולי אבטחה ותקשורת: OSPF, Radius, Multicast, QOS, Spanning-Tree, VPC, VSS, Tacacs, 802.1x, VPN, SSL, IPSEC.Show more Report"}, {"company": "מגייסת", "job": "ראש צוות פיתוח #C", "city": "Raanana", "date": "1 day ago", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=118&ao=1110586&s=58&guid=00000186e6418308bf92147c0eb17bea&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7656a875&cb=1678900527096&jobListingId=1008528078878&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj49vt6nce9801-1grj4317e227a000-a735cb7541d64066--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBV4Er2R3GvIxw2V_H6z0rM-FY1p228vW2Vwn2nNXU7nBf9Gr5F76a3M7sM5u9nAalt6X9XE7_3HLmGiJPqE_bh1j_LMIqauPGG3XPDr2CJp7AdCmhRUj6-9AMd6vpKBISpOYeD9YCfofePhmSeY3GrL0NAGr77wO3gz60VmpDpix0d2IqZQd2ytUkeEJdKH9mcIy7hFAS5T7YbyQXt-R3qYBY69RdFx4XeQEvMQpfajP31Tz_yTYqIDLoHYQHbkPw83f1GfoMSU3O0M-x3pKLkxNVVNo-9T1b2cELcKBUtobet8ik45lqZRa7vRWaYwczu0FSw8ASwCdkSb6jHcIeKghP7_gOSXWDlgpf85zFGnGuOZx_iNFvJnoU-iKLLZwz49qjD3OuLlhRdjHm8WiGhE7o0Wd8iIuK_pwJVpxdvXUeieUTO3p0g1Tb5zviFphoyM4CV76xDwkkcU0uzlYHb7K67gi3cNQzBoo8m9DAW_EcbZqWD9ioKH3hzt21NN-eP27VEwh4ut31m0n39_dyWOFt3gEdZIpGi2IDOIM7rz02w8McKJAOKN_t-nv7ZH8z0EyYqx9fVeYhrxKBV1ymejRTBacpG9Dr6lZxBpA_kSxDjIpQIUJn5CdyitIGsTZLY8dmWKG8ZoNoi9Z7dMXqcumVi6O3UZLE%3D", "description": "To a world’s leading social trading network, providing millions of users from around the world a one-stop-shop solution for their trading and investing needs, we are recruiting an development Team Leader. The Research and Development department develops cutting-edge technologies, focusing on field-relevant areas, such as blockchain and artificial intelligence. Your responsibility's: • Manage and lead a team of ~6 people. • You will be responsible for their growth, development and improvement in both technical and soft skills.\n\n\nYou will be a member of the group’s management team that includes 4 other managers. • As the team leader, you will be responsible for the value developed and delivered by the team. • You are expected to improve both the efficiency and the quality of the team’s delivery. • It is expected that you will lead the design process for the team’s solutions and also take part in the design process of the overall group’s solutions.\nYour team will be responsible for a very significant back end infrastructure of the company solution. Hence, it is responsible for its operation in the production environment 24/7. • Your tasks will include interaction with Product, business and other peripheral stakeholders to refine and deliver your team’s value and projects. • The teams use Agile routines.\n\nPosition Requirements: • Previous experience with some of our technological stack: .Net core, C#, RabbitMQ, Kafka, Redis, Microsoft Azure, K8s, Dockers. • Ability to view systems from both architectural overview, and the ability to drill down and improve micro development issues. • Previous experience as a team leader, and obviously have been an experienced engineer. • Experienced with Fintech domain - an advantageReport"}, {"company": "אביבית דבוש גיוס והשמה", "job": "DevOps Team Leader/DevOps Engineer", "city": "Israel", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=119&ao=1110586&s=58&guid=00000186e6418308bf92147c0eb17bea&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f861fe8f&cb=1678900528461&jobListingId=1006951632191&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj4a189klt2801-1grj4317e227a000-e0928268f7228781--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNAcqJjt6X43WZK9qA0dcnhZ3xqKQ_SR4q4l0AJXluU79zzCTBiwuAcDhu00foVjd5TzEjjvzZdv4jdSLKgTPG21Ww1pd_jLc71oxka3YCR09uQPR8oVfI9aJT59_zeaJfKDM5AWgMVfETNPuRzdKg_8WHyd9o8E1EJfo-Qcod3DHa__y797V3Am8fknjSCPWcwwLbfSbRhHK-_Da6XbgUOCfajOujA8-maSi3HPe08_biUX5xMjbKdPqQ2JhAgDgNpauUOFCSmUKbEeHOB7VX45Exm3glViRmYoaarcRMvifKP1HHRSlGhJDVUuk0qQaejeNW4fpDvmtPy04zKkHtmarKS61ZEncGhnV50g5bJvM0-0U7gaq5BugcQ8ZGv6dApjYiKjcVH7Lmqds58U7LRcBBuVAtRp5tTd7Ex31YLqoXmLARbhRVqxY6nUcH5c5E-1bGJx2GSuV0I4q7rpBQR-SZbfYn2vI3sx6gbgdsHHSZI3ZJ-L82NczMJgO33FrdyG1t4gdIkEWwTNmS_JLMbE2_TGA-OUYJxRi8-4TMthNSN6TGIYohQ-trjaQUXCH7Q_zcVeRwANb59WTOXRSUjx5WtE43Zzx2CLIYcFQ7Aom9CN0b99isDbZAwHqVlyQmHmrCyCIlck63dlgIVrGWvBws6RdyRmYXU%3D", "description": "DevOps Team Leader B.Sc. in Computer Science. At least 3 years experience in team management Proven experience in designing and managing SaaS infrastructure. Experience in building CI/CD in a complex multi-service environment.\n\nArchitectural vision and ability to design scalable and secured cloud-based services. Linux proficiency as sysadmin on Debian and/or RedHat derived distros. Knowledge of network admin: TCP/IP, ssh, HTTP/HTTPS, SSL, NLB. Scripting skills: bash (must), ruby, and/or python.\n\nExperience with Git and familiar with one or more of Github, Gitlab, Bitbucket. Hands-on experience with AWS or similar public cloud. Docker and Orchestration tools (K8S). Monitoring tools (Prometheus, Icinga, Grafana).\n\nCreating and managing clusters of ELK, RabbitMQ / Kafka, Redis. Fluent Hebrew and English – oral and written. ******************* משרה נוספת - DevOps TL Deep experience with Linux system knowledge.(Redhat CentOS) – Must (min 3 years ) Scripting and development skills – Must. (min 3 years ) Experience as a TL DevOps - Must.\n\n(min 2 years ) Experience with networking and configuration management tools .(Ansible/puppet/ Terraform) – Must Knowledge in Linux OS building and customization. Experience with Docker and Kubernetes. Passionate about new technologies. DevOps Engineer 4+ years of experience in a DevOps role Extensive experience in both application development as well as operational support for large, high scale applications Experience with Hashistack - terraform, consul, vault, and nomad Experience with Kubernetes Experience with running Dockers in production Knowledge of at least one of Ruby/Go/Java/Python - more than one is an advantage Experience with automating Cloud Computing platforms (particularly AWS) Understanding of Chef/Puppet/Ansible ****** Knowledge of the ins and outs of cloud providers (AWS, Google Cloud, etc) 3+ years Experience in DevOps or Software Development using the Ops toolset in the industry/Army unit Experience working in an algorithmic/data science system (an advantage) Excellent knowledge of Linux Good knowledge of Docker Good Knowledge of Terraform or similar IaC tools Coding skills (Python / Ruby / JS / Golang) Understanding of CI and CD concepts Working with databases (RDBMS or NoSQL) and large, complex data sets Good understanding of DevOps methodologies and infrastructure level tools Performance monitoring and tuning Understanding of security best practices, both for application (OWASP) and for the organization (SOC2 and the like)Report"}, {"company": "בי נט ייעוץ והשמה כ''א בע''מ", "job": "Senior Real-Time Software Engineer", "city": "Southern", "date": "12d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=120&ao=1110586&s=58&guid=00000186e6418308bf92147c0eb17bea&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6b2bf48d&cb=1678900529581&jobListingId=1008505283862&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj4a2ahk6dq801-1grj4317e227a000-df9ffcc06b2b4d75--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNDZcI3Tvdo4mWFVMACugIrJcyTPTca0rFPSvFIdGJj0WpGLHu3UottpkH-6BW-enihOL4V9V26Yz0_9pFBIS16aujpZ7HoeA3NhcDX7I857-e3bMCk5f8ef_690oovEjWaTxXrw2X7UMrY56iCMfHjMw-F44KzrZwnVcSdxUOI8cBygEhFZtWOWWP86r33R1DSywPS1uI2HrCyaBlfWTFgQRomZ2zUHyU3XWGNm84l1oPNGk9SXapu2oLdoyM9WZukdIGcNnaxhYzq9gL1TWUkyHFTSMIWw0-cmg71whr7JUJQgSHzDGG7d0spSS91sBW_-fLG4QFR4VD3kTHNCRbinRACOhkXb956PT0Ijofev3lb1EmIXzLUsDJmSg-4mmgGRQv5nx571UpPW-mHuiTfoJv2LTcksFgPRJhjkU9nG0r61EK70q-3HSXdKsjItPVjPDDXc78RuwKlzfpfuDUlKnu05UwifnaIvM7Z4zh25Az7JpXqDRbg6H4AgsI8C9VETgNGeXdbMWWZHabf1guX1BDbmqcSjIFVt-YShZQXsq2_SkC8uFnln_bGk10ZfWE3bMItOL235AzkvSHnGza-E3edxwTeW0K_57I8MHpIk7xzntkxeOv6BpzGCmMNbYygH5Ibkq70Iyhgw3_maQkSL_oRybrfFffI%3D", "description": "Senior Real-Time Software Engineer for real-time software development for Company's systems working within strict time constraints. **Please Apply your CV in WORD Document B.Sc. in computer science / SW engineering / electrical engineering. 5+ years programming experience in C/C++/Python, as well as hands-on experience debugging complex real-time software.\n\nExperience writing real-time coding, including complexity analysis and performance optimization Experience with Multi-threading, OOD and Design pattern Demonstrate a deep understanding of the Linux operating system including networking (network services) and scripting (Bash) Nice to have · Experience with parallel programming on NVIDIA GPUs using CUDAShow more Report"}, {"company": "בי נט ייעוץ והשמה כ''א בע''מ", "job": "FPGA/VHDL Engineer", "city": "Israel", "date": "7d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=121&ao=1110586&s=58&guid=00000186e6418308bf92147c0eb17bea&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a7ef3b8e&cb=1678900530736&jobListingId=1008515729861&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj4a3eoii20801-1grj4317e227a000-4104b0015e9944a6--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNDj56dqzv9PCoreWtHN7p9ycN2TF3vGSTuFTgxB7X_LyJvRSVQX_DIVrq-qWo2EEa0-C0ZfTj8EdG3aVwJuFdUhYzGQanG0Cb3c8v1SBWs4w9WjKsdfQQe_N67C_UQFv6lSCfpsUmweh0EXo0kIG6Iw3_japQ29sqdZuofxQtpFgn3OT_cKySfVVbHNnR1iiiKRsd_SM6XllXIQx7YInM_AHMbzrMuFDRG22mA3YpZLneJNWsXq1jXA2jaSomomW1YwHuCusb9sFv26EQBTMJJ2FHt9Ka_cq3TUO0I-gRb0ra9y6RU47ZibESW2s8o02wLrjG3H_PqniQseAwx4R2aegm_YribALMdW2t6u96-5KuGnyqL-HGsb5JDRVU9p0qCggcZomIkXOQ5dyhyRqxdNjaBjJF7SphHxV4wQcrh3okoaludtlsEQxGvrZ8sSBPrpIim2psTnEnsqcXMm3EUTxd2MtzcYzlSZlLZQsD4MRDxYmI1lBMw6qkeGLqrgowcgOy9GPwTIt20tJb5VEmI8fMaz1vhNb9rePjo7ozCGwvFXRlm5D-CliYBu1QwkAbG7LbibUuKSW7T8T501eYHCSoRzHWwHA5pCynwCU1CxbVg5Yxey9fM9iksoHzJbpbGff9tNkEBtoLXwmNPt7XswfCDZSNvqRAw%3D", "description": "FPGA/VHDL Engineer part of system architecture, design, and verification of main system components including HO support for troubleshooting and research for next-generation systems. **Please Apply your CV in WORD Document B.Sc. in Electrical engineering. - Must Experience in VHDL/Verilog at least 2 years - Must Experience and familiarity with hardware design for FPGAs Microcontrollers and DSP - Must Experience with interfaces/protocols – PCIe , DDR 3 or 4.\n\n\nMust protocols: (I2C, SPI, UART/USART, QSPI).- Must Board design experience and familiarity with the common inter-module communication protocols: (CAN , LIN, RS232 , RS485, RS422, ETH ) -Must Experience with onboard FW/SW integration (close integration with Embedded team) - Must Deep understanding of High Speed, Power and Signal Integrity concepts for board design - Must. Familiarity with Cadence EDA software (Orcad+Allegro) or similar i.e Altum/ Mentor - Must Experience working with lab equipment, for ex. Spectrum, Scope, Electronic Loads - Must SOM, Xilinx ,ST, Intel - advantage Ability to design PDN (Power Distribution Network) and On Board Auxiliary power system - Advantage Ability to lead projects from scratch to production Meticulousness and excellent organizational skills\n\nReport"}, {"company": "Parallel Wireless", "job": "PHY System Engineer- Intern", "city": "Israel", "date": "2d", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=122&ao=1136043&s=58&guid=00000186e6418308bf92147c0eb17bea&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0b8c3701&cb=1678900532031&jobListingId=1008525293384&jrtk=3-1-1grj4a4k0m6rv801-1grj4317e227a000-6c72e24bb57ab04c-", "description": "People come to work at Parallel Wireless because we are building the future of telecom. They stay, because they are challenged and driven by an incredible product and team. We take pride in our commitment to employee development, and our culture fosters an atmosphere of empowerment, trust, respect, and communication. Learn more about our mission, vision and values.\n\nPeople come to work at Parallel Wireless because we are building the future of telecom. They stay because they are challenged and driven by an incredible product and team. We take pride in our commitment to employee development, and our culture fosters an atmosphere of empowerment, trust, respect, and communication.\nWe are looking for highly motivated, and passionate, PHY system intern for the design, implementation, and integration of advanced cellular communication systems for our next generation base-station products.\nJob Responsibilities:\nTakeing part in the development and Integration of our base station PHY products\nDevelopment of debug capabilities\nBuilding and conducting test runs\nWork in collaboration with all company teams such as SW, DSP, Algorithms, QA and other.\nJob Requirements:\nUnderstanding of Wireless communication systems\nWorking experience with RF lab test equipment\nExcellent communication skills (written and verbal), team worker and ability to thrive in a global multi-site environment.\nAvailability to work at least 3 times a week\nParallel Wireless is the leading U.S.-based company challenging the world’s legacy vendors with the industry’s only unified ALL G (5G/4G/3G/2G) software-enabled OpenRAN solutions. Its cloud-native OpenRAN and network architectures redefine network economics for global mobile operators in both coverage and capacity deployments, while also paving the way to 5G. Through open collaboration with the OpenRAN ecosystem partners, Parallel Wireless has created the world’s first and largest fully-compliant OpenRAN ecosystem that is capable of delivering next generation wireless infrastructure at a dramatically lower cost, ensuring more equal access to 5G across the globe. The company’s OpenRAN portfolio is designed to help customers modernize their networks, reduce deployment costs and complexity, increase operational efficiency, enable interoperability, find new revenue streams, and start deploying multi-vendor 5G networks today. The company’s customers include over 60 global mobile operators, as well as private and public industries and governments that use their software-defined network portfolio to reimagine their networks. Parallel Wireless's innovation and excellence in multi-technology, open virtualized RAN solutions have been recognized with 65+ industry awards. Please visit www.parallelwireless.com for more information.\n\nParallel Wireless embraces diversity and equality of opportunity. We are committed to building inclusive and diverse teams representing all backgrounds, with a wide range of perspectives, and empowering industry-leading skills. We welcome and consider applications to join our team from all qualified candidates, regardless of their characteristics. We comply with all applicable laws and regulations on non-discrimination in employment (and recruitment), as well as work authorization and employment eligibility verification requirements.\n\nParallel Wireless does not accept unsolicited resumes or applications from agencies or individuals. Please do not forward resumes to our jobs alias, Parallel Wireless employees or any other company location. Parallel Wireless is not responsible for any fees related to unsolicited resumes/applications.Show more Report"}, {"company": "אלביט מערכות", "job": "Embedded SW Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=123&ao=1110586&s=58&guid=00000186e6418308bf92147c0eb17bea&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_13b77790&cb=1678900533881&jobListingId=1008071392022&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj4a6frpke0801-1grj4317e227a000-db7dc07c6981d9e8--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tGRBbjy15RxGaEEw7KZU_HJZ_VS6Ei8oFxUuO1dqU_4B7prX0YH3-0Ps60rZBZfMfpUweRCfP5WYATNN68b3YK6nXDtDYRSZw4249HsJVUFX2Lm-2CVotGkJKe9NO04Allh6pxx6Ym5vES9Qx3488E_NNQOofX38-i8CN5GadE6xFKwGc5pkNnq-ldsfS9dAwidpfaKrNdVevVTDji0uzavTY3sBdDdOchOB1474yGWiiXYp5LZF7-5zhuSI73sKCXdpwnn-Dw7dMI_QJa5xzdfSh0pKPCcpiGeHpJfyEO9GphCeUs4lvAWofn59gmGXNi7S5plZ0Jg6XBQ4-XRLno0fwPW5Q_dNhTcqSSl9M_tsKKxBnc5_MCbY69F2XQ79FCaBT6hfUBmmq6jWV6TCZvCg2A3AKE9SEnEUT29IO11iZOOuOeWdfEoGfmw3C0Q5cp-Kh9mmfm23kGNyg8J_LeC4lxjIYZcrX7L85JtOerrAK52PNixfJpXPweq7GctYyZ_eG1-6R0HQckEXp2zv1gPeXRYKUxWQHvVb6BvYPAItWs5GfYrc1DlmVKTdf5XtfAsh3XbslSC9P_C1LWuFcXALQVgBWECA41h1V10bEiQTXwAtXdJirGBqiWOVhuZh0Q_4OhRnrqxEhRwwoxldaMf9us5UAl86roo8KDjbzoWtr6DBjEj_Z08jYdjdZK46jQ%3D%3D", "description": "In light of the success of the E-LynX and E-cix family of products in Israel and around the world, we are expanding If you are looking for a professional challenge, interest, influence and development in high end technologies, this is your opportunity to take part of the success, in a challenging project and on a large scale in the field of radio, communication and software development The company's website in Netanya searches for team leader of Real Time Embedded software The role includes software development for Real Time Embedded systems in the communications field, real-time lead of software development team, while working with various disciplines in the administration. In addition, the role includes responsibility for the development process: characterization, analysis, implementation, integration and documentation of software design B.Sc in Software Engineering / Computer Science / Electrical Engineering Experience of at least 3 years of software development for RT Embedded systems Experience in the field of communication - Advantage Experience in C ++ / C Proven experience in vxWorks and Embedded Linux operating systems - Advantage Practical knowledge of communication layers in the Network & Data Layer Independencies of learning and leading projects Excellent interpersonal skills Proven experience in real-time system integration Hands on JobShow more Report"}, {"company": "אלביט מערכות", "job": "System Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=124&ao=1110586&s=58&guid=00000186e6418308bf92147c0eb17bea&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1f0048fc&cb=1678900535071&jobListingId=1008279978087&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj4a7lip6fl801-1grj4317e227a000-b7e0f4ae9856320b--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tGRBbjy15RxGaEEw7KZU_HLv3sJDFG2MTEpFHi0-G9McY88k0ys9uSQmlFVGayKyWUqs0XEqfgi9L6HM1QZG14cjDpweyFfMUt0mrirpo0PegsMIDsIq8ZnUQBsHURvZlmm9wMu0aGtzWcLq-YxU5AU-HkhhApcAHH0lvEyBlWPL-zjuV--qLeAcSHFX9r7wawysWD0remt_3ynMvOjUP1XE9MAuo9XbgZcFb81-7FbvJtLgibrp5PLvLuA9imxtfcKvjnJstkhuMXmOqNEFDDAK776fe1aHhwLcqM9z-jyMz4hmCgdYD3QdLZKAhRW5hdOZFItGVtqyzyfkujx40Rs-fYuPgOoLmhfgOoiRQSS1Jbh0-NG9FQ4y3Vo996jHR4b5sGkfjd10dSbRvV7bUMZkBPhxmin_wLgFAIhtxyYH9j3MVksIIvE4kELwTGX6u1yaBmCCltNUtUg8nbKbTM2CI2UGTCFerFDhBCfhTt-3TzK7P-ugxHMldnym9u8znTZQBMo6gj1VizaUDRcyGaW4GLVyNo55N4LAPoNlhICH2t1zTA_Va_FbvsHI4BI-_770btrwZ4nKrDHE_478Ad3js4PojV1LdGGx_KC7eP4hBbJUeY32KzrnLWt0FeeJa3HyK5WN9UJ-HU38mY3fOiZH4Hax6WCdkJgLSBTuyeCi1M0paod8Z21IyQ62_mjwFg%3D%3D", "description": "We are looking for system & communication engineer to lead technology-advanced and challenging programs as part of our communication systems engineering group in Elbit's Netanya site The job includes: System engineering for communication system solutions and communication applications Matrix management of other engineering groups to design, implement, integrate and test the solution for customers, foreign and domestic Requirement analysis, design and implementation support throughout the entire project lifecycle until delivery to the customer Working with technical customer representatives both locally and abroad, internal and external Ongoing projects support, including hands-on throughout projects lifetime Working with subcontractors to design, implement, integrate and test products Formal degree in engineering – preferably software, industrial, information systems or communication engineering At least 2 years of experience as a software / data / communication network system engineer System-wide view alongside ability to go into the technical details, with strong analytics capabilities High interpersonal skills, ability to lead activities and drive people to action High multi-tasking capabilities High proficiency in speaking and writing in both English and Hebrew Preferred skills: Experience in working with engineering teams to design a multidisciplinary systems and solutions (advantage). Knowledge of data networking, IP networks and routing protocols (advantage) Background in military communication systems (advantage) – networking, radios, C4I Active Israeli security clearanceReport"}, {"company": "אלביט מערכות", "job": "Vulnerability Researcher", "city": "Israel", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=125&ao=1136043&s=58&guid=00000186e6418308bf92147c0eb17bea&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1bba6524&cb=1678900536265&jobListingId=1006887999780&jrtk=3-1-1grj4a8s0kf28801-1grj4317e227a000-83df04cb50ed6a2f-", "description": "קוד משרה: JB-70036751 מיקום גיאוגרפי: פריסה ארצית עיר: פריסה ארצית\nתיאור המשרה\nSigmabit is looking for a talented professionals to deliver cutting edge solutions to its customers. You will work with collaborative teams to design and develop advanced cyber solutions. The team members constantly enhance their skills set by working with a talented and technically accomplished group of experts.\nThe Embedded Reverse Engineer analyzes, decomposes, disassembles code, performs static code analysis, debugs and modifies software. We specialize in exploitation and analysis of computer networks & devices with a wireless and embedded focus. Work often involves research of software operating systems, malware or electronic systems. It is also includes Protocol Analysis, Vulnerability Assessment, Security Research, and Rapid Prototyping of proof of concept capabilities\n\nדרישות המשרה\nJunior level in Reverse Engineering\nExperience with IDA\nJunior level in C programming (academia experience is accepted)\nFamiliarity with Wi-Fi technologies ( 802.11) - Big Advantage\nStrong Python - advantage\nFamiliarity with IDAPython - advantage\nFamiliarity Network intrusion and protocol analysis- advantage\nWilling to work independentlyReport"}, {"company": "אלביט מערכות", "job": "Software systems engineer", "city": "Israel", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=126&ao=1110586&s=58&guid=00000186e6418308bf92147c0eb17bea&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a8324ce8&cb=1678900538327&jobListingId=1008235581578&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj4aasimfra801-1grj4317e227a000-6ee7132de1806146--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tGRBbjy15RxGaEEw7KZU_HL-KfBTosWH5i-TUmuswhOoiazgCTwGPyG839DIzUY7LrDGHpPrAHi-su2lzjr_enKSJszRqc3MCgEQPaBPT-Yl1-Nsc5s7fsn2sfFdxJf8F9ld7Eq8Saeo6j-JlP6hlgkiBgu4MCFZ6tNVqO9d9dsaTn3L6Y4Dq-tYUON-j1o4Clw6Ax641z1HA0RTm95EMExVfoMREKJWQlhchjYeJQgXs5ell1ph4CyT8M5yc9Q1C3jtuKcL7Q1zCvHA2nCULzowYt138LKuB5-zSEfX-p1W_rADyMBlDY-ht4FCzp2ubFmR1DCheeMQMkCwnYspEXGToZvNcXzRNNLgqTDn4CDcI6shkhs0wY0-nXLSqNevsgUUzXgcr9RjoTkE5-g8f90c4a6as9YkifIybUQOoCsH3qHx4Ovp4Gg_3hpc6uMnuryTWUQ8SHUuf04kvwNbBZRHJ911AoIZJ8RZ7y4ABgxlSjp1djZVh9H1Jksj0gKE0C6v8Zzl8AvrV0QY3cvBaEl9XEPlbeRRpa8Y_UODBp-RUsdIn8tu1Q0ax5ZR6XR3zTsSM7rMLfojcrdjgbAbsH8t5aAvhxoVpkpsUaYwwLaMJd_w5uc-jlovTPchN8ABo4sBSFITdPNl8AmqCAuHuNH0TGMk-vhVbPqgp-ZTQFXb8bekOnBeBGiM8Bz1f1XHxQ%3D%3D", "description": "We are looking for YOU - a software & communication system engineer to lead technology-advanced and challenging programs as part of our software and communication systems engineering group in Elbit's Netanya site The job includes: System engineering for communication system solutions and communication applications Matrix management of other engineering groups to design, implement, integrate and test the solution for customers, foreign and domestic Requirement analysis, design and implementation support throughout the entire project lifecycle until delivery to the customer Working with technical customer representatives both locally and abroad, internal and external Ongoing projects support, including a lot of hands-on throughout projects lifetime Formal degree in engineering – preferably software, industrial, information systems or communication engineering At least 2 years of experience as a software / data network system engineer Experience in working with software development teams and defining software related solutions Knowledge of data networking, IP networks and routing protocols High interpersonal skills, ability to lead activities and drive people to action High multi-tasking capabilities High proficiency in speaking and writing in both English and Hebrew System-wide view alongside ability to go into the technical details, with strong analytics capabilities Preferred skills: Work experience with Agile methodology Experience in software development Background in tactical communication systems (advantage) – networking, radios, C4I Active Israeli security clearanceShow more Report"}, {"company": "Novidea", "job": "Help Desk", "city": "Netanya", "date": "1 day ago", "rating": "2.8", "link": "", "description": "Manage IT infrastructure On-Prem and in a Data center/cloud - Mixed environment (Deploy patches, critical updates etc.)\n\nCustomer-oriented and cool-tempered with great communication skills - high English level\n\nResponsibilities:\nProvide help desk support.\n\nSupport and troubleshoot hardware and software issues.\n\nAssist with onboarding practices for new employees.\n\nSupport the company with different systems and applications.\n\nManage and maintain IT inventory.\n\nSupport the company’s conference room equipment and vendors.\n\nProvide urgent support on evenings and weekends.\n\nHandle SSO and VPN solutions.\n\nSetting up, maintaining and purchasing commodity computing hardware and software.\n\nCreating a user management solution and Knowledge of Network failure troubleshooting.\n\nOwn business security and reliability throughout the company\n\nWork with service providers to create robust solutions\n\nRequirements:\nAt least one year of work experience as a Help Desk Engineer.\n\nExperience in IT or OPS and excellent Hardware and Software troubleshooting capabilities.\n\nExperience with administration of Windows, Linux and Mac desktop and servers stations.\n\nExperience with Site-to-Site VPN setup and SSO solution management (Google, Azure, Okta, etc.).\n\nCompetent at documenting infrastructure and writing up policies.\n\nResponsible, methodological, strong analytical and organizational skills.\n\nExperience in scripting.\n\nBe able to provide off-hours support if needed\n\nKnowledge and experience working with every day tools such as Microsoft Office and Jira. - Must\n\nDeep networking knowledge and previous work with configuring switches, Fortigate (SSLVPN, IPsec configurations), DHCP, and DNS – Must\n\nExperience in support and troubleshooting with the ability to diagnose and resolve basic computer technical issues. - Must\n\nExperienced with AWS ecosystem - advantage.\n\nExperience with regulatory aspects as HIPPA, GDPR, ISO27001 - advantage.\n\nWork with Office 365 security tools such as Microsoft Intune and MDM\\MAM - advantage.\n\nManaging a SIEM solution - advantage\n\nExperience with WAF system - advantageShow more Report"}, {"company": "אנטריפוינט", "job": "Cyber Security Engineer", "city": "Southern", "date": "30d+", "rating": "3.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=128&ao=1110586&s=58&guid=00000186e6418308bf92147c0eb17bea&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_15ab8fca&cb=1678900541802&jobListingId=1008232301804&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj4ae922hsa001-1grj4317e227a000-f7fdfb03d83d5974--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tGRBbjy15RxGaEEw7KZU_HKtsucjm1uf633m2Oyfe-HZX47ne6wMCjotsAohKkXln3-SGs4VsyiBOt0eH-pWPFv6Ry2tcStNaVF0eIqlNptPv1YeV334itupYahCsQqbQTMeO8us3UdMNrjN_9h8to58X-dNVMpCNcoul0HVpz0w4CK0UrqVevcLw49DgVcgV4-ruqYoe8OxXKmDNWnCCRWVYgOMkRT7jdrVxkj4o9pEsHjv1IggSj32Qy7N_xwYDD_vTZeoqqFU5wyvKhaKzL0BisIgIgnipq5Yujh9ecGmhBkm2FODF7NyzWdtdAcTTRC9SmD1jZ4UjmNIJurQ-hCU7Q2__hf-ESe1pVZXmuj6CZvJw3kV__BfpxaA3SG1LwPaBlMaEn0cES5OBkYXiPuQKdB95wUNIbWkPfWhI6VOnOY3sbAd1aKNTLTEVvVnkaN-O7fCUAO6hi5CjFC09dy9L5Ok0L65H1DAFMq-QMLoTr2RLtAJ_ZyRoQcCbsL3f5AuH6hGSRcYvG1hDoEmX_JQQjSgaizXGPWvXouOwxa7Q08xt_Mz5FLzNPRsVHLRX_5AbtPpw37bJIkphc-dPfaENZZ9jVFgHC21iNcb32i494nmeMgRkknfqUvPoXpCVBSOh1WCQsrw5FHjsYr5vpFlYDmr5o7Aft0C8P88D_bIO9d7DqbVk7g%3D", "description": "Cyber Security Engineer We are looking for an experienced and passionate Cyber Security Engineer (CSE). The CSE will be a key player in designing and implementing top of the line Cyber security solutions and methods to ensure maximum protection to the company’s data assets in hybrid environment . He/she will be a part of our fast-growing Cyber team and will work closely with the company’s CISO/DPO. The position is located in Netanya.\n\n\n3 years of hands on experience as a CSE in a medium/large size organization, designing and deploying cyber security solutions and methodologies · Fluent English, technical and communicative · Strong knowledge in security solutions in FW, endpoints protection, OS, IPS, URL filtering, mail relay, AV, CA, NAC, DDOS, Sandboxing and various network protocols · Experience in SIEM/SOC solutions · Experience in cloud security – an advantage · Experience in ing and writing technical procedures · Experience in securing public cloud-based infrastructure · Experience in network gear – Switches/Routers – an advantage\n\nShow more Report"}, {"company": "אלביט מערכות", "job": "Networking System Engineer - Student Position", "city": "Raanana", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=129&ao=1110586&s=58&guid=00000186e6418308bf92147c0eb17bea&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e998237b&cb=1678900543168&jobListingId=1008456774035&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj4afjkkblp801-1grj4317e227a000-03e744ae37697a51--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tGRBbjy15RxGaEEw7KZU_HLQD3IYP0G202YGRBO1VauVhAKah1pH3Q4J_Qw_Os6YFwDOqAkPChdE4Rvu00RUPPhsyKlllq7iz5woXkLwCDHvc6N8obqX8ib6RW_1bVzWGdcmvubuMsXOc9FCrlhHa0BOVxE63SaEhoGbGE84Az3vw-QNPkKcJqGvHBGUecShb1Xl_WFFUyllcC5WK9byo_gUDZf-2ZIxUcLLnBfYzLh5fjN7ej9mwmoCAmmaZR66wHeufVoBpsvJT2ss9A2sug0E55FrzwNlpeIGUcil12BVAWXUXbtiwsZZrRRtot3Rs22uEJo7TY2wBA3JtTEoXcZLf5kW1eVSjGjYkriITkG_AQeiAH3BolcfdcrS2OpWO6G7_OfQ6KlVIi3UDa0llM1FtPq9jQPB7QhOsEeU0u5ILaEhKFP9LV0Ej5TdG2XYtiNbfyyiX-lhnhqVfDsoDwIPAShE4QNLMY9XG2cFjOiRyW_TI1RmvRlhzVkkbb-cICVHXxMplSSfQayrJhEecQnm7OwtxbAo2m6_ZQ8j82Nt-cThVWPsASNJSs3U0G2krFsN90FV-74ndDrVtHUxDFkBtFbBLh_8cbX-72g5wU4CPvv5VRlzs_apbtfOP_UVHR2A9bfrMb1APaiCwyEtBAMCwArQP2PgH76tmJvKjip5csYAi-Qzq8to2rO4qAY6-w%3D%3D", "description": "Our team in Natanya develops the next generation of an innovative tactical communication software system We are dealing with unique cutting edge technologies and routing solutions for domestic customers Our product is deployed on a variety of operational platforms as part of a communication infrastructure for C4I applications We are looking for you, a creative and enthusiastic student, for a challenging system engineering position We invite you to join us, learn, gain experience and grow in our exceptional team Key Responsibilities: Analyze system and networking requirements Research and design innovative next generation solutions in the field of tactical networking and routing Set up proof of concept (POC) environments Build simulation environments for tactical routing protocols and conduct performance analysis Escort implementation, testing and operational deployment processes B.Sc. student in Computer Science/Software Engineering/Computer Engineering or related fields Practical experience with: Python, Ansible, Bash Practical knowledge of Linux networking: network interfaces definitions, routing tables, sockets Experience with virtualization technology: hypervisors, docker containers, micro-services architectures Knowledge of routing protocols - advantage Working with C4I systems (particularly with tactical communication) – advantage Team player with self-learning capabilities and analytical skillsShow more Report"}, {"company": "Cisco Systems", "job": "Software Engineer Intern - Caesarea, Israel", "city": "Israel", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=130&ao=1136043&s=58&guid=00000186e6418308bf92147c0eb17bea&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_37160103&cb=1678900544216&jobListingId=1008306907250&jrtk=3-1-1grj4agkikhpe801-1grj4317e227a000-2355160ff5f42f29-", "description": "Location: Caesarea or Tel-Aviv, Israel\nStart Date: Flexible - in accordance with the university schedule\nWhat You'll Do\nYou'll develop Core Software technologies at the heart of tomorrow's leading infrastructure solutions, tackling the entire range of challenges from user-facing API-s, through high-level algorithms, all the way down to firmware.\nThe Cisco silicon One team is leading the silicon development in Cisco. We use the latest silicon technologies to build largest scale and most complex devices at the edge of feasibility.\nIf you want to work with amazing people, developing the first iteration of world-class products, join us!\nWho You'll Work With\nYou'll be part of the Cisco Silicon One team - an amazing group driving Cisco game changing next generation network devices - Cisco Silicon One™. Our unique team works in a startup atmosphere inside a stable and leading corporate environment on the outside.\nWe are transforming the industry and building a new internet for the 5G era, providing a unified, programmable silicon architecture that is the foundation of all Cisco's future routing products.\nOur design center is unique - hosting all silicon HW and SW development disciplines inside one site.\nOur devices are designed to be universally adaptable across service providers and web-scale markets, designed for fixed and modular platforms. Our devices deliver high speed without sacrificing programmability, buffering, power efficiency, scale or feature flexibility.\nCisco Silicon One™ is a revolutionary, ground-breaking technology for our customers and end users for decades to come! The Internet now has a new faster, better, safer engine!\nLearn more about us right here:\nSilicon One Article\nCisco Silicon One movie\nCisco CEO talks to Fortune about 5G Chips\nIsraeli Calcalist on Leaba Cisco acquisition (in Hebrew)\nCisco Bets Its Business on 'Internet for the Future' Strategy\nWhat are we looking for?\nBrilliant ambitious and motivated individual, regardless of previous experience.\nTeam players who enjoy big challenges\nStudents of Computer Science with GPA above 88 from leading Israeli Universities, graduating in 2023-24\nPeople who can quickly ramp on multiple, interdisciplinary domains.\nWhy Cisco\nWe connect everything: people, processes, data, and things. We innovate everywhere, taking bold risks to shape the technologies that give us smart cities, connected cars, and handheld hospitals. And we do it in style with unique personalities who aren’t afraid to change the way the world works, lives, plays and learns.\nWe are thought leaders, tech geeks, pop culture aficionados, and we even have a few purple haired rock stars. We celebrate the creativity and diversity that fuels our innovation. We are dreamers and we are doers.\n#WeAreCisco\nMessage to applicants applying to work in the U.S.:\n\nWhen available, the salary range posted for this position reflects the projected hiring range for new hire, full-time salaries in U.S. locations, not including equity or benefits. For non-sales roles the hiring ranges reflect base salary only; employees are also eligible to receive annual bonuses. Hiring ranges for sales positions include base and incentive compensation target. Individual pay is determined by the candidate's hiring location and additional factors, including but not limited to skillset, experience, and relevant education, certifications, or training. Applicants may not be eligible for the full salary range based on their U.S. hiring location. The recruiter can share more details about compensation for the role in your location during the hiring process.\nU.S. employees have access to quality medical, dental and vision insurance, a 401(k) plan with a Cisco matching contribution, short and long-term disability coverage, basic life insurance and numerous wellbeing offerings. Employees receive up to twelve paid holidays per calendar year, which includes one floating holiday, plus a day off for their birthday. Employees accrue up to 20 days of Paid Time Off (PTO) each year and have access to paid time away to deal with critical or emergency issues without tapping into their PTO. We offer additional paid time to volunteer and give back to the community. Employees are also able to purchase company stock through our Employee Stock Purchase Program.\nEmployees on sales plans earn performance-based incentive pay on top of their base salary, which is split between quota and non-quota components. For quota-based incentive pay, Cisco pays at the standard rate of 1% of incentive target for each 1% revenue attainment against the quota up to 100%. Once performance exceeds 100% quota attainment, incentive rates may increase up to five times the standard rate with no cap on incentive compensation. For non-quota-based sales performance elements such as strategic sales objectives, Cisco may pay up to 125% of target. Cisco sales plans do not have a minimum threshold of performance for sales incentive compensation to be paid.Show more Report"}], [{"company": "CrowdStrike", "job": "C++ Windows Sensor Engineer - Data Security, Israel", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=101&ao=1110586&s=58&guid=00000186e642473bb4d0ca91ec69e9a7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_80f3ea3c&cb=1678900545604&jobListingId=1008414783574&cpc=9BE7264F9E667C9B&jrtk=3-1-1grj4ahui2i7e001-1grj44ht1gsrr800-0b71b029fbaaa0c2--6NYlbfkN0BJMW_X9OCLkZ04_weh8WkR-IGNb1MhigwTP7XGwrJOFwZb96yIISkY_qENr62JHCFeH7fHADQaV5Q8ssq_J0de5IYCbVEiRyTI7Kb1sZt28DnvkXJMeDE7QJHEJOLHl85jdw6oDqs_lmSvQrY-hFfblHX7bp842-IiAu9EuIMU1EYo0I5b-0l7nWY8xVPVYxDZ-C10uTlHTdWFqfNpdOufYrYXgpT5us53itLHr68t9fJ2-eUj9C5YQziP6F4Eaj00IPRLS7qnRxrdbhreVUA5TvzeDcxBo6Pqy_Ox8O2wOkU_uTQSKyP6qxNrpovHJl-Sk0rXxfHaVVYpAgTZcfZ_kq7qmWd378k4GV_a4wr8uuUXyv1A4pF6fWUIhq7l5IzpdHST5AWHNFJMwPhd7MK_Hg99RMNyno0z1OqMqLTUs8UK07vOn3rQEPURiwHJQJbMdIiOnU0eEGa6tZ16hC02GN3hoJfAsAYncZ4S5PqhCEKZJfVaT2QXQ6gqUIdYRumin1F27OohZ1hptSDGOx1t2rPNROb5SsV2diyZxbamxMXYOWAWQOIXGbYWAA0C3V1Wvc_ANK7UiYGlZAHU1Yrm08WRBE6B83XnLKPCHstZky2JEH74QGkAqwF5h5Fly0O70xACKO_K0vEkUiYQxm-9g4LkWthwjZOScuKIFjAWc4sQVulXi9dSSXVUXnTdhyIqMhPjwk3cDKXfqR_ybIGkflT8gHKuQoUtOwJC5gQrmQ%3D%3D", "description": "#WeAreCrowdStrike and our mission is to stop breaches. As a global leader in cybersecurity, our team changed the game. Since our inception, our market leading cloud-native platform has offered unparalleled protection against the most sophisticated cyberattacks. We’re looking for people with limitless passion, a relentless focus on innovation and a fanatical commitment to the customer to join us in shaping the future of cybersecurity. Consistently recognized as a top workplace, CrowdStrike is committed to cultivating an inclusive, remote-first culture that offers people the autonomy and flexibility to balance the needs of work and life while taking their career to the next level. Interested in working for a company that sets the standard and leads with integrity? Join us on a mission that matters - one team, one fight.\nAbout the Team:\nYou’ll be joining our Data Security Product Group, whose mission is to build a unified data security system which enables customers to identify and investigate insider threats, identify access to and movement of sensitive data, and ensure regulatory compliance by mitigating data loss risk.\nAbout the Role:\nCrowdStrike Falcon Host is a two-component security product. One component is a “sensor”, which is a driver installed on client machines that observes system activity and recognizes malicious behavior, then provides on-box prevention capability and remote telemetry to the Falcon Host cloud. The cloud component aggregates sensor telemetry for each customer’s network can correlate malicious behavior across multiple machines and presents our customers’ operations teams with a prioritized summary of the threats detected in their environments.\nJoin CrowdStrike and become a key leader in building the most innovative endpoint security solution in the world. Our sensor development team is responsible for building the endpoint sensor which deploys on multiple platforms including Windows, Mac, and Linux. As a Software Engineer, you will be expected to have ownership over major components and development projects. You will be required to assist with architecting solutions and support in implementing our core features. Features will cross-cut most core OS subsystems such as file system, memory and process, and networking. Many features are also built in a way that they will have shared components across multiple platforms. You need to be able to lead projects efficiently while maximizing performance and minimizing costs, making sure high standards are being followed when it comes to design, coding quality, and unit and component testing.\nResponsibilities:\nProvide partnership on the sensor development team involved in architecture, strategy, in building and improving next-generation Anti-Virus and Enhanced\nDetection and Response Security Software\nDevelop new product concepts\nSupport development teams in designing and building software with cross-platform deliverables (Windows, Mac, Linux)\nOwn features from design to delivery including participation in product demo at the end of the sprint\nCollaborate with multi-functional teams in various locations\nRequirements:\nIn depth knowledge with C++ and Windows development\nStrong low-level OS internals in either Windows, Mac OS, or Linux\nExperience debugging memory corruptions, process contentions and system performance\nExperience working with teams to ship major features and releases.\nLead, mentor, communicate, collaborate, and work effectively in a distributed team.\nPreferred Requirements:\nOS system expertise for core concepts and subsystems\nKnowledge in Security\nStrong background in scalable, light-weight and highly performing systems\nFamiliarity and experience with Agile process\n#LI-YA1\n#LI-MZ1\n#LI-DS2\nBenefits of Working at CrowdStrike:\nRemote-first culture\nMarket leader in compensation and equity awards\nCompetitive vacation and flexible working arrangements\nComprehensive and inclusive health benefits\nPhysical and mental wellness programs\nPaid parental leave, including adoption\nA variety of professional development and mentorship opportunities\nOffices with stocked kitchens when you need to fuel innovation and collaboration\nWe are committed to fostering a culture of belonging where everyone feels seen, heard, valued for who they are and empowered to succeed. Our approach to cultivating a diverse, equitable, and inclusive culture is rooted in listening, learning and collective action. By embracing the diversity of our people, we achieve our best work and fuel innovation - generating the best possible outcomes for our customers and the communities they serve.\nCrowdStrike is an Equal Opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected veteran status, or any other characteristic protected by applicable federal, state, or local law.Report"}, {"company": "CrowdStrike", "job": "Sr. Sensor C++ Windows Engineer - Data Security, Israel", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=1110586&s=58&guid=00000186e642473bb4d0ca91ec69e9a7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_64158c1c&cb=1678900546795&jobListingId=1008423542364&cpc=24589B7DFBADF147&jrtk=3-1-1grj4aj4gkblq801-1grj44ht1gsrr800-31dc5dfc4e448001--6NYlbfkN0BJMW_X9OCLkZ04_weh8WkR-IGNb1MhigwTP7XGwrJOFwZb96yIISkY_qENr62JHCH2LykahT18vvzPAhujoXjuM5KC3Y-91QFJbpYm2iGPIpjzeCjA9AwNc_MZe1zizxCMPYSPS0tI7vM-1_24SRmO5XeHIr90hML9YRIdU4-qCpL9pmFobhu0GWDZakPZtsgT5yBBRdapgKbCIemIOQbKy0_vsrUNPMPf-81vaG31ahnMApiWaMzGXdwfCgoeZ0KEgCV_GCgxtpDNv5xZ-sqfds04Pzch4u50XpjQbWYPGvSZ-a3Bj3xmezrrBL96oI3g2PPUW0h0O-fdl5kuvFe3oHzsHj_ImxIOM8Taq1DImSvkWNepMkpLqnQ_MS5D6-IOf8CB0AX3o2Oa4zvkjM2zpO998Y-aR1yA0hzV74ey2u-Zv_P3_vItnBcqS_OSbfW5ND-C42z9NFImskqS35uzwcoW90O53xVp_GFinPof5A-hOqhipHRLPOsn56E8UY-a8XunMN4uC3647JjqV8w7WGT9gHSwdX0wO6sFDVodIeC7NvHKqX_YGUklhDofEY4OKiRogSQ4TUlQDNUo4vSjBk0tK98NCMWGWeePkZ8RdviXUlJBeEc_OFQsa1sZfDsYHPYyC5SH5fakoE7PLNMJ4LrAUZkYsxs_-K3JlLsYSttq0ZmeDf0PMISYL9LBxtIbeWl6ZcDXHvN1-rrhNEe_czX5JZxQZ_B7fSBFu-ResQ%3D%3D", "description": "#WeAreCrowdStrike and our mission is to stop breaches. As a global leader in cybersecurity, our team changed the game. Since our inception, our market leading cloud-native platform has offered unparalleled protection against the most sophisticated cyberattacks. We’re looking for people with limitless passion, a relentless focus on innovation and a fanatical commitment to the customer to join us in shaping the future of cybersecurity. Consistently recognized as a top workplace, CrowdStrike is committed to cultivating an inclusive, remote-first culture that offers people the autonomy and flexibility to balance the needs of work and life while taking their career to the next level. Interested in working for a company that sets the standard and leads with integrity? Join us on a mission that matters - one team, one fight.\nAbout the Role:\nYou’ll be joining our Data Security Product Group, whose mission is to build a unified data security system which enables customers to identify and investigate insider threats, identify access to and movement of sensitive data, and ensure regulatory compliance by mitigating data loss risk.\nCrowdStrike Falcon Host is a two-component security product. One component is a “sensor”, which is a driver installed on client machines that observes system activity and recognizes malicious behavior, then provides on-box prevention capability and remote telemetry to the Falcon Host cloud. The cloud component aggregates sensor telemetry for each customer’s network can correlate malicious behavior across multiple machines and presents our customers’ operations teams with a prioritized summary of the threats detected in their environments.\nJoin CrowdStrike and become a key leader in building the most innovative endpoint security solution in the world. Our sensor development team is responsible for building the endpoint sensor which deploys on multiple platforms including Windows, Mac, and Linux. As a Software Engineer, you will be expected to have ownership over major components and development projects. You will be required to assist with architecting solutions and support in implementing our core features. Features will cross-cut most core OS subsystems such as file system, memory and process, and networking. Many features are also built in a way that they will have shared components across multiple platforms. You need to be able to lead projects efficiently while maximizing performance and minimizing costs, making sure high standards are being followed when it comes to design, coding quality, and unit and component testing.\nResponsibilities:\nProvide partnership on the sensor development team involved in architecture, strategy, in building and improving next-generation Anti-Virus and Enhanced\nDetection and Response Security Software\nDevelop new product concepts\nSupport development teams in designing and building software with cross-platform deliverables (Windows, Mac, Linux)\nOwn features from design to delivery including participation in product demo at the end of the sprint\nCollaborate with multi-functional teams in various locations\nRequirements:\n7+ years of experience with C++ and Windows development\nStrong low-level OS internals in either Windows, Mac OS, or Linux\nExperience debugging memory corruptions, process contentions and system performance\nExperience working with teams to ship major features and releases.\nLead, mentor, communicate, collaborate, and work effectively in a distributed team.\nPreferred Requirements:\nOS system expertise for core concepts and subsystems\nKnowledge in Security\nStrong background in scalable, light-weight and highly performing systems\nFamiliarity and experience with Agile process\n#LI-YA1\n#LI-MZ1\n#LI-DS2\n#LI-Remote\nBenefits of Working at CrowdStrike:\nRemote-first culture\nMarket leader in compensation and equity awards\nCompetitive vacation and flexible working arrangements\nComprehensive and inclusive health benefits\nPhysical and mental wellness programs\nPaid parental leave, including adoption\nA variety of professional development and mentorship opportunities\nOffices with stocked kitchens when you need to fuel innovation and collaboration\nWe are committed to fostering a culture of belonging where everyone feels seen, heard, valued for who they are and empowered to succeed. Our approach to cultivating a diverse, equitable, and inclusive culture is rooted in listening, learning and collective action. By embracing the diversity of our people, we achieve our best work and fuel innovation - generating the best possible outcomes for our customers and the communities they serve.\nCrowdStrike is an Equal Opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected veteran status, or any other characteristic protected by applicable federal, state, or local law.Show more Report"}, {"company": "BUFFERZONE Security", "job": "QA Engineers", "city": "Herzliya", "date": "30d+", "rating": "3.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=103&ao=1136043&s=58&guid=00000186e642473bb4d0ca91ec69e9a7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b97ab485&cb=1678900547982&jobListingId=1006729600525&jrtk=3-1-1grj4aka8k26d801-1grj44ht1gsrr800-c1bae74f345d1b04-", "description": "We are looking for motivated and talented people to join our team. If you are looking for a challenging position in a fast-paced start-up environment, please send your CV to us at careers@bufferzonesecurity.com.\nBUFFERZONE’s QA team is responsible for verifying that all product releases meet the highest standards. As a member of the QA team, the QA engineer will be responsible for planning, writing and executing product test plans, both manual and automatic. The job requires a good understanding of the MS Windows environment, Windows applications, client-server systems, and security applications.\n\nResponsibilities\nPlanning test cycles according to Product Requirements, Design Documents and work plans\nWriting detailed and creative manual and automated test plans\nCreating and executing tests\nProviding technical support for the product when needed, mostly in English\n\nRequirements\nExcellent English – spoken and written\nSelf-motivated and independent learner\nTeam-oriented, methodical and organized\nEnergetic and willing to work in a fast paced environment\nPrior experience with Active Directory, networks, file sharing systems, security software\n2-3 years experience in QA – an advantage\nBachelor’s degree in Computer Science, Engineering or equivalent technical field experience – an advantage\nPrior experience with JIRA – an advantageReport"}, {"company": "Optimove", "job": "Junior Software Engineer", "city": "Tel Aviv-Yafo", "date": "14d", "rating": "4.4", "link": "", "description": "Optimove is a global marketing tech company, recognized as a Leader by Forrester and a Challenger by Gartner. We work with some of the world’s most exciting brands, such as Papa John’s, Staples, and Entain, who love our thought-provoking combination of art and science. We recently secured a $75M growth investment, and with a strong product, a proven business, and the DNA of a vibrant, fastly-growing startup – we’re now experiencing yet another growth spurt. It’s the perfect time to join our team of ~400 thinkers and doers across NYC, LDN, TLV, and other locations, where 2 of every 3 managers were promoted from within. Growing your career with Optimove – a Top100 company to work for in Israel – Is guaranteed.\nBased in central Tel Aviv, our R&D operation is a dynamic environment, where every developer can impact the flow of technology – from introducing the smallest library to making big infrastructure changes. We welcome open-minded developers who like to share knowledge and help each other push Optimove forward to the cutting edge of today’s tech.\nIf you always dreamed of being a REAL developer this is the team for you. Our core team can do it all ( C#, NodeJS, SQL, Docker, GCP, cloud functions, CI/CD...) on a growing fast, high-scale product that handles thousands of events per second.\nResponsibilities:\nWe are a team of technophiles who hate latency. As a member of our team, you will need to:\nDevelop and maintain systems that can process complex requests within a few milliseconds.\nTackle advanced engineering challenges in multiple languages and environments.\nOn every product that the team manages, from ideation and planning, all the way to production and monitoring.\nTeach and learn. We love to inspire and be inspired and make sure that each team member has their place to grow and excel.\nWork both autonomously and collaboratively with the team and other Optimove teams.\nRequirements:\n\nB.Sc. in computer science or equivalent\nAt least 1-2 years of experience in backend development- must\nExperience with C#/.NET Core / Node.js (TypeScript)- must\nAnalytical mindset, strive to make data-driven decisions.\nAdvantages\nExperience working with micro-services architecture.\nExperience with Client-Side Angular framework\nExperience with RESTful Web API\nExperience working with SQL and/or NoSQL databases.\nSite:\n\nIsraelShow more Report"}, {"company": "AMBITION", "job": "Algorithms Engineer לחברה מצליחה בתל אביב", "city": "Israel", "date": "30d+", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=1110586&s=58&guid=00000186e642473bb4d0ca91ec69e9a7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_8fbdf470&cb=1678900550983&jobListingId=1008440029433&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj4an83kcna801-1grj44ht1gsrr800-810193bc7b1c061e--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNDZeKRTdBB5C4i026NBecx_r9tlT08GdZPQDQI2u0AhZsQkbdvMNCgU_Od2bD7NhDrMFqU5QDyN8ewM9vmrKq-2y88mlxThJm1nbgM1pceun2w2ODKwaWCA1Z5oSPQyrN6O157QgC5j5rmCDJgYFWVDQPUnifInShtCTImD53ox2uqgtTCsSDtyNaAxiYa2AqmA2KKXDKrB_OlKjimGUqhEMl-wKeS4_cHos89toK9aeJDSnhG2U8Zp8GVSS_Nu63e9ZWZD5j9QKaBPd6csCTypV7KuEK4bniNeR_8s2uBKFaQi9P5oVpZGvh9JztwNABbIG7VAMnzBqAGAagMHJHtqVzxjC4ZFIrQZUUjYVYKaa9tMfhtGkCKfySHIuLk_4dpzEyazMIekoEMaPQZmSMgUwPLRy0xnsavE2TCaRck1oTRU9dG1kuX9F0SaH7rq8pil6musybttt4KO-3PUiuwTVu9oBPVXF2pI84M_WDC3e4VFShXrNrdiVawp9g27JXlwjb-QwbdTDZo8bP0ayhvWL2yqOpCJ9PLGgIEzYTae3LAOJIpoOjForaEt5j8Z2WMxD6allx5E5mPcU5TQ-k9PMeHkVPykOzFH92LccZyM8ZaXZJdsOeMXerOKdgI9-iE-6DvTSkG9c_AIZuAKewrdf3XiwYx3YK8%3D", "description": "Algorithms Engineer לחברה מצליחה בתל אביב Algorithms Engineer לחברה מצליחה בתל אביב Python, Java, TensorFlow, Spark, Kafka, Cassandra, HDFS, ElasticSearch, AirFlow, BigQuery, Google Cloud Platform, Kubernetes and Docker דרישות התפקיד About you: M.Sc. or PhD. in Computer Science, Mathematics, Engineering or a related field Strong knowledge in Python Good knowledge in Java, Scala or C++ Familiarity with statistical modeling techniques 3+ years of hands on experience with coding machine learning/statistical modeling based solutions Experience in data analysis and visualization and strong knowledge in SQL Possess strong problem solving and critical thinking skills Nice to have: Experience in developing models using deep learning techniques and tools Experience in developing software within a distributed computation frameworkShow more Report"}, {"company": "חיבורים", "job": "Algo Software Engineer לחברת סטארטאפ", "city": "Raanana", "date": "28d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=106&ao=1110586&s=58&guid=00000186e642473bb4d0ca91ec69e9a7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_97b84cb1&cb=1678900552467&jobListingId=1008473410348&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj4aojvkf0m801-1grj44ht1gsrr800-6024af313766ea00--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBcv60MRBXIbaprORjPqSV7tL4CaRvNHIzOHC2jDVMqsDWu4fU7GjMGmDfsa0d05LnaaMKgMSZkfVbmj5gIYBqM3j0dlIN2IfJ6kGk-eU-qtv3eUeJhGWdauLI_hSJxsnUU8iEwa9Z8lgx0Qujo3_vjuY4LhUgZrtM8k8sLkQZ2UAR1L8kN71di7mMzjl8QUOKHK14ssXpP1NUWaGLhKmcpY7rFpQwBPfLRVeXrLZG-z507LuKMhXf0GnR-Hzby054i5zgRqSnizHDEa9QEoBxsC4sHdyFnNiXsWELaW2J6g5zHVZclL821zrgfqS51x10-vKCi46wPp61flF41Ki3hpcpykp1I_g-b_fzj60OW7WXOwb-wQxW4WWEu0fbd5rB_YyusXcAilZSg2PYX7M5eGI0-7mG66zumWiLzNCehzcnfPn8KJH9Fxyx8DVsBrYFiHQvcRZ2l4mFASIXu5WfemBVDhs-hTtjC3RasxwpJnXHhbgGUn8eq5s2yFTlEIcbsXU3bnCyaFeBmaCfH2H4A8hdowhcORPug5xiOqw5fYay56V4pnJdG4GRxvcE-cx8YHSH3zWJu83VLEyGSl4FuPQhV4XvXS7enBmwCvNmGX6QHba7iSnCdhDq0m3c2pDPU_ty7zn3wPmbRRC0KVnKbhhF1kLHXuF4%3D", "description": "Be a part of the AI team that shapes and develops algorithms for our livestockmonitoring solution Build infrastructure and evaluation tools to improve algorithm development speed and quality Develop backend infrastructure enhancements Drive infrastructure initiatives and implement robust and scalable solutions Write clean, concise code based on specifications Bachelor degree in Computer Science or equivalent At least 5 years experience as a backend developer Highly experienced with Python High level of spoken and written English. Team player with excellent communication and interpersonal skills Advantage - Familiar with DL frameworks (TensorFlow/ PyTorch/ Keras) and computer vision libraries (openCV) Advantage - AWS experienceShow more Report"}, {"company": "Unleash", "job": "Junior QA Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.3", "link": "", "description": "Unleash is powering the productivity revolution by providing users with a centralized way to search through their cloud based apps and local desktop. A light weight search interface allows users to enter their search query and receive relevant ranked results which are yielded in seconds.\nAs a user centric company, we place a great deal of emphasis on users experience when building our product and have fun doing it!\n\nWe are a fresh and energetic startup, post round A in funding ($12M), led by a strong team of second timer founders and top angel investors and VCs from the Sillicon Valley and Tel Aviv. Our expanding team is made up of enthusiastic and dedicated members working together to revolutionize the productivity world. We believe that collaboration across teams - where everyone is accessible, from our newest hires to the founders - combined with a vested interest in our teams well being are the keys to our successful working environment.\nWe are looking for a Junior QA Engineer to join our R&D team and continue growing our product!\nYour main responsibilities will include:\nPlanning and execution of tests on both Front and Backend sides as well as integrations with external services\nExecuting hands-on manual tests of the companies products on different OS\nUse a variety of tools for debugging and executing tests\nReporting and tracking issues (bugs and tasks)\nWorking collaboratively with other team members from the Product and Development teams\nReport to QA Team lead\nRequirements and Qualifications:\nGraduate of a software testing course or a relevant academic degree\nAt least 1 year of experience as a manual software tester\nUnderstanding of client/server model\nExperience working with Linux & Mac\nGood inter-personal skills\nIf you are a bright, pro-active, ambitious and naturally curious person who shares our value of teamwork, and you hold these skills, send us your CV!Show more Report"}, {"company": "מיקרופוקוס", "job": "Software Quality Engineer (Hybrid)", "city": "Israel", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=108&ao=1110586&s=58&guid=00000186e642473bb4d0ca91ec69e9a7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_cfa7222a&cb=1678900555380&jobListingId=1007743620866&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj4argm2hs6001-1grj44ht1gsrr800-65b7bde3a94b0c54--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNDBnOArbnabBkKJTX5sAQbkC2u26Xp4eWo1Js5SBbDPVo5bv4fQpO-_iQvkk-ojvzqtCeWFH10u89CItoZ8hH7sQLaB5IRUcS-ORDLs2w-ODJ7xhvbhZZjL4A0nU-WDMRven-fKd-hQ_yb7G3J_dTLhJAJlJLvRKXQO_wbk0mBTRu4mqfAU6dm2pHhS627dJ3qbE9HQShYRGdkTwvq22dS1EDpXiWzSpWyBwYTJyIebgkKjF47O9zbsFmH39eOWHr0AvX3z180UzXH0Rn-I4um4PuY2ncaRpEbfC67uMbstICuy1MFIvj7fafAvHuKUL_caLjPOzsM639V8L0sR9i2dhOwR-2jQEDJVXoENEegtxog-y3ADrez21WmoxntU6Goi6je6d38eHJ8nOPO3rgohXsN7_wlGaVA5lZinaCOZJKE0M4fG67V3wvaoLXIHNKNHhRz8aBuYNlFDph8b4U2882VbiRA3nNJTcoodgFHniovfP_KqH9dYLFzl92cs68hvxIFhz73VmKteI1zJkXMlDRBfpsaiG4X_6uf8bRsRAg6THMMQKY7NK6oI6jaRCBxHXikjRIzBrHseezDFgNYi72iPAC_g61STtjwggqEAANbTIfGoADrsH-qlJJCT9-k1sOYCNP0hDNRYggGbXw6s_PGC1T-LSFM%3D", "description": ": Job Description Micro Focus is one of the world’s largest enterprise software providers, delivering the mission-critical software that keeps the digital world running. We combine pragmatism, discipline, and customer-centric innovation to deliver trusted, proven solutions that customers need in order to succeed in today’s rapidly evolving marketplace. That’s high tech without the drama. We are looking for a talented Software Quality Engineer to support our rapid agile plans and join the growing R&D team which builds our ALM Octane product.\n\n: Responsibilities Take full testing ownership on various features and product areas File defects with appropriate supporting information for development to investigate and prepare a fix Work with Developers during the entire product lifecycle, Participate in the Agile/SCRUM process Cooperate with UX, UI and functional architect for specifications, user interaction and graphic design Work according to high execution standards, while adhering to project goals and ensuring high quality Be the customer advocate at all times: think, act and test according to real customer usage and scenarios Work smoothly with local and remote R&D teams, while keeping high visibility and effective communication Build and maintain complex testing Environment, local and in the cloud : Qualification’s 4+ years of experience in manual QA Experience with DBs and SQL Deep understanding of REST API and HTTP Good knowledge of Windows and Linux OS's Experience with cloud Environments: Azure and AWS Experience with Docker Good understanding of the agile software development lifecycle Technical skills Excellent analytical and problem-solving skills Solid English communication capabilities (both verbal and written) Owner, responsible and result driven Independent and flexible to changesShow more Report"}, {"company": "אביבית דבוש גיוס והשמה", "job": "QA Automation Manager /QA Automation Developer", "city": "Israel", "date": "2d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=109&ao=1110586&s=58&guid=00000186e642473bb4d0ca91ec69e9a7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f17a1589&cb=1678900556618&jobListingId=1008525853156&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj4asmfi39f801-1grj44ht1gsrr800-1e4c12acfa4eb587--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNAySOC0vL1bnH0kYBOB2o0TojTOD6nq89bkB8TMtTSR0KiDIoy7Glov9IW3CwY9UxDsj0EggtZlNxfOUTQkioFq51mPN3WbfKwPpK977n4S5MohORzPrarCYnNIzZS-wcd2m_t6X8RUyEF5ZkKZUWAmzUwTcT-b5mnQqqe_yIvi7qtGljbdLNp-UsTBVEZjZl7JZMBYzPFwo-i6Fsm8dLWYBiTBYk0-9etdfO7FHuj1TEVWDm4X39rauVjagTS11AnNoVduY6lTJeEFEszMtM7UDoc3sZCvxbmra1SYBfgnt2h83jTt4kTRp67KF0RSPZuod5XuiZrh4FUkbOM8aWg0a0KtZQ8nY8FD4Y-D1GlT9AuoSzAy8-aWBNUTGohrJqkoJSCXZKCcX0yOMnSSRzypjccTm5DkRLxO7Yc1Lp39vVhKUzPCCPk8wYm7ohzF7QAWccApQR2jTqexVDwAG9A6LqUB6NCS4mEU7c3dsXLuEtn4cz0KxWjENKzPFIGBrc03Mz80FegUU5FZLZdzTq9xPUpif0MpY3uHtUoYEOlgI5nVYisFoq6t-310U_IVyD86uOUxD4YfGFE2zb2HzugV8CGpF1EWMaNHod8Zko6d_fFMKbg0pHlqsvY5Gmq1KSIxtEcB2VhwAzYsT4XXhxdz0XsB9q2z6B0%3D", "description": "QA Automation Manager 5+ years of proven work experience in QA Automation – Must 2+ years of proven work experience in Managing QA Automation teams – Must Solid knowledge of software QA and Automation methodologies, tools, and processes. – Must Experience in Building / Maintaining / Enhancing infrastructure for QA Automation - Must Solid knowledge of Linux OS and Monitoring/Testing Linux resources (Memory, CPU, Limits, Etc.) – Must Experience coding in Python – Must Solid Experience in SQL – Must Proven experience in a cloud environment (AWS/GCP/Azure) Experience working in an Agile environment Experience working with a large scale system Proven work experience with Databases B.Sc. in Computer Science or Information Systems Senior QA Automation Engineer At least 3 years of SW Engineering experience with an Object-Oriented Programming language (Python/Java/C++/C#/etc..) Automation testing experience (methodologies, tools, and processes) Experience with a Software source control system (Git/Mercurial) Basic knowledge in Linux/Unix operating systems Ability to multitask, display flexibility, and work independently. Strong analytical skills.\n\nAbility to see the big picture and at the same time to pay attention to details A team player with excellent communication and interpersonal skills Experience in CI/CD process and Test Management Systems - advantage Understanding of the networking principles (e.g. DNS, routing) - advantage Familiar with Cloud Providers technologies - advantage.Show more Report"}, {"company": "Bright Machines", "job": "Software Engineer", "city": "Israel", "date": "30d+", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=110&ao=1110586&s=58&guid=00000186e642473bb4d0ca91ec69e9a7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_bf20e63b&cb=1678900557742&jobListingId=1008375115524&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj4atqgjm7h801-1grj44ht1gsrr800-fbb65f9a1c024c9b--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBvnGYFG6Yx6eDF7reUZ4Msq5hAB-XRGFLzVzuGvqiFVy8M94c_T4pGFWtYXSYXq9FvjG0Z__7zrEfGUhiKmCA6-EhublImxvk6m-rtuFFPd4CWvE3C5Omy-egyf_6mvwS8ZhInnAjpBpcoAlGcoavJITTvCRNYPJu5h-pl8XwLquqSZbP9kU9n-nNIRDzhDaQRO7z_-zim1_PfkRsoMUJPC0P29VZmmu0Lo5IgAbVVtRfSZ6rWu_OAuas4X3VjMO9FFjceAgBHSKGIBN46sITpCDJX7n9nXzGbvIX-aflBddMpJ5YqI2baCUZpaMyXqfxAT_8RJCzZRqlhsWe3cggmRAgKnAWR2wiaL0O_Nx_jtF2whlBaeGj3V9c0dIktITuZ2cEqLlQpVhKgHEcINcIGXmjUpHCyWPCeGTPMEGrqPT5Qt2Ukhgek5MZGYo9PkC2r88p4XgVqlPZDSS7Nnsfe8UOVh5E-3zSucyx3ndF9bJ4K_izWVfWsQzCrUcL0LQOH1zfNRqIZet3qVg-zW48PA4p4nNhSSC26HYvN5vX079eRHGrvK_6kaxDPGkGYKVKm-iexFvh7B68jLvooTbYC2rjW7Ble-fqsA_mCRxeV7-049FJuhFZpGuTp9WTobAocMt6CqopEiSEDe6CQB6FNjwrTAfCuOFQ%3D", "description": "We’re looking for a Software Engineer to join us at Bright Machines who will be responsible for defining and implementing the systems that make Software-Defined Manufacturing possible. You will work on a team with other Software Engineers in the Bright Machines Yakum office to define and implement our software stack – from robot to cloud. As a Software Engineer, you will create scalable software systems that drive our cloud-based analytics, data pipeline, performance monitoring, dashboarding, and command/control systems on the factory floor. Our robots and software will be deployed in a variety of factory conditions and help support the manufacturing operations of some of the biggest names in the industry.\n\nThis is a unique opportunity to be part of a greenfield development effort that will change the way companies build and produce products. At least 5 years of job experience (Software Engineer or equivalent) Proficiency in at least two modern programming languages (C#, Python, Java) Good knowledge in one of the following React, Angular, Vue, JavaScript Understanding of scaling and operational concerns for large software systems Good knowledge of different databases, SQL, NoSQL Broad understanding of Microservices architecture, Event Bus (RabbitMQ), RESTful/gRPC, ORM (EF), async programming Knowledge and demonstrated the application of software engineering best practices including coding standards, code reviews, CI/CD, testing, and operations Extensive knowledge of GIT with GitLab Bachelor's degree (or equivalent) in Computer Science or a related fieldShow more Report"}, {"company": "אר.ויי.בי. פלסמנט אגנסי בע\"מ", "job": "Data Engineer", "city": "Jerusalem", "date": "24h", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=111&ao=1110586&s=58&guid=00000186e642473bb4d0ca91ec69e9a7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_965e7e7b&cb=1678900559890&jobListingId=1008530033579&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj4avudmfqb801-1grj44ht1gsrr800-f51ea41c4803f3a7--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBciK1J05Aet1MT4D8pi21HqMB7KMlgnMmg2uQr07iwkPsyNEO_rqQI__2DYpgRB4jGRrgavN1LTS6vF9VpTm2MM1CYiHhI0p61sQZMDfm6h-PH6y-q24TEa8dgNPk9bjRaOwJj-6ydSwu_EuIWW7A43GP5SaBxa-2Ts5MdlFIW83cRpce_V5UtLBL8gMKT2uoFskUBlF98qRToB4jCoBegBUOYRNROU8LmeaOqRhI_tphM13JyaHlhHDI-r1QE630TFWwTQ6IWXcV9AmjLTTw_DrSMYne2aJO07irl4wgHuwF74RnqK8xWAITZEa_nEN-YG1RbCM7E66HmTaEZU31IKOdQwWcjwXaDZuv-zgab1FeTNteEPle_xyIZR0FAOTeu50AMvgxb0vbdNbGFReflz8X45jnYt6NLGx7IBDQN0323DGpijwugdqyI1nULsKUQ496uCKYGOi9xhZn0wXnhVCERCV_ytyV9hHih1H-pRcfCddmnNDTLfUKtDeyD2WQ-yMkEa4RF0QxVQxPEg4eiOCw-Cgf0fme_ik81vSkdJhgNbO1zDiK4W-4C2hcCNeSaENkTEexTQsRTOCwPW1NhPju_IcMRiJsFbEwantviIbQWB_k9ELClDXKxk2QotR5EFi6HcPrYbTuLbRis-rf2pVmTp0vxj64%3D", "description": "We centralize and simplify all the metrics used by Shopify sellers, enabling them to save more time and make more money. We help e-commerce businesses accurately track and forecast all kinds of metrics, including changes in profits and operational metrics. Our goal is to infuse AI into e-commerce, empowering shops to have an accurate picture of their business and make optimal choices that boost their bottom line. We are looking for talented Data Engineers to join our growing team.\n\nThis is a hybrid role, with 3 days a week in-office required (Jerusalem or Herzliya offices). Our ideal candidate is experienced with data pipeline builders and data wranglers, and someone who enjoys optimizing data systems and building them from the ground up. Must be self-directed and comfortable supporting the data needs of multiple teams, systems and products and comfortable working in a fast-paced and often pivoting environment. Qualifications: * At least 3 years of professional experience building and maintaining production data systems in cloud environments like GCP * Professional experience using Python, JavaScript and/or other modern programming language * Demonstrably deep understanding of SQL and analytical data warehouses * Experience with NOSQL databases, eg: ElasticSearch, Mongo, Firestore, BigTable * Hands-on experience with data pipeline tools (eg: Dataflow, Airflow, dbt) * Strong data modeling skills * Experience with MLOps - advantage * Familiarity with agile software development methodologies * Ability to work 3 days a week in-office (Jerusalem or Herzliya)Show more Report"}, {"company": "מיקרופוקוס", "job": "Software Quality Engineer", "city": "Israel", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=112&ao=1110586&s=58&guid=00000186e642473bb4d0ca91ec69e9a7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_76720550&cb=1678900561365&jobListingId=1007779391118&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj4b1c4khpv801-1grj44ht1gsrr800-8862eadc289c5640--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBQoLRpKY-IRdQeLCz0gwUMPIuURzA8tarMWbNk40Ml9IdfRwqX0_c_p-4u9_W8-N6B_njjBfe7KhaFDzK_6MJevBckPyXm6p3HJuSbihHpukrxYisKE5c_OtqXSofoIHa5hxRxN1vzMcCWuR1nGP-9lSh-WUueCfBVUJxCN545PwWyVmbt8r1pN-e0eOLaIpXsi9z2lm1cpGk2wjJ9qlx3VXmQ-X_n8P6jWfxdlPy47bGTObpUs0vechUQvCL6TzS7Dklr8ye417ShRY_hTD64JRYCel5i4s_n_R5Rp-uYwiwbacUHr6BtOMocqKAwgnLrT_L1PomS4mY9Paz4ZAH6LMkqcd5u_sTSNErYBQEhF82uuFVyXQw6t0qUSGG6f1FmGKqBbQqbW8lIRfmF8118nuCKriRIjsfoQCHFt8jqD_P2SqsRxfEfRetFsXnU2JCofD4W-j2HX0qlZ0EwTFTLjZIJlFTmhgh0WRHIwZXcRL9odgk8VbWIrgumqWJ-3pW8IE8P37slwxnJ7E0g_hRGVkY5QWB7pQi4x3RWCPGksgL4ZeKmqP8TTjqF-UVzCPd8jNShP7H3NJVMuZ8gvZzFEpteG4Q6Mcn-SvwbnsT8KF-gPs9cYvCKcY4q6vLNzaoFgnApA_C_I21rjVY8_42JyugD0ykqwAY%3D", "description": "Micro Focus is one of the world’s largest enterprise software providers, delivering the mission-critical software that keeps the digital world running. We combine pragmatism, discipline, and customer-centric innovation to deliver trusted, proven solutions that customers need in order to succeed in today’s rapidly evolving marketplace. That’s high tech without the drama. We are looking for a talented Software Quality Engineer to lead our rapid agile plans and join the growing R&D team which builds our LoadRunner Cloud products suite.\n\nResponsibilities: Take full testing ownership and lead the quality of OneAnalysis Product Write automated tests over existing automation framework as well as contributing to extend the frameworks according to product needs File defects with appropriate supporting information for development to investigate and prepare a fix Work with Developers during the entire product lifecycle, Participate in the Agile/SCRUM process Cooperate with UX, UI and functional architect for specifications, user interaction and graphic design Work according to high execution standards, while adhering to project goals and ensuring high quality Qualification’s: Bachelor’s Degree in Computer Science (or equivalent) Demonstrate a strong sense of ownership which drives you to find ways to do things better, faster, and more efficiently Good understanding of the Agile software development lifecycle Solid English communication capabilities (verbal and written) Demonstrate strong knowledge with test strategies, test design and test types Experience with UI testing, and preferably with framework development Experience with JavaScript, TypeScript Experience with Protractor - big advantage Experience in test automation – Prefer, at least 2 years of experience Experience in manual testing – Must, at least 2 years of experienceShow more Report"}, {"company": "Motorola Solutions", "job": "Digital Hardware Student", "city": "Tel Aviv-Yafo", "date": "12d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=1136043&s=58&guid=00000186e642473bb4d0ca91ec69e9a7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d6f8684e&cb=1678900563725&jobListingId=1008505567654&jrtk=3-1-1grj4b3m2ma6r801-1grj44ht1gsrr800-b85e4ce62f247833-", "description": "Company Overview\nAt Motorola Solutions, we believe that everything starts with safety.Its the constant that empowers people to confidently move forward. It can fill a flight or sell out a stadium. It can care for a patient or graduate a class.\n\nAs a global leader in public safety and enterprise security, we create and connect the technologies that help to keep people safe where they live, learn, work and play. Our integrated technology ecosystem unifies critical communications, video security and access control, and command center software, enabling collaboration in more powerful ways.\n\nAt Motorola Solutions, were ushering in a new era in public safety and security. Bring your passion, potential and talents to a career that matters.\n\nDepartment Overview Hardware Development Digital design and verification including schematics and layout\nJob Description\nfor Motorola solutions Hardware Team handling all R&D for Public safety devices is looking for an Electrical Engineer student\n\nBasic Requirements\nDigital design and verification including schematics and layout\n\nElectrical Hardware Engineering Student 3rd year\n\nKnowledge in electrical circuitries , schematics, layout, simulation tools\n\nExperience in soldiering, hardware tolls operation such as scope\n\nA practical Engineering degree Advantage\n\nTravel Requirements\nRelocation Provided\nPosition Type\n\nReferral Payment Plan NoShow more Report"}, {"company": "Innovid", "job": "Software Engineer Tel-Aviv", "city": "Tel Aviv-Yafo", "date": "23d", "rating": "4.4", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=114&ao=1136043&s=58&guid=00000186e642473bb4d0ca91ec69e9a7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6197b73a&cb=1678900564776&jobListingId=1008482535873&jrtk=3-1-1grj4b4mdncdu801-1grj44ht1gsrr800-99d60d05ae09f8cb-", "description": "Innovid (NYSE:CTV) powers advertising delivery, personalization, measurement and outcomes across linear, CTV and digital for the world's largest brands. Through a global infrastructure that enables cross-platform ad serving, data-driven creative, and currency-grade measurement, Innovid offers its clients always-on intelligence to optimize advertising investment across channels, platforms, screens, and devices. Innovid is an independent platform that leads the market in converged TV innovation, through proprietary technology and exclusive partnerships designed to reimagine TV advertising. Headquartered in New York City, Innovid serves a global client base through offices across the Americas, Europe, and Asia Pacific. To learn more, visit innovid.com or follow us on LinkedIn or Twitter.\nWe have a developer-centric culture, practice continuous deployment and no code ownership, and deal daily with the most advanced technologies and methodologies in software development, high scalability, and big data.\nWe're looking for top-notch, passionate developers to be part of our world-class R&D team. If you think you can handle a wide range of technologies, pushing code to production several times a day, working on a different part of our product code with every new task you get, please contact us!\n You will -\nParticipate in designing and developing Innovid's products in multiple technologies, no code ownership environment\nDesign and develop modules for a high-end product that serves billions of transactions a day\nDeploy your code to production in a continuous manner\nBe responsible for the well-being of your application in production\nWork with product managers to define, prioritize and finalize features\nCarry out full-stack, end to end development\nYou should have -\nA B.Sc. in computer science or a related discipline\nAt least 2 years of software development experience\nExperience with development of online, cloud based SaaS products\nGood knowledge of SQL\nExperience with Big Data development – an advantage\nExperience with web server or client side development – an advantage\nExperience with Linux in a production environment – an advantage\nExperience in Scala, Java, JavaScript (Angular, React and Node.js) – an advantage\nExperience with large scale performance issues and database work – an advantage\nMust have a passion for technology and quality\nGood analytical and communication skills\nAppreciation of deadlines is essential\nWhat we'll offer you -\nHigh visibility roles with a tremendous amount of growth potential\nWide and varied Learning & Development resources and culture that support it\nGlobal team and cross-company collaboration unlike anywhere else!\nAmazing people to work with!!!\nHybrid working model & good work-life balance\nRSU's (Restricted Stock Units) plan\nBeautiful office with a view near the train station\nWork next to our best friends on 4 (Dogs friendly), but also a friendly environment for those who don't appreciate the furry walkers\nSubsidized meal\nPilates lesson in the office\nEvents, treats, and fun office experience\nCheck out our engineering blog - https://engineering.innovid.com/\n\n\n#LI-RB1\n\nThere is no such thing as the perfect resume, or someone that checks every box. At Innovid, we are generous with our time and knowledge, and always ready to teach. So however you identify and whatever background you bring with you, please apply if this is a role that would make you excited to come into work every day and add to Innovid.\nEqual Opportunity Employer: Innovid is an equal opportunity employer, committed to our diversity and inclusiveness. We consider all qualified applicants regardless of race, color, nationality, gender, gender identity or expression, sexual orientation, religion, disability or age. We strongly encourage women, people of color, members of the LGBTQIA community, people with disabilities and veterans to apply. We are actively working to be an anti-racist organization. We're committing to creating an inclusive and equitable workplace for all of our employees. You can read more about our commitment to DEI here.\nIf you are located within the EEA and subject to GDPR or are a California resident subject to the California Consumer Privacy Act, click here to understand how Innovid processes your personal information and how you can exercise your rights.Report"}, {"company": "Global-e", "job": "QA Engineer - IL", "city": "Petah Tikva", "date": "6d", "rating": "3.2", "link": "", "description": "We're looking for a QA Engineer to join the Global-e Core R&D department and take a significant part in the delivery of Global-e's core system.\nWe’re looking for someone who's passionate about technology and software testing, with end-to-end experience in testing web applications in a complex, cloud-based environment.\nThe core group is responsible for the most important components of the system providing a multi-tenant, fully customizable checkout experience; APIs for e-commerce platforms integration; end-to-end payments solutions that involve third-party integration in a secured payment environment.\nRequirements:\n\nAt least 3 years of proven experience in manual testing web applications\nProven experience with writing and executing STP / STD / STR\nProven experience in writing SQL queries (MSSQL)\nExceptional interpersonal skills\nStrong ability to deep dive into the problem and find the root cause\nPrevious experience with e-commerce systems - strong advantage\nExperience with Postman -advantage\nB.Sc. in Computer Science or other technical fields – advantage\nExperience working in SCRUM methodologies – strong advantage\nGlobal-e is an equal opportunity employer. Our team is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and welcome applications from people of all walks of life. Our people play the key role in our success, and we are always looking for more driven, talented, and ambitious individuals to join our growing international family.Show more Report"}, {"company": "מיקרופוקוס", "job": "Full Stack Software Engineer", "city": "Israel", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=1110586&s=58&guid=00000186e642473bb4d0ca91ec69e9a7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_93aa94f4&cb=1678900567328&jobListingId=1008227507682&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj4b764ncdr801-1grj44ht1gsrr800-554ec588563eccec--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNAmQ3L1WBBreIrjLbExiXrV1gNme1izSiFPBxLLaRK98LRDNPfyrHpW8wy3LXwSxxRwEFY-_5JyaGLWrohbng_yQK09MnLKdGdTpFHN1dJyPc0yAGaEP6mkG2AmTKR-5y1Qkenk2VvwDk-7hjNY4FYcYsJxKmIGx7oaBeC5jDusAKfopFRV9BnkotSr7I3-vJX3aNZKLOZd46IhZkixw21FgWm90VoAcxPvnNxeu5zd6rSalLjQZBM9Gr-3B5nbRTQjuienMdLHG6y5_CbOlIU-1dhic1drtXS2ahwjvTICM5SkxOdAUnoBQEA3GBvgGr6r8RJ1VC2cPYIJ1eF9vbLb_rwQ7d8wQmaiMTrsdxagflZ0-r9CrUtsCEJOL8P9t4WtUwgh4RG6iDXaMcia4kgjkEOmTtyRQ5ckf549SWlV3_VOjqLHTS0WLRNeb5U_yTj6cMYBNUVWw_hktG9uzeKl1CCBNnR-p5K4Ve5Qc9P0FS3c0jqE_bim4_0Ur9yFBcp0nR8vwAQBE5TiDMcV37_2H4tAK1qgwg5MJ1L9-pz9DN5CPjOIYlAht0EgFFBfnMmyKAdztXKO0TuG4TrhFnK3RoABJOTY5V_yeEG64uyJ8svFhEFU_ouYVVyW2v8lAX9DOAw7jT3hW-JOD5gEh-JPO6BU2I5XpFc%3D", "description": "Micro Focus is one of the world’s largest enterprise software providers. We deliver mission-critical technology and supporting services that help thousands of customers worldwide manage core IT elements of their business so they can run and transform—at the same time. Job overview Be a team member in multidisciplinary team with good technical skills and wide area of responsibilities. Work according to high execution standards, while adhering to project goals and ensuring high quality.\n\nArchitect, design, and implement software solutions to fulfill project requirements. Maintain legacy code written by other developers, including bug fixes. Manage several interfaces with internal and external teams and job functions. Be a highly motivated initiator who can work effectively in an agile development environment.\n\nRequired qualities and skills B.A./B.Sc. in Computer Science/Computer Engineering. 5-10 years of software development experience. Strong understanding and hands-on experience of full stack development.\n\nExcellent knowledge of front-end web programming languages, such as HTML, CSS, JavaScript, and frameworks such as Angular and React. Excellent knowledge of one or more back-end programming languages, such as Java, Python ,and C# Great interpersonal and communication skills. Strong application architecture understanding. Advantage Experience with web development tools and services, such as package managers and CI/CD pipelines.\n\nExperience with dockers. Knowledge of .NET technologies and WPF. Experience with agile development methodoloShow more Report"}, {"company": "Experis Perm", "job": "Linux Software Engineer", "city": "Israel", "date": "6d", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=117&ao=1110586&s=58&guid=00000186e642473bb4d0ca91ec69e9a7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f05c6bf1&cb=1678900568495&jobListingId=1008518732463&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj4b8b82hsa001-1grj44ht1gsrr800-f3b8e604049780f7--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNDqb0wR4tNGEF-QPkvbj5FHGkB7qtA9KGOwuYF3Pem-QtQjCeBeCfWsLUUq8MH3r3OonJYxDzOJSDE9TqfNTDof8Qxvk0nR1gOQv1rnmcB99QuRW1mRf009XZI5K3CQ0CTFscv407s9Fyzip5dMFWVDMiYBdrQoZlCz2BbkO3_tPEKDCqsO27-_7ZRzqRj_uL3q0Km-uFXW2VZtRNxtLQGK1xeFvXU-0UslgMSgXli66tP9_U-72OpZjX_4oj5drUyobuC3-eBkSBycXZ20OAaaWXff7kZONmM85js3FH1bS-vY0w2zv3JJsucwvSgu9niM4OdesywjAdUIP_mN74heUGHif0FyzNm-WdDyFDb53EEQfMOK6xu4FE-liACoZXhGY_PDN2SoHlQ6goR9D40x6JnJriJXgtyk2JFQhy0OipqKOmx3yTpjzEopm0d19tu9TJD92APKwgKyhBBOWDfx3HLxD9hhrHHOPeIDjhvTIrZ4-E6CDux_rAQuDqtptxyhv_QwdoIzRVLN4uCAYRQATEvoC1DaA3AEarhwb3ccfmrEYkVDWpxFeL41BFcF3Cpzhsdbcdlcx-aK5OJCpvPijoE0QOlDX-x5COlOobxFo-L_qtoGPxUUsyGNi2C0CxXgqIrVa5ica8irQxqZrfH3HItrNuS75sg%3D", "description": "לחברה בתחום פתרונות תקשורת, מולטימדיה וסייבר ביוקנעם דרוש/ה Linux Software Engineer · B.S.c. degree in Computer Science, or related field preferred · At least 3 years experience in C or C++, Operating Systems, Multi-threading systems · Linux/Embedded Linux · Linux user space applications. · Linux kernelShow more Report"}, {"company": "מיקרופוקוס", "job": "QA Automations Engineer", "city": "Israel", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=118&ao=1110586&s=58&guid=00000186e642473bb4d0ca91ec69e9a7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_2e96aef3&cb=1678900570072&jobListingId=1007892433967&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj4b9orjihe801-1grj44ht1gsrr800-22a0f2c931f77a9a--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNCyO9D9YVC0ZKip1rXlUIpC9ugSsv6CUIXBvXnHzS3FmrSVX7mxugvN5FdNF8QMLo58n6SEYGVoG7-STGxeOF29teL83Ph4yBab6EIQSlbSUcVODxdYwshKv-vpNmyjeiDS53DNlrUB3i7rr6_tKtNy-TILrcs49_w0eeHyGHyUmvmHLxJP5VKGG9ZUBMDV0bDFnuK2x2tB45CoCta-fykKvrlo5BOPcxOqOtJ8dUE-lMfVGINHZlgStKvcBsJpb1gt8uLCdkYmMpXb3dqrlkUg7E8PtjuYUoFENb41mZCOUusiz25RE_W9WIXogIDkevc42KzYF1DF428-YC2MOWgox8r8lXR2nQR_VttsRJyg-C-29zaoChZwZmduqZVrxlJN3bD0nCM3_OOQvrFbLxj_JZs4ShwPvqigJj40T3gYqvYs5hKRxiHe1O-GY7oYQlgWaxASF266Ic-kIuYUkwF4Kn1o18skRFUykWCeL_mCw59KAJN8hK5Bsl8DpMeCTserf5rfvcBEKKQs7ENPbh-sqJbB8bmoZkoa7zfUbGJO_iBrAaGy1KrwjtYzBhmuNH8ArDQaAHz2KPKNXhCOWMzZUfcd7HGnSOD8HBuj3KL53oPzQpCpMeccInsMLDdl4d7Uqy_bwZWfE_GuCMouha-uC-Cc6yI1rLM%3D", "description": "We are looking for a talented Software Quality Engineer to lead our rapid agile plans and join the growing R&D team which builds our LoadRunner Cloud products suite. Responsibilities: Take full testing ownership and lead the quality of OneAnalysis Product Write automated tests over existing automation framework as well as contributing to extend the frameworks according to product needs File defects with appropriate supporting information for development to investigate and prepare a fix Work with Developers during the entire product lifecycle, Participate in the Agile/SCRUM process Cooperate with UX, UI and functional architect for specifications, user interaction and graphic design Work according to high execution standards, while adhering to project goals and ensuring high quality Bachelor’s Degree in Computer Science (or equivalent) Demonstrate a strong sense of ownership which drives you to find ways to do things better, faster, and more efficiently Good understanding of the Agile software development lifecycle Solid English communication capabilities (verbal and written) Demonstrate strong knowledge with test strategies, test design and test types Experience with UI testing, and preferably with framework development Experience with JavaScript, TypeScript Experience with Protractor - big advantage Experience in test automation – Prefer, at least 2 years of experience Experience in manual testing – Must, at least 2 years of experienceShow more Report"}, {"company": "עמותת ITWorks", "job": "Embedded Software Engineer", "city": "Israel", "date": "22d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=119&ao=1110586&s=58&guid=00000186e642473bb4d0ca91ec69e9a7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d30f170d&cb=1678900572541&jobListingId=1008484956415&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj4bc802bmk001-1grj44ht1gsrr800-e175ddf55b78c3e0--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNCXYcmjOfqo1Z3Hke_OquUIytd_wH-6-FTbfDt2xJ14cf1O6ShQjFeWi9wtlHQtWGH5TnOq7WOkO12mxdX2DjDwCY6d9Cc9nci2gIeFOoGhogNhI4l7TcmnsthkCi5GMnezhrREFZdgC-NtedElbL11SyqCOtBaghRH3jA978lrLGLnqFgilsiHmvQ1pv_KtbQZyP8Z5SzUIHkjs5V9dmIArCn2wotaO44dgoz5145MZ0PlA6nTOdWf56YnKNJXsaHfxmk3u9Tz7XuVy4Sk7U3Cb9rP27Hqo5vzVMLtXeueGPj1KBtAWqKLNqb_Lm2unRP-X4Qd4CrBTfl-SR85lRyImHB_-fcmr3b9vHM92kz-U9isnpm_xGeaCxoHELTEmlyc7LgRCsxpU4vI5oV4gEdk7DPJIfYcd1FJXO2O7_Lp7H50LT9u3QkinEpZ2RzvIYVo0CZNl2sLasu0QxclRVswVZGnO2WoYz2LcrpEPRFmWCzQaeUxO73bAt8b_pJb7MU66klW1cHvHDzZV1i6seDxnp3zYVx3t8N07lxVejiTlOShXaV87hwbG08l_qCtFU1W4TNXr9opSHtul4VVEC7sMa27tOkzJAaNcWE54Km3E-B9Qm0xci7cIchThBc3XCgUiEKEpe-szO5MIDlMFkY8sJXIqsZ6mss%3D", "description": "What you will be doing: - Learning the different aspects of our products by developing features in various areas and disciplines - power electronics, motion control theory, DSP and communication over different platforms. - Developing on various micro-controllers and dealing with various RT constraints. - Ownership of a project\\product from end to end- from concept and simulation, through development and integration and field deployment. - Building complex simulations integrating SW and HW.\n\nRequirements: - B.Sc in electrical engineering (big advantage) or computer engineer - MUST - Proven experience with low level embedded, RT-embedded / DSP / MCU programming. - At least 4+ years of experience in embedded programming from the industry. - Proficiency programming in C - Must. - Experience with HW/SW Systems.\n\n\nExperience with working with micro-controllers\n\nReport"}, {"company": "Unleash Labs", "job": "Junior QA Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=120&ao=1136043&s=58&guid=00000186e642473bb4d0ca91ec69e9a7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ec7eabd3&cb=1678900574600&jobListingId=1008312736637&jrtk=3-1-1grj4be7ujm7j801-1grj44ht1gsrr800-688b85a5fdbf4a2e-", "description": "Unleash is powering the productivity revolution by providing users with a centralized way to search through their cloud based apps and local desktop. A light weight search interface allows users to enter their search query and receive relevant ranked results which are yielded in seconds.\n\nAs a user centric company, we place a great deal of emphasis on users experience when building our product and have fun doing it!\n﻿\nWe are a fresh and energetic startup, post round A in funding ($12M), led by a strong team of second timer founders and top angel investors and VCs from the Sillicon Valley and Tel Aviv. Our expanding team is made up of enthusiastic and dedicated members working together to revolutionize the productivity world. We believe that collaboration across teams - where everyone is accessible, from our newest hires to the founders - combined with a vested interest in our teams well being are the keys to our successful working environment.\n﻿We are looking for a Junior QA Engineer to join our R&D team and continue growing our product!\n\nYour main responsibilities will include:\n\nPlanning and execution of tests on both Front and Backend sides as well as integrations with external services\nExecuting hands-on manual tests of the companies products on different OS\nUse a variety of tools for debugging and executing tests\nReporting and tracking issues (bugs and tasks)\nWorking collaboratively with other team members from the Product and Development teams\nReport to QA Team lead\nRequirements and Qualifications:\n\nGraduate of a software testing course or a relevant academic degree\nAt least 1 year of experience as a manual software tester\nUnderstanding of client/server model\nExperience working with Linux & Mac\nGood inter-personal skills\nIf you are a bright, pro-active, ambitious and naturally curious person who shares our value of teamwork, and you hold these skills, send us your CV!Show more Report"}, {"company": "SentinelOne", "job": "Junior Windows Low Level Engineer - Engine team", "city": "Tel Aviv-Yafo", "date": "21d", "rating": "4.8", "link": "", "description": "About Us:\n\nSentinelOne is defining the future of cybersecurity through our XDR platform that automatically prevents, detects, and responds to threats in real-time. Singularity XDR ingests data and leverages our patented AI models to deliver autonomous protection. With SentinelOne, organizations gain full transparency into everything happening across the network at machine speed – to defeat every attack, at every stage of the threat lifecycle.\n\nWe are a values-driven team where names are known, results are rewarded, and friendships are formed. Trust, accountability, relentlessness, ingenuity, and OneSentinel define the pillars of our collaborative and unified global culture. We're looking for people that will drive team success and collaboration across SentinelOne. If you're enthusiastic about innovative approaches to problem-solving, we would love to speak with you about joining our team!\nWhat are we looking for?\n\nOver the top talented people who are capable of leading a feature through the whole development lifecycle. People that can explore, design, recommend and develop from scratch innovative ideas and drive a sophisticated product to production.\n\nWhy us?\n\nYou will work on real-world problems and make an impact by protecting our customers from cyber threats. You will be joining a cutting-edge project and will be able to influence the architecture, design, and structure of our core platform. You will tackle extraordinary challenges and work with the very BEST in the industry.\n\nWhat will you do?\n\nAs part of our development team, you will have the chance to develop, test and debug the most complicated real world problems. To successfully deal with this challenge, you will continuously enrich your knowledge and experience with Windows OS internals and EPP\\EDR eco-system. The Platform team is in charge of complex low-level areas, such as the agent's Anti-Tampering (self-protection from a malware attempting to harm the agent), network sensors, and other kernel-side features.\n\nWhat skills & knowledge should you bring?\n\n2+ years of experience as a software developer in the area of low level programming.\n2+ years' experience in C and C++.\nConstant will to learn and improve.\nGreat communication skills.\nAbility to work independently and with peers from different time zones.\nOut-of-the-box thinking\nHands on experience with Windows low-level development and debugging of Windows applications - an advantage\nPrevious experience of working on a production-grade product with a wide scale deployment - an advantage\nWindows Kernel development experience - an advantage\nPrevious experience with security-oriented development, reversing or malware analysis experience – an advantage\n\nSentinelOne is proud to be an Equal Employment Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, gender (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.\n\nSentinelOne participates in the E-Verify Program for all U.S. based roles.Show more Report"}, {"company": "ADASKY", "job": "Software Engineer – Sensors and Data", "city": "Israel", "date": "1 day ago", "rating": "4.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=122&ao=1136043&s=58&guid=00000186e642473bb4d0ca91ec69e9a7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_fedf683b&cb=1678900580021&jobListingId=1008527852848&jrtk=3-1-1grj4bje62dh3001-1grj44ht1gsrr800-19c89910de692a8b-", "description": "We are looking for a Software Engineer to join our growing team of software experts in ADASKY. In this role, you will build software systems and tools around automotive sensors data to develop our next data infrastructure that handles large-scale data from a sensor suite, and that provides solid ground for diverse data annotation, analytics, and deep learning needs.\n\nThe ideal candidate is experienced in implementing automated pipelines for data services from the ground up, with an excellent understanding of emerging data engineering needs and technologies, both in cloud and on-prem, and knowledge of efficient visual data (images video, lidar, inertial sensors) data exploration and manipulation.\n\n\nRequirements\n\n2+ years’ experience building data pipelines from the ground up\n\nFamiliar with data operations\n\nExperience supporting and working with algorithm and SW R&D teams\n\n\nThe candidate must know the following:\n\nBasic Linux administration\n\nPython programming of complex systems\n\nDeploying and maintaining CD/CI\n\n\nAdvantages\n\nBuilding data pipeline for visual content (images, video, lidar, inertial sensors)\n\nDataBig data exploration of SQL and NoSQL databases\n\nFront-end programming (react.js)\n\nBash, Jenkins, Docker\n\n\nPosition is located in YokneamShow more Report"}, {"company": "Amazon Data Services Israel", "job": "Software Dev Engineer Intern", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=123&ao=1136043&s=58&guid=00000186e642473bb4d0ca91ec69e9a7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ffa1b2a3&cb=1678900581234&jobListingId=1008142270282&jrtk=3-1-1grj4bkotk62m801-1grj44ht1gsrr800-6fb43868eaf37115-", "description": "Currently enrolled in a Bachelor’s or Master’s Degree in Computer Science, Computer Engineering, or related fields at time of application\nAlthough no specific programming language is required – you should be familiar with the syntax of languages such as Java, C/C++, or Python\nKnowledge of Computer Science fundamentals such as object-oriented design, algorithm design, data structures, problem solving and complexity analysis\n\nJob summary\nWe’re on the lookout for the curious, those who think big and want to define the world of tomorrow. At Amazon, you will grow into the high impact, visionary person you know you’re ready to be. Every day will be filled with exciting new challenges, developing new skills, and achieving personal growth.\n\nHow often can you say that your work changes the world? At Amazon, you’ll say it often. Join us and define tomorrow.\n\nIf you’re insatiably curious and always want to learn more, then you’ve come to the right place.\n\nWith us, you’ll get good at making fast decisions, taking calculated risks and fearlessly chasing excellence.\n\n\nAs an intern, you will be matched to a manager and a mentor. You will have the opportunity to impact the evolution of Amazon technology as well as lead mission critical projects early in your career. Your design, code, and raw smarts will contribute to solving some of the most complex technical challenges in the areas of distributed systems, data mining, automation, optimization, scalability, and security – just to name a few.\n\nKey job responsibilities\n\nCollaborate with experienced cross-disciplinary Amazonians to conceive, design, and bring to market innovative products and services.\nDesign and build innovative technologies in a large distributed computing environment and help lead fundamental changes in the industry.\nCreate solutions to run predictions on distributed systems with exposure to innovative technologies at incredible scale and speed.\nBuild distributed storage, index, and query systems that are scalable, fault-tolerant, low cost, and easy to manage/use.\nAbility to design and code the right solutions starting with broadly defined problems.\nWork in an agile environment to deliver high quality software.\nApplications are reviewed on a rolling basis. For an update on your status, or to confirm your application was submitted successfully, please login to your candidate portal. Please note that Amazon works with a high volume of applicants. We appreciate your patience as we review applications for future Amazonians!\n\nPlease include a grade sheet/academic transcript (in English) along with your CV in a single PDF when submitting your application.\n\nPrevious technical internship(s) if applicable\nExperience with distributed, multi-tiered systems, algorithms, and relational databases\nExperience in optimization mathematics such as linear programming and nonlinear optimization\nAbility to effectively articulate technical challenges and solutions\nAdept at handling ambiguous or undefined problems as well as ability to think abstractlyReport"}, {"company": "אנטריפוינט", "job": "Software Engineer", "city": "Southern", "date": "10d", "rating": "3.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=124&ao=1110586&s=58&guid=00000186e642473bb4d0ca91ec69e9a7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_914c3f98&cb=1678900582391&jobListingId=1008509501914&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj4bltiklsm801-1grj44ht1gsrr800-fa26a95980d72153--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tGRBbjy15RxGaEEw7KZU_HJJ2J43Bze3L9tHj0ovXIX1tpbt6iig_M47YCp8Y51BirBRHYunUwlZG_pTdUNROA2tsnsfeR-tBW7AwU4vJSY3ropGxDPPiz4B1M1H7KA2KRCEBYJz4SN7w7e83V78v8wSKGaGZWfErDtNcFfHXECOGbT6mxm7tov6ONsGPQxXmQEC11sZ0NPe1EwU-MIVdtSqZx37bo4UruPBhel__YV16uvy-1c4ozFoZAWmRcHtqPofLLyHtXWUHT67vutkZ68sTZbB8_3NYIQHW8eRxj6i3n8woQxQBYCKdeOYDjI91_k6Fn7dMbcvmHbjLp5WTECAPADkQt69NKTsK3q0j_eJtSpQEGYMitKO6iNwr_Uk3ig6kQ168rP-dPXgsdJdfxhjhsxi1jnVnNE7M_l4-ohEqlvSJeSwqbnn1cGIcUpDv_Y2P3xLmj3i2ppf4ItRv7lvOqkT8bNugg34BYFHBNHPfKzbDr7NQ0Tq2oRexl-XAgE4UpFu9y9Cn9aS3GNa1Q-zwumeABpbjwJa-JCGB70TvpEkkIYPbuZ6-Os0uGs0mk9gvzJHbuA7ShmNKmrBo6wJU4Dwltz3YtDn_rGaw4GCtr5oy_7waTWBMoL_VrsBGB-IZ2gQNl3VvcDF4LfAn85R6RVj_ou2YJYAtLyjIDJ_WQM0XAEaULM%3D", "description": "We’re looking for a Software Engineer who loves solving difficult challenges, working with the newest technologies, and is driven by an appetite for creativity. What you’ll be doing Be a part of an amazing fast-paced team building the infrastructure of our platform. Design and develop highly available and scalable components in a microservices-based architecture. Proficiently use C#, .NET, SQL, Redis, Elasticsearch, AWS Tackle complex technical challenges: performance, fault-tolerance, security, and production issues.\n\nPlay an active role and influence all stages of our agile-oriented development process: requirement definition, planning, design, implementation, code review, and delivery. Requirements: At least 5 years of Backend development experience. An ability to perform in a dynamic, agile, entrepreneurial environment. Understanding of relational and non-relational databases Experience with distributed systems and microservices architecture – advantage Experience working in Linux-based environments – advantage Experience working with Docker and Kubernetes – advantage Experience working with Redis and Elasticsearch – advantageReport"}, {"company": "אליפסה הנדסה בע\"מ", "job": "RF Group Leader", "city": "Southern", "date": "24h", "rating": "3.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=125&ao=1110586&s=58&guid=00000186e642473bb4d0ca91ec69e9a7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_629d2506&cb=1678900583667&jobListingId=1008530574369&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj4bn5ekhol801-1grj44ht1gsrr800-a20057f1ecddc741--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBuWMEU9SoS1uIenlp5eBKgKrWIYc9lMhIl_hQk07MfXWsG2C_hSyR4mY7Q9Jah1YclUhHeJtwVLcjIh7msG1T1p1UOTyly0DoTXyEC1q9ILSGDEOAfvfXItgFdM6rprL53mkNLjsmipsiIGc45TgoWettAK-16EsQ1U2ukR1_tUlX-Tc7IvDSpLLX3O4-pltLUnXEN1xbaUmQBkVmDnaWYwmxzqeFh3izF2bVmFDMRsRrtpQ2rphASl0Y6S9KCOxUeMj2VrAc6ukpbynx0fgcZxF-5EqbyEQCoo50Eygj-p7YQvkA_NRZZG86qC7ki--UPEPembCX9_I1EJV-svGW0m3vuu0IXH0mujZ7Kpu_KDj8Nz-6UYWpi4gXwrpcb-0GOizaoLu_XJzsZCDkm7njbf2bSVVnCuHaUX4OhdSx6B5NTemTc8pXRfbrcJLGmtUBVFVnKDzriVvibEZoZCiICyDbTTmZ2izgR0uZqc6wcRCnMR_nk19-on_zsUMvwBCAac0YksneGtR0UylYw-Cyyz_dCegM0Me6dcX9lK5Qza0oMixj-Y58RHm9QeSttP0IvZ3N1ujhm4XLJRv4ZRuqTzmAJUO07Q0IyY7ibqHCOMcShYUPG_G4NmTvIrl8MUbY_cDjs8yMRfLlVBqn_iKIivJ878S0FAZo%3D", "description": "We are seeking for a talented leader to join our company as an RF Group Leader, and to perform among other tasks, Hands-On work . Job Responsibilities : Analyze RF system level requirements for new products and derive quick and effective design circuits to meet the design target within the scope of the project. Close collaboration with other design team members including system, software, mechanics. Define RF architecture for new products along with selecting, qualifying, and validating parts for higher-level designs.\n\nLeading ang professionally mentoring the team. B.Sc. in electrical engineering 8+ years of experience as an RF design engineer. Experience in high frequencies Experience in detailed design of RF circuits and submodules System-level understanding Demonstrated experience designing circuits including, PAs, PLL, splitter/combiners, LNAs, etc.\n\nDemonstrated RF circuit simulation tools and frontend environments with extensive experience with Cad EM simulation tools.Show more Report"}, {"company": "SAP", "job": "Intern - Product Manager Customer Data Cloud ( Gigya)", "city": "Tel Aviv-Yafo", "date": "21d", "rating": "4.4", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=126&ao=1136043&s=58&guid=00000186e642473bb4d0ca91ec69e9a7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0c56e534&cb=1678900584867&jobListingId=1008487110710&jrtk=3-1-1grj4bob7kbl6801-1grj44ht1gsrr800-dafe64d0bc61cbde-", "description": "We help the world run better\nOur company culture is focused on helping our employees enable innovation by building breakthroughs together. How? We focus every day on building the foundation for tomorrow and creating a workplace that embraces differences, values flexibility, and is aligned to our purpose-driven and future-focused work. We offer a highly collaborative, caring team environment with a strong focus on learning and development, recognition for your individual contributions, and a variety of benefit options for you to choose from.Apply now!\nCompany Description\nSAP started in 1972 as a team of five colleagues with a desire to do something new. Together, they changed enterprise software and reinvented how business was done. Today, as a market leader in enterprise application software, we remain true to our roots. That’s why we engineer solutions to fuel innovation, foster equality and spread opportunity for our employees and customers across borders and cultures.\nSAP values the entrepreneurial spirit, fostering creativity and building lasting relationships with our employees. We know that a diverse and inclusive workforce keeps us competitive and provides opportunities for all. We believe that together we can transform industries, grow economics, lift societies, and sustain our environment. Because it’s the best-run businesses that make the world run better and improve people’s lives.\nMeet your team\nJoin the SAP Customer Experience Product & Engineering team and have a positive impact on how businesses are run across the globe. SAP CX is a leader in enterprise cloud applications for cloud CRM and DXP solutions, with thousands of organizations using our SaaS solutions to understand their customers best and engage with relevance and personalization. If you think you have what it takes to be part of a fun, fast paced, diverse, and talented group of team members who are the driving force behind our company’s product portfolio, then we want to hear from you!\nWhat you’ll do\nIn order to win and help our customers succeed , we strive to build best in class products in the Customer identity and Access management area. Our Product and development teams work together to fulfill this mission.\nAs part of your role you will be required to have in-depth understanding of our organization products, features, operations, and business environment. You will need to collaborate with the product managers on the website roadmap , help build the product backlog and follow up on the plans vs execution with the development teams.\nWhat we offer?\nPractice at one of the leading software development companies in the world\nWorking in a multinational environment\nExperience with highly scalable MACH-based SaaS applications\nSAP product know-how\nFriendly and open colleagues\nA compensation package above average\nContinuous personal and professional growth\nSuperior office and work environment\nInternational team\nWhat’s the job?\nEnsure product definition: Assist in describing the product backlog which reflects customer and user needs.\nEnsure product roadmap definition : Assist in maintaining product roadmap accuracy and transparency\nAssist in enriching the product backlog and support the scrum team and other relevant stakeholders to understand the backlog.\nEnsure product delivery: Support the validation of planned and implemented scope throughout the product lifecycle.\nAssist in creation of product-related non-coded assets (such as rollout and knowledge transfer material).\nAssist in collection and incorporating feedback from customers and other relevant stakeholders.\nWhat are we looking for?\nA student currently pursuing a bachelor's or master's degree with up to 18 months remaining to graduation\nCurrent student status in a recognized higher-education institute is required\nYou are interested in product management\nResponsible, detail-oriented, and able to handle complex tasks independently while meeting goals.\nA team player with the ability to work well with other team members across different locations\nFluent in verbal and written English\nBesides that, you are reliable, organized and have very good communication skills\nWhat do you need to stand out?\nYou want to work solving complex business problems\nYou are curious and proactive\nYou have a “Can do” attitude\nWe build breakthroughs together\nSAP innovations help more than 400,000 customers worldwide work together more efficiently and use business insight more effectively. Originally known for leadership in enterprise resource planning (ERP) software, SAP has evolved to become a market leader in end-to-end business application software and related services for database, analytics, intelligent technologies, and experience management. As a cloud company with 200 million users and more than 100,000 employees worldwide, we are purpose-driven and future-focused, with a highly collaborative team ethic and commitment to personal development. Whether connecting global industries, people, or platforms, we help ensure every challenge gets the solution it deserves. At SAP, we build breakthroughs, together.\nWe win with inclusion\nSAP’s culture of inclusion, focus on health and well-being, and flexible working models help ensure that everyone – regardless of background – feels included and can run at their best. At SAP, we believe we are made stronger by the unique capabilities and qualities that each person brings to our company, and we invest in our employees to inspire confidence and help everyone realize their full potential. We ultimately believe in unleashing all talent and creating a better and more equitable world.\nSAP is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to the values of Equal Employment Opportunity and provide accessibility accommodations to applicants with physical and/or mental disabilities. If you are interested in applying for employment with SAP and are in need of accommodation or special assistance to navigate our website or to complete your application, please send an e-mail with your request to Recruiting Operations Team: Careers@sap.com\nFor SAP employees: Only permanent roles are eligible for the SAP Employee Referral Program, according to the eligibility rules set in the SAP Referral Policy. Specific conditions may apply for roles in Vocational Training.\nEOE AA M/F/Vet/Disability:\nQualified applicants will receive consideration for employment without regard to their age, race, religion, national origin, ethnicity, age, gender (including pregnancy, childbirth, et al), sexual orientation, gender identity or expression, protected veteran status, or disability.\nSuccessful candidates might be required to undergo a background verification with an external vendor.\nRequisition ID: 364829 | Work Area: Solution and Product Management | Expected Travel: 0 - 10% | Career Status: Student | Employment Type: Limited Part Time | Additional Locations: #LI-Hybrid.Show more Report"}, {"company": "בי נט ייעוץ והשמה כ''א בע''מ", "job": "Senior Real-Time Software Engineer", "city": "Southern", "date": "12d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=127&ao=1110586&s=58&guid=00000186e642473bb4d0ca91ec69e9a7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d41891e8&cb=1678900586970&jobListingId=1008505283862&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj4bqcv2pea001-1grj44ht1gsrr800-df9ffcc06b2b4d75--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNDZcI3Tvdo4mWFVMACugIrJcyTPTca0rFPSvFIdGJj0WpGLHu3UottpkH-6BW-enihOL4V9V26Yz0_9pFBIS16aujpZ7HoeA3NhcDX7I857-e3bMCk5f8ef_690oovEjWaTxXrw2X7UMm0FOs0JLlaOh8ez70PbfoqTGJi35-4oJI2x4BauOvPMvwQo8L-W1jIuxhB-E7cZylYO4NB0dZ0OxPzZ2Ookke_BT0ZDJnljDaAOlRllUJ5mzjslfQGfdEEemecxSjyiKkCTW48sqpilXJZLA1Q1Lhh8gLv5Ivdg_LGmC06iHjnVzaUgP3XDzEq_ihyMVP4TOY3Qsa__-8I3zJWiGisQsSj6WeWarf3xoOMAvXHulBcLh6laznWPykcLWcA3XN4o-6p1-Yk_PzV0usS36vrI74Z5L5eECiWRIxNc-JRbHbzuNho3M2BXbawwGM_eGmRLVIXkbS_-RJF9n75FFlYrVz131SPiIS2CfJYtKWYUJHxqwIRWQ1GSPgWitoPlK9pnEjpOYztEMxXXssDesq08-A4e3m7NM6BQf0RCVLj2cZfgO3sUMKedKV3iRffLPLb4GF8BYa3OGhWgsjjW5CnwKdcT7NDyWKDmbHsvZJAtpUU_oNqY3OMFFgglV9cyechmLPDLFSVeuIusPLQnXxUg9KA%3D", "description": "Senior Real-Time Software Engineer for real-time software development for Company's systems working within strict time constraints. **Please Apply your CV in WORD Document B.Sc. in computer science / SW engineering / electrical engineering. 5+ years programming experience in C/C++/Python, as well as hands-on experience debugging complex real-time software.\n\nExperience writing real-time coding, including complexity analysis and performance optimization Experience with Multi-threading, OOD and Design pattern Demonstrate a deep understanding of the Linux operating system including networking (network services) and scripting (Bash) Nice to have · Experience with parallel programming on NVIDIA GPUs using CUDAShow more Report"}, {"company": "ESR", "job": "Embedded Software Engineer", "city": "Israel", "date": "16d", "rating": "2.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=128&ao=1110586&s=58&guid=00000186e642473bb4d0ca91ec69e9a7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_603a5f54&cb=1678900588117&jobListingId=1008494822983&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj4brenk632801-1grj44ht1gsrr800-d8109326ca5bda90--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBsBTX67ZV43kXPBm8YQAjz69wZISiFcBJg7-OBZLoHXwwS4dNBXi5usl-oQpV3CmCdBPLfaqCfzg2SR-PqA5n5xSl0TfM21lz6INJiduiAkoDV1m6q0gRIQi-5_b41airfnkuO_3yH4YJGlmIpn1Vr0L-MJ8YK7czPgVjNDPqY4-M7VIoyvZK3D2PIcge-yEg_FhCu1fziKixABy_-otyt5HAl1j4hnNBrZTv8tk9N8sW5uEvvRC7_KUBnbBe9IWSNEEPKHrOUwQpY7DtDKG8S0X3Lwp9vBNgFdcLEA2sa9R8xkYzqTzlpNRFroFtqZlEdm9LZpDoHUECZ9OM_Lc2ofAGZFFRBY7NJh9YIbdbDJYYDH8yWdmAmtdXyD_usgc-oLv8N6JVhSpZHIY9Ercqe2EylTOAU79pyTGW0FuHN92s4KUtE-ZvWTZ9dnxdkBnKMPIunF76ZBjkFMk4QW3-VbnsYRZL9_BUvlYPMYAt3Meebj7pM0H7EKNhGrvMnjeSx2Jc4XFBRkb0xH6YVbS-M-o9tdLc5gDW5UhpDEXdqfjRt68_JY-6JFWQAse6hnnX1DDbi7EGIeT9N2mOKs66Hb9AcmB6H0PDfR6z6qISZlmwpmtu8WwCpVuQA6eaGG07h46lkoM30KVO2SkQFLXnTaG2Y6WnplmE%3D", "description": "לחברת הייטק מתחום הפיתוח Automotive דרוש/ה Embedded Software Engineer. במסגרת התפקיד : - עבודה כחלק מצוות הפיתוח - תכנון, הטמעה ותחזוקה של קושחת RT EMBEDDED בעיקר על מיקרו בקרים מבוססי ARM - אחריות מלאה על פרויקטים שונים - B.Sc במדעי המחשב או הנדסת חשמל - ניסיון שותף בפיתוח באמצעות C או ++C - לפחות 4 שנות ניסיון בפיתוח תוכנה Embedded ו- Embedded Linux. - ידע בפרוטוקולים הבאים: I2C, SPI, USB, TCP/IP, RS-485, UART, CAN ו-FD-CAN. - ניסיון בעבודה עם אוסילוסקופ, סניפר וניתוח לוגי.\n\n\nהבנת מערכות הפעלה פנימיות (Linux, freeRTOS וכו'), פרוטוקולי תקשורת ורשתות. - היכרות עם DevOps וסטנדרטים (git, אוטומציות, CI/CD). - רקע באלקטרוניקה ו-DSP- יתרון - ניסיון בפיתוח עם שפות נוספות- יתרון - ניסיון עבודה עם Linux Karnel (Buildroot ו-Yocto) - ניסיון עם STM32 MCUs- יתרון - ניסיון באינטגרציות FPGA- יתרון\n\nShow more Report"}, {"company": "myteam", "job": "Junior Manual QA Engineer - AVA", "city": "Israel", "date": "15d", "rating": "4.3", "link": "", "description": "AvaTrade company, located in Herzliya is looking for a Manual QA\nThe Role / Responsibilities:\nWrite and execute manual tests.\nUse bug-tracking systems to submit, track and manage defects.\nAnalyze the results of the tests performed and provide meaningful reports to the project team.\nMaintain software testing artifacts.\nUse queries to create test data and analyze results.\nWork with other testers and key stakeholders to ensure coverage for each software release.\nAssist with the analysis of story-level requirements.\nClarify functional requirements.\nRequirements:\n3 years in Software Quality Assurance-Must\nExcellent understanding of the Test Life Cycle\nAbility to multi-task and learn quickly is a must.\nGood knowledge of HTML, CSS, web and mobile standards is required.\nWorking with log analytics tools (like Cora Logix/Sumo Logic)\nExcellent understanding of web-based Client/Server architecture\nExperience in SQL query writing\nExperience with e-Commerce systems and CRM systems.\nExperience with TFS/Jira\nExperience with Scrum/Agile methodologyShow more Report"}, {"company": "Bright Machines", "job": "Test Development Software Engineer (QA Automation)", "city": "Southern", "date": "30d+", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=130&ao=1110586&s=58&guid=00000186e642473bb4d0ca91ec69e9a7&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b4379ac0&cb=1678900590421&jobListingId=1008375115659&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj4btnckbkl801-1grj44ht1gsrr800-205a9d79082a55e3--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBvnGYFG6Yx6cKbbtRhFndn1SasV32KvyUMH_I2W1zcA3o1KY4vgpyOMmUjtDQ1-CXPVvmALWZbMiK4VFEamePYACxrM-erftq5ibbFm2PzEYbdgYtogGeVDTClPi2QKD8yXarIQjWgmg0vnK2U09upFnJOwaHfDkvvePSXxM4f5VjM1m2PCPm0fvltAva4uPaKaq1Z0o18hJg6Zx-VWQTOsieqm6bW08FdbXxb3uCT4v0Aah1usQqzav6SjIwON7zxeXmG-9nL4c3UDsdLQJy3QNFNOy0IGTLjQVsLAcf7n-K8DaBPD3fkWawqXBY7iuma40CkTYAj8tei6Uh_crldZIWxgXTA6RcafAUdFY-_0F9_bLNmDiyM-htoe7tQF5J1PdA5Z9JZDUE4lKMQ7P3Z9Wlpj8NCYViQ8M4qEweFWLM3c0BvDITptr1rk-XSCe34HtMwWF79WgS0VVeh7jAcS00Tc-_Bez7K7C3Qeufsad0p7t1zqhJkaTmOgiQrLwHDMCP0XOWaFMT5qMzSnOmqBQiX0HlBf31rtvJT4GUnzxlF5_Sz8-GgnvErzeyswx3ngzJa3w2Gef_0I6zSC27HR3VAv758aEYgb0OaZCijblZdwP-sGSDQMFp_f0OaBXTQzTnOVBRYs-IHSAOYQNgb4p9wqU7QcvM%3D", "description": "We’re looking for Software Development Engineer in Test to join our automation team and be responsible for defining testing coverage and implementing quality validation, both manual and automated, to achieve CI/CD validity of business logic and user interface as well as to reduce regression time. In addition, the SDET will be working closely with both QA and Development teams to design and create a unified test automation framework that will be used across all levels of the web development organization. 2+ years job experience with automation testing Experience and knowledge with automation frameworks (such as Cucumber / Selenium) Experience with common CI/CD platforms (Jenkins, GitlabCI, etc.) Experience with web applications testing Experience working with DB (such as Postgres/SQL) Experience writing detailed test documents (STP, STD, STR) Deep understanding of QA methodologies Experience with functional, UI, Sanity, loading and data validation testing Ability to work and learn individualy as well as work as part of a team Ability to prioritize and work on multiple tasks under tight deadlinesShow more Report"}]]