[[{"company": "LiveU", "job": "VP Finance", "city": "Kfar Saba", "date": "30d+", "rating": "4.4", "link": "", "description": "About LiveU\nLiveU is driving the live video revolution, providing live video streaming for TV, mobile, online and social media. Let your audience become part of your story with high-quality and flawless live video, transmitted from anywhere in the world, through the use of our patented bonding and video transport technology. LiveU creates a consistent bandwidth and a reliable connection so you can acquire, manage and distribute high-quality remote live broadcasts.\nLocation: Kfar Saba\nKey Responsibilities:Oversee all aspects of the company's financial and accounting operations, including financial reporting and forecastingLead the preparation of annual, quarterly, and monthly reportsMonitor globally the compliance with local government reporting requirements and tax filingsDevelop and document business processes and accounting policies to maintain and strengthen the internal controlsLiaise with senior management in the business and with the IT to lead the design and development of systems to improve and automate internal processesMentor and develop the finance team, promoting a culture of continuous improvement and growthLead M&A financial due diligence activitiesA business partner of other units in the organization such as HR, Legal and Sales\n\nRequirements:\n\n10+ years of overall combined accounting and financial experience, with at least 3 years in a leadership roleExcellent US GAAP accounting knowledgeExperience in manufacturing industryExperience with reporting and managing regulatory requirements, including direct and indirect taxesKnown for developing high performing teams, fostering collaboration, and creating a learning culture to stay ahead of the growth curveStrong leadership skills, steadfast resolve, and high personal integrityFluent communication in English (written and verbal)Experience with automating accounting processes– AdvantageExperience with Priority and BI tools – Advantage\nReport to the CFOShow more Report"}, {"company": "LiveU", "job": "Global Director of Procurement", "city": "Kfar Saba", "date": "30d+", "rating": "4.4", "link": "", "description": "About LiveULiveU is driving the live video revolution, providing live video streaming for TV, mobile, online and social media. Let your audience become part of your story with high-quality and flawless live video, transmitted from anywhere in the world, through the use of our patented bonding and video transport technology. LiveU creates a consistent bandwidth and a reliable connection so you can acquire, manage and distribute high-quality remote live broadcasts.The Global procurement manager is responsible for sourcing equipment, goods and services and managing vendors. This position will manage a team in Israel, to execute the procurement and collogues globally, that will work under the policy and processes defined by procurement manager. This position work closely with Supply Chain, Quality and Engineering and Finance and reports to Global VP of Operations.Requirements:Developing, leading and executing procurement strategies policies and processes.Purchase of goods, materials and services to ensure that the company’s operational needs are met, taking into account price, quality and delivery and to ensure continuity of supply and service.Leading strategic procurement projects in various areas of the business, this include working closely with internal business owners for the planning, sourcing of suppliers, RFI/RFP as needed, evaluation and negotiations.Assess, manage and mitigate risks. Perform cost and scenario analysis, identify cost savings opportunities and set cost reduction targets and plans.Managing procurement team for day to day non-strategic procurement work.Leads vendor/supplier’s selection and maintains key working relationships.Negotiate with strategic suppliers for optimal terms.Basic requirements:EducationBachlor’s degree in Industrial and Management/Electronic/Mechanical or other relevant Engineering/Logistics BSc.MBA- AdvantageRequirements Proven working experience as Procurement Manager in international High-tech HW companies.Well knowledge in Electronic systems, components and Mechanical technologies. Experience in signing contracts with large Electronic Manufacturing Subcontractors (EMS).Familiarity with sourcing and vendor management.- Strong leadership, Analytical, Interpersonal and organizational skillsExcellent English verbal and written communications skills.Job Type: PermanentShow more Report"}, {"company": "Jifiti", "job": "VP Finance", "city": "Israel", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=103&ao=1136043&s=58&guid=00000186e63f0629992c0b8402caed9f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6fc3a016&cb=1678900277727&jobListingId=1008395684824&jrtk=3-1-1grj42cbincch801-1grj3u1k7i9hq800-d89be49552dc69a4-", "description": "About The PositionJifiti is a cutting-edge fintech company that's driving the technology for leading banks and retailers worldwide. We’re growing quickly following an investment of over $20M by the company that owns IKEA. So we need people like you – smart, energetic, and with a passion for getting great things done for some of the most iconic brands in the world.The successful candidate will be a individual with 7-10 years of managerial, accounting and financial management experience in a rapidly growing start-up environment, reporting directly to the C-level.ResponsibilitiesDirecting all aspects of accounting operations, overseeing all transactions related to general ledger, receivables, payables, payroll and financial reporting.Analyzing company's financial results with respect to profits, trends, costs and compliance with budgets. Issue regular status and ad hoc reports to senior management.Strategizing and presenting financial KPI’s.Developing and coordinating all relationships with financial institutions.Responsible for ongoing training and mentoring of team.Assisting senior management in financial planning and results management. Work with other team members to understand revenue and cost drivers and define appropriate reports for tracking.Coordinating, preparing, and reviewing monthly, quarterly, and annual reports with internal and external stakeholders.Coordinating and/or preparing tax schedules, returns and information.Managing all tax planning and compliance with all required federal, state, local, payroll, property, and other applicable taxes.Managing cash flow.Building a finance department as the company grows.Other finance and administrative duties as required.Requirements7-10 plus years of managerial accounting and financial management experience.Experience working in a growing start-up environment.Experience in international environment with US, Israeli and European entities.Recent experience scaling a finance operation to at least $100 million in annual revenues.Bachelor’s degree in Accounting, Finance or Business.Israeli CPA.Experience working under US GAAP.Strong organizational skills, attention to detail, ability to prioritize and meet deadlines.Experience in a SaaS hitech environment.Ability to multi-task in a fast-paced environment with fluctuating priorities and deadlines.Ability to work without direct supervision, and efficiently manage tasks and time.Job Type: Full-timeShow more Report"}, {"company": "Cardo Systems", "job": "Director of E-Commerce", "city": "Raanana", "date": "21d", "rating": "4.2", "link": "", "description": "Cardo Systems, the global market leader in the field of wireless communication systems for motorcyclists, ORV & Outdoor-Sports, has an immediate opening for an experienced and enthusiastic Director of E-Commerce.\nFull-time position in a hybrid model, reporting to the VP of Global Sales.\nJob description\nThe Director of e-commerce is a cross-functional position that is responsible for leading, executing, and optimizing the company’s e-commerce strategy across its Global online sales channels and platforms for its business lines. The position has strong interfaces with Sales, Marketing, website & webstore, and Finance.\nThis person is responsible for various aspects of online operations, business planning, and marketing strategies. The Director of e-commerce provides a thoughtful analysis of market trends, strategies to increase brand awareness, insight into growing online sales, and ways to improve customer satisfaction, acquisition, and retention.\n﻿Roles & Responsibilities\nManaging Amazon EU sales for all product lines\nManaging Amazon sales globally for Outdoor and ORV\nOverseeing the company’s sales in Amazon US, T-mall, JD, and other e-tailers (dotted line)\nSetting and achieving online sales targets\nManaging the e-commerce budget – analyzing success and allocating budgets based on ROI and strategic objectives\nCollaborating with the webstore manager, Amazon US, and other online sales managers to maximize value for the company\nCollaborating with third-party vendors and partners\nForecasting demand\nOverseeing sales performance\nBusiness analytics, including ROAS \\ conversion rates and others\nIdentifying and implementing new technologies to improve online sales and customer experience\nAnalyzing customer data and using it to inform sales and marketing strategies\nEnsuring compliance with regulations\nStaying up-to-date with industry trends and identifying new opportunities for the company in the eCommerce space\nRequirements:\n\nRequirements\nBachelor's degree in business, marketing, e-commerce, or a related field. An MBA or other relevant post-graduate degree is preferred.\n7+ years of experience in e-commerce, digital marketing, or related fields, including at least 3 years of management experience.\nStrong analytical skills, including the ability to develop and interpret financial reports and performance metrics.\nExcellent communication and interpersonal skills, with the ability to effectively lead and manage teams, develop and maintain external partnerships, and communicate with senior leadership.\nKnowledge of Global e-commerce platforms and technologies, online marketing, and customer experience.\nProven success and track record in Amazon\nStrong project management skills, including the ability to manage multiple projects and priorities simultaneously, meet deadlines and work effectively under pressure.\nStrong problem-solving and critical-thinking skills, with the ability to identify and solve complex problems and make strategic decisions.\nFamiliarity with consumer electronics products and industry is a plus.Show more Report"}, {"company": "Avnon", "job": "Africa - Account Manager (Sales)", "city": "Kfar Saba", "date": "30d+", "rating": "3.7", "link": "", "description": "TAR from Avnon group is recruiting an experienced salesperson.\nLeading the account management related to integration and/or turnkey solutions to the HLS and Defense sectors.\nEstablish a wide network of end-users, partners, agents and distributors in the region.\nManage and lead the techno-commercial sessions, presentations and demonstrations to the potential customers.\nParticipate and represent the company in relevant HLS and Security related domestic and international exhibitions.\nMatrix management of various stakeholders throughout the sales cycle - including account team members: Pre-Sales and project manager, as well as Operations, Procurement, Legal, Finance and more.\nReporting to the Customer Business Department VP.\nRequirements:\n\nBackground in HLS/Defense sectors – MUST.2+ years of proven experience in integration projects sales to the HLS/Defense sectors in AfricaAn autodidact professional with strong analytical skills, eager to learn new domains.Proven ability to prioritize competing needs of multiple, rapidly evolving tasks and initiatives.Attention to details, accuracy and precision. Independently identifying and solving problems.Ability to adapt to, build and maintain relationships with multiple external and internal stakeholders.Strong communication skills, oral and written with excellent presentation and demonstration skillsTechnical background – advantageFluent English – MUSTFluent French - MUSTReport"}, {"company": "Minute Media", "job": "Business Operations Director", "city": "Tel Aviv-Yafo", "date": "19d", "rating": "3.6", "link": "", "description": "Minute Media is a global sports & entertainment media and technology company, having all its technological needs developed in-house, end to end, in a rapid big-data environment. Minute Media’s platform serves as the company’s foundation, powering its content as well as enabling the evolution of other market-leading digital media brands. To date, Minute Media’s owned and operated destinations include The Players’ Tribune, 90min, DBLTAP, Mental Floss, The Big Lead, and FanSided. For more information, visit www.MinuteMedia.com.\n﻿Position Summary\n﻿\nMinute Media is looking for a Business Operations Director who will be responsible for performing both qualitative and quantitative analyses while using the findings to create decision-support mechanisms that will allow to optimize and enhance the business, to ensure reaching its KPIs and to answer important strategic questions. This position will be reporting directly to the VP Finance & Business Operations of the company with high visibility to C-level executives and company’s management.\n﻿Responsibilities\nRegularly partner business units’ management to track performance and provide information and ongoing business analysis to help guide day to day and strategic decision making.\nDrive periodic review and analysis on unusual trends in key business metrics (KPIs) using business intelligence data.\nIdentify potential risks to business performance and recommend optional operational pathways.\nPartner with operational and commercial teams to develop end to end procedures to support the business flow and the achievement of Company’s goals.\nMake recommendations for change and manage the implementation.\nDetermine the operational implications of business decisions and projects and act accordingly to support and enable fluent business operations.\nCollaborate with cross-functional teams to identify opportunities, generate ideas, and develop business cases for profitable growth.\nLead and implement strategic global initiatives for improvements and efficiencies to achieve business goals and operational excellence.\nRequirements:\n\n10+ years of relevant professional experience in the labour market\n4+ years of experience in Business Operations / Ad Operations / Media Operations or a top-tier consulting firm\nCan-do approach and ability to swiftly move from strategy planning to execution, and reiterate based on performance\nOutstanding analytical skills, detail-oriented, proactive and self-motivated\nLimitless curiosity about business models and understanding of how companies operate\nA great communicator that can collaborate successfully with different teams within the business\nBachelor degree in Economics, Business Administration, Industrial Management Engineering, or any relevant degree from a leading institution is required\nMBA - advantage\nBrand:\n\nMinute Media\n\nBenefits:\n\nOpportunity to make a meaningful impact in a fast-growing company\nCareer development opportunities & different skill-based workshops offered each quarter\nHybrid work model\nFlexible holiday scheme\nGradual return from parental leave\nFun company events and celebrations\nCommunity involvement opportunities, both in-person and remote\nNot sure that you're 100% qualified but are up for the challenge? We want you to apply!\nMinute Media is committed to creating a diverse and inclusive work environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.\nCheck the URL and email address of any correspondence with Minute Media. If it is not from @minutemedia.com, treat it as fraudulent. To learn how to protect yourself from recruitment fraud click here.Show more Report"}, {"company": "מכניק ריקום בעמ", "job": "Back Office / בק אופיס | מנהל שיתופי פעולה Affiliates", "city": "Tel Aviv-Yafo", "date": "14d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=107&ao=1136043&s=58&guid=00000186e63f0629992c0b8402caed9f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ab94e261&cb=1678900286162&jobListingId=1008498412992&jrtk=3-1-1grj42kk5is1v801-1grj3u1k7i9hq800-2bdb4951377e356c-", "description": "hey everyone!were hiring !starting immediately!!***open positions****israel**ftd agent for morning,**ftd agent for night**ftd manager for morning**ftd manger for night**pa for night**pa for morning**support+ compliance agent for morning**affiliate manager**back office finance morning**back office nights**retention agents**cyprus**retntion agents - english, polish, spanish, italian,french**team leader -* *english, polish, spanish, italian,french**vp**conversion manager*send us your cv by mail : |** לפנייה למשרה יש להגיש מועמדות **|Show more Report"}, {"company": "mPrest", "job": "R&D Director", "city": "Petah Tikva", "date": "30d+", "rating": "3.2", "link": "", "description": "As the leader of our growing R&D group, you will play a key role as a mentor, shape the design of our systems, and set standards for quality and delivery.\nIf you want to take part in the development of core defense solutions, participate in all product development stages, attend military experiments, and contribute to the national security, your place is with us!\nRequirements:\n\nCan-Do and Hands-On approach.Excellent communicationHighly motivated, self-driven, leads by example.7+ years experience in R&D managerial rolesExperience as VP R&D or R&D director of 30+ sized team.Experience in managing QA and Devops teams.+10years of software development experience in in .NET C#, JAVA.3+ years experience with micro services architecture and distributed systems.Experience with PMO, agile and CI/CD methodologies and practices (TFS/GIT)Strong design, architecture, and problem-solving skillsExperience with web frontend development (Angular, React, Vue).Proven record of delivering complex, distributed systems.Ability to build long-term plans and set alignment around goals and objectives.Understanding of budgets and business-planning.Define and manage all technological aspects of the division. Convert business vision to tech strategy.Capability to work with multiple interfaces throughout the organization (System Engineering, Project Management, HR, Purchase, Finance, Senior Management).Great customer facing abilities.Presentation design skills (Hebrew & English).BSc/BA in Computer Science or equivalent.\nBonuses:MBAExperience in private cloudsValid Security ClearanceExperience with Command & Control Systems - Big advantageDefense background\nResponsibilities:\n\nManage software development lifecycle, deliverables, performance, and vision.Plan and Lead features development, functional and non-functional, From SW design through implementation, automation, and manual testing.Lead and take part in defining architecture discussions and the division's technological roadmap and lifecycle.Build and maintain an engineering culture of excellence. Lead and monitor the development’s execution, deliveries and KPI’s.Direct the professional growth of staff by providing coaching, mentoring, training, and supervision of the software engineering groups, including backend,\nfrontend, QA, and DevOps.Strategize and align with commercial operations and deployment teams to ensure timelines and budgets are met.Advocating and communicating technology capabilities internally and externally, including leadership, Utilities Board, customers, partners, and investorShow more Report"}, {"company": "Candex", "job": "Junior Operations Associate", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "", "description": "Junior Operations Associate\nAbout Candex\n\nCandex is a rapidly growing fintech player in the B2B payments market, which is one of the hottest markets in technology. Our solution is used by the Global 2000 to pay vendors in 30+ countries, fast & compliantly - clients include brands like 3M, Starbucks, Dell, Pfizer, Danone, L'Oréal, HSBC, Roche, Colgate, and many others. We have a world-class management team and $37m in funding from investors like Amex, JP Morgan, Altos, NFX, and Partech. As a member of our company, you will have a golden opportunity to reshape and impact how the biggest companies in the world manage a meaningful part of their business.\n\nThe company is growing rapidly, and we seek a Junior Operations Associate. This position will report to the VP of Operations. This is an opportunity to join the Candex Finance team and make a significant impact at a rapidly growing multinational fintech company.\n\nThe Role\n\nThis is a key role in delivering supreme support and service to our customers. You will be a valuable resource throughout the payment process and a crucial point of contact for our customers. If you have excellent interpersonal and communication expertise, strong writing and analytical skills and a desire to leverage your knowledge of fintech and payments; this opportunity is a perfect fit.\n\n\nResponsibilities:\n\nHandle day to day customer email/phone support related to the entire payment process.\nProvide guidance to new customers to ensure they are on-boarded successfully.\nAdminister pending payments and registrations.\nWork with customers to correct payment details provided or to obtain any missing information.\nSend out client invoices ensuring they are accurate and compliant.\nReview customer invoices received ensuring their accuracy and timeliness.\nReconcile bank payments received against invoices.\nPrepare bank transfers and ensure that customer bank details are verified.\nVerify customer data by performing compliance checks.\n\nRequirements:\n\nUndergraduate Bachelor's degree in economics/finance/accounting is preferred.\nFluent English language skills – written and verbal – a must.\nFintech/Hi-tech experience is preferred.\nAble to accommodate global working hours - Mon-Thurs 11am-7pm, Fri 10am-5pm.\nImpressive interpersonal and communication skills.\nStrong computer skills with advanced Excel skills.\nOutstanding attention to detail, with an ability to spot numerical errors.\nHighly organized with the ability to multitask and work under pressure.\nTech savvy and the ability to pick up new technology quickly.Show more Report"}, {"company": "bluewhite", "job": "Controller", "city": "Tel Aviv-Yafo", "date": "2d", "rating": "", "link": "", "description": "Imagine there was a platform that allows operating multiple autonomous vehicles, in the air and on the ground, across the globe, from a single location. How awesome would that be?! What if you were the one to help build it from scratch?\nBased in TLV (Sarona), Blue White Robotics is a world leader in autonomous technologies and unmanned systems.\nWe are seeking a sharp Controller to join our ranks! In this position you will report to the VP of Finance. This position will require hands-on approach. Candidates must be able to manage multiple responsibilities while managing outsourced functions to successfully and timely process all necessary accounting functions.\nThe major responsibilities of this position include, but are not limited to: Monthly financial close, production of periodic financial reports, maintenance of an adequate system of accounting records, and a comprehensive set of controls and budgets designed to mitigate risk, all to enhance the accuracy of the company’s reported financial results.\nResponsibilitiesPerform monthly and yearly closing and preparation of financial statements.Process journal entries and maintaining a General Ledger (including maintain COA).Prepare and file multiple jurisdiction tax returns.Support cash flow by preparing monthly budget reports.Oversee AR /AP and Payroll activities.Handle annual business operations renewals such as industry-related corporate, state, and\nlocal authorities licensing, General Liability and Workers Compensation.\nRequirements:\nBachelor’s degree in Accounting / Economy, or closely related field, from an accredited college.2+ years of relevant accounting experience.Strong analytical and problem-solving abilities - Must.Ability to prioritize, while monitoring timelines to achieve completion of objectives.Attention to details with an appreciation of the “big picture”.Ability to work independently and well under pressure.Excellent English, both oral and writing skills.Excellent organizational skills.Audit firm experience – Advantage.CPA – Advantage.Working Conditions: Primarily in an office environment and periodic weekend or evening work is expected.Show more Report"}, {"company": "Plusgrade", "job": "Accounting Analyst", "city": "Tel Aviv-Yafo", "date": "24h", "rating": "3.8", "link": "", "description": "Plusgrade powers the global travel industry with its portfolio of leading ancillary revenue solutions. Over 200 airline, hospitality, cruise, passenger rail, and financial services companies trust Plusgrade to create new, meaningful revenue streams through incredible customer experiences. As an ancillary revenue powerhouse, Plusgrade has generated billions of dollars in new revenue opportunities across its platform for its partners, while creating enhanced travel experiences for millions of their passengers and guests. Plusgrade was founded in 2009 with headquarters in Montreal and has offices around the world.\nABOUT THE ROLE:\nWe are seeking a dynamic Accounting Analyst to join our finance department on a contract basis (3 to 6 months). The Accounting Analyst will assist our team accounting tasks for our newly acquired legal entity in Israel and help to transition to the Corporate accounting processes. This role will report to the VP, Controller of Plusgrade and work closely with the Plusgrade Finance team.\n WHAT YOU WILL BE DOING:Maintain accounting records and filing information as required.Prepare monthly invoices and forward them to all the customers. Work on collections to ensure customers are paying timely.Work with the Head Office to ensure bills and invoices are paid on time.Assist the accounting team to answer accounts payable and accounts receivable questions and issues.Process and verify employee expense reports accurately with adherence to corporate expense policies.Reconcile corporate credit card expense report.Support administrative tasks for the Israel employees.Work closely with the 3rd party accounting service provider to produce a monthly trial balance within the Corporate timelinesAssist in the preparation of monthly payrolls-Assist with Finance projects as requested (Implemenation of NetSuite for example).\nYOU ARE SOMEONE WITH:3+ years of experience in a similar function or rolePost-secondary degree/diploma in accounting or related fieldProficient in Excel (vlookups, pivot tables, sumifs, etc.), Google Docs and technology-savvyFluency in English and Hebrew, both spoken and writtenStrong organizational and planning skills, ability to work accurately and efficiently under demanding deadlines and with minimal supervisionWorks well on teams and as an individual contributorAbility to maintain strict confidentiality\nWHAT YOU’LL LOVE ABOUT US:\n\\uD83C\\uDFE6 RRSP/401(k) Matching\n\\uD83C\\uDFE5 Comprehensive Health Plans\n\\uD83D\\uDCC5 Unlimited Vacation/PTO\n✈️ Travel Experience Credit\n\\uD83E\\uDDD8 Annual Wellness Credit\n\\uD83E\\uDD57 Team Events and Monthly Lunches\n\\uD83D\\uDCBB Home Office/Commuter Credit\n\\uD83C\\uDF05 Work From Anywhere Program\nOUR PROCESS:\nPlusgrade is an equal opportunity employer and is committed to providing an accessible recruitment process. We welcome applications from all qualified individuals and are committed to equal employment opportunities regardless of gender identity or expression, race, ethnic origin, creed, place of origin, age, sex, marital status, physical or mental disability, sexual orientation, and any other category protected by law. Upon request we will provide accommodation for applicants with disabilities.\nWe believe in diversity and inclusivity and that is why our interview process is designed for a positive candidate experience and to ensure every candidate is evaluated equally. All applications will be reviewed from our Talent Team and the successful candidate(s) will go through the following recruitment process:\nRecruiter Phone InterviewHiring Manager InterviewTake-home Assessment or remote coding exercise (if applicable)Team Interview\nAll candidates will be provided with feedback regardless if they pass or didn’t pass any of our interview stages. All your information will be kept confidential.Show more Report"}, {"company": "mPrest Systems", "job": "R&D Director", "city": "Petah Tikva", "date": "30d+", "rating": "3.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=112&ao=1136043&s=58&guid=00000186e63f0629992c0b8402caed9f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1ea60027&cb=1678900292641&jobListingId=1008399987752&jrtk=3-1-1grj42qsik60u801-1grj3u1k7i9hq800-c1d50405c4f475e2-", "description": "Petah Tikva, Israel · Full-time\nAbout The Position\nAs the leader of our growing R&D group, you will play a key role as a mentor, shape the design of our systems, and set standards for quality and delivery.\nIf you want to take part in the development of core defense solutions, participate in all product development stages, attend military experiments, and contribute to the national security, your place is with us!\nResponsibilitiesManage software development lifecycle, deliverables, performance, and vision.Plan and Lead features development, functional and non-functional, From SW design through implementation, automation, and manual testing.Lead and take part in defining architecture discussions and the division's technological roadmap and lifecycle.Build and maintain an engineering culture of excellence. Lead and monitor the development’s execution, deliveries and KPI’s.Direct the professional growth of staff by providing coaching, mentoring, training, and supervision of the software engineering groups, including backend,\nfrontend, QA, and DevOps.Strategize and align with commercial operations and deployment teams to ensure timelines and budgets are met.Advocating and communicating technology capabilities internally and externally, including leadership, Utilities Board, customers, partners, and investor\nRequirementsCan-Do and Hands-On approach.Excellent communicationHighly motivated, self-driven, leads by example.7+ years experience in R&D managerial rolesExperience as VP R&D or R&D director of 30+ sized team.Experience in managing QA and Devops teams.+10years of software development experience in in .NET C#, JAVA.3+ years experience with micro services architecture and distributed systems.Experience with PMO, agile and CI/CD methodologies and practices (TFS/GIT)Strong design, architecture, and problem-solving skillsExperience with web frontend development (Angular, React, Vue).Proven record of delivering complex, distributed systems.Ability to build long-term plans and set alignment around goals and objectives.Understanding of budgets and business-planning.Define and manage all technological aspects of the division. Convert business vision to tech strategy.Capability to work with multiple interfaces throughout the organization (System Engineering, Project Management, HR, Purchase, Finance, Senior Management).Great customer facing abilities.Presentation design skills (Hebrew & English).BSc/BA in Computer Science or equivalent.\nBonuses:MBAExperience in private cloudsValid Security ClearanceExperience with Command & Control Systems - Big advantageDefense backgroundShow more Report"}, {"company": "CPS Jobs", "job": "Product/Project Manager", "city": "Tel Aviv", "date": "30d+", "rating": "2.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=1136043&s=58&guid=00000186e63f0629992c0b8402caed9f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a6e2ccb8&cb=1678900294015&jobListingId=1007017789538&jrtk=3-1-1grj42s9ngfqc801-1grj3u1k7i9hq800-bf1c13be314d1620-", "description": "תחום: מוצר/פרויקט\nמקצוע: producet manger\nThe Position\nA worldwide leader in internet marketing and optimization software development is looking for a Product Manager.\nThe Product Manager for back-office systems is an internal facing role, reporting to the VP Product, partnering with sales and operational teams to ensure that our in-house leads distribution,\nreporting and finance systems are optimally used.\n\nResponsibilities:\nOwn the overall product plan and roadmap.\nMap and prioritize goals, build consensus across teams and stakeholders, clearly communicate objectives.\nCoordinate and lead the entire product lifecycle through close collaboration with other teams.\nWrite detailed product requirements s (PRD), accompanied by wireframes and technical flows when needed.\nParticipate in architecture discussions, regularly propose and discuss solutions to system and product changes.\nManage the daily tasks’ status through internal project management tools, syncing and liaising with teams and senior management.\n\nRequirements:\n2+ years’ experience in product management role.\nFamiliarity and experience in product management and/or working with complex CRM, accounting, leads distribution or inventory systems.\nProven experience in writing product requirements documents (PRD)\nExperience working on agile enabled teams.\nStrong project-management skills, ability to prioritize and discern ‘must have’ and ‘nice to have’ tasks.\nExcellent verbal and written communication skills (English) and the ability to interact professionally with a diverse group of executives, managers, and users.\nRelevant technical/functional expertise and knowledge.\nExperience with agile methodology tools such as Jira.\n\nאיזור: גוש דןShow more Report"}, {"company": "KLA", "job": "Revenue Analyst", "city": "Yavne", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=114&ao=1136043&s=58&guid=00000186e63f0629992c0b8402caed9f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_145b000f&cb=1678900300329&jobListingId=1008171542151&jrtk=3-1-1grj431q220ht001-1grj3u1k7i9hq800-10a4007d49e3d890-", "description": "Company Overview\nKLA is a global leader in diversified electronics for the semiconductor manufacturing ecosystem. Virtually every electronic device in the world is produced using our technologies. No laptop, smartphone, wearable device, voice-controlled gadget, flexible screen, VR device or smart car would have made it into your hands without us. KLA invents systems and solutions for the manufacturing of wafers and reticles, integrated circuits, packaging, printed circuit boards and flat panel displays. The innovative ideas and devices that are advancing humanity all begin with inspiration, research and development. KLA focuses more than average on innovation and we invest 15% of sales back into R&D. Our expert teams of physicists, engineers, data scientists and problem-solvers work together with the world’s leading technology providers to accelerate the delivery of tomorrow’s electronic devices. Life here is exciting and our teams thrive on tackling really hard problems. There is never a dull moment with us.\nGroup/Division\nKLA is well known for its high-performing business model which routinely produces significant profit margins and revenue. Key to supporting KLA business is the finance team that partners with corporate and global business organizations to provide expertise and guidance for developing and executing sound business models and practices. The Finance organization consists of operations and corporate finance teams. The operations finance team influences business decisions by gathering the best available operations information, distilling it and making recommendations to our management team on the best course of action. The corporate team provides a broad range of services, such as financial planning, corporate accounting, tax, industry analysis and benchmarking, internal audits, SEC reporting and merger and acquisition support.\nJob Description\nResponsibilities\n\nWe’re looking for a detail-oriented Financial Analyst to contribute to a great finance team and work cross-functionally within the company. The ideal candidate will work with multiple business functions and have the opportunity to affect the company’s overall long term financial performance.\n\nThe Division Revenue Financial Analyst will support the Division Controller and the VP/GM in driving revenue achievement. Responsibilities include:\n\nPartner with sales, operations and other divisional functions to optimize revenue plan and execution.\n\nMaintain accurate database for bookings, shipment, revenue history and forecast.\n\nPerform scenario planning and support the annual strategic planning process.\n\nSupport period close processes, preparation of financial packages and reporting.\n\nProvide analysis of business trends, such as customers, pricing, GM Analysis, etc...\n\nIdentify, support, and implement group process improvements.\n\nMinimum Qualifications\nQualifications\nBachelor's Degree or equivalent in Accounting/Finance with up to 5 years of relevant experience (with emphasis on accounting, forecasting and financial analysis).\nKnowledge of basic revenue accounting and finance principles.\nExcellent communication skill and ability to influence without direct authority.\nAnalytical mindset and ability to provide meaningful analyses that are concise and actionable.\nMust be hard working, have a positive attitude and willingly contribute to a team.\nAbility to meet deadlines, perform under time pressure, cope with the fast-pace environment, prioritize and multi-task.\nComfortable working in an ambiguous environment and be flexible to constant change.\nOpenness to learning and looking for ways to improve.\nWorking knowledge of revenue accounting standards preferred.\nAdvanced Excel skill and working knowledge of ERP systems.\nExperience working on TM1/SAP an advantage.\nFluent English.\nWe offer a competitive, family friendly total rewards package. We design our programs to reflect our commitment to an inclusive environment, while ensuring we provide benefits that meet the diverse needs of our employees.\nKLA is proud to be an equal opportunity employerReport"}, {"company": "Riskified", "job": "Finance Operation Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=115&ao=1136043&s=58&guid=00000186e63f0629992c0b8402caed9f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_17efe5c2&cb=1678900310084&jobListingId=1008382669675&jrtk=3-1-1grj43ad5k62n801-1grj3u1k7i9hq800-76ee58402247e030-", "description": "About Us\n\nRiskified empowers merchants and shoppers to realize the full potential of eCommerce by making it safe, accessible, and frictionless. Our global team helps the world's most-innovative eCommerce merchants eliminate risk and uncertainty from their business. Merchants integrate Riskified's machine learning platform to create trusted customer relationships, driving higher sales while reducing costs. Riskified has reviewed hundreds of millions of transactions and approved billions of dollars of revenue for global brands and fast-growing businesses across industries, including Wayfair, Wish, Peloton, Gucci, and many more. As of July 29th, 2021, Riskified has begun trading on NYSE under the ticker RSKD.\nAbout the Role\n\nRiskified's Finance team is hiring a Finance Operation Analyst to join our fast-growing company. In this role, You will be responsible for planning and analyzing the company's financials to ensure accurate recording and enable educated decision-making, and ongoing monitoring. Working with various teams on controls and accounting infrastructure to support the company's rapid growth and expansion. This is a rare and exciting opportunity to join a successful and growing company. We're looking for a sharp, technically oriented, and highly motivated person who wants to make a significant impact and join a dynamic, cross-functional team.\n\nWhat You'll Be Doing\nGenerate target vs. actual analysis, investigate and explain key variances, trends, and drivers.\nProvide support for the annual planning and financial forecasting processes.\nPrepare presentations and analyses for senior management on a quarterly and monthly basis.\nParticipate in the development, implementation, and maintenance of accounting policies and internal controls to comply with legislation.\nSupport and manage the current process of the monthly billing cycle.\nEnsure that detailed accounting documentation is compiled and maintained in support of relevant legal, regulatory, and audit requirements\nAssist finance with ad-hoc reporting and analysis\nQualifications\nBachelor's degree in finance, accounting, or business (MBA and/or CPA is a big advantage)\nStrong English skills - both oral and written - MUST\nWorking knowledge of Tableau (big advantage)\nStrong analytical skills with high attention to detail\nStrong presentation skills and the ability to put together sophisticated informative presentations with minimal direction and oversight\nPrior experience in high-tech industry/start-up company (big advantage)\nAdvanced Excel / G-suite knowledge\nAbility to meet deadlines and work under pressure\nStrong collaborative team worker\n\n\nLife at Riskified\n\nWe are a fast-growing and dynamic tech company with 750+ team members globally. We value collaboration and innovative thinking. We're looking for bright, driven, and passionate people to grow with us.\n\nCOVID-19 Update:\n\nOur Tel-Aviv team is currently working in a hybrid of remote and in-office work for all our team members. We have recently moved to our new space in Tel Aviv - check it out here!\n\nSome of our Tel Aviv Benefits & Perks:\n\nEquity for all employees, Keren Hishtalmut, pension\nPrivate medical insurance, extra time off for parents and caregivers\nCommuter and parking benefits\nTeam events, fully-stocked kitchen,lunch stipend, happy hours, yoga, pilates, functional training, basketball, soccer\nWide-ranging opportunities to volunteer and make an impact\nCommitment to your professional development with global onboarding, skills-based courses, full access to Udemy, lunch & learns\nAwesome Riskified gifts and swag!\nIn the News\n\nGeektime: Riskified Goes Public\n\nWalla!: Happy Hour at the Riskified Offices\nGeektime Insider: A look at Riskified Tel Aviv\n\nGlobes: Riskified to contribute the highest amount up to date to Tmura\n\nGlobes: Riskified is among Israel's fastest growing companies\n\nTechCrunch: Riskified Prevents Fraud on Your Favorite E-commerce Site\n\nCTech: Riskified's VP HR on Post-COVID Flexible Work RoutinesShow more Report"}, {"company": "Revelator", "job": "Technical Royalty Operations Manager", "city": "Jerusalem", "date": "25d", "rating": "5.0", "link": "", "description": "ABOUT US:\n\n Revelator is a premier provider of digital IP infrastructure to music companies globally. Our cutting-edge technology and innovative solutions empower music businesses to thrive in the digital age. We are driving the music 3.0 economy forward by enhancing speed, accuracy, and transparency in rights management, digital supply chain management, and royalty distribution.\n\nABOUT YOU:\n\nWe are seeking a highly motivated and detail-oriented Technical Royalty Operations Manager to join our team. The ideal candidate will have a strong knowledge of the music industry, and familiarity with accounting principles and computer systems, experience with complex data models and system workflows, and an intermediate proficiency in SQL. Additionally, a successful candidate will have strong leadership skills, experience in financial management, and a thorough understanding of intellectual property rights and royalty distribution processes. The ability to work independently as well as coordinate with team members is essential.\n\nThis position reports to VP product.\nLocation: Remote or hybrid.\nKey Responsibilities:\n\nOversee music royalty calculations and distribution to rights holders\nAnalyze royalty statements and financial data to solve complex issues\nManage a team that collects, tracks, and reconciles royalty data and prepares financial reports\nCollaborate with operations and finance teams for efficient royalty operations and timely payments\nPlan and execute work independently and take ownership of your area of responsibility\nContinuously improve existing systems and processes to stay current with industry trends and regulations\nAdditional Responsibilities:\n\nTrack reporting and payments against timelines and forecasts\nUse SQL to query large datasets and create reports for tracking gaps in reporting\nCorrespond with internal teams on statements, payments, and advances, and develop BI dashboards\nConduct ad hoc investigations for Management decision making\nInnovate for scalable and best-in-class royalty tracking processes\nExpand knowledge of royalty reporting and processes across global income sources to identify missing income.\nRequirements:\n\nStrong familiarity with computer systems and data models\nIntermediate proficiency in SQL and working knowledge of using SQL-based databases, ideally with experience in Athena\nKnowledge of basic accounting principles\nHigh attention to detail and strong organizational skills\nAbility to work independently and in a team environment\nExperience in a music publishing or recording business with a solid understanding of licensing and rights management\nExperience presenting data to communicate a narrative and making appropriate choices in delivery and presentation\nProficiency in Excel for data analysis and manipulation\nExperience manipulating or analyzing large volumes of data and identifying gaps in data or income is essential\nSelf-starter with strong analytical and critical thinking abilities who takes initiative and can problem-solve to understand complex royalty issues\nWHAT WE OFFER\nThe opportunity to work in a fast-paced Start up environment with experienced industry leaders.\nA learning environment where you can really learn latest technologies and make an impact on the future of the Music industry.\nAn equal-opportunity oriented Work environment where every employee is respected, valued and empowered indiscriminate of race, ethnicity, gender, religion, culture...\nWork-from-home or from our offices or a combination of the two\nCompetitive Salary\nPension and Study FundShow more Report"}, {"company": "retrain.ai", "job": "Senior Bookkeeper", "city": "Tel Aviv-Yafo", "date": "10d", "rating": "4.8", "link": "", "description": "Our growing startup seeks a Senior Bookkeeper to join our team. In this role, you will manage all bookkeeping and payroll processing aspects, including maintaining employee records, calculating salaries and benefits, and ensuring timely and accurate payments.\nAs our first bookkeeper and payroll controller, this is a great opportunity to grow with the company and the finance department.\nretrain.ai is a leading provider of Talent Intelligence solutions for enterprises. Using cutting-edge Artificial Intelligence and real-time market data, our platform helps businesses hire, retain, and develop their employees with unparalleled accuracy, transparency, explainability, and bias prevention. Our innovative solutions set the standard for responsible and effective talent management in the industry.\nLocation: WeWork Azrieli Town\nHybrid work balance\nCulture: collaborate, learn, grow!\nDirect Manager: VP of Finance\nVisit our website to read more about responsible AI and why retrain.ai\n(www.retrain.ai)\nRequirements:\n\nCertified bookkeeper type 2 (type 3 an advantage)\n5 + years of experience in bookkeeping and payroll processing\nStrong knowledge of payroll regulations and tax laws\nHigh-level proficiency in excel, Priority, Shiklulit/Michpal\nExcellent attention to detail and accuracy\nEnglish - business proficiency level.\nStrong communication and interpersonal skills\nAbility to work independently and prioritize tasks in a fast-paced environment\nResponsibilities:\n\nManage the Implementation of the Priority and Shiklulit/Michpal systems.\nOwnership over bookkeeping to trial balance process.\nMaintaining accurate and up-to-date records of financial transactions, including sales, purchases, receipts, and payments.\nPreparing financial reports, such as balance sheets, income, and cash flow statements.\nProcess payroll monthly for Israeli employees, including verifying employee hours, calculating deductions, and ensuring accurate payment.\nYou will maintain accurate employee records in the payroll system, including new hires, terminations, and changes in salary or benefits.\nPrepare and distribute employee paychecks, direct deposits, and tax documents.\nEnsure compliance with payroll regulations and tax laws.\nWork Loction:\n\nHybridShow more Report"}, {"company": "Sapiens", "job": "VP of M&A", "city": "Holon", "date": "30d+", "rating": "3.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=118&ao=1136043&s=58&guid=00000186e63f0629992c0b8402caed9f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7d0ca13a&cb=1678900322924&jobListingId=1008421976787&jrtk=3-1-1grj43ofnklt2801-1grj3u1k7i9hq800-cbdc951ac733e1fe-", "description": "VP of M&A\nReq ID: 51363\nLocation:\nHolon, IL\nLocation: Holon, Israel\n\n*** We work in a hybrid working model (work from home a few times a week) ***\n\nAbout Us\nSapiens International Corporation (NASDAQ and TASE: SPNS) is a leading global provider of software solutions for the insurance industry, with a growing presence in the financial services sector. We offer integrated core software solutions and business services, and a full digital suite for the property and casualty/general insurance; life, pension, and annuities; and reinsurance markets. Sapiens also services the workers’ compensation and financial and compliance markets.\nOur portfolio includes policy administration, billing, and claims; underwriting, illustration and electronic application; reinsurance and decision management software. Sapiens’ digital platform features customer and agent portals, and a business intelligence platform. With a 30-year track record of delivering to more than 600 organizations, Sapiens’ team of over 5,000 employees operates through our fully-owned subsidiaries in North America, the United Kingdom, EMEA, and Asia Pacific. For more information: www.sapiens.com.\n\nVP of M&A\nThe VP of Mergers and Acquisitions(M&A) will be responsible for the execution of M&A transactions, including pre-LOI analysis, due diligence, and synergy/integration planning. This role requires a strong understanding of finance, business, and accounting principles, as well as excellent analytical, communication, and project management skills.\nThe VP of M&A will work closely with senior leadership and cross-functional teams to ensure that M&A activities align with the company's overall business objectives and drive value for shareholders.\nThis is a true opportunity to join a fast-growing corporate with a broad history and present of acquisitions and growth and shape the future of the InsurTech industry.\nReporting to the CFO and dotted line to the Head of Corporate Development.\n**Part-time jobs, employees, or freelancers on permanent contracts\nKey Responsibilities\nHands-on analysis of financial statements, budgets, and other financial data to assess the financial health and potential of target companies\nManage full due diligence processes, responsible for the different tracks and teams (Product, Business, Accounting, Tax, HR, Operations, etc..)\nConvert Due Diligence Findings into final SPA documentation (together with the Legal teams)\nSupport the Deal Structuring and Valuation\nSkills\nUnderstanding of finance and accounting principles as well as financial modeling skills\nExcellent analytical, communication, and project management skills.\nUnderstand deal structures and valuation models\nPost-Merger planning and integration – nice to have\n\nRequirements\nBachelor's degree in finance or accounting\nA minimum of 5 years of experience in M&A, with a proven track record of hands-on and leading due diligence processes\nAdvanced working knowledge and experience with a full due diligence process, documentation, and negotiation strategies\nStrong understanding of finance, business, and accounting principles\nAbility to build and maintain strong relationships with internal and external stakeholders\nProven experience and skills in team building, time management, conflict resolution, communication, briefing, presentation, and strategic thinking\nExperience working with different cultures, and strong intercultural and interpersonal skills\nAbility to work independently and in a team environment\nMBA or advanced degree in a relevant field is a plus\nPMI experience – an advantageShow more Report"}, {"company": "InspHire", "job": "Head of Video Advertising", "city": "Herzliya", "date": "30d+", "rating": "5.0", "link": "", "description": "A global ad-tech company that provides digital advertising solutions in an increasingly complex programmatic advertising ecosystem is looking for a department leader for the Video advertising solution to publishers. This position reports to the CEO of the company.\n\nThe leader will communicate and collaborate with both internal and external clients as well as act according to data-driven insights.\n\nAdditionally, will be in charge of the campaign management and growth while managing campaigns, exploring and developing new businesses opportunities with existing demand partners and publishers.\nThe ideal candidate will be a perfect combination of awesome interpersonal, leadership and analytical skills.\nThe role includes:\nWorking internally with the VP of the Media department to define strategy in 2022\nConvincing sites to implement the company's Video product\nInitiate and lead strategic projects in front of internal divisions – R&D, Product, Marketing, Finance\nPresenting the company's revenue streams & abilities to the world’s leading Video demand partners\nTrack the daily activity, Analyze and optimize campaign’s performance and Campaign troubleshooting\nStrong analytical skills using Excel or Google Sheets, including the ability to manage and analyze large sets of data coming in from multiple sources\nCustomer service, manage various sales efforts in order to meet and achieve company goals monetization KPI's\nOut of the box ongoing challenges\nGeneral characteristics required for the position:\nAt least 2 years’ experience as a Video team leader\nDeep understanding of the Ad-Tech ecosystem\nStrong negotiation skills\nExcellent written and verbal English communication and presentation skillsShow more Report"}, {"company": "Deloitte", "job": "Business Controller Lead", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=120&ao=1136043&s=58&guid=00000186e63f0629992c0b8402caed9f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_99ec23db&cb=1678900326011&jobListingId=1008447188229&jrtk=3-1-1grj43rhfkbls801-1grj3u1k7i9hq800-24ba1cf5e47a3e22-", "description": "Description\n\nDeloitte Israel is looking for a business corporate controller to join our finance team.\n\nThe successful candidate will lead the controllership team, will be involved in all the financial processing, and manage all aspects of the finance department’s daily operations.\n\nDeloitte Israel has been an integral part of the US firm since 2019 when the US-Israel member firms combination agreement was executed. The Finance team is managed on a single platform and the continuation of the finance transformation is supported through integration with state-of-the-art technology systems and processes.\n\nThe position is open to both women and men\n\nThe job is full-time and hybrid in Azrieli Towers, Tel Aviv/from home\n\nResponsibilities:\n\nManage the controllership team in Israel and collaborate with US and global finance teams across the organization\nDrive the consolidated periodic financial statement close process, implement controls, monitor changes, oversee the close execution with global teams.\nResponsible for all accounting issues, operations and activities, guide controllers, implement new processes and improve existing analysis and controls.\nOversee and review the financial data, AR, collection, AP, GL maintenance, Capex, reconciliations, allocation, FX gain/loss ect…\nManage day to day analyses and management reporting, ensure proper internal controls\nDevelop relationships with global teams\nRequirements\n\nRequirements:\n\nCPA (BIG 4), BA in Accounting, MBA (is a plus)\n10+ years experience as a controller\nMust have strong accounting knowledge and strong business perspective.\nProven experience as a controller in global company\nProblem solving skills\nStrong management capabilities and proactive leader\nTeam player – excellent interpersonal skills\nExcellent written and verbal communication skills, English and Hebrew\nExperience working with SAP is an advantage\nReporting to the VP Finance\n\nAt Deloitte, we believe that an inclusive mindset and diverse workforce are two of our greatest competitive strengths. That’s why we continue to reinforce our commitment to foster inclusionShow more Report"}, {"company": "ZIM", "job": "Executive assistant to EVP Countries & Business Development", "city": "Haifa", "date": "6d", "rating": "4.4", "link": "", "description": "We are looking for an Executive assistant to EVP Countries & Business Development that will support Medium & small countries VP execute strategy, assist in implementing working methodologies. Support and coordinate process between various functions and countries. Follow up and lead projects and process for improving countries performance and KPIs, and provide analytic support on various aspects of country’s results, nomination of new agents and partners\nMajor areas of responsibility\nProjectsSupport VP with presentations to management & BODLead ad-hoc projects with the countriesBe a professional focal point.\nCountry’s profitability improvementGain good understanding on the unique activities and circumstance of each country.Collect performance information and analyze itIdentify gaps between the Product and performance, and give recommendations for improvementHave good understanding on countries’ economies, political situation\nAssist the countries to improve the communication and cooperation with other functions\nMeeting BU’s targets\nSupport the countries’ interface with the BUAssist the countries in building their work plan and organization in order to enable the country to meet its targetsMarket and product analysis (Provide clear picture of market and competition in each country)Track the countries meeting the BU targets\nTools and procedures development\nDevelop tools and procedures to support uniformity and efficiency.Implement tools and proceduresCoordination with functions in the H/O (CS, FI, Global sales, etc.) in order to develop tools and process, that will assist the countries to improve performance.\nAnnual work plan and BudgetSupport building the annual work plan and the budget\nWork closely with regional finance on budget performance and realignment if required.Alert and give recommendations\nRequirements:\n\nAcademic education: Bachelor’s degree holder in Economics/ Business management/ Industrial management engineering. MBA- Advantage.\nMinimum 4 years of commercial and managerial experience\nHigh level of analytical skills\nAbility to generate good working relationship with senior counter parts.\nControl of office tools, Excel (Macros level) and PowerPoint in particular.\nSystems oriented.\nExperience with projects management, presentations\nHigh level of control in English language (Speaking, reading and writing). Knowledge of other languages is an advantage\nFunction:\n\nCountries & Business Development\n\nPublish in Internal Career Page:\n\nYesReport"}, {"company": "CPS Jobs", "job": "VP Marketing", "city": "Tel Aviv", "date": "30d+", "rating": "2.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=122&ao=1136043&s=58&guid=00000186e63f0629992c0b8402caed9f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a04d49c9&cb=1678900328634&jobListingId=1007017791634&jrtk=3-1-1grj43u38k24s801-1grj3u1k7i9hq800-929069eb74950b28-", "description": "תחומים: בכירים, שיווק דיגיטלי\nA leading FinTech company is looking for VP Marketing!\nYou will design, implement and monitor effective marketing strategies that align with our business goals.\nResponsibilities\nDirect management of the marketing department\nDevelop and implement a cohesive marketing plan\n\nIncrease brand awareness\nSet current and long-term goals for internal teams\nBuild relationships with media and stakeholders through creative PR strategies\nMonitor all marketing campaigns and improve them when necessary\nPrioritize marketing projects and allocate resources accordingly\nPrepare regular reports and presentations on marketing metrics\n\nConduct market analysis to identify challenges and opportunities for growth\nDefine and improve the Sales Funnel and Conversion Rate\nTrack competitors’ activities\nDevelop the company’s affiliate network\n\nדרישות:\nMinimum 5 years experience managing the marketing activities of an on-line company with over 1 million users\nProven work experience as a VP of Marketing, Marketing Director or other senior role\nDemonstrable experience designing and implementing successful marketing campaigns\nSolid knowledge of SEO, web analytics and Google Adwords\nExperience with working with USA PR firms\nStrong analytical and project management skills\nBackground in the finance/investment world- advantage\nLanguage skills\nEnglish- high level (read and write)\nOther languages- advantage\n.\n\nאיזור: גוש דןReport"}, {"company": "Teva Pharmaceuticals", "job": "Senior director, head of FP&A for Global R&D", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=123&ao=1136043&s=58&guid=00000186e63f0629992c0b8402caed9f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_930ccadb&cb=1678900330045&jobListingId=1008276788036&jrtk=3-1-1grj43vf1ncf9801-1grj3u1k7i9hq800-837e11306a4c18ac-", "description": "Senior director, head of FP&A for Global R&D\nDate: Mar 4, 2023\nLocation:\nTel Aviv, Israel, 1\nCompany: Teva Pharmaceuticals\nJob Id: 42592\nWho are we?\nTeva is a global pharmaceutical leader and the world's largest generic medicines producer, committed to improving health and increasing access to quality health solutions worldwide. Our employees are at the core of our success, with colleagues in over 80 countries delivering the world's largest medicine cabinet to 200 million people every day. We offer a uniquely diverse portfolio of products and solutions for patients and we've built a promising pipeline centered around our core therapeutic areas. We are continually developing patient-centric solutions and significantly growing both our generic and specialty medicines business through investment in research and development, marketing, business development and innovation. This is how we improve health and enable people to live better, healthier lives. Join us on our journey of growth!\nJob Description\n\nThe head of FP&A is responsible for strategic financial management, leading all financial processes and analysis for global R&D. He/she provides long-term planning for R&D pipeline that serves the company strategy. He/she works across R&D functions supporting innovative medicines, generics and biosimilar R&D projects with clear objective to boost speed, flexibility, accuracy, quality and alignment across all R&D finance functions.\nHe\\she initiates and leads complex financial processes with aim to streamline and simplify those while focusing on delivering services of greater range and value and support management decision-making.\nThe FP&A lead is a pivotal player in transforming R&D finance to support the new mode of operation in finance and GBS penetration as well as supporting design and implementation of new financial processes and systems.\nKEY RESPONSIBILITIES\nLeads and manages all financial processes (monthly/quarterly closing, Rolling forecast, AOP , LRP) and ensures adherence to reporting timelines; enhances forecast accuracy, analyzes results and proposes necessary corrective measures; ensures adherence to approved expense budgets; prepares all required financial presentations; reconciles all financials with the company's financial statements\nWorks with Global Finance to ensure compliance with all relevant external and internal accounting, tax and other finance-related regulations\nLead and manage labor economics for global R&D. Standardize and improve projects FTE's planning\nImprove planning and reporting systems and partner with IT constantly to challenge existing process in order to promote process automations, digitization and optimizations to allow faster deliveries of financial results and predictive analysis (SAC, Cfin, etc)\nEnhance R&D responsibility & accountability in forecasting and monitoring cash\nSupervises and consolidate capital expenditures plans and lead Planiswear implementation\nMines and uses financial data to generate insights/flags to enable the real-time business decision-making\nServe as liaison between corporate functions, other BU's and local teams\nLeads, manages and develop a team of 5 finance professionals\nQualifications\n\nThe employee will be a seasoned finance leader, with sound business judgment, knowledge of pharmaceutical industry and a proven track record of performance. He/she will be operationally involved, business sensitive and attuned to the urgency, pace and energy of the organization. He/she will be a leader with proven analytical skills and the ability to lead and grow relationships and help guide the global R&D finance team through financial processes in the most efficient and effective way.\n10+ years’ experience in finance of which at least 5 years in a multinational pharmaceutical company\nBS/BA degree in Finance, Accounting or an equivalent qualification. MBA in Finance or Management or CPA is preferred\nSuccessful track record in a finance leadership position\nProven experience in building high performing teams in a rapidly changing environment\nGood process skills to manage and improve complex processes cross functional\nKnowledge of Hyperion planning. SAP Financials is a plus\nExcellent interpersonal skills\nMotivates and energizes employees and colleagues\nComfortable working under pressure\nAbility to build partnerships with all levels of management and cross-functional business partners\nOrganised, flexible, self-confident, self-motivated personality\nFunction\nFinance\nSub Function\nBusiness Finance\nReports To\n\nVP finance, Global R&D and GM&P\n\nAlready Working @TEVA?\n\nIf you are a current Teva employee, please apply using the internal career site available on \"Employee Central\". By doing so, your application will be treated with priority. You will also be able to see opportunities that are open exclusively to Teva employees. Use the following link to search and apply: Internal Career Site\nThe internal career site is available from your home network as well. If you have trouble accessing your EC account, please contact your local HR/IT partner.\nTeva’s Equal Employment Opportunity Commitment\nTeva Pharmaceuticals is committed to equal opportunity in employment. It is Teva's global policy that equal employment opportunity be provided without regard to age, race, creed, color, religion, sex, disability, pregnancy, medical condition, sexual orientation, gender identity or expression, ancestry, veteran status, national or ethnic origin or any other legally recognized status entitled to protection under applicable laws.Report"}, {"company": "PayEm", "job": "Account Executive", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.6", "link": "", "description": "PayEm is a global procurement and spend management platform that automates finance processes from request to reconciliation. By reducing friction and tedious tasks for finance teams, our clients increase productivity, reduce risk and lower operating costs to contribute to business growth. This is an exciting opportunity with a rapidly growing company.\nWe are seeking Account Executive for North America and Israel. This role will report directly to the Chief Revenue Officer.\nIf you dislike the bureaucracy of a large company and enjoy the scrappiness of being part of a young, dynamically growing company, then PayEm might be for you. We have an inspiring sales culture and strive to create a positive can-do environment where the individual and team can thrive. If you want to be a part of something special and help us continue the process of building a great company, then apply now.\nRequirements:\n\n5-10+ years of quota-carrying sales success.\nEnglish is your primary language.\nExperience in selling into North America.\nWorking days are Monday-Friday. Work hours are East Coast Time zone.\nConfidence and experience in selling to the office of finance. VP Finance, CFO, Controllers, and Procurement are our primary economic buyers.\nExperience in working in a high velocity sales model.\nHave prior experience working at young rapidly growing companies.\nUnderstand the basic pillars of Value Based Selling.\nHave received formal sales training at your previous company and are well-versed in either Sandler, Challenger or similar sales methodologies.\nMust be able to build pipeline. AE candidates demonstrate and ability to build pipeline leveraging productivity tools like OutReach, marketing events, and their irrespective SDR team.\nPositive, inspiring, high energy, and a self-starter attitude with high level of written and verbal communication skills.\nGrowth minded and have the grit and attention to detail to be successful.\nProcurement and/or Spend Management experience is a plus.\nAbout The Role:\n\nConsult with Finance leaders (CFOs, VPs, Directors) and Controllers to help them achieve full visibility and better control over all non-payroll company spend.\nSource, progress, and close new mid-market and enterprise accounts through a consultative and insight-driven sales approach.\nWork closely with the CRO, SDR team, Solutions Engineers, and Value Engineers to drive the business.\nWork closely with Customer Success and Marketing teams to increase customer advocacy and grow revenue of existing accounts.\nProvide valuable input into the product roadmap and be the voice of the customer for the product management and engineering teams.\nEvangelize PayEm through prospecting, working with tech partners, and attending conferences and events.\nKnow the product and competitive landscape.\nNavigate complex deal cycles with multiple stakeholders.\nManage & forecast your pipeline accurately through SFDC.\nClose business! Have fun!Report"}, {"company": "InspHire", "job": "Bookkeeper/Finance Assistant", "city": "Herzliya", "date": "30d+", "rating": "5.0", "link": "", "description": "We're looking for a Bookkeeper/Finance Assistant to join a digital publishing house that owns and operates a collection of highly successful humor and entertainment websites.\nIn this role, as the right hand & assistant to VP finance you will be part of the Finance and Accounting team. The role requires a very detail-oriented person, responsible and accountable of the financial duties, outstanding attention to detail with excellent organizational skills\n\nWhat will you actually be doing?\nRecording daily financial transactions.\nPrepare and manage payments cycle to Local & Global vendors.\nTrack bank account balances and perform bank reconciliation.\nTravel reports and personal expenses reimbursement.\nSupport in EOM closing.\nPerform other bookkeeping and accounting tasks as requested.\nWork in a multi-currency environment.\nSkills & Requirements\nCertified Bookkeeper (Type 2) – Mandatory.\nAt least 2-4 years’ experience of bookkeeping (global company - Advantage).\nAdvanced English level (both spoken and written) – Mandatory.\nAdvanced skills in Microsoft Excel / Google Spreadsheet – Advantage.\nOrganized, pay attention to details and accuracy – Mandatory.\nKnowledge in Sap Business 1 and/or QuickBooks – Advantage.\nAbility to work independently in a fast-paced environment.\nAbility to prioritize workload.\nAbility to work in a team and be a team player.\nFull time positionShow more Report"}, {"company": "Sensibo", "job": "Senior Bookkeeper", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=126&ao=1136043&s=58&guid=00000186e63f0629992c0b8402caed9f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_fbdd8121&cb=1678900336215&jobListingId=1008345557493&jrtk=3-1-1grj4451dg2en801-1grj3u1k7i9hq800-a64cde5e87e990d4-", "description": "Job Description\nWe are looking for a passionate and seasoned Senior Bookkeeper to join our Tel Aviv team. (Hybrid work schedule)\nAs Senior Bookkeeper, you will report directly to our VP of Finance and will oversee all of the accounting functions and collaborate on all of our global accounting needs.\nAdditional responsibilities will include: General ledger, consolidation, and reporting of financial results, leading an annual audit, optimization of processes, and internal control. Our ideal candidate will be able to adapt to a high-growth organization to drive operational execution.\nResponsibilities\nMonthly/Quarterly Close: Ensure the timely and accurate preparation of account reconciliations, analysis and presentation of the monthly consolidated financial close. Additionally, assist in the preparation of financial reporting\nGeneral Accounting: Manage general ledger and all sub-ledgers. Maintain the company's overall system of accounts, books, and records on all company transactions and assets.\nManage and implement technical accounting and tax pronouncements and stay current and adopt all new technical accounting pronouncements\nAudit: Manage the day-to-day audit process including the preparation of support, Financial Statements and interactions with the external audit firm\nWorking closely with the Operations team to monitor manufacturing forecasts, ongoing costs including shipping costs and inventory costs\nPolicies, Procedures and Internal Controls: Work with the team to develop and implement accounting policies and procedures as required with a focus on driving efficiencies through effective and efficient use of our accounting systems\nFinancial Management: Work closely with the VP of Finance to manage the financial results of the business\nProvide oversight and support for the management of department-level operating expenses\nFamiliar with the implementation of ERP systems\nManage our cash flow and banking operations\nManage European VAT and US Sales Tax issues\nPayroll: Process Israeli payroll and benefits administration\nRequirements\n3+ years of relevant experience in finance-related roles at a global hi-tech startup\nBachelor’s degree in Accounting. Bookkeeping or Finance\nAccounting degree or equivalent skill level/ experience required\nProficient level of English, spoken and written required\nStrong knowledge of accounting and ledger systems\nExperience with ERP systems\nStrong understanding of accounting methods\nFP&A experience is very helpful and a big plus\nOther perks\nGreat work environment\nCentral location in Ramat Gan (near the train station)\nFlexibility and good work-life balance\nOptions plan\nWorking at Sensibo\nWe are a dedicated team working together towards solving a big challenge, developing our skills and fulfilling ourselves.\nSensibo is a fast-growing startup with a unique vision. We are building a first-class indoor climate and air quality consumer brand with international reach. We are launching new products and services in indoor air quality and climate control. We strive to make a real impact by supporting the green transition and zero carbon vision, by enabling customers to save energy, increase their comfort and improve their health.\nJoin us to make a real impact on the lives of millions around the world, and have fun while doing it.Show more Report"}, {"company": "Nisha", "job": "Corporate Treasurer", "city": "Central", "date": "30d+", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=127&ao=1136043&s=58&guid=00000186e63f0629992c0b8402caed9f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d5274ce3&cb=1678900337781&jobListingId=1008361132097&jrtk=3-1-1grj447032inq001-1grj3u1k7i9hq800-94063953fbf065a5-", "description": "תיאור המשרה:\nלחברה טכנולוגית מובילה דרוש/ה Corporate Treasurer לתפקיד מאתגר הכולל אחריות על פעילות שוטפת של הגזברות, כולל ניהול לוחות זמנים, מימון סחר בינלאומי, פיתוח מערכות IT תומכות וניהול קשרים עם מוסדות פיננסיים. כפיפות ל VP Business Finance and Corporate Treasury.\n\n\nדרישות התפקיד:\nתואר ראשון בכלכלה / חשבונאות / דומה\n\nלפחות 8 שנות ניסיון בתפקיד Corporate Treasurer - חובה\n\nניסיון ניהולי - חובה\n\nניסיון בארגון גלובלי וציבורי - יתרון משמעותיShow more Report"}, {"company": "INSIGHTEC", "job": "Operations Cost Accountant", "city": "Haifa", "date": "30d", "rating": "4.1", "link": "", "description": "What you will be doing:\n\nBusiness partner for VP Operations and operational leadership Develop and implement structured costing model and systemization of our manufacturing process.\nCost roll-up process - Periodic update of products standard costs and ongoing analysis of actual production costs and BOM structure\nControl and monitor operations and logistics budgets\nInventory and COGS variances analysis (PPV, Scrap and count variances)\nPrepare financial models to support decision making (Turnkey, vendor selection)\nSupport accounting close including COGS analysis and inventory valuation, including excess and obsolescence accruals\nImplementation of digital solutions for improving financial operational processes and dashboarding\n\nWhat you have:\n\nBachelor's Degree in Economics, Finance or Accounting.\nAt least 4 years of cost accounting experience in a global cooperation, preferably in medical device\nExperience in analyzing, tracking, and reporting processes\nTangible, hands-on experience with ERP planning and reporting systems and BI (Priority, Qlik)\nExcellent Excel and Power Point skills\nEffective leadership and demonstrated problem solving skills\nStrong English written and verbal communication skills\nAnalytical & process oriented\nPersonal organization and self-management\n\nAdvantages:\n\nBeing introduced by an Insightec employee\nFamiliarity with costing in Priority\n\nLet us introduce ourselves\nInsightec is a growing medical technology company transforming patient lives through innovative incisionless surgery. Based on two decades of clinical experience and research and development, the company's Exablate® Neuro platform focuses sound waves, guided by MRI, to provide tremor relief to patients with Essential Tremor and Tremor-dominant Parkinson's Disease.\n\nResearch for future applications in the neuroscience space is underway in partnership with leading academic and medical institutions.\n\nWe are a global team united by a common vision to transform healthcare by making focused ultrasound a standard of care for patients. Our culture is built on Our Values of integrity, team, quality, innovation and patient care. We challenge and empower our people to be great at what they do and leverage our different ideas, skills, interests and cultural backgrounds to succeed.\n\nAfter a recent investment round, Insightec is valued at more than $1B, bringing it to unicorn status. We are over 350 strong in Haifa and K. Ono in Israel, Miami, Dallas, Shanghai and Tokyo.\n\nDo the most meaningful work of your career by joining us in our mission to make the impossible possible.\n\n\nInsightec is an equal opportunity employer and is committed to a safe work environment free from discrimination, where employees are treated with dignity and respect. Insightec does not discriminate against any employee or applicant on the basis of race, color, religion, national or ethnic origin, sexual orientation, gender identity or expression, age, disability or other characteristics protected by law. We adhere to these principles in all aspects of employment including hiring.Show more Report"}, {"company": "", "job": "Associate Director of Finance and Operations", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=129&ao=1136043&s=58&guid=00000186e63f0629992c0b8402caed9f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_cf53df22&cb=1678900340925&jobListingId=1007153533733&jrtk=3-1-1grj44a3sk61j801-1grj3u1k7i9hq800-31a866a2acb133ee-", "description": "M²: The Institute for Experiential Jewish Education’s mission is promoting a proud and inspired community of Jewish educators who possess the personal and professional capacities to help learners find meaning and relevance in Jewish life. We run a broad range of training programs for in-service educators and consulting services for education and resource development for educational organizations. These programs and services primarily take place in North America, though M² has a growing presence in Israel and Europe.\nM² seeks to learn, grow, share, and make real change in the field of experiential Jewish education. With offices in both New York and Israel, we are a nimble, cutting edge and incredibly warm team that sits in both New York and Israel. Our work is guided by our five organizational values: generosity, humility, rigor, innovation, and integrity.\n\nM² is an Equal Opportunity employer.\n\nPersonnel are chosen on the basis of ability without regard to race, color, religion, sex, national origin, disability, marital status or sexual orientation. We are committed to building a team that represents a diversity of backgrounds, perspectives, experiences and skills.\n\nApply here: https://www.thesabidot.com/m2-finance\nThe deadline for application is July 18th.\n\nPosition Overview\n\nM²: The Institute for Experiential Jewish Education is seeking an experienced, self-motivated Assistant Director of Finance and Operations. Reporting to the Vice President of Finance and Administration, the role will provide support for all operational and financial aspects of the organization, for both our Israeli חל\"צ and our US 501(c)3. The position requires at least three-days per week in our Jerusalem Office.\nAs our Assistant Director of Finance and Operations, you are a self-starter, passionate person who thrives working in a rigorous, creative and fast-paced environment. You are proactive and resourceful and willing to perform all the tasks associated with being part of a growing team. You are comfortable managing small to large scale tasks and your attention to detail doesn’t inhibit your appreciation for seeing the bigger picture. You are detail oriented, have excellent interpersonal skills, highly attentive to even the most minute details, and interact easily with people from diverse backgrounds and sectors.\nJob Responsibilities\nFinance\nAssist the VP of Finance and Administration in all areas of financial management, payables and receivables, procurement, and financial reporting.\nProvide support for various projects throughout M² departments, specifically tracking of payments, invoicing, and contracts\nProvide support and management of organization-wide and project specific budgets and manage accurate reporting processes.\n\nOperations\nCreate and maintain excellent filing and tracking systems for agreements and MOUs between the organization and external vendors / personnel.\nManage relationships with key vendors, including accounting and bookkeeping firms in Israel and the US.\nDevelop and manage operational / technical systems and software’s to support all departments\nSupport HR related tasks such as regular updates of organization wide policies, vacation and sick days and more.\nSkills and Qualifications\nAs a prerequisite, you believe in the values of M² and be driven by its mission. You possess:\nMinimum 3 years proven experience with financial administration or operations.\nEnglish as a mother tongue, spoken Hebrew a plus\nUnderstanding of basic bookkeeping and accounting payable/receivable principles\nExperience in budget management, customer service orientation and negotiation skills\nExperience in creating and managing agreements and contracts with vendors and clients\nTechnical knowledge of online web-based type systems – such as Dropbox, Zoom, Google\nProficiency in multiple software platforms, including MS office and Apple.\nExperience with accounting/financial systems a plus\nSuperb communication skills both for internal and external communications\nDiscretion and confidentiality\nAbility to manage, prioritize and follow through on a wide range of tasks\nAbility to thrive in a fast-paced and creative work environment\nFlexible work style with the ability to work under tight deadlines and with shifting priorities\nA positive attitude; you know how to work within a team and are open to continuously learning & growing\n\nWhat M² offers\nFull time position with at least three days working from our Jerusalem office\nSalary range of 13,000-14,500 ILS/ month, commensurate with degree of position-specific experience and qualifications\nStrong benefits package including generous paid time off policy, plus Jewish and nationally observed holidays\nAn atmosphere that is guided by values, integrity, and passion\nA nimble, cutting edge and warm working environment\nA team of professionals seeking to learn, grow, share, and effect real change\n\nApply here: https://www.thesabidot.com/m2-finance\nThe deadline for application is July 18th.Show more Report"}, {"company": "", "job": "Bookkeeper / Finance Assistant", "city": "Herzliya", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=130&ao=1136043&s=58&guid=00000186e63f0629992c0b8402caed9f&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d012ebbe&cb=1678900342567&jobListingId=1008447588911&jrtk=3-1-1grj44bnama5i801-1grj3u1k7i9hq800-30e11fededba09df-", "description": "הגש מועמדות\n\nהרצליה\nמשרה מלאה\nמעל שנתיים ניסיון\nתיאור\n\nIn this role, as the right hand & assistant to VP finance you will be part of the Finance\nand Accounting team. The role requires a very detail-oriented person, responsible and\naccountable of the financial duties, outstanding attention to detail with excellent\n\nדרישות\n\nCertified Bookkeeper (Type 2) . At least 2-4 years’ experience of bookkeeping (global company - Advantage).  Advanced English level (both spoken and written) . Advanced skills in Microsoft Excel / Google Spreadsheet – Advantage. Organized, pay attention to details and accuracy. Knowledge in Sap Business 1 and/or QuickBooks – Advantage. Ability to work independently in a fast-paced environment. Ability to prioritize workload.\n\nדרושים בתחום\nחשבונאות וכספים - מנהל/ת חשבונותחשבונאות וכספים - פקיד/ת הנהח\"ש\nמאפייני משרה\nמעל שנתיים ניסיוןמשרה מיידיתמשרה מלאה\nשמור משרה\n\nשתף\n\nשלח מודעה לחבר\nעודShow more Report"}], [{"company": "Gimmonix Technologies", "job": "Product manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": "Product managerWe Are GimmonixGimmonix is a veteran travel technology company at the forefront of solving some of the most complex challenges in the travel industry and hotel distribution. In the past years we’ve been focused on PLG and Network Effect centric solutions. We’re looking for a driven candidate to join our team as a product manager. As a global company, our teams operate from various locations combining hybrid and full-remote positions.Ideally, you are a self-starter, reformed developer and a natural leader, who enjoys orchestrating feature launches through team management. The Product Manager should also come with plenty of hands-on experience and take an active part in outlining, designing, and optimizing the various products being worked on in the department.Your responsibilities will includeWithin this role you will be responsible for a full cycle of product development of the platform and its supporting applications.Identify market needs and opportunities working with existing customers, prospects, and partnersPartner with R&D, Customer success, Sales, and other stakeholders to drive market adoption and revenue growthConsolidate, rationalize, and prioritize market requirements for product planning and roadmapsWrite PRD documents, flow charts and work on requirements delivery to engineering teamsCollaborate closely with engineering leaders and their teams through all stages of product developmentChampion the team, customers and partners around a cohesive product roadmapWhat you bring to teamBe a part of an innovative environment and impact the business growth of the companyHave led or participated in launch of new products and their market validation (PMF)Working knowledge of Travel APIs with emphasis on Hotel/Hospitality vertical3+ years working in Travel tech centric companies2+ years of product management experience in high complexity productAbility to manage feature development in fast-paced, agile environmentWell acknowledged with SDLC processes and Agile methodologiesFamiliarity with business issues, ability to quickly learn, and ability to be comfortable with ambiguity, unsolved problems, and uncertaintyExcellent oral and written communication, negotiation, and interpersonal skillsFluent EnglishTechnical experience with Data Infrastructure solutions with API based services - an advantage.Experience with PLG, PMF validation and Network Effects - an advantageTravel (EMEA) may be required for on site meeting with partners and customersJob Type: Full-timeיכולת לנסוע לעבודה באופן קבוע/לעבור לגור במקום אחר:Tel Aviv-Jaffa, מחוז תל אביב: להסתמך על נסיעות באופן קבוע או לעבור לגור במקום אחר לפני תחילת העבודה (נדרש)Show more Report"}, {"company": "Confidential", "job": "Director of Brand Management", "city": "Tel Aviv-Yafo", "date": "22d", "rating": "", "link": "", "description": "You’ll be managing the dedicated business unit managers with full ownership of P&L, drive the growth of the team and business and be responsible for developing, defining, and overseeing the store managers day to day activity. Main responsibility:Laed brand managers team and work cross functionally with multiple departments on product features and goals.Create and oversee store managers business KPI’s.Working with your brand managers to establish efficient and integrated workflows and working processes: monthly KPIs, inventory planning, strategic development of the brand etc.Inspiring, steering and developing your team a 360° point of view, this includes new product development, new channel launches, content & creative development, performance marketing and supply-chain & logistics optimizationScaling your brand(s) by driving profitable growth and developing expansion strategiesAnalyzing market trends and customer needs and defining product range development and extensionPartnering with internal/external stakeholders to develop a go-to-market strategy and facilitate successful product launches and international expansionAnalyzing PPC and other marketing campaigns; optimizing conversion, click-through-rate and advertising cost of saleEnsure all activities are in compliance with applicable rules, regulations, policies and proceduresAdditional responsibilities as requestedQualifications:5+ years of experience in a highly analytical role where you led a business unit, had P&L responsibility, engaged in strategic decision-making and drove revenue and margin growth (General Manager, Founder, Product Owner)Bachelor’s degree in Business, Marketing, or a related fieldEffective leadership and coaching skillsExcellent communication and relationship skillsDetail-oriented with strong analytical abilitiesExcellent mathematical, writing, verbal and computer skillsAbility to adapt to new tasks with little noticeStrong desire to winDeep understanding of project management and driving growth initiatives across multiple cross-functional teams such as marketing, content, supply chain and technologyDemonstrated ability to problem solve as well as create and execute growth / optimization initiatives through data-driven decision makingPositive energy, collaborative attitude, “no excuses, only solutions” mindset and ability to work comfortably in a diverse and international environmentAdvantage: Exposure to managing a portfolio of products or digital brands, preferably on Amazon or ShopifyJob Type: Full-timeSalary: 12,345.00₪ - 100,000.00₪ per monthAbility to commute/relocate:תל אביב -יפו, מחוז תל אביב: Reliably commute or planning to relocate before starting work (Preferred)Report"}, {"company": "Gimmonix Technologies", "job": "Head of Account Management", "city": "Tel Aviv-Yafo", "date": "27d", "rating": "", "link": "", "description": "Job DescriptionOur Growth team at Gimmonix takes our business and products across the world. The team delivers significant revenue making a direct and meaningful impact to Gimmonix’s bottom-line and customers. The Head of Account Management is responsible for leading the Account Managers and team, who nurture existing clients by attending their requests and proactively upselling and cross selling our Solutions.Your roleYou'll have global scope and will work closely with clients technology and product management teams to develop a coherent strategy that is aligned with our brand and clients ’ objectives.You will be the voice of the customer, advocating for clients' needs. leading clients growth within our Solutions, defining and establishing the methodology of account management lifecycle.Looking for someone who’s demonstrated: strong data-driven business decisions, great team leadership and tried ability to deliver results under strict timelines. Your initiatives will expand the breadth of business, identify and develop business opportunities; lead collaboration with partners; spearhead internal cross-functional project development; and deliver on financial goals.ResponsibilitiesLeading and nurshiring new opportunities with existing clientele base, and managing Account Management team in a variety of areas such as client satisfaction, client retention and churn prevention,, account management, leading enterprise client projectsEvaluate opportunities, prioritize initiatives that encourage and lead to client usage growth of our Solutions Develop a plan for improving customer experience and drive initiatives with clients to increase business; take care of all solutions within the company to increase the connections between our network of clients.Identify potential improvements in the solutions that will lead to a higher conversion rate.Empower your team to incubate benefits that increase customer demand, are exciting for their customersDefine team and individual KPIs in the line with targetsUse data to identify, evaluate, and manage strategic business opportunities with significant potential incremental revenueOngoing communication of business performance and team progress on initiativesCo-develop a strategy with each supplier and stay aligned on goals, initiatives and targets to strengthen our external relationshipsCollaborate closely with product management, Customer support, Business Development and marketing teams .Lead deal development including prospecting, negotiating, and project development with current clients.Skills and Qualifications5-7 Years of Sales/Account Management experience in the travel industry with at least 2 years leading a team.Experience building a business from scratchExperience with travel technologyNative or close-to-native Hebrew and fluent English knowledge on a business levelExperience in an analytical role in an ecommerce, technology company, consulting, or product management preferredExtensive experience in identifying and prioritizing high-impact improvement opportunitiesExcellent communication, influencing and relationship building skillsDemonstrated ability to work through complex business problems and partner with internal clients with a consultative approach.Strong analytical/modeling skills with ability to convert raw data into actionable business insightsExcellent verbal, written and data visualization skills are a must-have.Ability to communicate in a clear and effective mannerAbility to prioritize among conflicting demands in a fluid environmentAbility to commute/relocate:Tel Aviv-Jaffa, מחוז תל אביב: Reliably commute or planning to relocate before starting work (Required)Show more Report"}, {"company": "LANDMARK COMPANIES LLC", "job": "Equity & Debt Real Estate Professional", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": "Job Description· Evaluating new investment opportunities, including funds, institutional investors, private investors and direct investments to companies’ projects· Performing due diligence evaluations of potential partners, lenders, funds, and private investors· Performing industry research, including competitor analysis for improvement company’s portfolio· Evaluate new opportunities by reviewing offering memoranda for new funds and participating in external manager meetings· Assisting company’s portfolio with business development, future funding and other strategic initiatives by raising equity· Conducting market analysis and equity opportunity identification via academic research, customer interviews, conferences, incubators· Assist in the underwriting of co-investment opportunities, including working with financial models, evaluating commercial diligence materials, engaging with industry experts· Support the team’s market mapping, initial screening and subsequent deep due diligence of potential investments· Support development of diligence materials, valuation/exit models, and Investment Memo/Scorecard to assess market sizing, talent assessment, product-market fit, key metrics/financials, capital structure, valuation modeling and exit scenarios, risks, etc.· Liaise with team members to support diligence and support the Associate team to complete the investment process· Support company’s portfolio around product strategy, talent sourcing, business development, regional market and global expansion and support for future financing· Help gather and manage portfolio performance, metrics, and financials on a Quarterly basis· Support capital raising for the firm and company’s portfolio follow-on round growth financingsDesired Skills and Experience:· 2-4 years of previous work experience, ideally with a background in venture capital, private equity, investment banking, and/or FinTech operating roles.· Strong Excel modeling and PowerPoint presentation development skills· Alignment with Fin’s values in working in collaborative teams, high integrity, merit-driven and no ego/entitlement.· B.A. or B.S. in related fieldsPay: From 25,000.00₪ per monthAbility to commute/relocate:Tel Aviv-Jaffa, מחוז תל אביב: Reliably commute or planning to relocate before starting work (Required)Show more Report"}, {"company": "Pfizer", "job": "Pharmaceutical Health Representative CV - Internal Medicine", "city": "Herzliya", "date": "24h", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_940e0573&cb=1678900349831&jobListingId=1008528444530&jrtk=3-1-1grj44ipmgahm801-1grj3ulg5gsp0800-1268c2f76e5a085a-", "description": "Pfizer Israel is looking for a Talented and Motivated Pharmaceutical Health Representative.\nIsrael (Jerusalem area)\nContract Type: Permanent\nRole summary\nThe Pharmaceutical Health Representative is responsible for calling on practicing physicians, hospitals, managed care (kupot) and other health-related organizations/personnel within an assigned territory. He / She must provide the most current information pertaining to Pfizer Israel products and their approved indications in a manner which will ensure the appropriate use of these products and achieve the business potential of the territory. Accomplishment of these goals must comply with the terms and conditions outlined in the Representatives Pledge of Ethics, Pfizer’s Policy on Business Conduct as well as sampling policies.\nRole responsibilities\nInvest time and effort to achieve the established goals for the territory such as sales, market share, doctor calls, etc.\nDemonstrate extensive product knowledge and excellent Selling skills\nAbility to work in a cross functional team, high coordination and communication abilities\nMaintain the required technical expertise including competitive product knowledge and computer capabilities\nEnsure clear concise and accurate communication of product information using proper medical terminology\nPlan and organize daily sales call activities to optimize the use of time and maximize the achievement of sales and market share objectives\nPrepare, analyze and send sales/patients scanning monthly reports (as requested by DM) in his/her territory\nRecognize changes in the work environment, develop and implement alternative plans to achieve objectives, modify call plan/business plan activities accordingly\nDemonstrate persistence to accomplish objectives despite disappointments and/or rejection of original efforts\nMake daily decisions based on logical and factual information after weighing alternatives and their consequences\nCreate and maintain a positive impression with customers\nProject a professional image as demonstrated by neat physical appearance and appropriate manner of speech\nMaintain timely communication with supervisor and other members of the sales team\nFully comply with the terms and conditions prescribed in the Sales Representatives\nQualifications\nUndergraduate degree or equivalent in science, medicine or pharmacy\nFluent in Hebrew. Working knowledge of English.\nAt least three years sales experience in the pharmaceutical sector (working with Cardiologists- advantage)\nMedical background\nStrong communication and presentation skills\nHigh self-learning ability\nExcellent PC Skills\nAbility to work within an international environment.\nResults driven\nStrong planning and prioritizing skills\nFlexible Competitive\nSelf-motivated\nReliable\nHigh ethical standards\nTeam player\nOther Info\nRequired Driving license\nPurpose\nBreakthroughs that change patients' lives... At Pfizer we are a patient centric company, guided by our four values: courage, joy, equity and excellence. Our breakthrough culture lends itself to our dedication to transforming millions of lives.\nDigital Transformation Strategy\nOne bold way we are achieving our purpose is through our company wide digital transformation strategy. We are leading the way in adopting new data, modelling and automated solutions to further digitize and accelerate drug discovery and development with the aim of enhancing health outcomes and the patient experience.\nFlexibility\nWe aim to create a trusting, flexible workplace culture which encourages employees to achieve work life harmony, attracts talent and enables everyone to be their best working self. Let’s start the conversation!\nEqual Employment Opportunity\nWe believe that a diverse and inclusive workforce is crucial to building a successful business. As an employer, Pfizer is committed to celebrating this, in all its forms – allowing for us to be as diverse as the patients and communities we serve. Together, we continue to build a culture that encourages, supports and empowers our employees.\nSales\n#LI-PFEReport"}, {"company": "United Nations", "job": "FIELD PROGRAMME SUPPORT OFFICER", "city": "Jerusalem", "date": "24h", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=106&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_94e84171&cb=1678900350916&jobListingId=1008530652409&jrtk=3-1-1grj44js32i79001-1grj3ulg5gsp0800-0e6056645ab2e917-", "description": "UNRWA, the largest United Nations operation in the Middle East with over 30,000 staff working across five areas of operation, is looking for highly committed personnel wishing to make a change.\n\nIf you are looking for a rewarding opportunity to make a tangible difference for one of the most vulnerable communities in the world, UNRWA would like to hear from you.\n\nThe Field Programme Support Officer reports to the Deputy Director of UNRWA Affairs (Programmes), or Deputy Director of UNRWA Affairs (Operations), as applicable; and to Chief, Evaluation Division for technical guidance on evaluation activities.\nResponsibilities\n- Supports programme, project and emergency appeal planning processes and provides input, within the context of relevant Agency strategic planning frameworks, into field level strategic plans and annual operational plans; builds Field capacity to assess, deliver, monitor, report on and evaluate Field interventions.\n\nManages the application of Programme Cycle Management (PCM) in his/her respective field; provides support to Programme Chiefs in carrying out all phases of PCM with due focus on project management; facilitates results-based programme plans built on evidence from evaluations and assessments and using theories of change and logical frameworks; incorporates efficient use of inputs, outcome, output and activity indicators; oversees the reporting and analysis of results data through the Agency Results Based Monitoring system, contributing to quarterly Field level management reviews, semi-annual Agency-wide results reviews and annual Agency-wide and Field specific results reporting.\nAssists the DDUA/P or DDUA/O in coordination of all programmes in the field, including health, education, relief and social services and microfinance, through an integrated and cohesive programme management framework.\nProvides guidance to the Field Office to enhance quality of project design and management and ensure effective results through capacity and skill development; manages PCM and other training courses.\nIntegrates cross-cutting themes (gender, protection, livelihoods social inclusion) with field-specific programme planning process.\nManages decentralized evaluations at the field level and supports centralized evaluations Agency-wide.\nCompetencies\nUN Core Values of Integrity, Professionalism and Respect for Diversity, and Core Competencies of Communication, Working with People and Drive for Results apply by default. Default managerial competencies may apply.\n\nCreating and InnovatingRelating and NetworkingPlanning and OrganizingFormulating Strategies and ConceptsDelivering results\nFor guidance on how to prepare for competency-based interviews: https://careers.un.org/lbw/home.aspx?viewtype=AYI\nEducation\nAdvanced university degree (Master’s or equivalent) from an accredited educational institution in programme management, public or business administration, social sciences, or a related discipline.\nWork Experience\nAt least eight years of progressively responsible and relevant experience in programme or project management, results-based management of humanitarian and development assistance programmes and monitoring and evaluation is required.\n\nA minimum of four years of relevant international work experience at a senior level is required.\n\nunless already serving as an international staff member in the UN Common System, at least two continuous years of relevant international experience outside UNRWA, and outside the country(s) of citizenship is required.\nLanguages\nExcellent command of written and spoken English is required.\nAssessment\nEvaluation of qualified candidates may include an assessment exercise which may be followed by competency-based interview.\nSpecial Notice\nType of Contract and duration: 2 years, with the possibility of further extension.\n\nThe duty station is Jerusalem, working for the West Bank Field Office.\n\nThe incumbent may be required to travel to UNRWA area of operations.\n\nApplicants have to complete the Personal History Profile (PHP) in inspira in order to be considered. The PHP should be completed with full relevant work experience as per the requirements in the Job Opening, in order to be considered.\n\nA roster may be created from the selection exercise, and successful candidates may become eligible for an appointment to the same post or a similar post.\n\nUNRWA welcomes applications from qualified candidates with disabilities.\n\nEquivalency:\nA first level university degree in combination with two additional years of qualifying experience may be accepted in lieu of an advanced university degree.\nNB: Work experience alone or formal qualifications with no relevant work experience are not considered an acceptable combination.\n\nUNRWA is funded almost entirely by voluntary contributions from UN member states, regional bodies, business foundations and individual contributions. The mission of UNRWA is to help Palestine refugees achieve their full potential in human development under the difficult circumstances in which they live.\n\nFor more details on UNRWA, please visit: https://www.unrwa.org/\nUnited Nations Considerations\nStaff members are subject to the authority of the Commissioner-General of UNRWA and to assignment by him or her.\n\n\nUNRWA is committed to achieving gender parity at all levels of staffing under the current UN-wide gender agenda and strongly encourages applications from qualified applicants from under-represented groups.\n\nAt UNRWA, the paramount consideration in the recruitment and employment of staff is the necessity of securing the highest standards of efficiency, competence and integrity, with due regard to geographic diversity. All employment decisions are made on the basis of qualifications and organizational needs. UNRWA is committed to creating a diverse and inclusive environment of mutual respect. Reasonable accommodation for applicants with disabilities may be provided to support participation in the recruitment process when requested and indicated in the application.\n\nUNRWA Considerations\n\nUNRWA staff are expected to uphold the highest standards of efficiency, competence, neutrality, impartiality and integrity. This includes respect for and commitment to human rights, diversity and non-violent means of dealing with all kinds of conflict. Only persons who fully and unconditionally commit to these values should consider applying for UNRWA jobs. Candidates will not be considered for employment with UNRWA if they have committed violations of international human rights law, violations of international humanitarian law, sexual exploitation, sexual abuse, or sexual harassment, or if there are reasonable grounds to believe that they have been involved in the commission of any of these acts. Candidates who have committed crimes other than minor traffic offences may not be considered for employment. The Agency may disqualify applicants who have separated for reason of misconduct, who left a UN Agency while misconduct processes were pending, or who appear on the UN Sanctions List.\nUNRWA is a non-smoking work environment.\n\nApplicants are urged to follow carefully all instructions available in the online recruitment platform, inspira. For more detailed guidance, applicants may refer to the Manual for the Applicant, which can be accessed by clicking on “Manuals” hyper-link on the upper right side of the inspira account-holder homepage.\n\nThe evaluation of applicants will be conducted on the basis of the information submitted in the application according to the evaluation criteria of the job opening and the applicable internal legislations of the United Nations including the Charter of the United Nations, resolutions of the General Assembly, the Staff Regulations and Rules, administrative issuances and guidelines. Applicants must provide complete and accurate information pertaining to their personal profile and qualifications according to the instructions provided in inspira to be considered for the current job opening. No amendment, addition, deletion, revision or modification shall be made to applications that have been submitted. Candidates under serious consideration for selection will be subject to reference checks to verify the information provided in the application.\n\nJob openings advertised on the Careers Portal will be removed at 11:59 p.m. (New York time) on the deadline date.Show more Report"}, {"company": "Roche", "job": "Head of Operations - Roche Diagnostics Israel", "city": "Hod HaSharon", "date": "1 day ago", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=107&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_35a07fc8&cb=1678900352602&jobListingId=1008526402321&jrtk=3-1-1grj44lg0k633801-1grj3ulg5gsp0800-c1b1c01c93cfe940-", "description": "The Position\nHead of Operations\nAre you driving by purpose, looking for an innovative, agile working environment in the healthcare sector with an impact on the society and patients? Then you have come to the right place!\nWho we are:\nRoche is ranked among the world's foremost corporations providing innovative healthcare solutions, continuously investing in medical research and development.\nAt Roche, more than 100,000 people across 100 countries are pushing back the frontiers of healthcare. Working together, we’ve become one of the world’s leading research-focused healthcare groups. Our success is built on innovation, curiosity and diversity.\nRoche is an Equal Opportunity Employer.\nThe position is for 3 years.\nROLE\nDirectly reporting to the Country Manager of Roche Diagnostics Israel, this role will be located in Hod Hasharon, Israel, and will undertake the responsibility to manage a team of approx. 8-10 employees covering Order Management, Supply Chain, Customer experience, Quality and Regulatory.\nMember of the local Leadership Team, you will drive the affiliate’s results, influencing and aligning the organization towards key initiatives, in order to reach the financial and strategic business goals of delivering patient care in Israel.\nYou will lead the teams by empowering them through agile ways of working to leverage the voice of customers.\nYou will inspire your teams to be true business partners, to go beyond the core role into cross-functional collaboration, learning and adjusting, to enable true value creation; all these while working on business processes optimization to simplify & gain efficiencies through digitalization and automation of processes.\nRESPONSIBILITIES\nResponsible together with the Country Manager for the achievement of operational profitability compatible with or in excess of company objectives.\nGuaranteeing the proper level of inventories in the Country;\nManaging the operations with the 3PL and the efficiency of customer service;\nComply and apply all quality regulations and procedures from local and global perspective;\nManage and provide metrics to improve the quality of customer service, from order taking to post market surveys;\nProperly anticipate demands, partner with customers and automate interactions between our system and the customers communication systems;\nResponsible to manage a team with high quality service by providing first level customer support for invoices, proof of deliveries and other activities;\nProvide all necessary financial insights to the Sales and Marketing teams to support adequate decision making incl. ethical business behavior and compliance.\nProvide controlling service to the organization based on financial guidelines from regional/global organization and local regulations.\n Co-own business decisions from the finance side, monitoring the results through genuine business collaborating.\nLead the local Operations organization toward embracing and implementing agile principles.\nManage the performance, development & succession of the department according to Roche practices/values.\nYOUR PROFILE\nRelevant operation experience of 7+ years in a global matrix organization, with proven abilities to inspire the team toward embracing change, challenging ways of working and improving business processes.\nPost graduate education, preferably a Master Degree with major in BA/Management, Finance or Marketing or relevant certification (e.g. CFA/CPA) is a plus\nSomeone driven by purpose, looking for an innovative, agile working environment in the healthcare sector with an impact on society and patients!\nSomeone who is passionate about finance, people development and business partnering, while having a customer-centric approach.\nPositive mindset and focused on value adding activities, around the customer journey.\nProven desire and ability to work in an agile organization, embracing and leading change and new ways of working.\nSelf-driven and open-minded person of high integrity, with excellent interpersonal skills, paired with strong analytical mindset and a solution & result oriented attitude.\nAbility to easily manage complex situations and provide clarity.\nLeadership abilities; previous people management experience is a must, as well as experience in leading teams in a matrix / agile organization.\nExperience working cross functionally in international environments, able to connect quickly to other ‘geographies’ and to make use of the network’s best practices.\nFluency in English and Hebrew\nWho we are\nAt Roche, more than 100,000 people across 100 countries are pushing back the frontiers of healthcare. Working together, we’ve become one of the world’s leading research-focused healthcare groups. Our success is built on innovation, curiosity and diversity.\nRoche is an Equal Opportunity Employer.Show more Report"}, {"company": "Apiiro", "job": "Employee Experience Manager", "city": "Tel Aviv-Yafo", "date": "3d", "rating": "4.9", "link": "", "description": "What we're about\n\nWe're an experienced and diverse team focused on solving one of the biggest challenges CIOs and CISOs have - allowing development teams to move fast without compromising on security controls and risk management. We're looking for smart and fun people to join us and make a significant part in shaping out technology, product, and culture.\n\nWhat you're About\n\nFirst and foremost, you LOVE people.\n\nYou are passionate about creating an outstanding Employee Experience and you know how to put our employees' well-being first! You are super creative and a great team player with excellent interpersonal and communication skills (both Hebrew and English).\n\nYou have been leading global employee experience programs in Hi-tech companies for at least 5 years. You pay attention to the smallest details and love seeing the bigger picture. You enjoy collaborating with different stakeholders across the organization and always come with a positive can-do attitude.\n\nYou are an experienced event producer, whether it's parties, trips, or international kickoffs. You know how to create the greatest swag and presents that will put a smile on every team member's face.\n\nYou have the ability to manage projects in an organized manner, prioritize tasks, and efficiently harness various resources.\n\nBeing a social media ninja is a huge advantage for us\n\n\nWhat you will do\n\nYour role focuses on managing, promoting and implementing our unique culture globally while supporting the full employee lifecycle & experience, through in-person as well as virtual events and experiences.\nYou will plan, manage and lead yearly global experience plans, including all employee experience activities in the company, starting from the onboarding process, happy hours, company celebrations, employee milestones, holidays and basically every get together at Apiiro!\nYou will play an instrumental role in employees' well- being throughout their life cycle in the company\nOversee and execute on internal communication to insure that our culture and motivation continues to drive business success\nYou will partner with cross functional teams to create and manage our employer branding, while fostering effective work relationships.\nYou will create, manage and control your domain's budget, and analyze budget vs. actual controls.Show more Report"}, {"company": "DoorLoop", "job": "Senior Data Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=109&ao=1110586&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_79283b22&cb=1678900355663&jobListingId=1008440987692&cpc=14D5209370AEC984&jrtk=3-1-1grj44ogdk6eo801-1grj3ulg5gsp0800-54ca41fb4a28cc75--6NYlbfkN0Bg8kaLZpGmonnt516iCDBz1BXXYWwUs3o81vaiU99V9TLG472jvwa0fELsyMFCbJIwFfNgDGDlDNBAZocAjRsGInWfsqI9DliyMkOIGBt6VFBNKJzzVXp24PE5wDbwrWxBpc4fD0-ClI7yXJVx1azSBMNPQwI6rbbkQ0RxWJ8tAPxpRQmsfPPhcGDSxMc-9L5XEzfkuk1nVPY7VfhdyHfbbXb57F1N13EkcmwIBW39vtwmm0JHPbNECWf4hO79fPT3OguhVJCzya18Y_wfXnA5iCYXtIdhytLyvL3qnJ73xFBDTk9HHZnm-asEkvgKv6prc136ZYEM7ZAKAr7A-5gjfz1XzWkUYFJgkYjGa3HYg7onQB_3XqmoiOuZWVEzW7aLrAAJP4sSynH4EcQ-BB8oAaM_fuSITm_gHC1buTGwz7YN4orfC8vzoWmERfBb_-1y_p3FmlX2qohgwejOPf25xfdcv9t7OQe7cJ12aXD1dOp6PJv4klFAUqJsf9eNt79dMwfMWzgmnSs3KzM5l5vDDUqOnPvGQkxUNilhdzWNvmIm60qbsPmEfodDYq9DU9IghhQYnh4ad4fD4wY3U-Q9cunTHKSRSdR3EYxhBVN26A%3D%3D", "description": "About DoorLoopCertified as a Great Place to Work®, DoorLoop is a property management software used by landlords and property managers in over 100 countries.As a software company with $30M in funding, 3 offices worldwide (Miami, London, Israel), and tens of thousands of units being managed, we are one of the fastest growing tech companies.If you want to work with a team that values transparency, feedback, and growth, DoorLoop is for you.The RoleWe are looking for a super talented Senior Data Analyst to join our team in Tel-Aviv. If you are excited about what you are about to read, we invite you to apply!We are looking for someone who has a good understanding of relational databases, hands-on experience in SQL and/or Python, and data visualization tools such as Tableau and Power BI. You will be working closely with the product, marketing, customer success, and engineering teams, to improve conversions, LTV, churn, product A/B tests, and more. You will collect and analyze the data and help answer the toughest issues each team is facing in order to drive insights..Some additional qualities about you and this role:You will identify, analyze, and interpret trends or patterns in complex data sets to drive actionable insights.You will define and implement KPIs across different teams: product, business, marketing, and customer success.You will implement product features, measure their performance, and provide recommendations.Gain a deeper understanding of how customers use our product, and advise us on how to improve.You will translate product/business requirements, and create a clear visualization which \"tells the story\" using a BI tool or other platformQualifications & Requirements4+ years of experience as a Data/Business Analyst.B.S in one of the following: Industrial Engineering, Statistics, Mathematics, Economics, or a related field.An ability to understand complex business models and simplifyExperience in product analysis including working with BI events and performing A/B tests.High level of SQL is a must.Experience in BI visualization tools such as Tableau, Amplitude, or similar and performing A/B tests.Experience in data modeling, ETL development, and data warehousingTeam player, effective interpersonal skills, and good vibes. Ability to manage relationships with key partners and the ability to work independently.Experience in a fast-paced, dynamic work environment.Bonus PointsExperience in Python is a plus, but not a must.Experience working with Salesforce is a plus, but not a must.Benefits & PerksUnlimited paid time off with unlimited personal, vacation, and sick days.Annual company retreat in the US with our Miami team (all expenses paid).Career development with unlimited access to Udemy's courses and other growth opportunities.Monthly investment classes from our co-founders on how to invest your money in a diversified portfolio of real estate, stocks, crypto, NFT, & more.No micromanagement - We believe responsible people thrive on freedom.Great equipment - Ergonomic chairs, Mac or PC laptops, dual monitors, standup desks, and more.No rules - No dress code, policies, or handbooks. Just do great work & have fun!Job Type: Full-timeAbility to commute/relocate:תל אביב -יפו, מחוז תל אביב: Reliably commute or planning to relocate before starting work (Required)Show more Report"}, {"company": "lusha", "job": "Business Development Representative TLV", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=110&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_cdd69967&cb=1678900357694&jobListingId=1008343100065&jrtk=3-1-1grj44qffkblv801-1grj3ulg5gsp0800-a3efbc56254488a8-", "description": "Description\nWe’re looking for a Business Development Representative (BDR) to join our Sales Team to work towards our collective goal to empower businesses to succeed through data. The BDR will play a critical role in nurturing users of the Lusha platform, engaging and qualifying outbound sales inquiries and generating a consistent pipeline. The BDR manages the first touchpoint of the sale, and sets the tone for the sales cycle. We’re interested in hiring entrepreneurial team players who thrive in an environment where hustle, growth and authenticity are valued. If this sounds like your dream job and you’re looking to grow while pushing your boundaries in a dynamic environment, Lusha is the place for you.\nYou will:\nProactively reach out to users of the Lusha platform on an outbound basis to nurture, drive adoption, and qualify sales opportunities.\nWork closely with the Account Executive team to devise account strategy.\nDemonstrate the value of Lusha offerings through phone calls, email, LinkedIn, and other social mediums.\nAct as the subject matter expert on Lusha product offerings.\nSet walk-through sessions and demos for the Lusha sales team when a lead reaches a qualified stage.\nYou are:\nWilling to go the extra mile: Bring a memorable experience and extraordinary value to your clients.\nPassionate about making an impact: Do what you do with passion, think about the sale and what’s the best for it.\nSelf-motivated, proactive and entrepreneurial: We work in a fast-paced environment, with agile methodologies where you will be challenged every day to bring the best solution for your customers and think of new solutions.\nGreat communicator: The role requires capabilities to explain in different ways the same solution to different people .\nA storyteller - Stories constitute the single most powerful weapon in a salesperson’s arsenal.\nReady, able and willing to receive feedback: The BDR has tremendous growth potential and should be coachable and eager to learn.\nWhat do you bring to the table?\nIntellectual curiosity to understand customer pain points and needs.\nStrong and professional communication skills - written, verbal, presentation.\nAbility to persuade, lead, and confidently handle objections.\nStrong sense of urgency for reaching goals and key deliverables.\nSelf-starter mentality: act without being told what to do. Brings new ideas to the company.\nFlexibility - things change around here. FAST.\nHigh integrity, energy, and dedication.\nWhy Lusha?\nLusha connects you to your most relevant potential customers by creating simple, self-served products that provide access to meaningful and insightful B2B data. We offer ways to leverage data as an enabler for better, smarter and faster conversions at every stage of the customer lifecycle. Lusha was named Top 100 G2 Best Software Company and Top 100 Fastest-Growing product in 2020. Based in the center of Tel Aviv, Israel, Lusha is a fast-growing startup that offers its 300+ employees the opportunity to take an active role in shaping the future of the company. As one of our first hires at the US HQ in Boston, MA, you will be a founding member of the sales team, working with teammates across the globe. While all of us are dedicated to that mission, we surely know how to have a good time.\nOn the people's side, we believe in creating a caring and fun environment where our employees can be individuals and at the same time, belong to something bigger – the Lushian family. Because ultimately, that’s the key to driving growth for our employees, our company, and our customers. So, if you are customer & impact-focused, thrive in a fast-paced environment, and love working in a place that doesn’t really feel like work, this is your opportunity to become a Lushian and feel the vibes.Report"}, {"company": "Deloitte", "job": "Marketing and Business Development Marketer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=111&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0ef68246&cb=1678900366035&jobListingId=1008212208645&jrtk=3-1-1grj452kkklu4801-1grj3ulg5gsp0800-f1abb0cdcefcf7b3-", "description": "Description\n\nDeloitte Marketing and Business Development team is hiring for a unique role and searching for a talented marketer to support Deloitte technological businesses!\n\nAbout the role:\n\n Work with senior executives on marketing strategy, plans, and execution\n Create marketing content, including communications, newsletters, posts, and more (English and Hebrew)\n Plan and lead marketing projects, including events, webinars, roundtables, workshops, and more\n Build, foster, and scale meaningful relationships with leading Israeli players\n Create business development materials including client proposals, department eminence, marketing presentations, and more\n\nRequirements\n 2-3 years of experience working in a marketing role (advantage working in technologic companies)\n Experience in marketing positions at B2B companies (advantage)\n Bachelor's degree / educational background in a relevant field\n Excellent verbal and written communication skills in English and Hebrew (Fluency in both required)\n Exceptional organizational and multi-tasking capabilities\n High level of professionalism and ability to work with senior executives\n Team player with great interpersonal skills\n Proficiency in Excel, PowerPoint, and other Microsoft applications\n\nAt Deloitte, we believe that an inclusive mindset and diverse workforce are two of our greatest competitive strengths. That’s why we continue to reinforce our commitment to foster inclusionShow more Report"}, {"company": "Nexar", "job": "Technical Product Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": "Nexar is building the first over-the-top vehicle-to-vehicle network on the planet, to predict and prevent collisions. We use AI, machine vision, sensor fusion, real-time networking, and quite a few other buzzwords, to create a new, delightful, and really safe, driving experience, powered by your smartphone, with the potential of saving the 1,300,000 people who die on the road every year.On the way, we capture and understand driving the world’s roads probably better than anyone else, with drivers from dozens of countries using Nexar for their commute or as part of their job. Nexar offers its business partners data applications providing insights from the road by leveraging the knowledge extracted by performing deep analytics through deep learning at an extremely large scale (with billions of images captured per week). Nexar’s network provides crowd-sourced intelligence of how the road the world around the road looks like and how it’s changing day to day.We are looking for a talented, experienced Technical Product Manager to own and lead the full lifecycle of data applications, and the underlying data platform that powers these data applications for our automotive OEM partners.In this role, you will partner closely with engineers, designers, business leaders and our customers - to execute and deliver on Nexar’s product strategy, through entrepreneurial thinking, professionalism, teamwork, constant learning, and an appetite for success.ResponsibilitiesTechnical Product Management - Ideating, launching and iterating on Nexar’s data applications and data platform.Customer Development - Collecting, managing and responding to feedback; participating in discussions in key customer accounts; working closely with the sales and marketing teams to better understand applicability.Customer Research - Participating/guiding customer research on new areas of exploration; collecting data about our competitor’s capabilities; developing an informed point of view in regards to technology trends.Product Definition - Working very closely with engineering, research and testing teams in order to document user stories and precisely define capabilities; prioritising stories and maintaining a roadmap.Experimentation - Developing, testing and measuring hypotheses.Process Improvement - Actively implementing new ways to improve the products and processes at our growing companyRequirementsProven technical product management experience in a related B2B field, either enterprise software, packaged software, SaaS or on-demand.Track record of ownership and results, from inception to ongoing research and support, including roadmap prioritisation and delivery.Analytical understanding of business considerations and competitive landscape.Deep understanding of the technical trade-offs, architecture and unit economics of complex products and platforms, especially at a very large scale of data processing (comfortable thinking in Petabytes).Experience defining effective technical capabilities into products or solutions to address customer needs.Experience developing human-facing B2B products in areas of mobility, automotive, and mapping.Experience creating and maintaining a developer program and a family of APIs.A creative, flexible thinker - with a sense of structure. Comfortable with being out of your comfort zone.Ideally with a degree in computer science, electrical engineering or a related field.Curious. Energetic. Excellent communicator. Opinionated. Never violent.Things move fast and change fast. Keep up.Job Type: Full-timeSalary: Up to 45,000.00₪ per monthShow more Report"}, {"company": "NetHR", "job": "Business development", "city": "Raanana", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=1110586&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f79213ff&cb=1678900370157&jobListingId=1008430216898&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj456jbmfqk801-1grj3ulg5gsp0800-4fa53282caf64f7b--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNAZH0JiOdG3yc4INQKmbs5T8ANjfD1dgenyiYhglfWtyKD6dqMnHeS5MfFPZB-nsUYhuse64s3HCgb4RCgFkoTDr2oBvQ7QyZEUcdFJs9EyHuNtPABHoahqAzNlYgnYuRzMQdE8L1Txeck3WJqe2UXxCQ8VXY_J8HeL_1Zq4dBLdhb6YHkyCOvROje1PWNcJ5_HbCWgHSWDVvVhnrybGNHkhXX-rL_9PdxIKpZwdKXS4TiXEI5hmmog0xXnuzVm8qVif1PNdZlmrdCqYCDYi0AdyGbYlbm1tbcFeCgtOLWU1_wBDwtkrYrFqdlQGqL-RhakZw1GaNje9mRD3OqTb0xHwZw6lQXwvnPU0P3Vp9nJCTs48mkKFsrjDW4cIc726fa06BYD3WGPqv63kwIbey3GDTIFH-f3rCDzC_5bwV0gUzTtw9kcBf_UORF8ALcASi_UgN76rnyg6sKk2GWiWoHYn5auU3sELns0veHnD1_W25TVb-Gpa4IqgepZxm3JGMLW_JU7B-CfTufeK6kQOB-lmOiNHtJdlMWkvOwzYvBy1DgAUOg6djWb6dXkjv2VWa33ou2Yl3zNoL_ylIlD0SDFFe2Y5dXxrg4DoHFUhjABkB853ZXxo3wgPUKuDeaxKyxV7DmYMlvrqwjSdFUxI1GX-NQVlNXUgaw%3D", "description": "חברת תקשורת בינלאומית מחפשת Bizdev לתפקיד מול שווקי מזרח אירופה ואפריקה ניסיון בתפקיד בכיר בעולם הטלקום- חובה ניסיון במכירות והוצאה לפועל של תוכניות – חובהShow more Report"}, {"company": "Munters", "job": "Head of CS & Support", "city": "Petah Tikva", "date": "7d", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=114&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c4b222bd&cb=1678900371336&jobListingId=1008514612393&jrtk=3-1-1grj457ot2dhb001-1grj3ulg5gsp0800-c7630227c753715e-", "description": "Did you know that we facilitate over half of the world’s lithium battery production? And that 1 out of 7 meals worldwide have been produced in facilities equipped with our climate control? Munters has been a pioneer of sustainable air treatment solutions since 1955. Today our technology is more relevant than ever and is mission-critical for the production of medicine to the running of data centers. Together we work to support our customers in creating a healthier planet. Come work for us and be a part of this exciting journey.\nGlobal Service & Customer Success Manager\nJob Description:\nSet up and lead the Munters Global Service Division. Build global teams of customer support specialists and processes to ensure clients receive assistance with the technical aspects of products or services.\nDevelop and implement customer support processes in MIS and in the business units to increase customer satisfaction.\nAssess support statistics and prepare detailed reports on the findings in cooperation with regional local teams.\nDefine, along with the business units, how many service technicians are required and be responsible for their training.\nAid in product design and product development.\nRun product demonstrations both on customers’ sites and remotely.\nDrive digitalization internally in Customer Support.\nImplement training resources, assets, and abilities to the new global service structure.\nBridge the gap between sales, customer support, and customers.\nEnsure customers get fast time-to-value.\nAnalyze customer data to improve customer experience.\nBuild customer loyalty and reduce churn.\nImprove onboarding processes.\nEvaluate and improve tutorials and other communication infrastructure.\nHandle and resolve customer requests and complaints.\nResponsibilities:\nService business experience with digital transportation background.\nIn depth understanding of running Service & Customer Success remotely (digitally).\nExperience with providing standard services (installation & commissioning).\nExperience working in a global industry, understanding of global markets, customer behavior and expectations.\nVery driven, and not afraid of driving a transformation (build up a new way of working).\nFlexible, open minded, someone who is able to identify service disruptions and work closely with existing team to ensure the availability of products and services.\nQualifications:\nB.A degree in a relevant field\nAt least 10 years of relevant work experience\nExcellent written and verbal communication skills\nAbility to multi-task, organize, and prioritize work\nFluent in English\nHow is it working at Munters? Meet your future colleagues.Report"}, {"company": "MultiPass", "job": "Business Development Manager (Israel)", "city": "Israel", "date": "9d", "rating": "3.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=115&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d5c88f50&cb=1678900372494&jobListingId=1008511642736&jrtk=3-1-1grj458tlmfr0801-1grj3ulg5gsp0800-4f77a76a033b82f3-", "description": "As our customer numbers continue to grow, we are looking for a Business Development Manager based in Israel. We expect you to know the Israeli financial market like the back of your hand and understand the needs of local companies with cross-border business activity.\n\nYou’ll be tasked with establishing and strengthening relationships with new customers and building a network of partners locally.\n\nResponsibilities:\n\nPromoting MultiPass offering to potential customers and other financial institutions;\nSeeking out and winning new customer relationships to drive revenue and margin growth;\nIdentifying new opportunities for growth;\nExecuting a plan based on the existing strategy, tailoring and refining it to convert prospects to customers;\nParticipating in conferences / expos on behalf of MultiPass.\n\nRequirements:\n\nProven track record of business-2-business sales the designated geographical area;\nStrong payments/banking industry background with an understanding of the payments ecosystem;\nExperience across the industry;\nFocus on new business development rather than account management;\nAccountability mindset;\nFlexibility for international travel.\nBenefits:\n\nFlexible working hours with great work-life balance;\nCompetitive compensation package including performance-related bonuses;\nA perfect environment for professional growth and opportunities;\nA friendly team of internationally based colleagues.Report"}, {"company": "VMware", "job": "Senior Success 360 (S360) Customer Success Manager - Opportunity for Working Remotely , Jerusalem", "city": "Jerusalem", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6c113733&cb=1678900374271&jobListingId=1008447390448&jrtk=3-1-1grj45alck25h801-1grj3ulg5gsp0800-4d6cc3aee947b773-", "description": "Senior Success 360 Customer Success Manager\nWhy will you enjoy this new opportunity?\nDo you enjoy helping Global and Enterprise organizations achieve their business outcomes through their technology investments? If you do, we have the perfect job opportunity for you!\nAs a Success 360 Customer Success Manager, you will serve as a trusted advisor, driving a cross-functional, unified customer experience for our customers during their transformational journey with VMWare.\nUpon joining our Customer Success team, you will play a critical role in delivering the Success 360 offering for enterprise customers by enabling them to rapidly and successfully onboard, adopt and realize business value with harmonized digital and in-person engagements across the entire customer journey.\nIn the Customer Success Manager role, you will interact daily with your assigned customers, helping them to achieve onboarding and activation milestones in driving product consumption. You will also jointly develop Success Plans with each customer to align their technology objectives to business outcomes.\nAs a Customer Success Manager, you be able to create a long-term relationship with your assigned customers as you develop an understanding of the customer’s desired business outcomes, focusing on maximizing value realization across their VMware portfolio.\nSuccess in the Role: What are the performance outcomes over the first 6-12 months you will work toward completing?\nDuring the first year, you will onboard into the Customer Success role and work with your assigned customers.\nUpon joining the Customer Success 360 team, you will be guided through a well-organized four-week onboarding plan that will be prepared for you.\nAfter onboarding, you will be assigned your first S360 accounts and work to establish ongoing cadence for account meetings with the customer, the account team and internal resources to understand the customer’s current and planned VMware production adoption and use cases.\nOne month after engaging with your customers, you will be able to articulate customer key business objectives and desired outcomes and begin crafting a joint Success Plan with the customer.\nYou will establish ongoing cadence for account meetings with the customer, and orchestrate internal resources to progress toward achieving key milestones.\nYou will create your Success Plan in Gainsight and record all customer activity and milestones throughout the customer journey.\nWithin 3 months of your joining date, you will be able to present your achievements in a Quarterly Business Review using the internal tools and deliverables that we will provide to you.\nYou will collaborate with internal resources to understand customer use cases and identify opportunities for prescribing Adoption Guidance and Workshops to further adoption and consumption.\nYou will proactively monitor customer health, identify expansion opportunities and mitigate renewal risk.\nDuring months 6-12, you will continue to drive business priorities within your assigned accounts and contribute to improving the overall Success 360 practice.\nYou will develop best practices to identify and proactively solve potential process or executional challenges.\nYou will ensure best-in-class execution; Develop and implement changes in both the customer's and VMware's operations systems that directly add value.\nThe Work: What type of work will you be doing? What assignments, requirements, or skills will you be performing on a regular basis?\nAs part of the s360 Customer Manager team, you will be working throughout the S360 subscription period with several assigned and strategic customers. The activities you will perform are all aligned with the purpose of helping our customers achieve their desired business outcomes through VMware technology. You will orchestrate the adoption and consumption of the VMware technologies the customer has purchased.\nYou will also be collaborating with the broader VMware account team and specialists as you perform the following:\nYou will have a track record of experience in customer success, in an enterprise software or SaaS organization, with a proven track record of successfully managing complex customer relationship in technology.\nYou will develop excellent understanding of VMware and associated technologies.\nYou will keep track of business and technology trends seen in market and hold one or more industry certifications in areas of interest.\nYou will possess robust inter-personal skills and ability to build relationships with internal and client stakeholders (including business and up to C-suite).\nYou will have experience developing and driving business cases that outline value to customers.\nYou will develop best practices to identify and proactively solve potential process or executional challenges.\nYou will demonstrate ability to manage multiple customer accounts, projects and deadlines simultaneously.\nWhat is the leadership like for this role? What is the structure and culture of the team like?\nThe Global Success 360 team is focused on driving strategic customer outcomes, while enabling our customers to derive maximum value from their VMware solutions. We provide a unified governance model to ensure we are acting as One VMware on behalf of our customers.\nWe strive to have a diverse and unified team, one which is focused on our customers and their success while contributing to a positive team culture. We are an open team who share best practice and collaboration amongst our colleagues. We give back to each other and our communities and welcome innovation and creativity at all levels, to be a meaningful contributor in our countries and societies.\nWhere is this role located?\nFlexible: The role is considered remote (based in Germany) and working from your home office unless otherwise specified by your future manager. You may be required to travel to VMware planned events and to meet with your customers and account teams (up to 25%).\nWhat are the benefits and perks of working at VMware?\nYou will be supported with a competitive and comprehensive benefits package. Below are some highlights, or you can view the complete benefits package by visiting www.benefits.vmware.com.\nMedical Coverage, Retirement, and Parental Leave Plans for All Family Types\nGenerous Time Off Programs\n40 hours of paid time to volunteer in your community\nRethink's Neurodiversity program to support parents raising children with learning or behavior challenges, or developmental disabilities\nFinancial contributions to your ongoing development (conference participation, trainings, course work, etc.)\nWellness reimbursement and online fitness and wellbeing classes\nCategory : Services and Consulting\nSubcategory: Customer Success\nExperience: Manager and Professional\nFull Time/ Part Time: Full Time\nPosted Date: 2023-02-02\nVMware Company Overview: At VMware, we believe that software has the power to unlock new opportunities for people and our planet. We look beyond the barriers of compromise to engineer new ways to make technologies work together seamlessly. Our cloud, mobility, and security software form a flexible, consistent digital foundation for securely delivering the apps, services and experiences that are transforming business innovation around the globe. At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Shape what’s possible today at http://careers.vmware.com.\n\nEqual Employment Opportunity Statement: VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. Vmware will provide reasonable accommodation to employees who have protected disabilities consistent with local law.Show more Report"}, {"company": "Unitronics", "job": "Product Manager", "city": "Central", "date": "30d+", "rating": "2.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=117&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_25399241&cb=1678900375944&jobListingId=1007491550047&jrtk=3-1-1grj45c9bhaps801-1grj3ulg5gsp0800-862e9ea14c3fa869-", "description": "Unitronics, a global company specializes in developing controllers and automated solutions is looking for its IIoT Cloud platform an experienced Product Manager.\n\n\nKey Responsibilities:\n\nResponsible for all product aspects throughout the product lifecycle.\nWork closely with development and QA teams to ensure on-time deliveries of product releases\nProduce relevant documentation such as specifications and mock-ups\n\n\nRequired Skills and Experience:\n\n3 years of product management experience, including all steps of the product life cycle management from product vision to definition, execution, enablement and rollout\nAt least 3 years as product manager of software with SaaS delivery & business model\nProven technical expertise and know-how in web, mobile and IoT fields\nExperience working in Agile teams as a product Owner\nExcellent written and verbal communication skills in English\nStrong Technical Background\nExcellent teamwork skillsShow more Report"}, {"company": "Intland Software", "job": "R&D Student", "city": "Herzliya", "date": "7d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=118&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6b80707c&cb=1678900377444&jobListingId=1008516748477&jrtk=3-1-1grj45do22dhb001-1grj3ulg5gsp0800-fbfe06dd9a6eced4-", "description": "Our world is transforming, and PTC is leading the way. Our software brings the physical and digital worlds together, enabling companies to improve operations, create better products, and empower people in all aspects of their business.\nOur people make all the difference in our success. Today, we are a global team of nearly 7,000 and our main objective is to create opportunities for our team members to explore, learn, and grow – all while seeing their ideas come to life and celebrating the differences that make us who we are and the work we do possible.\nPTC, a global provider of CAD, PLM, IoT and AR solutions, is looking for a 3rd year Computer Science (and Mathematics) student to join our development center in Herzliya, Israel.\nRequirements:\nStrong knowledge in C/C++.\nStrong Mathematical background an advantage\nLife at PTC is about more than working with today’s most cutting-edge technologies to transform the physical world. It’s about showing up as you are and working alongside some of today’s most talented industry leaders to transform the world around you.\nIf you share our passion for problem-solving through innovation, you’ll likely become just as passionate about the PTC experience as we are. Are you ready to explore your next career move with us?Report"}, {"company": "Coralogix", "job": "Business Development Representative", "city": "Tel Aviv-Yafo", "date": "3d", "rating": "4.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=119&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0b8ca392&cb=1678900379167&jobListingId=1008523708836&jrtk=3-1-1grj45fdjncfu801-1grj3ulg5gsp0800-cefffb7beeb8a149-", "description": "Coralogix is rebuilding the path to observability using a real-time streaming analytics pipeline that provides monitoring, visualization, and alerting capabilities without the burden of indexing.\nBy enabling users to define different data pipelines per use case, we provide deep Observability and Security insights, at an infinite scale, for less than half the cost.\nWe are looking for individuals who want to accelerate their careers in sales and make an immediate impact on our European Sales Team. The BDR will play a key role in partnering with Account Executives to generate new business and support our rapid growth in the European market.\n﻿RESPONSIBILITIES\nResearch accounts within our defined target market and identifies key players (coach, champion, economic buyer) to generate interest through discovery calls, Linkedin, and email campaigns.\nConduct high-level discovery calls with Account Executives in target and prospect accounts.\nFollow-up on inbound marketing leads from trade shows, trial sign-ups, webinars, etc.\n\nRequirements\n1+ years prior BDR experience within SaaS start-ups with a proven track record of success and exceeding quotas\nPrior experience in generating new leads, conducting cold calling, and customizing emails to a specific persona/ICP\nExperience with lead generation tools such as LinkedIn Sales Navigator, Zoominfo, Salesforce, and Outreach\nExperience working in a high input and time-sensitive environment.\nWilling to work Monday-Friday\nFluent English speaker\nBonus Points: Experience selling to DevOps/Site Reliability engineersShow more Report"}, {"company": "אנטריפוינט", "job": "Project Manager", "city": "Tel Aviv-Yafo", "date": "9d", "rating": "3.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=120&ao=1110586&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_801217a8&cb=1678900380598&jobListingId=1008511844401&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj45gpbkf0k801-1grj3ulg5gsp0800-dbb167c29171c285--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tGRBbjy15RxGaEEw7KZU_HI5a6udzcwmkmD884u2NoxjUyN-AaOEC3eWW8AIMk4gcimgyjQGXQFYwYHaGbzv0qI51dh7A-XJ5GF_Go8HvScjpHiEpDbyEwKi5TYSZ2PBLm7Q2UmJkD21SfDcHEFAIExhHFZcPCZ9me2I9-0jCZ_q3aJJbb4uiuPHG0Wn6j68AdfYtTh3zGCcVmGgH9zD9OncYVe_G8jOgcqEhHDbS6qWo_2fIa23Jzcg7X8v1v9Jm1O0sMLL3IRigJMydkFMPwwKHwAWiZqz4U1bDenwNqOzscHMTV2uJqDOaUBWIXkAzVaPhOsvILIl6DgSMMeVJlJttpzJn4bQDVEwYITfG2qvsTm3UtzIGZ7KY1Y5eduq2Qfj8NH1kbHwoeqWAFCI81NeSpQ7T7-b1i3Nnk5fw58wdok94UBiPjkpfhM4War-UtVHAVHTLG9-q6xf9F1_gGtmArjdmzihG4SXM4yJVDDCaZn9uutUy4oNEwYLc5L3sdFWQGG9nKqceBdcP8rqF45JsY0iqgC5bsYFm9IevoWpao-2iObHLtDHQaEWOlwHEfM-0Tm4-eZcCeT2ZLM84RsETqqhhCc4oQYiGrIw8egQmgNwiTkL1Bk5dXAgEyf-FY1JrgEAYI1uYUUd2UF5C3jjF4QcNQ7OBi82poVuCS9ZW0Fo8HLmrlo%3D", "description": "A global insurance company is hiring! Our Project manager is part of a PjM department that leads cross-organization projects. Managing the scope, the building process of the project, the planning phase, creating an integrated work plan, promoting the stages of analysis, development, and testing. Create and executes project’s work plans and make appropriate revisions to meet changing needs The project manager manages several projects in parallel while handling and managing constraints and frequent changes per projects prioritization in a dynamic work environment.\n\nProblem Solving - proactive function who must deal with different problems and conflicts solving types The role requires integration with all of the relevant interfaces – product managers, other project managers, the R&D and testing teams, and internal customers & business partners. Ensure awareness of project status across the organization, get and keep things on track At least 3 years of project management experience with a proven track record of driving results in hi-tech organizations - Must Assertive independent leader & a team player Quick learner& Self-starter with an out-of-the-box thinking approach Strong organizational skills, negotiate and continually manage expectations under time-constrained circumstances Demonstrates ability to build strong, influential relationships English at a high level, including verbal expression abilities and drafting s in English Experience using project management systems (Asana/Monday)Report"}, {"company": "Kramer", "job": "Global Sales Chief of staff", "city": "Central", "date": "30d+", "rating": "5.0", "link": "", "description": "Who are we?\nKramer is a leading player and pioneer in the Pro AV industry. Kramer our audio-visual experiences power creativity, collaboration, and engagement.\nAt Kramer, we make award-winning, innovative, and reliable Pro AV hardware, software, and cloud-based solutions. Enterprise companies, schools, universities, governments, and military end-users trust and rely upon Kramer technologies in more than 100 countries across six continents worldwide.\nFrom AVSM to advanced cloud-based communication, collaboration and control solutions, Kramer creates audio visual experiences that are more engaging, more inclusive and more connected than ever before.\nAbout the role\nWe are looking for a passionate and experienced Global Sales Chief of staff to work closely with Kramer`s VP of Global Sales.\nThe ideal candidate is independent and self- learner, who loves to work with diverse teams and to find creative ways to conceptualize goals, translate goals into multi-faceted processes, and to drive execution and to serve as a thought partner and strategic advisor to VP Global Sales.\nTo succeed in this senior role, you’ll need to have great people skills, extensive business acumen and high ability to manage operations and projects.\nResponsibilities\nLead cross-functional strategic initiatives, facilitate special projects, and ensure action items are executed on behalf of the VP Global Sales\nOperate at a tactical, strategic, and operational level, handling the oversight of projects.\nAct as an extension of the VP Global Sales and as an information funnel, filter, and facilitator with internal and external stakeholders\nPromote team integration as well as cross-functional communication and collaboration\nManage key relationships and build a process to track and nurture key stakeholders, investors, and clients\nTrack high priority initiatives for the VP Global Sales to identify any/potential obstacles\nServe as a thought partner and strategic advisor to VP Global Sales, standing in on meetings, challenging ideas, offering a fresh perspective, and following up on action items with the team accordingly\nRequirements\nPerfect English, solid Hebrew\n5+ years’ experience working for a global tech companies in senior roles, ideally in a sales management.\nGreat at matrix management, influence, and a communication skill.\nTrusted, reliable, and highly available.\nOrganized and methodical.\nA strong data & analytical background. Great at solving problems through data, research and thinking out of the box.\nA++ player - smart, energetic, and hungry to do whatever it takes to succeed in this challenging role.\nEntrepreneurial - ambitious, self-starter, able to dive into any area of the business or product, look at the big picture and identify opportunities and issues.\nGet things done attitude - always finds a way to make things happen, scrappy and efficient with limited resources.\nExecutive presence - confident in managing up and relaying feedback to top executives.\nFlexibility - this role may require travel from time to time.\nUnderstanding of customer-centric products, operations, business development, and marketing.\nWBXBiVHYVjReport"}, {"company": "Pernod Ricard", "job": "Business Development Executive", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=122&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4b2ece4b&cb=1678900383863&jobListingId=1008351680788&jrtk=3-1-1grj45k0fnce9801-1grj3ulg5gsp0800-44f1ac4ff7dc6ade-", "description": "Key duties and Responsibilities:\nDevelop and maintain professional customer relationships within a defined territory\nTrain retail staff on Pernod Ricard brands selling story, category management and visibility standards (Golden rules)\nShare industry trends and growth opportunities\nIdentify key potential outlets to increase distribution and execution level for our strategic brands\nAchieve coverage of designated stores in line with journey plan and coverage target\nMaximize opportunities to increase SOS and incremental secondary display\nMonitor and report on in-store range compliance\nIdentify potential stores for branding and improving visibility through dedicated investment plan\nAudit in-store availability and report to the distributor- follow up on its evolution\nMonitor and report on counterfeit and parallel trade products\nAttend weekly/monthly Company meetings for brand plans and performance updates\nMonitor and report competitors' activity\nScope and perimeter:\nNumber of persons to supervise - none\nMain interlocutors outside the Group Pernod Ricard: Israeli distributors, Israeli retailers, consumers, local partners\nPerimeter of the job:\nX Local: 85% X International: 15%\nProfile\nEducation (Minimum academic level necessary):\nBusiness school or similar\nProfessional Experience (required by a new incumbent):\n3 to 6 years of experience in sales or spirits in Israel\nStrong experience in building relationships with a customer/distributor, good communication skills\nProject management (organization, planning)\nStrong integration and understanding of international business\nStrong negotiation skills\nLanguages & Other Specific Skills:\nEnglish: fluent\nMain applications on PC\nSoft skills:\nSense of ethics, entrepreneurial, resourceful, and transparent\nOpen minded, used to work in different cultural environments\nAssertive, self-starter\nResult oriented\nJob Posting End Date:\nTarget Hire Date:\n2023-02-15-08:00\nTarget End Date:Show more Report"}, {"company": "Teva Pharmaceuticals", "job": "Customer Experience", "city": "Tel Aviv-Yafo", "date": "22d", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=123&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a1a77b65&cb=1678900385467&jobListingId=1008484999283&jrtk=3-1-1grj45li7klu1801-1grj3ulg5gsp0800-0829ccc2bb6f3647-", "description": "Customer Experience\nDate: Feb 21, 2023\nLocation:\nTel Aviv, Israel, 1\nCompany: Teva Pharmaceuticals\nJob Id: 45908\nWho are we?\nTeva is a global pharmaceutical leader and the world's largest generic medicines producer, committed to improving health and increasing access to quality health solutions worldwide. Our employees are at the core of our success, with colleagues in over 80 countries delivering the world's largest medicine cabinet to 200 million people every day. We offer a uniquely diverse portfolio of products and solutions for patients and we've built a promising pipeline centered around our core therapeutic areas. We are continually developing patient-centric solutions and significantly growing both our generic and specialty medicines business through investment in research and development, marketing, business development and innovation. This is how we improve health and enable people to live better, healthier lives. Join us on our journey of growth!\nJob Description\nResponsible for managing all Teva pharma projects/opportunities in CRM.\nFilter in of technical requests under his ownership to ensure qualitative service provided to the customers in a timely manner.\nResponsible for filter in and submitting of technical requests.\nFilter out and response to customers on SR under ownership to ensure qualitative service provided to the customers.\nClose follow-up on pending service requests, in order to get a complete and accurate answer.\nCoordinate between the BUs and customers on technical requests on a daily basis.\nStreamlining and following all processes in order to obtain an optimal support/service.\nBuilding trustworthy relationships with customers, considering the various cultural backgrounds.\nFilter out and response to customers on SR under ownership.\nBack up of other team members according to predefined decision.\nCoordinating and participating TCs with customers.\nDealing with complicated issues such as complaints, long pending SRs, sensitive customers etc.\nInitiate & lead new high level ideas to be used as a service/ marketing tool to further improve the service and create an ongoing service discussion with customers.\nResponsible for sending customer notifications.\nEngage Teva pharma contacts to register and use Teva api Connect (customer portal), Provide ongoing support and training to Teva users.\nQualifications\n\nKNOWLEDGE:\nBSc in life sciences / chemistry / biology or other relevant field - must\nPrevious experience in QA/QC/RA/R&D – must\nFluent English-must, other languages- advantage\nMS office skills (e.g., excel and power point)\n\nSKILLS/QUALIFICATIONS:\nHighly motivated\nCustomer focused\nProactively thinking\nAnalytical thinking\nA team player\nFunction\nSales Support\nSub Function\nCustomer Service Support\nReports To\n\nSr Dir Commercial Operations\n\nAlready Working @TEVA?\n\nIf you are a current Teva employee, please apply using the internal career site available on \"Employee Central\". By doing so, your application will be treated with priority. You will also be able to see opportunities that are open exclusively to Teva employees. Use the following link to search and apply: Internal Career Site\nThe internal career site is available from your home network as well. If you have trouble accessing your EC account, please contact your local HR/IT partner.\nTeva’s Equal Employment Opportunity Commitment\nTeva Pharmaceuticals is committed to equal opportunity in employment. It is Teva's global policy that equal employment opportunity be provided without regard to age, race, creed, color, religion, sex, disability, pregnancy, medical condition, sexual orientation, gender identity or expression, ancestry, veteran status, national or ethnic origin or any other legally recognized status entitled to protection under applicable laws.Show more Report"}, {"company": "Rookout", "job": "Sales Development Representative", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=124&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b0ab7f2c&cb=1678900388211&jobListingId=1008428131166&jrtk=3-1-1grj45o97kf3p801-1grj3ulg5gsp0800-8dfdf04b7ec5328f-", "description": "About The Position\nDo you get a kick out of helping businesses succeed? Then you just might be our next Rooketeer! Join our highly-talented dynamic team as we pursue our vision of helping developers deliver better software.\nWith Rookout, developers can review parts of their live code on demand, even while it is running. We simplify and accelerate the data collection process and save hours (or days, or even weeks) of dev and DevOps work.\nAs our Sales Development Rep, you'll get to choose who will be the company's next clients. You will run the entire top of the funnel from choosing the strategic accounts thru speaking with C-level decision-makers and delivering those meetings to the sales reps.\nThis role gives you an opportunity to join a sales team in a growing company and grow your career.\n\nResponsibilities\nThe Sales Development Rep (SDR) works with outbound and inbound demand generation to uncover and craft new opportunities that result in closed business.\nConnecting with prospects in a variety of ways\nDocumenting daily activities\nCollaborate with our Sales and Marketing teams to strategize on named accounts.\nRepresenting Rookout with integrity and professionalism at all times in all written and oral communications\n\nRequirements\nA minimum 1 year of outbound and inbound sales experience in the SaaS/software industry is preferred\nSelling to R&D, Engineering executives and professionals preferred\nClear and polished written communication skills\nExcellent speaking/ listening skills and ability to engage prospects\nFearless attitude and hunter mentality - willing to take intelligent risks\nStrategic planning abilities\nB2B sales experience\nMethodological and organized\nWhat we offer:\nThe anticipated salary range for this role is between $45K-$65K + Variable. Actual starting pay may vary based on a range of factors which can include experience, skills, and scope\nHealth, Dental, and vision insurance are paid fully by the company for the employee\n401k\nCompany stock optionsReport"}, {"company": "Spotlock", "job": "Business Development Representative (part/full time, hybrid)", "city": "Israel", "date": "8d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=125&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6e72f421&cb=1678900389482&jobListingId=1008513537278&jrtk=3-1-1grj45pg4klvj801-1grj3ulg5gsp0800-23df0458d789f60e-", "description": "Company Description\nSpotlock is a VC-backed, early-stage startup, that develops a game-changing platform for the construction industry.\nWe are growing and looking to add talented and passionate people to our team. This is a unique opportunity to join a promising startup in its early days and work closely with the founding team in crafting the go-to-market strategy.\n\nJob Description\nYou will work with the founding team on developing new markets:\nConduct online research - identify key players, research accounts, generate interest, develop relationships with important stakeholders, and document interactions with prospects in Hubspot.\nInitiate contact with prospects through phone calls, email, and LinkedIn.\nIdentify the needs and challenges of the prospective customer, determine their interest, and schedule discovery meetings.\nWork closely with the founding team to analyze insights and develop go-to-market strategies.\n\nQualifications\nNative level of written and spoken English with excellent communication skills - a must.\nAbility to make outbound calls and send out targeted emails on a daily basis.\nStrong proficiency in cold calling with a proven track record of success.\nDesire to work in a very dynamic and agile startup environment.\nAdditional Information\nWe follow a hybrid working model that combines working from home or at the office, with flexible hours.Show more Report"}, {"company": "8fig", "job": "Product ops", "city": "Tel Aviv-Yafo", "date": "10d", "rating": "", "link": "", "description": "8fig is a growth platform built to propel e-Commerce brands to new heights with cash flow planning technology and continuous, uncapped capital. Founded by supply chain experts, our growing data-driven, client-obsessed team is driven by our purpose to democratize online retail and scale eCommerce sellers to 8-figures in revenue.\nWe are seeking an experienced and motivated Ops Manager. As an Ops Manager, you will be responsible for managing the end-to-end lifecycle of software development projects, from planning to execution and delivery. You will work closely with cross-functional teams, including software engineers, product managers, quality assurance analysts, and designers. You will be the primary point of contact for clients, ensuring that project requirements are met, timelines are adhered to, and project deliverables are of the highest quality.\nKey Responsibilities:\nKeep projects on track, solve bottlenecks, re-prioritize efforts, and analyze their impact\nDevelop project plans, including timelines, budgets, and resource allocation, and manage the project to ensure adherence to the plan.\nDefine project scope, KPIs and objectives, and communicate project status to all stakeholders, including clients, team members, and management.\nIdentify project risks and develop mitigation strategies to ensure that projects are delivered on time and within budget.\nCoordinate and lead cross-functional teams to deliver high-quality products and services that meet or exceed client expectations.\nManage project documentation, including project plans, project charters, requirements documents, status reports, and other project-related artifacts.\nDevelop a deep understanding of customer needs and market trends to inform product strategy and roadmap\nLead cross-functional teams to design, develop, and launch new products and features\nDefine and track key performance metrics to measure the success of products\n\nRequirements:\n\n\nBachelor's degree in computer science, engineering, business administration, or a related field.\nExcellent interpersonal skills\nAbility to work in a fast-paced, dynamic environment\nStrong analytical and problem-solving skills\nStrong attention to detail and ability to work with ambiguity\nExtra Points:\nExperience selling products on Amazon,Shopify,BigCommerce…\nExperience with data intensive products, Machine learning\nStrong public speaking skills, including confidence and stage presence\nIf you're still nodding your head in agreement and this seems like a good fit, don't hesitate to reach out—we're looking for you!Show more Report"}, {"company": "Novo Nordisk", "job": "Internal Communication Manager", "city": "Kfar Saba", "date": "1 day ago", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=127&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_114989d1&cb=1678900392126&jobListingId=1008526211167&jrtk=3-1-1grj45s2ekf3s801-1grj3ulg5gsp0800-dcc8b25dfb46f0a8-", "description": "Are you skilled in translating raw ideas into effective storytelling of our products, missions, and visions? Do you enjoy working in close collaboration with different key stakeholders? If you want to utilize your potential in content writing, social media management, media relations, developing an internal communication strategy, and corporate publishing, then apply and join us as Internal Communication Manager within the Novo Nordisk affiliate in Israel.\n\n\nThe Position\n\nNovo Nordisk Israel is looking for an Internal Communication Manager. In this role, you will drive the Internal Communication across Novo Nordisk Israel, Design and drive the communication strategy supporting business goals, and Strength Novo Nordisk's corporate reputation. You will be responsible for supporting the realization of the vision, strategy, and execution of relevant internal communication strategy. Proactively build and protect Novo Nordisk Israel's reputation and support Novo Nordisk Israel in becoming a sustainable employer to engage employees and to create and sustain a high-performance organization.\n\nResponsibilities\n\nDevelop and execute the communication strategy of the affiliate aligned with business priorities.\nCoordinate, structure, and plan internal communications, building a communication plan through the channels available in Novo Nordisk.\nBe part of the crisis management committee to assure proper internal communication.\nEnsure a strong company reputation and Be part of Novo Nordisk Global GCN (Global Communications Network).\nWork according to Business Ethics procedures and Work according to local law, Novo Nordisk Way, and Novo Nordisk policies & guidelines.\n\nQualifications\n\nTo be eligible for the role, you hold a bachelor’s or MBA / MA degree in communications or social sciences or political sciences, or digital & media from a university or well-recognized institute. You have 5+ years of experience in a relevant industry in a similar role with a proven track record in communication and the ability to translate business priorities into the most efficient and effective communication plan and execute the plan. You have the ability to collaborate and communicate with different stakeholders, Leadership teams, employees, customers, vendors, consultants, and cross-functional project teams.\n\nCompetencies:\n\nExcellent written and verbal communication skills, including communication across functions and strong presentation skills.\nStrong interpersonal skills, ability to lead without authority strong networking, and Out of box thinking, always eager to launch and implement new ideas.\nHave excellent project management skills and the ability to execute hands-on tasks.\nStrong strategic capabilities with demonstrated experience in analyzing complex situations into a change management communication plan.\nTeam player who can work both in a team, cross-functionally, as well as independently.\nExperience in working with media relations in a private company, public institution, or Public Relation agency.\nExperience in working in HR departments or Pharma Experience - an advantage.\nFluent in spoken and written English and Hebrew.\nProficient in PowerPoint Presentations or Canva.\n\n\nAbout the Department\n\nYou will be part of the People & Organisation department which contains an HR Business Partner, Training & Development Specialist, and Sustainability and Wellbeing Lead and you will report to Senior People & Organisation Director. Our core purpose is to be a sustainable employer and to enable Novo Nordisk to attract, retain and reward the right people in the right place through sustainable, competitive, flexible, and compliant reward practices.\n\n\nWorking at Novo Nordisk\nWe are a proud life-science company, and life is our reason to exist. We’re inspired by life in all its forms and shapes, ups and downs, opportunities, and challenges. For employees at Novo Nordisk, life means many things – from the building blocks of life that form the basis of ground-breaking scientific research, to our rich personal lives that motivate and energise us to perform our best at work. Ultimately, life is why we’re all here - to ensure that people can lead a life independent of chronic disease.\n\n\nContact\n\nIf you believe you are qualified, and are willing to take the challenge, please send your CV directly via our online application tool.\nWe thank all applicants for their interest, however, only those candidates selected for inter-views will be contacted\n\n\nDeadline\n\nApply before 01/04/202\n\nWe commit to an inclusive recruitment process and equality of opportunity for all our job applicants.\n\n\nAt Novo Nordisk we recognize that it is no longer good enough to aspire to be the best company in the world. We need to aspire to be the best company for the world and we know that this is only possible with talented employees with diverse perspectives, backgrounds and cultures. We are therefore committed to creating an inclusive culture that celebrates the diversity of our employees, the patients we serve and communities we operate in. Together, we’re life changing.Show more Report"}, {"company": "SciPlay", "job": "VIP Experience Manager", "city": "Israel", "date": "24h", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=128&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d1d791a0&cb=1678900393303&jobListingId=1008528301532&jrtk=3-1-1grj45t83g2on801-1grj3ulg5gsp0800-9b61fc1516b9912a-", "description": "DESCRIPTION\nThe VIP Experience Manager is responsible for the day-to-day work with all SciPlay game teams and stakeholders to develop and implement VIP assets to drive the mutual goals and objectives of the product and VIP operations teams.\nKEY RESPONSIBILITIES\nSciPlay is a leading developer and publisher of digital games on mobile and web platforms, providing highly entertaining free-to-play games that millions of people play every day for their authenticity, engagement and fun.\nSciPlay currently offers nine core games, including social casino games Jackpot Party Casino, Gold Fish Casino Slots, Hot Shot Casino and Quick Hit Slots, and casual games MONOPOLY Slots, Bingo Showdown, 88 Fortunes Slots, Backgammon Live, and Solitaire Pet Adventure with offices all over the world!\nThis individual will work centrally under the VIP operations to advance the projects with game team stakeholders to ensure that VIP assets, communication tools, and player rewards within the core products are of the highest quality and align with SciPlay and the VIP Operations Teams goals. This person works closely with game team product managers, GMs, developers, monetization, and Live Ops teams for each core game and is a crucial contributor in driving the future VIP Game roadmap. This role will report to the Director of VIP. They will collaborate on new initiatives to amplify VIP assets within each product while learning and leveraging our strengths against other social gaming competitors in the marketplace.\nEssential Job Functions:\nCollaborate with game team stakeholders to develop and implement VIP assets to drive the mutual goals and objectives of the product and VIP operations teams.\nProactively identify opportunities for VIP operations program improvements and continued development within SciPlay products.\nPartner with game team stakeholders to oversee the design, development, and implementation of VIP program initiatives within SciPlay products\nRegularly meet with VIP Team Managers and VIP Account Managers to continually identify areas of growth and opportunity for the VIP program within the products and initiate those efforts with game team stakeholders.\nCoordinate with VIP Account Managers, Retention Manager, and VIP Team Managers to collect player feedback about new assets, features, and content and present findings to game team stakeholders.\nPartner with VIP Data Analyst to collect and evaluate the KPI impact of new product assets from VIP players and provide actionable insights to continue to drive the VIP program forward consistent with game team business objectives\nContinually communicate with Design Team to identify features, rewards, and benefits available to VIP players on competitor products in the social casino marketplace.\nHelping Manage a queue of inbound and outbound VIP player communication in support channels (and on Facebook) for SciPlay products where a VIP Account Manager is not yet established\nMonitor and update VIP Team leadership regularly on new program efforts in the product development pipelines for each core product.\nContinually communicate with CS Team leadership to understand general player sentiment regarding new feature releases, product updates, and changes to existing game mechanics.\nAssist VIP Operation s Team leadership in the training and onboarding of Account Managers to provide insight regarding game team processes, available VIP assets, projects on the future roadmap, and VIP communication/admin tools.\nResponsible for creating at least 1 VIP contest per week, where players are challenged in the game, and prizes are awarded to the top winners.\nCreate a 1 VIP giveaway which challenges players to drive in the-game KPIs, and prizes are awarded to random winners.\nCoordinate at least 1 community contest per week.\nBoth of these should help drive opt-in growth month-over-month\nCreate a VIP Appreciation program in-game for games where one is not yet established.\nCoordinate sending and drafting of 1 newsletter per month with Account Manager (due to events, this will need to be completed together)\nPrepare post-event analysis for stakeholders within 7 days of event conclusion, including revenue analysis.\nHealth check: feedback from players, any issues experienced with event mechanics and event processes (opt-ins, payouts, communications)\nProvide monthly wrap-up of events presented during the first VIP Weekly Sync of the month.\nCreate a monthly schedule of planned events presented during the final VIP Weekly Sync of the month.\n\nREQUIREMENTS\nEducation\nBachelors degree in related field.\nYears of Related Experience\nYears of experience 5 to 8 years\nWe are SciPlay! We make games!\nThe roots of our company are simple and strong: Our founder, Aaron “Shurm” Schurman, fell head over heels for casino games and had a vision to create the most entertaining free-to-play casino games for gamers around the world. We’ve grown into a company that makes games we are truly proud of and that are enjoyed by millions of players every day. Our history is extensive, but we’re just getting started. In 1998, we got our start as Phantom EFX and in 2019, we reintroduced ourselves as SciPlay and went public on the Nasdaq.\nAt SciPlay, we are programmed to think untraditionally. From our yearly development conferences, shindigs, and new game launches, we believe in doing what you love and doing it well. We take great pride in our ability to create authentic experiences for players and we are excited to continue investing in our workforce, technology, and our data-driven approach, all with the mission of delighting our players long into the future. We believe that if we continue to stay passionate, set ambitious goals, live our values and play together, we will become the #1 social casino and casual gaming company in the world.\nA few of our highlighted perks and benefits:Competitive salariesPaid Family LeavePaid Volunteer TimeAnnual bonuses, matching 401k, stock options, and other benefitsGame Room featuring current generation consoles, numerous game titles, and various table games.Fully Stocked Kitchen with Beverages and SnacksOpen Office Concept with Ergonomic Seating and Standing DesksSummer HoursHybrid Office (Currently 1 Day In / 4 Days Remote)\nWe don’t consider the above list “Culture” though. Culture at SciPlay is MUCH MORE than just that including, but not limited to:Culture League Dedicated to Employee Engagement and FunEmployee Resource GroupsMental Health ResourcesCareer RoadmapsAnnual Company RetreatsLearning & Development OpportunitiesManagement TrainingLeadership Book ClubsEmpathic LeadershipWork Life Balance\nCompany Values:\n#beYOU\n#playTOGETHER\n#embraceCULTURE\n#levelUP\n#getRESULTS\n#justWIN\nRead More About Our Values Here:\nhttps://www.sciplay.com/about-sciplay/sciplay-core-values/\n Don’t meet every single requirement? Studies have shown that women and people of color are less likely to apply to jobs unless they meet every single qualification. At SciPlay we are dedicated to building a diverse, inclusive and authentic workplace, so if you’re excited about this role but your past experience doesn’t align perfectly with every qualification in the job description, we encourage you to apply anyways. You may be just the right candidate for this or other roles we have! #beYOU\nSciPlayers are humble. In the live environment of mobile game development, there’s no room for egos and the loudest voice doesn’t get their way here. We are diverse in our backgrounds and our experience, both professionally and personally, and we believe our differences are key to unlocking our super powers.\nSciPlay Corporation and its affiliates (collectively, SciPlay) are committed to creating a workforce of credibility and dependability. As a prerequisite to employment with SciPlay (to the extent permitted by law), you shall be asked to consent to SciPlay conducting a due diligence/background investigation on you. This job description should not be interpreted as all-inclusive; it is intended to identify major responsibilities and requirements of the job. The employee in this position may be requested to perform other job-related tasks and responsibilities than those stated above. SciPlay is an Equal Opportunity Employer and does not discriminate against applicants due to race, color, sex, age, national origin, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any other federal, state or local protected class. If you’d like more information about your equal employment opportunity rights as an applicant under the law, please click here EEOC Poster.\n#LI-ME1 #LI-Hybrid #LI-RemoteReport"}, {"company": "אר.ויי.בי. פלסמנט אגנסי בע\"מ", "job": "International Sales Development Representative -SDR", "city": "Israel", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=129&ao=1110586&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_84d91c24&cb=1678900394490&jobListingId=1008431356421&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj45ud9m6rv801-1grj3ulg5gsp0800-f8eba598d44f82ea--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNAfQ2-UsambsOBdIi4VUREUCUzrjMnocVkuIzc5JSyv3JKqAvZvfkIaUjJ1fjNjD9sM09EApmX173C16B7374l_w4mDHCGquErBWLGTAtsYXF9CqRnQe8Db64U17eEBqIuCLeiqaXyw0hjkbsU0Np0AudS-Eg06a97j2FO4m9PJ4Jc5ERFZxgdycIPEdvIsl_3JbxNTDBPuxBgotb3C_fsZBOoXKnVDWO9U4jItfcgjYxTaVC1S5QOCb8oOcKpSSKI8oE2EBA2nnCzf9OWw9KszQxH_M4FG4nVfwvQYd-GE_5GDx4Op2LL3KiAzO5OnWdtwDTGaR6U1LZDB2rtYfUMIwc_woO-8UNL6C7t7g4fst7NdPQ_jLPqtirv1S2J8vM98Y6sPW7IliekgB_OBZvbpyUySCBedTFzwpI3wk6Sa8Ud7j6Ndc9Zsb-OjHAKELOQLuh4UIW_EtZUXoV7n8obLapupXztPhGyzad5XMuN_TH4KlZ6T5r0fDUXTvZvzkHqfWp4MdSPBAxvOh-Sy9hDzFuTya9DMyCrmsXRm1bDt32qTEWpg0vAp4M1SLCK5_htqkJy7l0wWZ53QeKYXDIAH2CnlAKhceM9Kt0aYqKr_l7uuVGLqMqtYc1YmoshbYlPQ333Bvzvzce6taWk6pm2xTja9sMbKHIs%3D", "description": "We are a global company with machine-learning-based products in the mobile marketing field. We have offices and representations in Russia, India, Indonesia, and headquarters in Rehovot, and are looking for an international outbound SDR to join our global BD team. Our team works closely with some of the world's best mobile apps in different verticals such as gaming, fintech, and e-commerce, helping their growth efforts in user acquisition and retargeting, providing them with data-driven insights from our custom predictive ML models, which process over 2 million transactions a second! Responsibilities: Initiate custom reach outs based on our data-driven prospects system Qualify new business leads and sales opportunities, manage, nurture, and grow interested prospects across territories.\n\nSearch and report market trends. Work closely with CSM & product teams to accelerate business processes. Participate in conferences and commercial business events (You might need to travel from time to time) Requirements: Very High level of English. Mother tongue-great advantage!\n\nAnalytical mindset! Experience in lead generation/ outbound sales/ business development of data-driven products Great passion for sales enablement and for learning a complex ML-based product Other languages such as Russian, Chinese, Korean and more- will be a great advantage Proactivity, High energy, persistence, Results - drivenShow more Report"}, {"company": "AstraZeneca", "job": "Medical affairs learning and development", "city": "Kfar Saba", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=130&ao=1136043&s=58&guid=00000186e63f55999e524705f7c3f6e6&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b5a00d2b&cb=1678900395760&jobListingId=1008388899076&jrtk=3-1-1grj45vkkk6et801-1grj3ulg5gsp0800-e9d1768f3c83f784-", "description": "Medical affairs learning and development\nAt AstraZeneca we embrace a company culture that is personal and welcoming. It was built by our employees, is maintained by them, and is stronger because of them. It brings out the best in every one-off us and provides the framework for how we want to grow. As an organization, we are committed to delivering consistently high ethical standards of practice worldwide. We are driven by the desire to develop innovative medicines that bring hope and improve lives.\nThe position\nThe Medical affairs learning and development supports the Medical department on strategic and tactical level driven by business acumen and ecosystem knowledge. This function will support the transition of Medical Affairs into a pro-active co-creating and strategic partner for both our organization and external stakeholders.\nThe Medical affairs learning and development has to develop, maintain and deploy training and capability building programs for all positions within the Medical Department, including the onboarding of new colleagues, to meet key performance objectives.\nThe Medical affairs learning and development will collaborate directly with Medical Excellence peers and country medical teams to understand internal and external environment and dynamics at the regional and local level and related competency gaps.\nResponsibilities\nDevelop and support change management plans and associated organizational effectiveness initiatives, on ‘KPI thinking and acting’\nDevelop, maintain and deploy training and capability building programs for Medical, incl. onboarding of new colleagues:\nFocus on Medical 2.0 capabilities and behaviors\nIncl. quality and compliance standards, SOPs, processes and tools\nco-creation and co-execution of innovative solutions and propositions across the portfolio with internal and external partners on national and international level\nEnhance the omni channel and digital capabilities and platforms in collaboration with IBEX\nMonitor existing and upcoming competency gaps based on external and internal demands and translate them in training and development plans\nSupport the Medical leadership team to drive alignment and coordination of goals, priorities, and efforts across Medical Affairs, and with other groups globally.\nBe responsible for the Medical Excellence Budget.\nThe Medical Excellence Manager will report into the Medical Director AZIL.\n\n\nMust Have\n2+ years' experience of working on a L&D Manager٫ Training Manager or other relevant position\nVast experience in conducting trainings / coaching\nSignificant experience with effective learning and development methods\nProject management skills\nExperience as middle or senior management\nEntrepreneurial: combines organizational, operational, business excellence, relationship with understanding of Medical strategic priorities to act at a higher level\nProven ability to interact widely and effectively within the company across regions, functions and cultures\nAbility to set and manage priorities, resources, performance targets and project initiatives in a multinational matrix environment\nGood execution ability and self-motivation\nExcellent communications (incl. very good presentation skills) and relationship building capacity and ability to listen, understand and integrate competence needs into learning and training programs and plans\nAffinity to digital (new media & technologies) / digital, data and design-thinking\nAdditional Capabilities\nCompleted degree in life sciences or comparable: Medical Doctor, pharmaceutical or biomedical degree or equivalent by experience\nWorking experience in the pharmaceutical industry relevant for this function (e.g. Medical Affairs, Sales & Marketing Management, Market Access, public affairs, Learning & Development and/or a health care analytics/services organization within the pharmaceutical industry)\nGood problem solving and conflict resolution skills\nNext Steps – Apply today!\nTo be considered for this exciting opportunity, please complete the full application on our website at your earliest convenience – it is the only way that our Recruiter and Hiring Manager can know that you feel well qualified for this opportunity. If you know someone who would be a great fit, please share this posting with them.\nAstraZeneca is an equal opportunity employer. AstraZeneca will consider all qualified applicants for employment without discrimination on grounds of disability, sex or sexual orientation, pregnancy or maternity leave status, race or national or ethnic origin, age, religion or belief, gender identity or re-assignment, marital or civil partnership status, protected veteran status (if applicable) or any other characteristic protected by law.Show more Report"}], [{"company": "Schindler - Your Finance Team", "job": "חשב לחברת סטארט אפ", "city": "Raanana", "date": "21d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=101&ao=1110586&s=58&guid=00000186e63fbe76bce51d8ef930ef5c&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e688d014&cb=1678900398693&jobListingId=1008485478879&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj462hbkbkq801-1grj3vfmdi38u800-2a3ae69670fd383c--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNAO5_ZsnqAeIoCS8tMz_N53vSD3wHFKl87WAIkEpPx8qtFAyfxLY-xBCq04w8RgTAiihbzbI2E-XnXLnqhnvNzbScqUoPpoJ8JdXP-BBpXJJInEy4Cv6Aw0UMcOnHkm_dm-0XJ28aqN_M6cReAypnlJXfWVcKKPSz3p4oJJwaleW193GS0GwBNEz5s6q33B4aJLq9-7IaRaFQKhavJrw_G91vNWLcfTFAic7ibKZbN8GtIDnRvcepr22teTuDsVcINivAXaseZtZFjM-kJrmJJB0QHUjlFbesPVBV_3ior1zazLD9m5l22SO0L_sv7vnShKFpT2OvmFtoyoqlKJSFy33dA6Emg8zdhgMzvkivZuAFFGe0XhPoj-tsMJ7pib5pAWufnh-f6T8gJJMOLlG1Yfrar75Pg5s9qnOO_gtFo_6KjuBpczyiWOfTGleZYF9m8mtrN6hqC2UtqFxR8-mX176_OizFHZcSLCCvoeQNeJodoeOkF_eLga6No5FTpKi1FYK-VVg3Mnr2IpvOS7JYrMQw9ynjput2eBaAeBR00rKcZsmuvsw0xi3ZjUkvHJKZ5zvatzQlcO0mUs6PT3XJl7kw97u4UwYpvAvZbxxPtqL4MuwTycbGMOazGeRDb6fAHmN-OLu39Y6gwGGTbtrql1CDL_4ItiBgU%3D", "description": "\"Schindler-Your Finance Team\" is a leading financial services firm that manages the financial operations of startups, multinational companies, and research and development centers. We are looking for a highly motivated, independent controller to be a part of our dynamic team. Location – Petach Tikva Responsibilities: · Managing the day- to -day finance operations · Responsible for monthly, quarterly and annually financial closing process · Prepare financial reporting packages in accordance with US GAAP · Assist in cash flow management (payments and collections) · Support the work of bookkeeping department to ensure accuracy of financial records · Liaise with the banks, government agencies and offices as necessary Requirements: · Bachelor's degree in accounting or finance - required · 3+ years of experience in the tech, finance or fintech industry · Experience with US GAAP and multi-national company experience · High level English and Hebrew · Familiarity with ERP system – Priority · Strong attention to detail, the ability to multitask and a high level of accountability · Willingness to learn and go beyond defined job scopeShow more Report"}, {"company": "365scores", "job": "Controller", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "", "description": "365Scores is a global sports technology hub providing real-time results, in-depth stats, original content, customized news feeds, and more. Our mission statement is to make fans' experience better, more accurate, and more fun. We are located in Tel-Aviv with offices in Hong Kong, London and São Paulo, almost 100 employees world wide and growing.\nWe are looking for a finance controller to join us. Ideally right after a full intership at one of the BiG 5 firms .\nYou’ll enjoy a friendly, innovative, and creative atmosphere in a fast-growing and dynamic startup company.\nAs a Controller you will oversee a company's financial records, manage the day to day operational activity, work with bookkeeping teams, optimizing financial processes and controls, support statutory audit for several entities and other ad hoc projects required in the finance team.\nThe position is located in Tel-Aviv\nRequirements:\n\nBachelor’s degree in Accounting from a university or a leading college - a must\nLicensed CPA - a must\n2 years experience from one of the BiG 5 firms\nExcellent Excel skills\nDetail-oriented with superior analytical and problem-solving skills\nStartup mentality, roll up your sleeves attitude\nSelf-motivated and proactive\nStrong communication skills and service orientation\nA team player with good interpersonal relations\nWork level proficiency in English and Hebrew (both verbal and written)\n\nResponsibilities:\n\nSupport many aspects of accounting management (review of journal entries, invoices, payments, monthly closure, billing, etc.).\nOversee the daily financial operations of the company\npreparations of consolidated financial statements\nOngoing financial planning and management of the company’s budgeting processes\nEnsure the timely and accurate preparation and filing of the company’s financial reports\nWork closely with outside bookkeepers (Israeli and foreign) and payroll controllers on day-to-day financial operations, including payroll, AP, and AR processes.\nProvide comprehensive financial updates to management by evaluating, analyzing, and raising flags as needed.\nWork with the company's external auditors on quarterly reviews/ annual audits\nsupport Ad-hoc financial projectsReport"}, {"company": "bluewhite", "job": "Controller", "city": "Tel Aviv-Yafo", "date": "2d", "rating": "", "link": "", "description": "Imagine there was a platform that allows operating multiple autonomous vehicles, in the air and on the ground, across the globe, from a single location. How awesome would that be?! What if you were the one to help build it from scratch?\nBased in TLV (Sarona), Blue White Robotics is a world leader in autonomous technologies and unmanned systems.\nWe are seeking a sharp Controller to join our ranks! In this position you will report to the VP of Finance. This position will require hands-on approach. Candidates must be able to manage multiple responsibilities while managing outsourced functions to successfully and timely process all necessary accounting functions.\nThe major responsibilities of this position include, but are not limited to: Monthly financial close, production of periodic financial reports, maintenance of an adequate system of accounting records, and a comprehensive set of controls and budgets designed to mitigate risk, all to enhance the accuracy of the company’s reported financial results.\nResponsibilitiesPerform monthly and yearly closing and preparation of financial statements.Process journal entries and maintaining a General Ledger (including maintain COA).Prepare and file multiple jurisdiction tax returns.Support cash flow by preparing monthly budget reports.Oversee AR /AP and Payroll activities.Handle annual business operations renewals such as industry-related corporate, state, and\nlocal authorities licensing, General Liability and Workers Compensation.\nRequirements:\nBachelor’s degree in Accounting / Economy, or closely related field, from an accredited college.2+ years of relevant accounting experience.Strong analytical and problem-solving abilities - Must.Ability to prioritize, while monitoring timelines to achieve completion of objectives.Attention to details with an appreciation of the “big picture”.Ability to work independently and well under pressure.Excellent English, both oral and writing skills.Excellent organizational skills.Audit firm experience – Advantage.CPA – Advantage.Working Conditions: Primarily in an office environment and periodic weekend or evening work is expected.Show more Report"}, {"company": "AppsFlyer", "job": "Financial Information Systems Analyst - Maternity leave replacement", "city": "Herzliya", "date": "8d", "rating": "4.5", "link": "", "description": "Our Business Applications department is looking for a Financial Information Systems Analyst to help upscale Appsflyer's Financial applications landscape.\n\nAs a part of the Business Applications team, you will work closely with the Finance and IS units to map the business processes, gather requirements, design, implement, support and maintain the Netsuite ERP and other related Finance applications and integrations to ensure the delivery of innovative, high-quality solutions that meet the business needs.\n\nWhat you'll do\n\nProvide day to day support to internal clients - Especially supporting the Netsuite Cloud ERP, in addition to procurement and travel systems\nGather and document customer business requirements\nBecome a true business partner to the relevant stakeholders and support their vision & mission\nProvide creative technical solutions to complex business challenges - act as a strategic problem solver\nDefine detailed functional requirements for automations and integrations to NetSuite\nWork with the finance team and address requests on a daily basis\n\nWhat you have\n\nMaternity leave replacement for 6-7 months\n2 years of experience as an accountant/controller in a similar company/ a Finance person who would like to be transitioned to IS/ Last year student in Industrial engineering or Information system/ Information system analyst with 1-2 years experience working with ERP's (preferably NetSuite)\nWide understanding of financial business processes and tools (Billing, expenses, ERP, budget planning, etc.).\nExperience with defining requirements for complex customizations and integrations.\nExpert ability to translate business requirements to technical design, alongside good analytical skills\nAbility to communicate technical information to a non-technical audience.\nBachelor degree in Industrial Engineering / Information systems / Accounting - an advantage\nExcellent English - written and verbal\nBonus Points\nFamiliar with the NetSuite cloud ERP\nIntroduced by an AppsFlyer employee\nExperience with system Integration methods\nFamiliar with the Agile work methodologies - an advantage\nDegree in Accounting, Finance, Economic, Industrial Engineering, or related field - an advantage\n\n\nAs a global company operating in 16 countries across 5 continents, we reflect the human mosaic of the diverse and multicultural world in which we live. We ensure equal opportunities for all of our employees and promote the recruitment of diverse talents to our global teams without consideration of race, gender, culture, or sexual orientation. We value and encourage curiosity, diversity, and innovation from all our employees, customers, and partners.\n\n\"As a Customer Obsessed company, we must first be Employee Obsessed. We need to make sure that we provide the team with the tools and resources they need to go All-In.\" Oren Kaniel, CEOShow more Report"}, {"company": "IRP Systems", "job": "Finance controller", "city": "Ness Ziona", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=1136043&s=58&guid=00000186e63fbe76bce51d8ef930ef5c&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_21f59ffc&cb=1678900407780&jobListingId=1008431108531&jrtk=3-1-1grj46bc8klvj801-1grj3vfmdi38u800-98b233b6b4cd61b0-", "description": "DESCRIPTION\nIRP systems is developing the next generation of high-performance e-powertrain systems that will change the electric vehicles market and we are seeking an experienced finance controller to join the ride.\nREQUIREMENTS\nBachelor's degree in Accounting and a CPA – Mandatory2-3 years of audit experience from an accounting firm (big 4) – MandatoryAt least 3 years of experience as controller – MandatoryProficient in ExcelExcellent English - fluent ( Verbal and written).High-tech company experienceNetSuite knowledge- advantageAttention to detail, resourceful, independent, and strong interpersonal skillsQuick learner, organized, responsible, and personally dedicated to accomplishing objectives\nSKILLS AND QUALIFICATIONS:\nLead the monthly closing processesAssist with budget and forecast processesPerform periodical analytical analysis to explain variations and identify trendsWork and coordinate with the Company’s external auditors during interim and annual auditsOngoing communication and collaboration with finance teams abroadLead projects and ad-hoc financial tasks and processesPrepare tax returns and other reports to the Company’s authoritiesShow more Report"}, {"company": "Accenture", "job": "Business & Integ Arch Specialist", "city": "Herzliya", "date": "24h", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=106&ao=1136043&s=58&guid=00000186e63fbe76bce51d8ef930ef5c&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_30199f55&cb=1678900409337&jobListingId=1008529143918&jrtk=3-1-1grj46csmgfqf801-1grj3vfmdi38u800-ee094e79dbb38f41-", "description": "Accenture is a global consulting company with over 730,000 employees world-wide. Our portfolio of business includes Accenture Strategy, Accenture Consulting, Accenture Digital, Accenture Technology and Accenture Operations. At Accenture, you can launch yourself into your next journey-a dynamic career with a global consulting organization at the forefront of business, technology, and innovation.\nAs a Consulting Analyst who lives and breath technology, you will explore your professional passions and develop market leading skills that will enable you to thrive no matter what your future career path holds. Accenture consultants combine technology, digital and business expertise to design and deliver end-to-end solutions that our clients need to become high-performance businesses and governments.\nNell’Armonia part of Accenture is a consulting firm specialized in the field of information systems for business analytics and management of the company performance.\nYou will be working on the deployment of financial reporting and consolidation projects for customers who are among the most prestigious international groups headquartered in Israel. You will accompany them in the design and implementation of their management tools, the change management, and the business consulting inherent in these tools.\nProfessional requirements:B.A. in Economics / Economics & Management / Accounting (advantage).Professional experience of at least 1-3 years in a Finance reporting / Controller departments / Accounting firm.Good understanding and knowledge in consolidation Financial Reporting Standards (IFRS and USGAAP).Advantage: hands-on experience in using \\ implementing of Performance management tools: Oracle EPM / HFM (Hyperion financial management), CCH Tagetik etc.A good understanding of business processes and management reporting, statutory reporting, group consolidation and their impact on corporate information systems.\n\nAccenture is a global consulting company with over 730,000 employees world-wide. Our portfolio of business includes Accenture Strategy, Accenture Consulting, Accenture Digital, Accenture Technology and Accenture Operations. At Accenture, you can launch yourself into your next journey-a dynamic career with a global consulting organization at the forefront of business, technology, and innovation.\nAs a Consulting Analyst who lives and breath technology, you will explore your professional passions and develop market leading skills that will enable you to thrive no matter what your future career path holds. Accenture consultants combine technology, digital and business expertise to design and deliver end-to-end solutions that our clients need to become high-performance businesses and governments.\nNell’Armonia part of Accenture is a consulting firm specialized in the field of information systems for business analytics and management of the company performance.\nYou will be working on the deployment of financial reporting and consolidation projects for customers who are among the most prestigious international groups headquartered in Israel. You will accompany them in the design and implementation of their management tools, the change management, and the business consulting inherent in these tools.\nProfessional requirements:B.A. in Economics / Economics & Management / Accounting (advantage).Professional experience of at least 1-3 years in a Finance reporting / Controller departments / Accounting firm.Good understanding and knowledge in consolidation Financial Reporting Standards (IFRS and USGAAP).Advantage: hands-on experience in using \\ implementing of Performance management tools: Oracle EPM / HFM (Hyperion financial management), CCH Tagetik etc.A good understanding of business processes and management reporting, statutory reporting, group consolidation and their impact on corporate information systems.Report"}, {"company": "Klips", "job": "Group Controller", "city": "Ramat Gan", "date": "13d", "rating": "2.0", "link": "", "description": "Klips is a fast-growing innovative Fintech company, creator of next-generation Financial Hub including Crypto trading, CFD trading, Digital Banking facilities, Shares dealing, Payments, and CRM, using cutting-edge technologies to bring a new era in financial freedom terms.\nWe solve real day-to-day problems by unifying financial services and making them accessible while reducing the friction caused by using multiple service providers. We are now recruiting the Klips core team! This is your opportunity to take part in changing the financial world.\nKlips is a global company with offices in Israel, Cyprus, Romania, and South Africa.\nWorking in Klips means enjoying the flexibility, personal growth, and professional development.\nJOIN US!\nWe are looking for an experienced Group Controller for our global SaaS company.\nRequirements:\n\nBachelor's Degree in Accounting - A Must.\nin-depth knowledge of accounting is required: journal entries, bank adjustments, reports to the authorities.\n2+ years of overall combined accounting and finance experience in Tech./ Product companies-A Must.\nExperience in Crypto/ Currencies industry - an advantage.\nManagement experience .\nFamiliarity with IFRS and Israeli standards.\nEnglish - high proficiency.\nExperience with NetSuite ERP – Advantage.\nStrong analytical, problem-solving, and decision-making skills.\nA hands-on and proactive approach to problem-solving.\nOrganized, excellent multi-tasker, and great time management skills.\nExperience with NetSuite – An Advantage.\nTeamwork capabilities.\nResponsibilities:\n\nMonitoring of the monthly financial statement closing process and consolidation of subsidiaries.\nPreparation the financial reporting package, management reports with analytical analysis and actual vs budget.\nMonitor the compliance with local statutory reporting requirements, tax filings and capital requirements.\nPrepare and analyze financial data and internal reports; monitor progress and changes, provide valuable insights.\nWorking and providing support to all departments of the group on financial issues.\nWorking with external accountants.\nHQ ad hoc tasks on deep accounting, taxes, and projects.\nManaging and monitoring Cash flow planning and execution.Show more Report"}, {"company": "Kramer", "job": "Subsidiaries Controller", "city": "Central", "date": "30d+", "rating": "5.0", "link": "", "description": "Subsidiaries Controller\nWho are we?\nKramer is a leading player and pioneer in the Pro AV industry. Kramer our audio-visual experiences power creativity, collaboration, and engagement.\nAt Kramer, we make award-winning, innovative, and reliable Pro AV hardware, software, and cloud-based solutions. Enterprise companies, schools, universities, governments, and military end-users trust and rely upon Kramer technologies in more than 100 countries across six continents worldwide.\nFrom AVSM to advanced cloud-based communication, collaboration and control solutions, Kramer creates audio visual experiences that are more engaging, more inclusive and more connected than ever before.\nAbout the role\nWe're looking for a Subsidiaries Controller to join our finance team.\nReporting directly to the DOF.\nThis role includes responsibility over all aspects of the financial and tax reporting as well as interactions with Kramer Audio Visual finance teams around the world.\nWhat will your job look like?\nCoordinates and analyzes financial plans and forecasts and works independently to provide information to management.\nAnalyzes and interprets actual performance to plan, explains key variances, and makes recommendations for corrective actions.\nAssists with monthly and quarterly-end closing, year- end audits, ad-hoc requests, and other corporate financial mandatory requirements.\nResponsible for monitoring and meeting regulatory compliance requirements, through training process owners providing assistance with documentation, performing reviews, and completing testing as necessary. Able to critically analyze processes and controls, identify deficiencies, and assist with remediation efforts.\n Lead and assist in special ERP projects as necessary.\nResponsible for managing operational data and ensuring data integrity and accuracy\nDevelops system controls to ensure data integrity.Assists the reporting team manager in producing accurate and timely financial statements and regulatory reports.\nRequirements:\nBachelor’s degree in accounting from a university or a leading college – Must\nCPA with at least 2-4 years’ worth of experience as CPA.\nBig 4 background – Must\nExcellent English both writing and verbal – Must\nExperience in a global, multi-currency company.\nExperience with IFRS - An advantage.\nProficiency with Priority – An advantage.\nStrong Excel skills, including proficiency in developing financial models and graphs.\nStrong communication and interpersonal skills\nStructured, systematic, and able to manage many activities at the same time in a matrix structured organization.\nFull-time scope - overtime as needed\nRF87LAa7xeShow more Report"}, {"company": "Vision Systems", "job": "Controller", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=109&ao=1136043&s=58&guid=00000186e63fbe76bce51d8ef930ef5c&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_505e7d81&cb=1678900413382&jobListingId=1008363696089&jrtk=3-1-1grj46grnkltk801-1grj3vfmdi38u800-3bd21f5e9794fa83-", "description": "About The Position\nGauzy Ltd. is looking for a Controller to join our Finance department.\nThe main goal is to take a leading role in the preparation of consolidated financial statements in compliance with US-GAAP and SEC rules and to contribute in maintaining the accounting and financial processes of the company up to standard to ensure accurate financial reporting.\nResponsibilities\nFinancial Reporting and Accounting:\nPreparation of consolidated financial statements in compliance with US-GAAP, well documented working papers and other reports at demand.\nManage the monthly and quarterly period end closure including assets and liabilities update to period end and P&L - such as cash and cash equivalents, inventories, fixed assets, AR/AP balances, accrued expenses, revenues reconciliation, bonus accruals, payroll accruals etc.\nTake a substantial role in communication with external auditor and advisors.\nSupport many aspects of accounting and bookkeeping management (review of journal entries, invoices, payments, monthly and quarterly closure, billing, tax return, financial reporting etc.).\nTake part in the implementation and documentation of internal controls, new processes and policies in compliance with SOX regulations and company policies.\nRequirements\n3 years of experience in corporate finance departments as Controller or other similar position\nB.A. in Accounting\nCPA license\nKnowledge of accounting practices and financial processes (financial closure, reporting etc.)\nSolid knowledge of US-GAAP - advantage\nExperience with public Company filing - advantage\nLanguage: Fluent in English & Hebrew both written and spoken\nWorking knowledge of MS Office (mainly excel) and SAP software (advantage)\nAvailability to work long hours if required\nWell-organized with a great eye for details, ability to prioritize\nVery good communication and interpersonal skills\nReliable and able to carry out tasks autonomously and collaboratively, problem-solving abilityShow more Report"}, {"company": "Tailor Brands", "job": "Financial Controller", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.4", "link": "", "description": "With over 30 Million users on our platform, we’re here to change the future of business. Our all-in-one platform makes starting a business affordable and accessible to everyone - we welcome more than 800k new business owners every month. From our products to our careers, there are endless opportunities for growth.\nOur team | Our core | Our dream fulfillers\nWhen we started Tailor Brands, we wanted to help people to accelerate their growth and fulfill their dreams. This also defines us internally; we put our focus on maximizing individual impact and creating an environment of absolute transparency.\nAbout the role\nJoin our Finance department to oversee all financial aspects of the company, including general accounting, month close, business support, tax returns, audits, operations, cash management, payroll and much more\nAnalyze financial results (monthly, quarterly, and annual reports) with respect to cash burn, trends, costs, and compliance with budgets\nPrepare investors and management periodical packs\nCash management and cash projections\nEquity related matters, including managing the cap table, option plans etc.\nInteract with other departments to provide consultative support for planning initiatives through financial analysis, reports, and recommendations\nWork with the Company’s external auditors and ensure the timely and accurate filing of the Company’s financial reports\nPrepare tax returns and other statutory reports, including tax planning\nEnhance and implement financial and accounting system processes, tools, and controls\nRequirements:\n\nProfessional certification (CPA)\nInternship from one of the Big 4 firms\nAt least 2 years of experience as an assistant controller/controller in a global high-tech company - Startup is a big advantage\nGreat communication skills and ability to collaborate with other departments and external 3rd parties\nExperience in preparing financial statements according to US GAAP\nAbility to prioritize tasks, meet deadlines, well organized and function as a team member to accomplish job roles\nGreat attention to details and problem-solving skills\nSuperb written and verbal communication skills both in English and Hebrew\nWorking knowledge of MS Office (especially Excel) and Priority accounting software - Advantage\nFamiliarity with SaaS metrics (especially in B2C) - an advantageShow more Report"}, {"company": "FERRERO", "job": "Controller", "city": "Holon", "date": "30d+", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=111&ao=1136043&s=58&guid=00000186e63fbe76bce51d8ef930ef5c&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_fb93830d&cb=1678900415797&jobListingId=1008444696264&jrtk=3-1-1grj46j6mk6dv801-1grj3vfmdi38u800-068def62c111df25-", "description": "Job Location: Holon\nCompany description\n\nFerrero is a family-owned company with a truly progressive and global outlook and iconic brands such as Nutella®, Tic Tac®, Ferrero Rocher®, Raffaello®, Kinder Bueno® and Kinder Surprise®. As the love for our brands continues to grow, so too does our global reach. Represented in 55 countries, with products sold in more than 170, the Ferrero Group is loved by generations around the world. The secret to our global success? Nearly 35,000 dedicated employees who celebrate care and quality to craft a business, careers and brands we are proud of. Join us, and you could be one of them.\n\nDiversity Statement\n\nFerrero is committed to building a diverse and inclusive culture in which all employees feel welcomed and appreciated and have the same opportunities. We believe all of our people are equally talented in their own way. In nurturing the curiosity and natural abilities of our employees, we provide them, generation after generation, the means to succeed personally and professionally, enabling them to craft their journey at Ferrero. The diversity of our talents is what makes our work environment multicultural, innovative and highly rewarding.\n\nAbout the Role:\n\nResponsible for ensuring the proper planning process (Strategic Planning, Budget, Forecast).\nEnsures the reliability of Market data management.\nInteracts with all the local departments and the Central Reporting and controllers of central functions to explain deviations and budgetary assumptions.\n\nWho we are looking for:\n\n3-5 years of experience as Finance Business Analyst\nAdvanced Excel - Must (VBA is a plus)\nFluent in Hebrew and English\nKnowledge SAP R3 and Hyperion (Essbase is a plus)\nPrecision and commitment\nAbility to work effectively in multitasking and project mode, as well as under pressure and time constraints\nExperience in confectionary or FMCG is a plus\n\nRequisition ID\n58195\nJob function\nFinance, Administration & Control\nCountry\nIsrael\nCity\nHolon\nApply Now\nShare\nthis jobShow more Report"}, {"company": "Munters", "job": "Assistant Controller", "city": "Petah Tikva", "date": "7d", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=112&ao=1136043&s=58&guid=00000186e63fbe76bce51d8ef930ef5c&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7a649874&cb=1678900416923&jobListingId=1008514612635&jrtk=3-1-1grj46kafgfqf801-1grj3vfmdi38u800-c917b094190aabb2-", "description": "Did you know that we facilitate over half of the world’s lithium battery production? And that 1 out of 7 meals worldwide have been produced in facilities equipped with our climate control? Munters has been a pioneer of sustainable air treatment solutions since 1955. Today our technology is more relevant than ever and is mission-critical for the production of medicine to the running of data centers. Together we work to support our customers in creating a healthier planet. Come work for us and be a part of this exciting journey.\nMonters Israel is looking for a talented assistant controller to join our finance team. As such, you will be responsible for supporting our Finance Manager in the accounting and financial reporting functions of the organization. This includes assisting with the preparation of financial statements, budgeting and forecasting, internal controls, accounting operations and other projects.\nMunters is a global leader in energy efficient air treatment and climate solutions. Using innovative technologies, Munters creates the perfect climate for customers in a wide range of industries. Munters has been defining the future of air treatment since 1955. Today, around 3,300 employees carry out manufacturing and sales in more than 30 countries. Munters Group AB reports annual net sales of more than SEK 7 billion and is listed on Nasdaq Stockholm.\nHow is it working at Munters? Meet your future colleagues.Show more Report"}, {"company": "Haleon", "job": "Israel Finance Controller (maternity cover)", "city": "Israel", "date": "13d", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=1136043&s=58&guid=00000186e63fbe76bce51d8ef930ef5c&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b7a83fcf&cb=1678900418771&jobListingId=1008504741916&jrtk=3-1-1grj46m3b2i7f001-1grj3vfmdi38u800-d5c413ce1359dd3d-", "description": "Job Description\nSite Name: Petach Tikvah\nPosted Date: Mar 2 2023\nHello. We’re Haleon. A new world-leading consumer health company. Shaped by all who join us. Together, we’re improving everyday health for billions of people. By growing and innovating our global portfolio of category-leading brands – including Sensodyne, Advil, Voltaren, Otrivin, and Centrum – through a unique combination of deep human understanding and trusted science. What’s more, we’re achieving it in a company that we’re in control of. In an environment that we’re co-creating. And a culture that’s uniquely ours. Care to join us. It isn’t a question.\nJob Title\nFinance Controller (Maternity Cover)\nRight now, we’re in start-up mode. Giving those who join us the amazing opportunity to shape our company and the working experience we are building.\nWe are now looking for a great talent to join our Finance department in Israel, Petach Tikvah.\n You will be a part of a team of 4 individuals, reporting directly to Greece & Israel Finance Manager. This is a temporary role to cover for a maternity leave.\nIn this role you will act a sole controller in the department, being responsible for entire financial aspects, including reporting cycle- full management (budget and actuals), accounting team management( 2 persons), local distributors reconciliations, pricelists, global financial activities.\nYour Role Will Include…\nMonthly reporting cycle such as:\n Monthly reporting pack: accruals preparation, classification review, consolidation of results, analytics (vs. PY and budget)\nReporting all P&L\\BS components into Bison system\nWorking capital monthly review and control vs Budget\nAccounting team\\processes management\nTax: annual tax report, monthly tax submissions control\nAnnual financial report preparation with external auditors\nControl framework: monthly testing, ensure full compliance with the company internal controls\nPrice lists control and ongoing management\nDistributors and trade: distributors reconciliations and trade spend control\nProviding financial analysis and profitability scenarios to different models\\promotions upon request\nInteractions with external stakeholders such as distributors and Audit/tax consultants, as well as internal with Local function and Global tax\\finance\nWhy You?\nQualifications & Skills:\nEducation: CPA qualified, 2nd degree will be an advantage\nLanguage: Hebrew and English (fluent)\nComputer skills: Excel at a high level, SAP will be an advantage\nAt least 3 years' experience as a controller or in a similar role\nFinance competencies: local\\global accounting principles\nAnalytics skills\nExperience in a multinational company will be a plus\nStrong communicating skills\nPro-active attitude\nAble to manage processes also complex ones in a full life cycle\n\"Problem solver\" mindset\n#Li-Hybrid\nWhy Join Us?\nThe future of everyday health is changing. And we’re the people changing it. In front of us is an incredible opportunity to go beyond what any of us have done before. And make everyday health more achievable, more inclusive and more sustainable. For more and more people. So join us, as we build one of the world’s leading consumer healthcare companies. Join us to innovate our category-leading brands. To better understand people’s everyday health needs. To tackle the biggest barriers that stand in their way. To change individual and societal behavior. Join us to work with colleagues who share your restless energy. To explore your interests. To stretch yourself to do the best work of your career. And join us, as together we build a working experience that encourages us all to lead happier, healthier, more productive lives. The way we see it, every day is an opportunity for better. And we’re going all in to realize it.\nCare to join us. Find out what life at Haleon is really like www.haleon.com/careers/\n\nAt Haleon we embrace our diverse workforce by creating an inclusive environment that celebrates our unique perspectives, generates curiosity to create unmatched understanding of each other, and promotes fair and equitable outcomes for everyone. We're striving to create a climate where we celebrate our diversity in all forms by treating each other with respect, listening to different viewpoints, supporting our communities, and creating a workplace where your authentic self belongs and thrives. We believe in an agile working culture for all our roles. If flexibility is important to you, we encourage you to explore with our hiring team what the opportunities are.\n\nAs you apply, we will ask you to share some personal information, which is entirely voluntary. We want to have an opportunity to consider a diverse pool of qualified candidates and this information will assist us in meeting that objective and in understanding how well we are doing against our inclusion and diversity ambitions. We would really appreciate it if you could take a few moments to complete it. Rest assured, Hiring Managers do not have access to this information and we will treat your information confidentially.\n\nHaleon is an Equal Opportunity Employer. All qualified applicants will receive equal consideration for employment without regard to race, color, national origin, religion, sex, pregnancy, marital status, sexual orientation, gender identity/expression, age, disability, genetic information, military service, covered/protected veteran status or any other federal, state or local protected class.\n\nPlease note that if you are a US Licensed Healthcare Professional or Healthcare Professional as defined by the laws of the state issuing your license, Haleon may be required to capture and report expenses Haleon incurs, on your behalf, in the event you are afforded an interview for employment. This capture of applicable transfers of value is necessary to ensure Haleon’s compliance to all federal and state US Transparency requirements.Show more Report"}, {"company": "EX.CO", "job": "Controller", "city": "Tel Aviv-Yafo", "date": "8d", "rating": "4.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=114&ao=1136043&s=58&guid=00000186e63fbe76bce51d8ef930ef5c&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f144efba&cb=1678900419992&jobListingId=1008512167178&jrtk=3-1-1grj46natklu1801-1grj3vfmdi38u800-36f9c7e6682d201e-", "description": "Our Story:\nWe’re EX.CO, the world’s leading self-serve video technology platform. We empower publishers to own their video strategy for maximum yield by providing easy-to-use, AI-based solutions for ad serving, monetization, content automation, interactive experiences, and contextual targeting.\n Our one-stop-shop platform is trusted by some of the largest publishers globally including CBSi, Hearst, MLB, Nasdaq, Refinery29, Sky News, Time, ViacomCBS, VICE, and Ziff Davis.\n Founded in 2012 with employees located around the world, EX.CO is backed by The Walt Disney Company, Saban Ventures, Viola Group, 83North, and Firstime Ventures. For more information, visit EX.CO.\nYour Story:\nManage all financial aspects of the company including financial audits US GAAP, internal financial reports, tax reports, commercial agreements, billing, collection, payments etc.\nOngoing budget control and working closely with senior management and FP&A.\nEnsure that the regulatory requirements of all statutory entities are met regarding all the company’s financial affairs.\nAdministration of other finance-related matters (insurance, partners and third-party requests, application forms, etc.) including monitoring procedures.\nParticipate in fundraising rounds, M&A processes from DD to full execution, Developing KPIs.\nWork closely with the Director of Finance on ad-hock matters, ongoing, preparing analysis and presentations etc.\nRequirements:\nCPA degree in accounting, big-4 accounting firm experience.\n3+ years experience in a finance position in a global high-tech company.\nEnglish and Hebrew- fluent written and spoken. Good communication and presentation skills.\nExperience in the online industry – Advantage.\nExperience managing finance and tax aspects for US and UK subsidiaries.\nHighest standards of accuracy and precision; highly organized and detail-oriented.\nStrong analytical capabilities and business understanding, superior Excel skills.\nExperience with Priority- Advantage.Show more Report"}, {"company": "Trullion", "job": "Corporate Controller", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "", "description": "Accounting is the language of the business world, and all companies rely on accurate financial data to communicate with stakeholders. The $400 billion per year financial reporting industry is ready for new technology to take standards to the next level.\nAnd that's where Trullion comes in. Our AI-powered platform automates critical accounting workflows, provides real-time reports and insights and promotes new levels of collaboration for financial leaders.\nWe are a rapidly growing start-up with clients that include global multinational brands and leading audit firms. Our investors include Aleph, Third Point, Greycroft, leading CFOs, and CAOs from around the world.\nThis is the perfect time for you to join us as we expand our current offerings and launch new products. We are looking for an experienced Corporate Controller who wants to join our core team and help us build the single source of truth for the financial world.\nRequirements:\n\nCertified Public Accountant (CPA)\nGraduate of one of the “Big 4” accounting firms\n4+ years experience working as a controller of a startup company (experience with SaaS is preferred )\nExperience in US GAAP\nStrong Microsoft Excel skills\nExcellent oral and written communication in both English and Hebrew\nHighest standards of accuracy; highly organized, detail-oriented, and mindful of deadlines\nAbility to work both independently and collaboratively.\nProactive, fast learner, and self-motivated\nCulture warrior\nResponsibilities:\n\nOversee all accounting, payroll, and tax.\nLead monthly, quarterly, and annual close processes, including preparing all required financial statements, tax filings, statutory reporting requirements, and ongoing interaction with external accountants under US GAAP.\nHelp manage the company's cash flow.\nManage and support day-to-day Finance Operations activities, including accounts payable, accounts receivable, cash flow and banking transactions, salaries, and management of internal and external bookkeepers.\nIdentify opportunities to improve financial and operational systems and cost-effectiveness.\nManage audit processes and work closely with external auditors during the interim and annual audit\nProvide periodical management reporting packages (including AR/AP aging, unaudited financials, budget vs. actuals analysis, etc.), Ad-Hoc reporting, and analysis as needed both internally and externally for management, investors, auditors, etc.\nResponsible for implementing accounting standards, including revenue recognition (ASC 606)\nAssist in designing and implementing internal controls and risk management.\nOversee relationships with banks both in the United States and in Israel.\nWork closely with the Head of Finance and CEO to help prepare the company budget and both short-term and long-term financial plans.\nAd-hoc accounting and finance-related projects as needed.\nAbout us:\n\nBacked by founders with IPO and “Unicorn” experiences, we stick to our 4 key values:\nWe’re on your side. The best way to achieve our goals is through collaboration: after all, your success is our success.\nWe think big. We want you to own what you do, elevate it to the next level, and try new and creative approaches.\nWe live by truth. We encourage everyone to come together with their own beliefs to form something meaningful.\nWe’re committed. We are committed to you, to each other, and to the idea of innovation.Show more Report"}, {"company": "Plusgrade", "job": "Accounting Analyst", "city": "Tel Aviv-Yafo", "date": "24h", "rating": "3.8", "link": "", "description": "Plusgrade powers the global travel industry with its portfolio of leading ancillary revenue solutions. Over 200 airline, hospitality, cruise, passenger rail, and financial services companies trust Plusgrade to create new, meaningful revenue streams through incredible customer experiences. As an ancillary revenue powerhouse, Plusgrade has generated billions of dollars in new revenue opportunities across its platform for its partners, while creating enhanced travel experiences for millions of their passengers and guests. Plusgrade was founded in 2009 with headquarters in Montreal and has offices around the world.\nABOUT THE ROLE:\nWe are seeking a dynamic Accounting Analyst to join our finance department on a contract basis (3 to 6 months). The Accounting Analyst will assist our team accounting tasks for our newly acquired legal entity in Israel and help to transition to the Corporate accounting processes. This role will report to the VP, Controller of Plusgrade and work closely with the Plusgrade Finance team.\n WHAT YOU WILL BE DOING:Maintain accounting records and filing information as required.Prepare monthly invoices and forward them to all the customers. Work on collections to ensure customers are paying timely.Work with the Head Office to ensure bills and invoices are paid on time.Assist the accounting team to answer accounts payable and accounts receivable questions and issues.Process and verify employee expense reports accurately with adherence to corporate expense policies.Reconcile corporate credit card expense report.Support administrative tasks for the Israel employees.Work closely with the 3rd party accounting service provider to produce a monthly trial balance within the Corporate timelinesAssist in the preparation of monthly payrolls-Assist with Finance projects as requested (Implemenation of NetSuite for example).\nYOU ARE SOMEONE WITH:3+ years of experience in a similar function or rolePost-secondary degree/diploma in accounting or related fieldProficient in Excel (vlookups, pivot tables, sumifs, etc.), Google Docs and technology-savvyFluency in English and Hebrew, both spoken and writtenStrong organizational and planning skills, ability to work accurately and efficiently under demanding deadlines and with minimal supervisionWorks well on teams and as an individual contributorAbility to maintain strict confidentiality\nWHAT YOU’LL LOVE ABOUT US:\n\\uD83C\\uDFE6 RRSP/401(k) Matching\n\\uD83C\\uDFE5 Comprehensive Health Plans\n\\uD83D\\uDCC5 Unlimited Vacation/PTO\n✈️ Travel Experience Credit\n\\uD83E\\uDDD8 Annual Wellness Credit\n\\uD83E\\uDD57 Team Events and Monthly Lunches\n\\uD83D\\uDCBB Home Office/Commuter Credit\n\\uD83C\\uDF05 Work From Anywhere Program\nOUR PROCESS:\nPlusgrade is an equal opportunity employer and is committed to providing an accessible recruitment process. We welcome applications from all qualified individuals and are committed to equal employment opportunities regardless of gender identity or expression, race, ethnic origin, creed, place of origin, age, sex, marital status, physical or mental disability, sexual orientation, and any other category protected by law. Upon request we will provide accommodation for applicants with disabilities.\nWe believe in diversity and inclusivity and that is why our interview process is designed for a positive candidate experience and to ensure every candidate is evaluated equally. All applications will be reviewed from our Talent Team and the successful candidate(s) will go through the following recruitment process:\nRecruiter Phone InterviewHiring Manager InterviewTake-home Assessment or remote coding exercise (if applicable)Team Interview\nAll candidates will be provided with feedback regardless if they pass or didn’t pass any of our interview stages. All your information will be kept confidential.Show more Report"}, {"company": "REE", "job": "Assistant Controller", "city": "Israel", "date": "2d", "rating": "4.7", "link": "", "description": "REE Automotive (Nasdaq: REE) is changing the electric mobility and aims at becoming the standard for EVs. REE’s disruptive corner technology enables a completely flat and modular chassis that supports all mission-specific EVs in the spaces of commercial vehicles and people movers.\nWe are looking for a highly motivated, organized and dedicated assistant controller to join our finance team at our HQ in Kibbutz Glil-Yam (Herzliya). This is a great opportunity for a post-internship candidate to take a key role in the day-to-day tasks of our financial department and gain experience at a multi-national high-growth organization traded on NASDAQ.\nResponsibilities:\n\nSupport and execute month, quarter and annual close, reporting and results analysis.Assist with preparation of financial statements according to US GAAP.Implement and oversee financial, accounting and SOX processes and policies.Prepare tax filings.Support and cooperate with AP team, FP&A, foreign finance teams and business partners.Cooperate with external auditors.Assist with ad-hoc projects as necessary.\nRequirements:\n\nCertified Public Accountant in Israel.Internship at one of the Big-4 accounting firms (assurance or technical accounting departments).Up to 2 years of post-internship experience.Experience with publicly traded companies and SOX processes – a must.Fluent English and ability to work effectively with foreign subsidiaries – a must.Proficient in Microsoft Excel – a must.Experience with auditing multinational hi-tech companies – an advantage.Knowledge in accounting and reporting according to US GAAP.Great communication and inter-personal skills.Ability to work well under pressure, meet tight deadlines and strive in a fast-paced work environment.Highly motivated, independent, quick learner, well organized and willing to take new responsibilities.\nWebsite:\n\nREEShow more Report"}, {"company": "Harman International", "job": "Controller Assistant", "city": "Hod HaSharon", "date": "30d+", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=118&ao=1136043&s=58&guid=00000186e63fbe76bce51d8ef930ef5c&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0f2ea83c&cb=1678900424973&jobListingId=1008425861405&jrtk=3-1-1grj46s5egrif801-1grj3vfmdi38u800-96f52a14c2e031f2-", "description": "A Career at HARMAN\nAs a technology leader that is rapidly on the move, HARMAN is filled with people who are focused on making life better. Innovation, inclusivity and teamwork are a part of our DNA. When you add that to the challenges we take on and solve together, you’ll discover that at HARMAN you can grow, make a difference and be proud of the work you do every day.\nHARMAN Israel is a software company specializing in the automotive \"Connected Car\" field,\nLocated in Hod-Hasharon.\nHARMAN Israel is a synergy of leading automotive technology solutions who are owned by Harman International, a Samsung company: IGNITE, OTA, Cybersecurity & ADAS\nAt HARMAN, we combine passion and purpose to deliver smart products, systems, software and services that connect people wherever they are.\nWe are seeking for an experienced CPA Assistant Controller to join our Finance team\nKey Responsibilities:\nMonitoring subsidiaries reporting to ensure smooth delivery of day-to-day financial operations of AP, AR, Fixed Assets, GL and statutory reporting.\nOverseeing the month-end/quarter-end and year-end closing process, review/prepare journal entries and general ledger reconciliations.\nParticipating in the monthly and quarterly financial closing, consolidation, reporting process of the company and additional data as required by the corporate reporting package.\nParticipating part in the annual budget process and preform monthly actual vs. budget analysis.\nAssisting in preparation of the statuary financial statements and tax return reports.\nOverseeing accounting procedures and internal procedures.\nWorking with department managers, corporate staff, and subsidiaries finance\nAd-Hoc financial tasks and projects.\nRequired Skills & Qualifications\nCPA, experience from the big 4 - MUST!\nFluent English- MUST!\nFamiliarity with IFRS - advantage\nFamiliar with ERP (“SAP R3” an advantage)\nAbility to analyze financial data and prepare financial reports and statements\nGreat attention to details and ability to multitask\nStrong analytical, interpersonal and communications skills\nHARMAN is an Equal Opportunity /Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race,color, religion, sex, sexual orientation, gender identity, national origin,disability or Protected Veterans status. HARMAN offers a great work environment, challenging career opportunities, professional training and competitive compensation. (www.harman.com)Show more Report"}, {"company": "UVision", "job": "Controller – Maternity Leave Replacement", "city": "Israel", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=119&ao=1136043&s=58&guid=00000186e63fbe76bce51d8ef930ef5c&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_279e45ec&cb=1678900425985&jobListingId=1007503800768&jrtk=3-1-1grj46t5hncfm801-1grj3vfmdi38u800-0c78c0cf0e908443-", "description": "UVision, which develops a line of products of unique loitering munitions, is looking for a financial controller to join our growing finance team\n\nSupervising bookkeeping team\nPreparation of periodic & annual financial statements, including consolidation of subsidiaries\nPreparing and Monitoring financial reporting – budget vs actual, revenues, cost analysis & forecast reports\nMonitoring Company’s cashflow.\nManage all monthly, quarterly and year end closings and preparing of monthly financial statements and analysis\nSupport quarterly and annual audits\nWriting and managing finance and procurement procedures\nRequirements:\nCPA experience from a large accounting firm\n2+ years’ experience in a global Hi-tech company, experience from a\nmanufacturing company – advantage\nExperience in IFRS accounting standards\nExperience with Subsidiaries abroad – advantage\nPrior knowledge with ERP Systems, Priority – advantage\nFluent verbal & written English skills\nStrong Microsoft Excel and Office applications skillsShow more Report"}, {"company": "AKT", "job": "Assistant Controller - Israel based", "city": "Israel", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=120&ao=1136043&s=58&guid=00000186e63fbe76bce51d8ef930ef5c&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_17741bc1&cb=1678900427229&jobListingId=1007957460379&jrtk=3-1-1grj46uc3kbko801-1grj3vfmdi38u800-23926336f70b8262-", "description": "AKT, a global HR solutions and services company and one of the largest SAP Cloud People Solutions consulting firms in the EMEA region, is growing and looking for a high-motivated, skilled, independent, and responsible Assistant Controller to become an integral part of our Finance team. As an Assistant Controller, you will be reporting to and working closely with the Director of Finance.\nRole and Key Responsibilities\nManage accounting records and Preparation of financial statements.\nAssist with preparation of management reports.\nAssist in analyzing monthly and quarterly budgets Vs Actuals, forecasts and company goals.\nPreparation of annual tax reports and other statutory reporting requirements.\nWork with the Company's external auditors/advisors on audit, accounting, and other matters.\nMonitor the bookkeeping team and review the accuracy of financial data.\nAssist in establishing and maintaining financial key policies, procedures, and controls throughout the entire reporting process.\nSupport the accounting team in various tasks and reporting.\nAssist with managing cash flow and preparing ad hoc reports.\nOversee billing and collection process.\nOversee daily operations of financial activities and liaise with service providers.\nJob Requirements\nCertified Public Accountant (CPA)\nAudit experience from one of the Big 4 - advantage.\n 1-2 years of post-internship experience in a global company – advantage.\nProficient with Microsoft Excel\nExcellent oral and written communication skills in both English and Hebrew\nStrong knowledge of US-GAAP and Israeli GAAP\nFull time position at AKT’s offices in Azrieli Holon, Israel\nPersonal Skills\nStrong analytical, interpersonal, and communication skills.\nTeam player and service-oriented.\nDetail-oriented but yet a big picture thinker.\nWell organized with a can do approach, a multi-tasker with attention to details\nIntensive work that often requires long hours and flexibility.\nAKT offers\nStimulating and collaborative working environment\nInternational business environment (offices in UK, France, India, Czech Republic, Israel, with more to be added).Report"}, {"company": "KLA", "job": "Revenue Analyst", "city": "Yavne", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=121&ao=1136043&s=58&guid=00000186e63fbe76bce51d8ef930ef5c&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d8605948&cb=1678900428896&jobListingId=1008171542151&jrtk=3-1-1grj4700a34at001-1grj3vfmdi38u800-10a4007d49e3d890-", "description": "Company Overview\nKLA is a global leader in diversified electronics for the semiconductor manufacturing ecosystem. Virtually every electronic device in the world is produced using our technologies. No laptop, smartphone, wearable device, voice-controlled gadget, flexible screen, VR device or smart car would have made it into your hands without us. KLA invents systems and solutions for the manufacturing of wafers and reticles, integrated circuits, packaging, printed circuit boards and flat panel displays. The innovative ideas and devices that are advancing humanity all begin with inspiration, research and development. KLA focuses more than average on innovation and we invest 15% of sales back into R&D. Our expert teams of physicists, engineers, data scientists and problem-solvers work together with the world’s leading technology providers to accelerate the delivery of tomorrow’s electronic devices. Life here is exciting and our teams thrive on tackling really hard problems. There is never a dull moment with us.\nGroup/Division\nKLA is well known for its high-performing business model which routinely produces significant profit margins and revenue. Key to supporting KLA business is the finance team that partners with corporate and global business organizations to provide expertise and guidance for developing and executing sound business models and practices. The Finance organization consists of operations and corporate finance teams. The operations finance team influences business decisions by gathering the best available operations information, distilling it and making recommendations to our management team on the best course of action. The corporate team provides a broad range of services, such as financial planning, corporate accounting, tax, industry analysis and benchmarking, internal audits, SEC reporting and merger and acquisition support.\nJob Description\nResponsibilities\n\nWe’re looking for a detail-oriented Financial Analyst to contribute to a great finance team and work cross-functionally within the company. The ideal candidate will work with multiple business functions and have the opportunity to affect the company’s overall long term financial performance.\n\nThe Division Revenue Financial Analyst will support the Division Controller and the VP/GM in driving revenue achievement. Responsibilities include:\n\nPartner with sales, operations and other divisional functions to optimize revenue plan and execution.\n\nMaintain accurate database for bookings, shipment, revenue history and forecast.\n\nPerform scenario planning and support the annual strategic planning process.\n\nSupport period close processes, preparation of financial packages and reporting.\n\nProvide analysis of business trends, such as customers, pricing, GM Analysis, etc...\n\nIdentify, support, and implement group process improvements.\n\nMinimum Qualifications\nQualifications\nBachelor's Degree or equivalent in Accounting/Finance with up to 5 years of relevant experience (with emphasis on accounting, forecasting and financial analysis).\nKnowledge of basic revenue accounting and finance principles.\nExcellent communication skill and ability to influence without direct authority.\nAnalytical mindset and ability to provide meaningful analyses that are concise and actionable.\nMust be hard working, have a positive attitude and willingly contribute to a team.\nAbility to meet deadlines, perform under time pressure, cope with the fast-pace environment, prioritize and multi-task.\nComfortable working in an ambiguous environment and be flexible to constant change.\nOpenness to learning and looking for ways to improve.\nWorking knowledge of revenue accounting standards preferred.\nAdvanced Excel skill and working knowledge of ERP systems.\nExperience working on TM1/SAP an advantage.\nFluent English.\nWe offer a competitive, family friendly total rewards package. We design our programs to reflect our commitment to an inclusive environment, while ensuring we provide benefits that meet the diverse needs of our employees.\nKLA is proud to be an equal opportunity employerReport"}, {"company": "Team8", "job": "Team8-Controller-Temporary Position", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.4", "link": "", "description": "Team8, the world’s leading company-building platform, is hiring a controller to join its finance team and will be the main finance focal point of our new portfolio companies.\nWe are seeking an intelligent and hard-working individual, who is a team player, process-driven and detail-oriented, and thrives in a fast-paced work environment.\nThe role is currently temporary (7 months) with an option to extend it\nMain Responsibilities:\nManaging the ongoing day-to-day finance of the companies - from month closing, budget building, cash management, and board preparations.\nPreparation of monthly, quarterly, and annual closing for several of our portfolio companies.\nManaging global Bookkeeping.\nSupervise the intercompany billing process.\nPerforming managerial reporting, forecasting, and budgeting.\nAssist with the external relationship with auditors.\nUndertaking ad-hoc financial tasks.\nRequirements:\n\nC.P.A.\nExperienced in an audit of global Hi-Tech companies/ high-growth start-up environments (SAAS companies - advantage)\nExperience as an assistant controller / Controller - Mandatory\nHigh proficiency in English.\nWorking knowledge of MS Office (especially Excel) and ERP systems\nLeading projects capabilities and analytical abilities.\nAnalytical mindset and strong communication skills, especially when it comes to explaining financial information to diverse constituencies\nUS tax and audit experience\nOverall track record of professional and academic success\nTeam8:\n\nTeam8Show more Report"}, {"company": "Enlight Renewable Energy", "job": "Assistant Controller", "city": "Rosh Ha`Ayin", "date": "14d", "rating": "", "link": "", "description": "Come be a part of the renewable energy revolution! Established in 2008, Enlight Renewable Energy is a traded company and it is one of Israel's leading companies in the initiation, development, financing, construction and operation of renewable energy projects. The company operates in Israel, Europe and the US, boasting a diversified portfolio of income-generating projects, projects under construction and pre-construction. We are looking for an Assistant Controller to join us in the Finance department.Responsibilities: Preparation of financial reports and auditsPerforming general accounting workManagement of monthly, quarterly, and annual closing processesWork closely with the company's bookkeeping, including providing support on tax and accounting issuesSupport Controller in all financial matters of the organizationRequierments: 3-4 years of experience as a certified CPA, BIG4 graduate – a mustPrevious experience in the fields of infrastructure or renewable energy - a significant advantageAdvanced Excel skills – a mustHigh level of English (writing, reading and speaking) – a mustStrong analytical and accounting skillsExcellent interpersonal skills and ability to work effectively with employees at all levels within the organization and externally, including global functionsJob Type: Full-timeShow more Report"}, {"company": "Mindspace", "job": "Financial Controller", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.2", "link": "", "description": "Imagine your dream office... Now, try again.\nMindspace is a rapidly growing global provider of inspiring workspaces for teams of all sizes. Our community consists of enterprise companies and established startups, as well as small businesses, entrepreneurs, and creative freelancers. With members in more than 34 locations across 7 countries, we are setting the gold standard for flexible workspaces around the world.\nWho is the financial Controller?\nThis full-time position is based in Tel Aviv and entails managing the financial policies of Mindspace. The ideal candidate should have several years of experience in a top accounting firm, experience as a controller/ assistant controller and a creative team player with strong interpersonal and management skills.\nYour day at Mindspace.\nWith a strong understanding of accounting and financial measures, you will be ensuring that business operations are aligned with the company’s policies. You’ll be handed a lot of responsibility including managing a team based in and outside Israel. We trust that you are an independent, responsible, and professional who is able to work in a fast-paced environment with cross-organizational teams and interfaces.\nWhat you will be responsible for, mainly.\nGuides financial decisions by establishing, monitoring, and enforcing policies and procedures.\nMonitors and confirms financial condition by conducting audits; providing information to external auditors ( local and foreign )\nPreparing ongoing reports to the company’s stakeholders\nAnalyzing company’s financial results with respect to profits, trends, margins, costs and vs. budget\nManaging employees .\nMonth-end close process\nEnsure invoicing is done on time and includes all the necessary accounts, involved in complicated billing issues, revenue recognition, and debt collection\nTax - comply with local, government reporting requirements and tax filings\nResponsible for managing and reporting monthly CF\nPreparation of quarterly reporting package and related working paper.\nEnsuring global compliance with IFRS 16.\nPreparing annual budget.\n #LI-Onsite\nRequirements:\n\nExperience & Minimum Qualifications:\nBachelor’s degree in accounting - a must\nCPA from a Big 4 accounting firm, with a minimum of 1-2 years of experience after internship (experience from a global company – an advantage)\nExcellent computer skills; experience in SAP\nGood knowledge of Israel Tax and tax reporting experience\nExceptional knowledge of finance, accounting, budgeting, cost accounting and cost control principles, and Generally Accepted Accounting Principles.\nHigh level of English and Hebrew - MUST\nAdvanced knowledge of bookkeeping and accounting best practices, laws, standards\nAnalytical ability to develop and implement improvements or recommendations\nCritical Competencies for Success:\nWe may be an international firm – but you must possess a strong understanding and knowledge of Israeli taxation and compliance laws\nYou’ll be handed a lot of responsibility – so we trust that you’re an independent and responsible worker who is able to work in a fast-paced environment with cross-organizational teams and interfaces\nThere are no taking shortcuts here – transparency is key!\nYou should be a highly-creative team player who is able to think on his feet when the going gets tough\nBuilding infrastructure processes and procedures should not be out of your comfort zone – so come prepared with a can-do attitude\nFired up about Mindspace; you are ready to live, eat and breathe Mindspace, spreading the love to everyone you encounter\nPlease submit your application in English.\nMindspace is an equal opportunity employer.Show more Report"}, {"company": "Forter", "job": "Controller", "city": "Tel Aviv-Yafo", "date": "30d", "rating": "4.7", "link": "", "description": "About us:\n\nDigital commerce is built on trust. At every point along the eCommerce journey, businesses must make a critical decision: Can I trust this customer? Answering this simple question accurately and instantly is powerful—it can accelerate revenue growth and strengthen a company's connection with its customers. How do we do it? Forter was founded on the insight that it's not about what is being purchased, nor where— but who is behind the interaction.\n\nThe Forter Decision Engine finds patterns across more than one billion identities in our dataset. We isolate fraudsters and protect customers—ensuring everyone gets the experience they deserve. Given that trust is central to how we operate, Forter is very much driven by a defined set of values. We attract remarkable talent and have retention and engagement levels that are well above benchmarks. We're meticulous about strengthening our culture\n\nAbout the role:\n\nForter is seeking a talented Controller to join our finance team. As such, you will be assisting in managing the financial reporting and compliance operations. You will report to the Corporate controller.\n\nWhat you'll be doing:\nLead the monthly and annual closing processes for the company and its subsidiaries.\nPrepare monthly/ quarterly/ annual consolidated financial statements (US GAAP)\nSupport the day-to-day finance operations of the company and its subsidiaries and ongoing communication with finance teams abroad.\nSupport the bookkeeper in all day-to-day aspects to ensure the accuracy of financial records.\nPreparation of materials for the quarterly and annual reports and working with the external auditors\nProvide analytical analysis as needed.\nPrepare statutory reports such as annual financial reports and tax reports for global subsidiaries .\nSpecial projects and assignments as needed.\nCooperate with team members and colleagues for organizational support while maintaining excellent work relations and level of service.\nWhat you'll need:\nBachelor's degree in Accounting (CPA)\nCPA from a Big 4 accounting firm, specializing in Hi-Tech (an advantage).\nAt list 2 years of experience from a Hi-Tech company, in a similar position.\nKnowledge of US GAAP and State laws, experience working with US financial entities.\nExcellent Microsoft Excel skills\nExcellent analytical and problem-solving skills\nExcellent English skills - written and verbal\nAble to work in a fast-paced environment, ability to prioritize workload and meet tight deadlines.\nAdvanced knowledge NetSuite- an advantage\nHigh level of independence and self-examination\nLife as a Forterian:\n\nWe are a team of over 500 Forterians spread across 3 different continents. Since 2013, we've raised $525 million from investors such as Tiger Global, Bessemer, Sequoia Capital, March Capital and Salesforce Ventures. We're on a mission to bring trust to global digital commerce so that companies like Nordstrom, Priceline, Instacart and ASOS can block fraud, drive revenue and improve customer experience.\n\nAt Forter, we believe unique people create unique ideas, and valuable experience comes in many forms. So, even if your background doesn't match everything we have listed in the job description, we still encourage you to apply and tell us why your skills and values could be an asset to us. By welcoming different perspectives, we grow together as humans and as a company.\n\nForter is an Equal Employment Opportunity employer that will consider all qualified applicants, regardless of race, color, religion, gender, sexual orientation, marital status, gender identity or expression, national origin, genetics, age, disability status, protected veteran status, or any other characteristic protected by applicable law.\nForter's Applicant Privacy PolicyShow more Report"}, {"company": "Landa", "job": "Controller", "city": "Rehovot", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=126&ao=1136043&s=58&guid=00000186e63fbe76bce51d8ef930ef5c&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e24b2797&cb=1678900435223&jobListingId=1008333510051&jrtk=3-1-1grj47669joqt801-1grj3vfmdi38u800-cf0cf48cfdb606d6-", "description": "DESCRIPTION\nLanda seeks an enthusiastic and experienced controller to join its Finance department and oversee the company’s accounting operations. In this role you will be responsible for budgeting, production of financial reports, issuing procedures, as well as conducting risk management.\n\nRESPONSIBILITIES\nManage the monthly and quarterly financial closing processes, including quality control over financial transactions and financial reporting\nIn charge of bookkeeping and support day to day finance operation of the company\nReview the monthly account reconciliations, including preparing more complex and critical month-end journal entries.\nMonitor and review perpetual inventory transactions\nSupport complex accounting matters that require judgment.\nAssist in developing, implementing and maintaining key financial policies and procedures.\nResponsibility for the company's statutory reporting and filing requirements, including required tax filing.\nAssisting with ongoing tax matters\nSupport for projects, including automation projects and processes improvements\nREQUIREMENTS\nCPA from Big 4 accounting firm with a minimum of 5 years of experience\nExperience in the high-tech industry – advantage\nExperience in inventory and cogs accounting – advantage\nKnowledge and experience in IFRS-Must\nHigh analytical skills\nKnowledge and experience working with ERP systems – QAD advantage\nExperience with general ledger functions and the quarter / year-end close process\nStrong software skills with knowledge of Excel\nATTRIBUTES\nA strong and proactive team player.\nExcellent interpersonal skills.\nAbility to work in fast-paced work environment and work under pressure.\nAttention to detail and good time management skills.\nStrong organizational skills.\nFluency in English (spoken and written) –mustShow more Report"}, {"company": "Gauzy", "job": "Controller", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.6", "link": "", "description": "Gauzy Ltd. is looking for a Controller to join our Finance department.\nThe main goal is to take a leading role in the preparation of consolidated financial statements in compliance with US-GAAP and SEC rules and to contribute in maintaining the accounting and financial processes of the company up to standard to ensure accurate financial reporting.\nRequirements:\n\n3 years of experience in corporate finance departments as Controller or other similar position\nB.A. in Accounting\nCPA license\nKnowledge of accounting practices and financial processes (financial closure, reporting etc.)\nSolid knowledge of US-GAAP - advantage\nExperience with public Company filing - advantage\nLanguage: Fluent in English & Hebrew both written and spoken\nWorking knowledge of MS Office (mainly excel) and SAP software (advantage)\nAvailability to work long hours if required\nWell-organized with a great eye for details, ability to prioritize\nVery good communication and interpersonal skills\nReliable and able to carry out tasks autonomously and collaboratively, problem-solving ability\nResponsibilities:\n\nFinancial Reporting and Accounting:\nPreparation of consolidated financial statements in compliance with US-GAAP, well documented working papers and other reports at demand.\nManage the monthly and quarterly period end closure including assets and liabilities update to period end and P&L - such as cash and cash equivalents, inventories, fixed assets, AR/AP balances, accrued expenses, revenues reconciliation, bonus accruals, payroll accruals etc.\nTake a substantial role in communication with external auditor and advisors.\nSupport many aspects of accounting and bookkeeping management (review of journal entries, invoices, payments, monthly and quarterly closure, billing, tax return, financial reporting etc.).\nTake part in the implementation and documentation of internal controls, new processes and policies in compliance with SOX regulations and company policies.Show more Report"}, {"company": "Comeet", "job": "Controller", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.4", "link": "", "description": "Comeet is a fast-growing collaborative recruiting platform. Our mission is to make recruitment scalable, predictable, and enjoyable for managers, HR teams and candidates around the world and help companies hire the right people on time to fuel their growth.\nWe are looking for an experienced Controller to help build and manage all financial policies, processes, procedures, and controls for the scale and efficiency of the business, and assist in driving the company’s financial strategy and planning. You will be responsible for assessing the financial performance of the company as well as possible risks and investments in partnership with the Head of Finance.\nYou bring experience with the challenges that come from scaling company financial processes globally. You are reliable finance professional with broad knowledge of all relevant accounting, financial, and business principles for global technology companies. You are a strategic thinker and effective leader who can make wise, fair, kind, and profitable decisions.\nThe goal is to guide the company towards scale, profitability, employee retention, and long-term success. This position is remote with optional one day in the Tel Aviv office per week and reports directly to the Head of Finance in Israel.\nRequirements:\n\nProven experience as Controller or similar role; minimum of 4 years and up to 6 years of experience as a Controller or other finance operations function.\nIn-depth knowledge of corporate finance and accounting principles, laws and best practices; including US GAAP.\nSolid knowledge of financial analysis and forecasting.\nProficient in the use of MS Office (Excel) and financial management software (Quickbooks, Priority, SaaSOptics, etc).\nAn analytical mind with a strategic ability and the highest standards of accuracy; highly organized, detail-oriented, and mindful of deadlines.\nExcellent organizational and leadership skills; including the ability to work independently, self-learn, and adapt to a fast-changing environment.\nOutstanding communication and interpersonal abilities.\nFluent English - writing and verbal is required.\nBSc/BA in accounting, finance or relevant field; MSc/MA is a plus.\nCPA or other relevant qualification is a plus.\nBig 4 accounting firm, SaaS startup, or High-Tech company experience is an advantage.\nWhy Comeet is your perfect match\nWe’re a values-driven business with a strong passion for innovation that makes a meaningful impact on the world around us. Comeet is a place where you can bring your whole self and be welcomed. It’s a diverse and inclusive company culture with team members in 6+ countries with a remote first mentality.\nResponsibilities:\n\nDrive the financial planning of the company by analyzing its performance and risks.\nRetain constant awareness of the company’s financial position and act to prevent problems.\nSet up and oversee the company’s finance IT system; QuickBooks, Priority, SaaSOptics, etc.\nOversee all audit and internal financial control operations; including maintenance of a system of controls over accounting transactions.\nDevelop the corporate fundraising strategy and manage relationships with partners and investors as needed in partnership with the Head of Finance.\nPrepare timely and detailed reports on financial performance on a monthly, quarterly, and annual basis.\nConduct analysis to make forecasts and report to the management team.\nEnsure adherence to financial laws and guidelines; including preparation of Statutory Financial statements and filing tax returns in Israel and USA.\nWorking with interfaces within the finance department, audit team, outsourced finance functions, corporate, and other departments of the company.\nProvide support to the Head of Finance in all on-going business topics and in strategic projects and initiatives.\nEnsure timely provision of information and service to other departments and stakeholders.\nManage Israel, USA, and all other regions payroll and payment to vendors.\nProvide support to the Head of Finance and CEO in all legal aspects with support from external legal partners.Show more Report"}, {"company": "Deloitte", "job": "Business Controller Lead", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=129&ao=1136043&s=58&guid=00000186e63fbe76bce51d8ef930ef5c&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1dd02c7b&cb=1678900440193&jobListingId=1008447188229&jrtk=3-1-1grj47b1kk614801-1grj3vfmdi38u800-24ba1cf5e47a3e22-", "description": "Description\n\nDeloitte Israel is looking for a business corporate controller to join our finance team.\n\nThe successful candidate will lead the controllership team, will be involved in all the financial processing, and manage all aspects of the finance department’s daily operations.\n\nDeloitte Israel has been an integral part of the US firm since 2019 when the US-Israel member firms combination agreement was executed. The Finance team is managed on a single platform and the continuation of the finance transformation is supported through integration with state-of-the-art technology systems and processes.\n\nThe position is open to both women and men\n\nThe job is full-time and hybrid in Azrieli Towers, Tel Aviv/from home\n\nResponsibilities:\n\nManage the controllership team in Israel and collaborate with US and global finance teams across the organization\nDrive the consolidated periodic financial statement close process, implement controls, monitor changes, oversee the close execution with global teams.\nResponsible for all accounting issues, operations and activities, guide controllers, implement new processes and improve existing analysis and controls.\nOversee and review the financial data, AR, collection, AP, GL maintenance, Capex, reconciliations, allocation, FX gain/loss ect…\nManage day to day analyses and management reporting, ensure proper internal controls\nDevelop relationships with global teams\nRequirements\n\nRequirements:\n\nCPA (BIG 4), BA in Accounting, MBA (is a plus)\n10+ years experience as a controller\nMust have strong accounting knowledge and strong business perspective.\nProven experience as a controller in global company\nProblem solving skills\nStrong management capabilities and proactive leader\nTeam player – excellent interpersonal skills\nExcellent written and verbal communication skills, English and Hebrew\nExperience working with SAP is an advantage\nReporting to the VP Finance\n\nAt Deloitte, we believe that an inclusive mindset and diverse workforce are two of our greatest competitive strengths. That’s why we continue to reinforce our commitment to foster inclusionReport"}, {"company": "Logz.io", "job": "Controller", "city": "Tel Aviv-Yafo", "date": "30d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=130&ao=1136043&s=58&guid=00000186e63fbe76bce51d8ef930ef5c&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_f8c125c8&cb=1678900441310&jobListingId=1008468917414&jrtk=3-1-1grj47c392p8r001-1grj3vfmdi38u800-9259d9e897c71144-", "description": "About Logz.ioLogz.io helps cloud-native businesses monitor and secure their environment. Our Open 360™ Platform turns observability from a high-cost, low-value burden to a high-value, cost-efficient enabler of better business outcomes by combining and extending familiar, powerful and relevant Open Source capabilities across Logs, Metrics and Traces – complemented by security monitoring in the form of cloud-based SIEM. Now developers and engineers can employ an end-to-end, cloud-native observability stack built on scalable and easy-to-use Open Source using a single UI and unified agent – at a cost that anyone can afford. Our customers unlock proactive troubleshooting, faster product delivery and a fully supported SaaS observability platform, all while compounding efficiencies in time and cost. Logz is looking for a strong Controller to Join our team! This role will report to the company’s Director of Finance and work closely with a team of global professionals .Responsibilities:Team leader contributing to the monthly process and reports packages, both for internal and external usesEnsure timeliness and accuracy of financial and management reporting data.Managing audits with the Company’s external auditors as well as the timely and accurate filing of the Company’s financial reports.Coordinating and/or preparing tax schedules, tax returns and other statutory reports in local GAAP.Support the implementation of new accounting standards in order to comply with US-GAAP.Oversee the process of collections, accounts payable and payroll and tax returns, for several subsidiaries.Enhance and implement financial and accounting systems processes, tools and control systems.Support the work of AP team to ensure accuracy of financial recordsSupporting billing-related processes and integration with financial systems, such as NetSuite, SF and otherInteract with other departments to provide consultative support to planning initiatives through financial analysis, reports and recommendations.Prepare different analyses and assist with various tasks related to everyday activity.Verify proper implementation of company’s processes and policies (expenses, travel, etc)Ad-Hoc projectsRequirements:CPA certification with a Big 4 firm experience3-5 Experience in High-tech companiesSaaS experience - MustExperience with NetSuite - MustStrong EXCEL and G Suite SkillsStrong knowledge and experience in US-GAAPHigh level of EnglishAbility to work in a fast-paced work environmentAttention to detailsWell-organized with the ability to prioritizeTeam player and team leaderJob Type: Full-timeShow more Report"}]]