[{"company": "lusha", "job": "Marketing Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=101&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_be280958&cb=1678899774440&jobListingId=1008336620449&jrtk=3-1-1grj3j0t9kf19801-1grj3cg4j227a000-00d8ce117abd2aae-", "description": "Description\nLusha is growing and we are searching for a Marketing Designer to join our marketing team! If you are a skilled designer with strong web design skills, who is passionate about the craft of creative converting ideas and thrive in a fast-paced environment continue reading\nWhat will you be doing?\nAs a Marketing Designer, you will focus on creating disruptive assets that accelerate Lusha’s growth as part of our demand generation efforts.\nYou will:\nBuild and update marketing assets that overwhelm and engage our potential users\nConstruct creative concepts and communicate them in a clear way\nOwn brand design projects A-Z dealing with brand identity, UX/UI design, digital assets, and interaction design work\nWork collaboratively within the marketing team to gather information, understand the end goals and strategize visual communication approaches, with the business goals in mind\nCreative ownership of our website and landing pages - design page layouts, ensuring they are pixel-perfect, inspiring, and user-friendly\nPlan design projects and build marketing assets that engage our potential users (Web, social media, email marketing, and internal branding)\nWork closely with the acquisition team and monitor relevant KPIs to optimize the design toward success.\nTranslating product functionality and technical details into beautiful visuals\nEnsure consistency with our brand voice, style, and tone.\nApply a performance-based approach to over-deliver KPIs.\nYou are:\nCreative thinker. Able to clearly conceptualize ideas and deliver multiple executions to bring them to life.\nOrganized. Excellent organizational skills and ability to prioritize and meet deadlines.\nSelf-starter. Curious, fast learner, fast to respond, and hands-on.\nData-oriented. You like working with data and insights and pair that with your passion for users to generate balanced and thoughtful points of view on how to take our products to market.\nAmbitious. You are eager to make an impact. You thrive in a fast-moving, dynamic, growth environment and are able to operate at the strategic level and the micro-detail to get things right.\nA team player. You have great communication skills. You love working with people.\nAdaptive. You understand different marketing platforms require different techniques.\nDegree in Visual Communication – A must\nA strong online design portfolio that consists of web-based marketing campaigns and strong graphic principles - A must\n3+ years of experience in designing and developing innovative concepts for stunning campaigns across all channels - A must\nStrong communication skills and a team-oriented approach\nAbility to execute brand strategy into compelling marketing assets\nAbility to communicate complex concepts through simplified visuals\nExperienced in supporting multiple marketing channels at scale\nExperienced in creating and optimizing digital marketing assets for lead generation purposes\nStrong typography skills and attention to detail\nHands-on experience in Adobe Suite, Figma\nA \"people person,\" a team player with a 'can-do' attitude\nExperienced in video editing & After Effects experience - a plus\nStrong demonstrated Illustration skills - a plus\nWhy Lusha?\nLusha connects you to your most relevant potential customers by creating simple, self-served products that provide access to meaningful and insightful B2B data. We offer ways to leverage data as an enabler for better, smarter and faster conversions at every stage of the customer lifecycle. Lusha was named Top 100 G2 Best Software Company and Top 100 Fastest-Growing product in 2020. Based in the center of Tel Aviv, Lusha is a fast-growing startup that offers its 300+ employees the opportunity to take an active role in shaping the future of the company. While all of us are dedicated to that mission, we surely know how to have a good time.Show more Report"}, {"company": "Appdome", "job": "Marketing Designer( UI Designer)", "city": "Tel Aviv-Yafo", "date": "10d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_69e27aa0&cb=1678899775429&jobListingId=1008509555461&jrtk=3-1-1grj3j1rr2i79001-1grj3cg4j227a000-01721ebb0fc8da73-", "description": "Tel- Aviv · Full-time\nAbout The Position\nWe are looking for a talented UI Designer who is passionate about creation and creativity.\nAs a UI designer at Appdome, you should have strong user-centered design principles, an eye for detail, and the ability to work collaboratively with cross-functional teams including marketing, sales, product design, and developers. Be involved in a wide range of projects – from creating sales materials to more traditional web design and marketing assets\nDesign cross-platform experiences, new layouts, visuals, and illustrations\nRequirements:\n1-2 years of proven experience in interactive design\nA complete portfolio of visual design examples.\nAdvanced proficiency in visual design software, such as Figma & Adobe Creative Suite\nAbility to work across the entire design flow: sketching concepts, design, prototyping, and implementation\nConceptual thinking both in visual and interactive design\nStrong graphic design skills & a sense for extraordinary, pixel-perfect design solutions\nIllustration skills - an advantage\nKnowledge of HTML and CSS in design assets, WordPress - an advantage\nResponsibilities:\nEstablish the look and feel for various interfaces, including the website\nWork within brand guidelines to create layouts that reinforce a brand’s voice through its visual touch-points\nDesign logos, icons, and infographics\nJuggle multiple projects while effectively managing timelines and expectations\nWork with a component library\nIf you are a skilled designer with a passion for creating amazing user experiences, we want to hear from you!\nOnline portfolio / PDF – mandatory\nCompany Overview\nAppdome’s mission is to protect every mobile app in the world and the people who use mobile apps in their lives and at work. Appdome provides mobile brands with the only patented, centralized, data-driven Mobile Cyber Defense Automation platform, delivering rapid no-code, no-SDK mobile app security, anti-fraud, anti-malware, anti-cheat, anti-bot implementations, configuration as code ease, Threat-Events™ threat-aware UI/UX control, ThreatScope™ Mobile XDR, and Certified Secure™ DevSecOps Certification in one integrated system.\nWith Appdome, mobile developers, cyber and fraud teams can accelerate delivery, guarantee compliance, and leverage automation to build, test, release and monitor the full range of cyber, anti-fraud, and other defenses needed in mobile apps from inside mobile DevOps and CI/CD pipeline.\nLeading ﬁnancial, healthcare, m-commerce, consumer, and B2B brands use Appdome to upgrade mobile DevSecOps and protect Android & iOS apps, mobile customers, and mobile businesses globally.\nNice To Know\nOur Israeli R&D site is located in Tel Aviv next to Hashalom train station.\nHybrid work model.\nFlexible working hours.\nToday, Appdome's customers use their platform to secure over 50,000+ mobile apps and with protection of over 1B mobile end users projected by the end of 2023.Show more Report"}, {"company": "ironSource", "job": "Product Designer", "city": "Tel Aviv-Yafo", "date": "3d", "rating": "4.3", "link": "", "description": "Grow Product Studio is looking for an UX/UI Product Designer to help shape and craft our complex platform systems into products that are simple and intuitive. You will design end-to-end user experiences and optimizations – from early prototypes to final implementation and you will also contribute to the development of our product style guidelines and design system.\nSo if you breathe UX/UI - let’s meet!\nRequirements:\n\nBachelor’s degree in Visual Communication from Bezalel, Shenkar, HIT, or Wizo\n3+ years of experience designing a complex system/platform\nYou have experience collaborating closely with R&D\nProven knowledge of Figma (design and prototyping), Sketch, and Adobe Illustrator\nExperience with user research and user testing\n***Submissions without a portfolio will not be considered***\nRole:\n\nBrainstorm and design new features and take concepts through to production\nDesign pixel-perfect complex system/platform user interfaces\nBuild, communicate, and present design ideas and be responsible for the product’s design language\nCollaborate with other designers, as well as product managers, developers, sales and marketing, and other stakeholders to deliver the best design solutions and help deliver outstanding user experiences and sales materials\nProduce all assets needed for the development teams and make sure that the work is delivered as it was designed\n\nBusiness Unit:\n\nDesign & Creative\n\nAdvantages:\n\nYou have a positive attitude and great social skills with a willingness to put aside ego for the sake of what's best for the team\nYou possess the ability to adapt, switch gears, and thrive in a fast-paced environment\nYou have excellent organizational skills and ability to prioritize and meet deadlines\nExperience creating and build a design system library\nYou have a high level of written and spoken English\nGreat people skills, fun person to be aroundShow more Report"}, {"company": "Connecteam", "job": "Marketing Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=104&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_350d35fd&cb=1678899778509&jobListingId=1007523364265&jrtk=3-1-1grj3j4sap6eo801-1grj3cg4j227a000-659ef5c67532f9e4-", "description": "We Are:\n\nConnecteam is a TLV-based startup that is rapidly growing.\n\nOur mission and what our product is all about - is to change how 80% of the world's global workforce—the deskless workers, operate in their day-to-day job roles.\n\nOur marketing team is growing, and we are looking for a marketing design wizard. We want you to join our marketing department at one of Israel's most promising startup companies!\n\nYou Are:\n\nA creative person with real passion for design and outstanding conceptual and visual design skills.\n\nA natural-born leader with engaging visual storytelling abilities, a deep knowledge of brand and design experience, and an understanding of digital marketing across multiple channels.\n\nYou enjoy working closely with marketing and creative teams in a fast-paced startup environment.\n\nOwnership & Responsibilities:\n\nBuild and update marketing assets that overwhelm and engage our potential users and employees\nConstruct creative concepts and communicate them in a clear way\nOwn brand design projects A-Z dealing with brand identity, digital assets, and interaction design work\nCollaborate with other stakeholders to gather information, understand the end goals and strategize visual communication approaches, with the business goals in mind\nCreative ownership of our website and landing pages - design page layouts, ensuring they are pixel-perfect, inspiring, and user-friendly\nPlan design projects and build marketing assets that engage our potential users (presentations, data visualization, newsletters, banners, etc.)\nWork closely with the acquisition team and monitor relevant KPIs to optimize the design toward success, applying all learning to future work\nTranslating product functionality and technical details into beautiful visuals\nCreating campaigns, ads & web pages for our paid acquisition and SEO activity\nQualifications:\n\nDegree in Visual Communication – REQUIRED\nA strong online design portfolio that consists of web-based marketing campaigns and strong graphic principles - REQUIRED\n3+ years of experience in designing and developing innovative concepts for stunning material campaigns across all channels - REQUIRED\nStrong communication skills and a team-oriented approach\nAbility to execute brand strategy into compelling marketing materials\nAbility to communicate complex concepts through simplified visuals\nExperienced in supporting multiple marketing channels at scale\nExperienced in creating and optimizing digital marketing assets for lead generation purposes\nStrong typography skills and attention to detail\nHands-on experience in Adobe Suite, Figma\nA \"people person,\" a team player with a 'can-do' attitude\nFamiliarity with online marketing basic metrics & KPIs - Advantage!\nJoining Connecteam Is The Smart Move:\nWe build our people up. Every team member is treated as a long-term investment and we recognize the value in always nurturing and training them so they can go above and beyond in their skills and job duties.\nWe make an impact on our customer's business. We are on a mission to provide managers of all business types and sizes with the tools they need to communicate, operate, engage, and run their deskless workforce. Our product offers them an effective and affordable solution to run their business.\nWe get the job done. Connecteam employees are passionate in executing their job duties so they can drive the company forward and provide real value to our customers.\nWe have fun! From weekly happy hours to holiday parties, we always enjoy each other's company (and good food, of course). Connecteam is like one big, happy family!\nEveryone is welcome. Connecteam is committed to building an encouraging, caring, and supportive environment. We share a responsibility to support our team and enrich their lives.\nTogether we will shape the future of work!Show more Report"}, {"company": "Xtra-Mile", "job": "Graphic Designer", "city": "Raanana", "date": "17d", "rating": "4.5", "link": "", "description": "Xtra-Mile, a leading lifecycle marketing agency specializing in B2B, is seeking a creative and talented graphic designer to join our studio team\nResponsibilities:\nDesigning marketing campaigns starting with the creative stage all the way through to the final product.\nCreating banners and ads for the various media platforms\nDesigning bulk e-mails, invites, landing pages, websites, presentations, brochures, and other printed materials.\nRequirements:\n\nDigital marketing design experience - required\nFully proficient in Adobe (Illustrator, Photoshop, and InDesign) - required\nProficient in PowerPoint – a significant advantage\nProficient is joint design software (Figma XD) - a significant advantage\nAnimation software experience - a significant advantage\nAbility to think outside the box, fast grasp, and dynamic teamwork\nHigh working proficiency in EnglishShow more Report"}, {"company": "DGN Games", "job": "Marketing Graphic Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=106&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_28e0b8ad&cb=1678899780806&jobListingId=1008257158133&jrtk=3-1-1grj3j736h7jb801-1grj3cg4j227a000-35d65f5f07d0668d-", "description": "DESCRIPTION\nWe are looking for a talented and innovative graphic designer to join our Marketing Art team in TLV,\nfor a full-time position.\nThe designer will be responsible for creating artwork and brand design concepts for different platforms such as in-app and canvas.\nCreativity, independence, and critical thinking with strong and open communication capabilities is required.\nDue to the nature of this position, no candidate will be considered without a diverse portfolio submission.\nCandidates identified to continue in the process will be asked to complete an exercise in addition to a formal interview.\nRESPONSIBILITIES\nStore pages and icons design, creation of all elements of app store presence\nProduce high-quality in-app & digital marketing assets.\nWorking closely with internal stakeholders to ensure that the visual identity is in line with the global marketing industry.\nDriven design and execution of marketing and branding materials for all games that meet and set deadlines.\nREQUIREMENTS\nPortfolio with Examples of marketing art assets.\nAt least 2 years of experience in graphic design.\nGaming company experience – MUST!\nExperience working with deadlines, and a deadline-driven mentality to complete tasks.\nStrong sense of graphic design from all aspects and orientation with the latest trends in the industry.\nAbility to work in a wide range of styles.\nSolid understanding and comfortability with Adobe Photoshop, dimension, and Illustrator.\nKnowledge of HTML+CSS – advantage.\nHigh degree of self-motivation and discipline.\nExceptionally organized with high attention to detail.Report"}, {"company": "MAËLYS", "job": "Brand Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "", "description": "MAЁLYS is one of the fastest-growing D2C beauty brands in the world. We are breaking the mold of the body care industry with innovative targeted body care solutions for specific skin concerns, an intricate and unique combination of data and marketing, and a seriously sassy and bold brand voice.\nWe are a team of people who want to make lasting, impactful changes, who live (and love) to see results, who innovate with passion, and who love a good sense of humor. Is our vibe your vibe? Then keep reading…\nAs a Brand Designer, you will have the opportunity to channel your creativity by creating engaging designs for our digital content. You will be part of a growing brand and in a role where you can see your impact and immediate results.\nYour life at MAËLYS will look like…\nConduct a full design cycle, from collecting inspiration to creating a pixel-perfect UX/UI.\nExecute design and conceptual tasks as assigned with significant attention to detail.\nContribute to, and collaborate with fellow designers on design concepts and the brand experience.\nDevelop visual concepts for digital campaigns, product marketing, and customer marketing.\nYou will thrive in this role if you have…\n1-3 years of experience as a Creative/Marketing/Graphic Designer (preferably in a product / eCommerce company).\nA strong portfolio demonstrating design thinking and execution skills.\nExcellent knowledge of Figma.\nKnowledge in Adobe Creative Cloud - Photoshop, Illustrator, (After Effects - an advantage.)\nStrong understanding of typography and hierarchies.\nStrong design, color, and composition abilities.\nProficient in English.Report"}, {"company": "PowerLink Software Ltd", "job": "Marketing Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=108&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_85ec8f3a&cb=1678899783358&jobListingId=1008270614038&jrtk=3-1-1grj3j9i1khpv801-1grj3cg4j227a000-53cebd94db61097c-", "description": "We are looking for a true leader who is passionate about people and technology. To be successful you should be curious and an excellent communicator who can earn employees' and clients' trust in order to succeed.\nLead the entire Customer Success department - account managers, professional services, and support teams.Create an environment that encourages and empowers team growth.Shaping and maintaining our customer relations strategy.Build long-term relationships with customers and identify revenue opportunities by maintaining a database of customers.Work in cooperation with sales, product, R&D, and other departments in defining end-to-end processes that align with the business goals.Set KPIs for the teams and provide performance feedback.\nAbout Us:\nPowerlink is an end-to-end business management platform tailored for your business-specific needs. From marketing to sales to customer service, and more, Powerlink makes it easy for your entire business to work together. Each department is powerful on its own, but together they can be explosive. Powerlink was built from the ground up by developers who already knew back in 2011 that there had to be a better way to improve customer relations and decided to develop a software for every need aimed to keep customers delighted. After conquering the local market with more than 2000 satisfied Israeli customers from various industries, we are ready to go global.\n\nOur Customer Success department includes:\nTechnical Support team - the first point of contact for customers.\n\n\nAccount managers team - developing long-term relationships with customers, building loyalty, and ensuring higher customer retention and satisfaction.\n\nTechnical product experts - sharing their extensive knowledge for designing solutions for strategic customers.\nWe are looking for a true leader who is passionate about people and technology to lead the CS department through this adventure.\n\nAre you up for the challenge?\n\nThe Role:\nYour Experience & Skills:\n5+ years of experience in the Customer success world.\n‍\n2+ years of experience in leading a customer-facing team or other managerial experience.\n‍\nProactive, service-minded and enjoy working with people.\n‍\nA technological degree and work experience within a technological environment.\n‍\nA business-oriented thinker with a problem-solving attitude, who can see the bigger picture.\nCapable of translating data into action and explaining how Customer Support is progressing according to KPIs.\nMotivational leader who knows how to deliver exceptional customer service.\nA down-to-earth approach, understanding that it's all about the people.\nExcellent written and verbal communication skills in both Hebrew and English.\nWe Appreciate Those With:\nSay what they think.\nIndependent and proactive in a fast-paced environment.\nFast learner.\nHas excellent interpersonal and presentation skills\nProven track record of building client relationships and being client facing.Show more Report"}, {"company": "FORTVISION", "job": "Marketing Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=109&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_637505b2&cb=1678899784453&jobListingId=1007751597894&jrtk=3-1-1grj3jall2bmk001-1grj3cg4j227a000-671ce323d53d9fce-", "description": "We are looking for a designer with a passion for digital media, video, engaging content and marketing. Do you have what it takes to be a part of one of the fastest growing technology companies? Apply now and we’d be more than happy to have a conversation with you.\nYou are:\nAn experienced designer who lives and breathes design. You have experience in online design & web, and a deep understanding of Adobe Photoshop and Sketch You’re an out-of-the-box, conceptual thinker who is artistically talented and pays close attention to detail when creating your designs. An excellent communicator, you’re capable of collaborating with team members to deliver stunning results. Your portfolio is pretty impressive (remember to include it when you send your CV). And last but not least, you’re looking for a full-time job .\nAs a Web Designer, you will:\nDesign, work on and manage large-scale, high-end design templates and campaigns using FORTVISION platform that reach of millions of users every day.\nDesign online marketing campaigns.\nCreate engaging marketing material designs.\nDevelop innovative branding and marketing concepts for presentations.\nProvide hands-on support and guidance to sales and marketing team, and promote a transparent line of open communication.\nSkilled in HTML/CSS on a designer level (big advantage).\nMulti-task several projects at any given time under tight deadlines.\nMail your CV to jobs@FORTVISION.comShow more Report"}, {"company": "CONTROP", "job": "Marketing Designer", "city": "Hod HaSharon", "date": "23d", "rating": "2.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=110&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0242aca5&cb=1678899785714&jobListingId=1008482590742&jrtk=3-1-1grj3jbsnk6ei801-1grj3cg4j227a000-beb5fb54aba6ea36-", "description": "Business and Headquarters\nJB-381\nלמחלקת השיווק של חברת קונטרופ דרוש/ה מעצב/ת גרפי/ת עם ידע בעריכת וידיאו\n\nתיאור התפקיד:\n\nיצירת חומרים גרפים ועריכת וידיאו עבור רשתות חברתיות, תערוכות, ברושורים, ואירועי רווחה\nעדכון ויצירת מצגות\nעריכת סרטונים שיווקיים\nתחזוקת אתר החברה\n\n\nדרישות:\n\nתואר רלוונטי: תקשורת חזותית או הכשרה רלווטנית אחרת\nשליטה בתוכנות: פוטושופ, אילוסטרטור, פרימייר- חובה\nמינימום שנתיים ניסיון בעיצוב גרפי ועריכת וידיאו- חובה\nשליטה בתוכנות אופיס בדגש על Power Point- חובה\nידע בצילום יתרון\nאנגלית ברמה גבוהה\nיחסי אנוש מצויינים\n\nנא לצרף תיק עבודות לקורות החייםShow more Report"}, {"company": "Finonex", "job": "Platform Product Manager", "city": "Herzliya", "date": "19d", "rating": "", "link": "", "description": "About the role:Finonex is looking for a talented and passionate product manager to join our team in our office in Herzliya, Israel.As a product manager, you will be responsible for our web and mobile trading platform.You will work closely with cross-functional teams including engineering, marketing, and design to identify and prioritize opportunities for growth in our international markets and lead the development and execution of product strategies and initiatives that drive engagement and revenue.Our work model is hybrid, combining remote and on-site workIn this role you will:Ownership of product requirements, driving the product life cycle in an agile methodology.Define roadmap, take it from vision to reality and prioritize product requirements.Manage the full product life-cycle, from product definition through launch to maintenance - ideation, scope, specification, prioritization, design, implementation, quality assurance, launch, and iteration.Define and build metrics and OKRs and drive growth in multiple aspects of the product.Highly analytical with attention to detail, able to complete extensive market research.Analyze usage patterns and solve problems.Keep investigating for new tools and services that can help deliver better productsPlanning the features with a designer, to create the best UI & UX.You have:4+ years of experience in product management in B2C productExperience with defining and measuring product and usability KPI'sA great sense for user experience and designStrategic thinking with good planning skills.Ability to manage lifecycles of several products simultaneously.Technological orientation and understanding of the development cycle.Excellent English level with excellent verbal and written skills.Ability to explain complex requirements in simple terms, excellent communicator (both written and verbal).Experienced in driving collaboration across multiple disciplines - Product, UX, R&D, Marketing, CS and Sales.Self-driven and organized with the ability to effectively prioritize and execute multiple initiatives.Strong leadership, organizational and execution skills.Will be nice that you have:Work experience in a trading on-line companiesWork experience in SAS platformsJob Type: Full-timeShow more Report"}, {"company": "PayEm", "job": "Marketing Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.6", "link": "", "description": "PayEm is a global procurement and spend management platform that automates finance and procurement processes from request to reconciliation. By reducing friction and tedious tasks for finance and procurement teams, our clients increase productivity, reduce risk and lower operating costs to contribute to business growth. This is an exciting opportunity with a rapidly growing company.\nThe ideal candidate is a creative thinker by heart that is not afraid to work on multiple projects and channels.\nAs a Marketing Designer at PayEm, you will focus on creating disruptive assets that accelerate PayEm’s growth as part of our demand generation efforts. Projects include designing sponsored ads, branded content, social media assets, emails, landing pages, all kinds of online campaigns, branded internal needs, and much more.\nPrimary Responsibilities\nRequirements:\n\n3+ years of experience as a Creative/Marketing/Brand Graphic Designer\nA strong online design portfolio consisting of web-based marketing campaigns and strong graphic principles\nMastery of the Adobe Creative Suite (Photoshop, Illustrator, InDesign, AfterEffects), Figma\nAbility to work effectively under deadlines\nPlan /design projects and build marketing assets that engage our potential users (social media, email marketing, and internal branding)\nEnsure consistency with our brand voice, style, and tone.\nExperience collaborating with multidisciplinary product and marketing teams.\nImaginative, creative, and curious.\nStrong project management skills and the ability to manage multiple projects at once\nWork collaboratively within the marketing team to gather information, understand the end goals and strategize visual communication approaches with the business goals in mind\nAdvantages:\n\nSaaS B2B experience\nWeb / SVG animation experience a plus, using applications such as Adobe After Effect, Lottie positive\nAbout The Role:\n\nDesign and create creative concepts across media: including websites, social ads, email marketing, brand guidelines, etc.\nParticipate in campaign strategy meetings and campaign planning; testing concepts and exploring design and messaging solutions\nBuild upon and grow PayEm’s brand and personality while maintaining our brand style guide for all teams to utilize & reference\nCollaborate with cross-functional teams on project planning, marketing campaigns, sales enablement needs, and digital initiatives from start to finish\nCreate cohesive marketing experiences while developing high-quality assets that power successful campaigns and channel results\nContinuously research new creative campaigns, ad formats, design concepts, and graphic design trends\nIdentify best practices and data-driven insights for creative experimentation\nAct as a champion for high-caliber design throughout PayEm\nExpert knowledge of the creative process and project management\nHighly organized and able to work with a broad team of cross-functional stakeholders\nAbility to manage multiple projects, timelines, and resourcesShow more Report"}, {"company": "Seperia", "job": "Project Manager", "city": "Herzliya", "date": "30d+", "rating": "4.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_81ef6716&cb=1678899789838&jobListingId=1008454526356&jrtk=3-1-1grj3jfu5kblb801-1grj3cg4j227a000-2dd7a7e97e40b648-", "description": "Seperia builds and operates global fintech review sites. From 2003, we have been driving millions of sales to our partners (advertisers). We do it by focusing on value added content, wrapped within an engaging web product and matched with high-intent traffic.\n\nWe’re looking for our next Marketing Project Manager.\n\nWhat You Will Do:\nWork with the product designer, the acquisition team, and developers to create, manage and expand our leading, user-centric review sites.\nCommunicate with international brands on a monthly basis – manage the partnerships, evaluate their performance metrics, and drive product monetization.\nPerform hands-on research, analysis, planning, and execution of tasks.\nWork across interfaces to complete various tasks, through tools such as WordPress, Google Analytics, and BI systems.\nLead broad initiatives related to the product.\nWhat You Need:\nGreat written & verbal communication skills (Hebrew & English) – a must.\nAn independent and performance-oriented attitude with the ability to drive people and processes.\n1+ years of experience in product (marketing) management, project (marketing) management or global website management.\nA web-savvy mindset.\nExperience in managing websites via WordPress – advantage.\nTechnical capabilities & experience working with developers – advantage.\nWhat We Offer:\nHuge potential for growth. Our company is growing and we’re looking for someone who can grow with us.\nFreedom – we care less about formalities, and more about results. With a dynamic, informal environment, we keep excellence, innovation, and results at the forefront.\nUpside – as a performance marketing company, we develop global-level, scalable marketing assets with no glass ceiling. You can enjoy a growing upside.Show more Report"}, {"company": "8fig", "job": "Product Design", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": "8fig is a growth platform built to propel e-Commerce brands to new heights with cash flow planning technology and continuous, uncapped capital. Founded by supply chain experts, our growing data-driven, client-obsessed team is driven by our purpose to democratize online retail and scale eCommerce sellers to 8-figures in revenue.\nWe are seeking a highly experienced and talented Product Designer with at least 3 years of experience in user experience and interactive design. The ideal candidate possesses strategic thinking and a comprehensive understanding of the product development process, from research and prototyping to design and usability testing. Strong communication, organizational, and analytical skills are essential, as the candidate will be expected to continuously learn and focus on solving complex product problems.\nKey Responsibilities:\nConducting user research to understand the needs and pain points of the target audience.\nCreating user personas and journey maps to guide design decisions.\nDesigning wireframes, prototypes, and high-fidelity mockups.\nConducting usability testing to validate design solutions.\nCollaborating with cross-functional teams, including product management, engineering, and marketing.\nCommunicating design decisions and rationale effectively to stakeholders.\nStaying up-to-date with industry trends and best practices in UX design.\nProviding design guidance and mentorship to junior designers.\nParticipating in the entire product development process, from research to launch.\nContinuously iterating on designs based on user feedback and data analysis.\n\nRequirements:\n\n\n3+ years of experience working as a UX designer on SaaS products\nMaster of design tools such as Sketch and Figma\nStrong understanding of user-centered design principles and techniques\nStrong portfolio demonstrating a track record of creating intuitive and user-friendly software\nExcellent interpersonal skills\nExperience with A/B testing and working with data intensive products\nAbility to work in a fast-paced, dynamic environment\nStrong analytical and problem-solving skills\nStrong attention to detail and ability to work with ambiguity\nExtra Points:\nInterest and background in fintech\nExperience selling products on Amazon, Shopify, BigCommerce…\nStrong public speaking skills, including confidence and stage presence\nIf you're still nodding your head in agreement and this seems like a good fit, don't hesitate to reach out—we're looking for you!Report"}, {"company": "Loox", "job": "Creative Designer", "city": "Ramat Gan", "date": "30d+", "rating": "5.0", "link": "", "description": "We're on the lookout for a designer with an exceptional eye for detail, a knack for web design, and a collaborative spirit to be part of our team. If you're an excellent designer and a team player, come join us!\nAs a Creative Designer at Loox, you will:\nHelp develop and elevate our existing brand to ensure all creative materials are top-notch.\nUse Webflow to design and build the company website, along with landing pages and other digital assets\nCreate captivating visuals and imagery that will support different departments including marketing, education, HR, product, and others.\nCollaborate with relevant stakeholders across different departments to deliver outstanding designs.\nWhat you'll need:\nBA in Visual Communication or comparable experience\nExperience working with Webflow - a must\nPrior experience working on web, marketing, or brand design\nA strong grasp of image making, typography, and composition, and a good conceptual mindset\nAttention to detail, a keen eye for aesthetics and trend-savviness\nExperience in Figma and Adobe Suite\nGreat time-management skills and ability to deliver top-quality results\nA self-learner and a highly motivated self-starter\nExcellent communication skills in both English and HebrewA portfolio showcasing your skills, diversity, and attention to detail is a mustShow more Report"}, {"company": "SAR Technologies", "job": "Platform product manager", "city": "Herzliya", "date": "19d", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7f15bee5&cb=1678899794062&jobListingId=1008489520861&jrtk=3-1-1grj3jk20klvm801-1grj3cg4j227a000-ee38b6c86cda5eab-", "description": "Finonex is looking for a talented and passionate Platform product manager to join our team in our office in Herzliya, Israel.\n As a product manager, you will be responsible for our web and mobile trading platform.\nYou will work closely with cross-functional teams including engineering, marketing, and design to identify and prioritize opportunities for growth in our international markets and lead the development and execution of product strategies and initiatives that drive engagement and revenue.\nOur work model is hybrid, combining remote and on-site work\nIn this role you will:\nOwnership of product requirements, driving the product life cycle in an agile methodology.\nDefine roadmap, take it from vision to reality and prioritize product requirements.\nManage the full product life-cycle, from product definition through launch to maintenance - ideation, scope, specification, prioritization, design, implementation, quality assurance, launch, and iteration.\nDefine and build metrics and OKRs and drive growth in multiple aspects of the product.\nHighly analytical with attention to detail, able to complete extensive market research.\nAnalyze usage patterns and solve problems.\nKeep investigating for new tools and services that can help deliver better products\nPlanning the features with a designer, to create the best UI & UX.\nYou have:\n4+ years of experience in product management in B2C product\nExperience with defining and measuring product and usability KPI's\nA great sense for user experience and design\nStrategic thinking with good planning skills.\nAbility to manage lifecycles of several products simultaneously.\nTechnological orientation and understanding of the development cycle.\nExcellent English level with excellent verbal and written skills.\nAbility to explain complex requirements in simple terms, excellent communicator (both written and verbal).\nExperienced in driving collaboration across multiple disciplines - Product, UX, R&D, Marketing, CS and Sales.\nSelf-driven and organized with the ability to effectively prioritize and execute multiple initiatives.\nStrong leadership, organizational and execution skills.\nWill be nice that you have:\nWork experience in a trading On-line companies\nWork experience in SAS platformsShow more Report"}, {"company": "FIVE Product Definition", "job": "PRODUCT DESIGNER hired", "city": "Petah Tikva", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=117&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b75c007e&cb=1678899795221&jobListingId=1007013697177&jrtk=3-1-1grj3jl61p6dv801-1grj3cg4j227a000-5a6c19db763ced3e-", "description": "We are looking for a truly talented Product Designer with innovative and unique creative vision; one with excellent ability to understand and design highly complex screens, and with pixel perfect design skills.\n\nYou’ll be responsible for all interface design aspects for digital products, and work closely with Design, Product, Marketing and Dev teams to create design solutions for complex digital products in various fields and platforms.\n\nRequirements:\n\nProduct design portfolio\nMastery of various design tools (tech-savvy skills – advantage)\nStrong attention to detail\n\nJob location: Petah Tikva\nJob type: flexible\nMail to: designer@5ive.co.ilShow more Report"}, {"company": "WSC Sports", "job": "Visual Designer", "city": "Giv`atayim", "date": "30d+", "rating": "4.4", "link": "", "description": "WSC Sports develops an AI-based automation solution for real-time sports content creation and distribution and is the fastest-growing sports-tech company in the world.\nWhy WSC Sports:\nYou’ll work in an awesome environment alongside some of the most innovative people around, using cutting-edge technologies and tools (video editing, AI, data, etc.), and have the opportunity to directly influence the products and tools used by our clients who include sports giants such as the NBA, Bundesliga, FIBA, ESPN and more. And that’s just the beginning of what WSC Sports has to offer!\nWe are looking for a Visual Designer to join our design team.\nAs a Visual Designer at WSC Sports, you will work on company-wide projects to apply brand guidelines as well as contribute to expanding our visual language. You will create video content, graphics, and animation for a variety of digital platforms.\nWhat you’ll do:\nCreate and execute concepts, artwork, animation, and video content which may include:\nTypography, image-making, and layout work for promotional and marketing content\nEvent branding and materials for both live and digital events\nContent design (posters, GIFs, etc.)\nMerchandise\nIllustrations, animated or static compositions for campaigns (social media posts, email marketing, etc.\nRequirements:\n\nWhat you’ll need:\n3+ years of design experience, an advantage to being familiar with the startup environment\nB.Des degree or an equivalent\nProficient at After Effect and basic video editing\nIn-depth understanding of typography, iconography, color, space, being able to create a compelling and consistent visual experience.\nThe ability to partner with other creative team members and key stakeholders to create content used across a variety of platforms (web, mobile, video, and more). For this purpose must be proficient at creating storyboards and have storytelling skills\nStrong understanding of design systems.\nWhy should you apply:\nYou will join a small close-knit team- https://www.behance.net/WSCSports\nYou’ll get to work at the company with cutting edge technology- https://www.geektime.co.il/wsc-sports-raised-23m/\nYou could be a part of our great company culture, that puts people first- https://www.instagram.com/wsc_sports/?hl=en\nWork Model:\n\nHybridShow more Report"}, {"company": "Genesys", "job": "Product Designer (UX/UI)", "city": "Tel Aviv-Yafo", "date": "1 day ago", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=119&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a70c88e3&cb=1678899798185&jobListingId=1008527139477&jrtk=3-1-1grj3jo2rkugi801-1grj3cg4j227a000-b3d079c1be7ebabb-", "description": "It's fun to work in a company where people truly BELIEVE in what they're doing!\nWe're committed to bringing passion and customer focus to the business.\nExceed.ai is a Conversational Marketing platform, powered by Artificial Intelligence, that automates the lead qualification, nurturing process, and meeting schedule for Sales and Marketing teams to save them time and allow them to focus on building relationships with prospects and customers, having meaningful conversations and being creative. As the Exceed Product Designer, you’ll help build the next-generation, cloud-based customer experience platform. This role will be responsible for creating compelling and delightful experiences employing Design thinking methodologies and best practices. You will help define product features as well as user interactions and flows, creating wireframes, prototyping, documenting, and user testing the designs. As a confident communicator, you can work laterally to engage with senior stakeholders across the different disciplines with ease.\nThis is a fixed term contract for a duration of 6 - 9 months.\nLocation: For this role, we are open to candidates being based either on-site full time, or working Hybrid 50/50.\nIn this role the primary responsibilities include (but are not limited to):\nProduct designs as needed to ensure ideas are realized to their fullest potential through the effective use of user centered design and information principles.\nParticipate as a design lead to cross-functional teams that include, project management, product management, software developers, and QA.\nParticipate in product and feature ideation and conceptual development for web solutions, also taking into account responsive design considerations.\nProduce conceptual models, flow charts, conceptual sketches, wireframes, IAs, design prototypes, and design specifications.\nDesign and specify user interfaces using participatory and iterative design techniques, including observational studies, customer interviews, usability testing, and other forms of requirement’s discovery.\nCreate digital assets that effectively communicate product function and intent, user interaction, and screen hierarchy.\nEffectively communicate research findings, conceptual ideas, detailed designs, and design rationale both verbally and visually to stakeholders and team members.\nWork closely with development teams to ensure that design specifications are implemented.\nManage multiple projects at one time, switching focus between projects as required to manage priorities.\nRequired Qualifications:\n2+ years proven experience designing data-intensive software applications for a global audience.\nStrong knowledge of interaction design processes and methodology particularly as applied to desktop & mobile products.\nThrive in a fast-paced work environment that requires independent self-direction with an aptitude for team collaboration and open communication.\nProactive and takes ownership for producing positive results.\nContributes as a valued team member and colleague with leaders at all levels.\nDemonstrates personal self-awareness and desire for continual learning and personal development.\nMust possess the presentation skills and professionalism to project a professional image, both internally and externally.\nHave developed UX and/or User Interface (UI) designs for IT professionals.\nExperience working closely with engineering to champion design at every step.\nHave an online portfolio showing a mix of UX/UI design experience.\nProficient in industry standard design tools such as XD or Figma. (Figma is our tool of choice)\nPreferred Qualifications:\nB.S or M.S. in any of the following: HCI, Interaction Design, Industrial Design, Visual Design, and/or related fields.\nExperience with AI or machine learning capabilities.\nCovid-19:\nSafety for our employees and our communities is a key priority for Genesys. We continue to experience rapid growth during the Covid-19 pandemic and are conducting remote hiring and onboarding processes. All hiring and onboarding processes are being conducted remotely at this time.\nAs our Covid-19 task force and internal teams plan to reopen our global offices, the policies and procedures continue to be updated.\nReasonable Accommodations:\nIf you require a reasonable accommodation to complete any part of the application process or are limited in the ability or unable to access or use this online application process and need an alternative method for applying, you or someone you know may complete the Reasonable Accommodations Form for assistance. Please use the Candidate field in the dropdown menu to ensure a timely response.\nThis form is designed to assist job seekers who seek reasonable accommodation for the application process. Submissions entered for non-accommodation-related issues, such as following up on an application or submitting a resume, may not receive a response.Show more Report"}, {"company": "Beach Bum", "job": "Graphic Designer", "city": "Raanana", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=120&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9d66277f&cb=1678899799860&jobListingId=1006020925231&jrtk=3-1-1grj3jpn0j479801-1grj3cg4j227a000-f07a6146c5e0a05e-", "description": "You're invited to Join Beach Bum, the greatest gaming family that brings a new twist to classic games by introducing them to the world of online casual games.\nWe are seeking a talented CRM Graphic Designer who is excited about the game industry. We need your skills to focus on exploring and executing the best marketing materials while managing the whole creative process from end to end. You will use your amazing skills in shaping the visual language and communications and help us to engage potential players in creative & inspiring ways.\nResponsibilities:\nDesigning marketing materials for all marketing activities while maintaining the brand's language\n\nOwn the creative process from ideation through production to implementation\n\nBuild and maintain relationships with outsource providers\n\nLearn and develop new creative ideas and formats based on market research\n\nCooperate with the studio's art and CRM teams\n\nRequirements:\n1+ Years of experience in Marketing/CRM design\n\nexperience in the gaming industry - advantage\n\nVast knowledge in Photoshop - A must\n\nGood knowledge in Illustrator & After Effects - A must\n\nAbility to work in a fast-paced environment\n\nGood English\n\nGood communication and interpersonal skills\n\nMulti-task several projects to meet deadlinesReport"}, {"company": "Wix", "job": "3D Motion Designer - Brand R&D Team", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=121&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_8a7ecacb&cb=1678899801049&jobListingId=1008237413869&jrtk=3-1-1grj3jqskmfq3801-1grj3cg4j227a000-4f056aa0707b386b-", "description": "We are:\n\nWix’s Marketing Design studio. We’re continuously developing a world-class brand to communicate and engage with a wide range of audiences. Our creative, energetic and diverse team plays a hands-on role in elevating the brand with rich and sophisticated designs across all of Wix’s products, reaching more than 200 million users around the world.\n\nYou are:\n\nA 3D designer with 1+ years of experience, who’s willing to commit to our brand’s highest standards and push them even further. You’re a creative conceptual thinker with a beautiful online portfolio consisting of strong graphic design principles. You’re proficient in Cinema 4D as well as in Redshift render engine.\n\nYou have a strong interest in animation, image making and illustration. You have hard surface, texturing, and shading abilities (UVs, rigid and cloth simulation are an advantage).\n\nYou follow graphic and motion design web trends. You pay close attention to details and aesthetics and know how to create eye-catching, robust, interactive designs. You’re also an excellent communicator and team player.\n\nYou’ll get bonus points if you’ve worked in a digital agency and have excellent spoken and written English. You’ll get additional points if you know Houdini.\n\nAs a 3D Brand Designer you will:\nCollaborate with the rest of the Design Team to produce high-end renders.\nPartner with Designers and Creative Directors to produce style frames and designs\nHelp develop and establish brand aesthetic qualities in a variety of different feels\nPartner with our marketing motion design studio in developing assets for videos and animated sequences\nPartner with the Creative Technology department in order to generate real-time ready assets\n\nWe’re proud to be an equal opportunity employer. Wix was built around the idea that everyone has the right to be successful, online. This same vision defines us as an employer: creating a work environment where everyone is welcome, and anyone has the right to succeed.\n\nApply NowShow more Report"}, {"company": "InspHire", "job": "Crypto Affiliate Manager (Optional to Remote)", "city": "Herzliya", "date": "30d+", "rating": "5.0", "link": "", "description": "An international financial services group specializing in online trading and investment is looking for a Crypto Affiliate Manager to join its Marketing team. The Marketing team is a very international group of 10+ nationalities based in Montenegro, Cyprus and Israel. We welcome successful candidates with a proven track record and experience working as an Affiliate or IB manager for at least 2 years.\nThe hiring team is ready to learn from you, share its knowledge and provide amazing working conditions for your best performance. Apply now!\nWhat Will you Do :\nRecruit new affiliates\nMaintain existing affiliate\nMaintain and monitor affiliate programs and activities.\nLook for new IBs\nAffiliate support\nSearch for affiliates/traffic brokers and negotiate with them to cooperate with the company's affiliate program on its condition.\nCoordinate with designer regarding preparing conversion promo materials for Affiliates for specific GEO's (landing pages, teasers, banners).\nWrite marketing briefs and work with the creative team to develop assets for campaigns\nInitiate new campaign ideas and bonus offers for affiliates\nRepresent the company on international events (exhibitions, meetups, seminars, etc)\nGerman, Italian or Spanish speaker\nRequirements\nKey Skills Required:\n2 years as an Affiliate manager or 1 year as Affiliate manager +2 years of Sales/Retention in forex/crypto industry\nFluent English + German, Italian or Spanish language\nDeep understanding of affiliate and partner marketing channels\nHighly organized, strategic and execution-focused with the ability to multi-task\nAbility to operate independently and to meet established deadlines with exceptional attention to detail\nProven ability to prioritize tasks, handle multiple projects and frequent reporting\nAttention to detail, accountability and pride in the quality of work\nCreative thinker has technological knowledge and deep business understanding (smart creative)\nAbility to collaborate with and influence both internal and external partners\nAbility to travel when needed to conferences and team meetings\nProficiency working in Microsoft Excel, knowledge of affiliate networks\nExceptional planning and project management skills\nOutstanding verbal and written communication skills\nStrong interpersonal skills, curiosity, positive attitude, drive and collaborative spirit\nAbility to succeed in a fast-paced, matrixed environmentShow more Report"}, {"company": "accessiBe", "job": "Creative Web Designer - Temporary", "city": "Tel Aviv-Yafo", "date": "8d", "rating": "4.7", "link": "", "description": "accessiBe is the market leader in web accessibility that makes websites accessible to people with disabilities. accessiBe is more than a workplace, it’s a passion. Each day you’re surrounded by people who share the same goal and values, who work endlessly to break down accessibility barriers. We care about all people, regardless of their ability. We hire people that are determined to succeed and who are not afraid of rapid change. Our core values showcase who we are, and we strive to focus on excellency and sincerity.\nWe are seeking a talented, Creative Web Designer and Illustrator to join our Design Department. In this role, you will work collaboratively with other designers, developers, and product managers to create visually stunning web designs and illustrations that meet business requirements and user needs. You will be responsible for the design and creation of user interface elements, graphics, and illustrations that will be used in web applications and digital products.\nWant to make a real impact? Click here and find out how!\n\nClick here to learn more about accessiBe's #companyculture\n\nWhat you'll be doing:\nCollaborate with cross-functional teams to understand business requirements and user needs and iterate design concepts based on your findings\nDesign and create visually appealing web layouts, graphics, branded icons, and illustrations using Figma and Adobe Creative Suite, and other relevant design software\nDevelop wireframes, prototypes, and high-fidelity mockups for web and mobile applications\nWork closely with developers to ensure designs are implemented accurately and efficiently\nProduce high-quality illustrations and infographics for various marketing materials, web pages, and social media platforms\nEnsure all designs are optimized for different screen sizes and resolutions\nContinuously stay up to date with the latest design trends and technologies\nContribute to the development of the design system using components and variations in Figma and contribute to design standards, style guides, and best practices.\nRequirements:\n\n3+ years of experience in visual web design and illustration\nProficiency in Adobe Creative Suite and other design software\nExperience working in an Agile environment and collaborating with cross-functional teams\nExcellent communication and problem-solving skills\nStrong understanding of typography, color theory, and composition principles\nA portfolio that showcases your visual design and illustration skills\nBachelor's degree in graphic design, web design, or a related field\nIf you are passionate about visual web design and illustration and enjoy working in an Agile environment, we would love to hear from you!\nPlease submit your resume and portfolio for consideration.Show more Report"}, {"company": "FORTVISION", "job": "Strategic Partners Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=124&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6c5a4813&cb=1678899806334&jobListingId=1006136614520&jrtk=3-1-1grj3k00mpkev801-1grj3cg4j227a000-98d0e4ca616332cc-", "description": "We are looking for an all-star Strategic Partner Manager to join our Tel Aviv team . This person will be directly responsible for managing advertisers' agencies and identifying up-sell /optimization opportunities at scale. The ideal candidate will be sales oriental, entrepreneurial, analytical, designer, creative and have strong relationship management skills.\nResponsibilities and skills:\nBuild a strong relationship with the media planners within each agency\nIdentify upsell opportunities at scale within each agency and their customers\nDrive the entire sales process, from introduction, demos / meetings to closing deals\nProvide feedback to customers on product offering and how to best service advertiser's needs\nHelp customers with campaign strategy & optimization and increase customer satisfaction\nTroubleshoot and resolve issues in a timely manner\nIdentify opportunities to improve products and the customer experience\nRequirements:\n2+ years’ of experience in ad agency with deep understanding of brand strategy and performance campaigns- a must!\nExperience in a lead generating / sales planning / strategic planning preferably at a digital media/agency company - a must!\nExperience in client-facing in the digital media /online publisher space - preferred\nProven communication, presentation, phone etiquette and general sales skills (mainly cold-calls).\nExperience in structuring and negotiating deals within the digital media space.\nA true passion for marketing, interactive & engaging content, native advertising and a strong sales drive.\nStrong analytical skills to collect business intelligence by conversing with clients and identifying trends.\nAbility to effectively prioritize and manage tasks within a fast-paced environment\nDemonstrated ability to work and collaborate within a high-performing team\nSelf-motivated, entrepreneurial, and comfortable dealing with ambiguity\nMail your CV to jobs@FORTVISION.comShow more Report"}, {"company": "Cardo Systems", "job": "Graphic/UX Designer – Temp position", "city": "Raanana", "date": "30d+", "rating": "4.2", "link": "", "description": "Cardo Systems, the global market leader in the field of wireless communication systems for motorcycle & ski helmets, is looking for a creative and energetic Graphic/UX designer to join our marketing team.\nFull-time, temporary position (9 months for maternity leave replacement) in a hybrid model (from the company's offices at Raanana/from home), reporting to the Director of Corporate Marketing.\nJob Description:\nThe ideal candidate will continue developing the company-wide design language that is in tune with both the market esthetics and the company’s brand pillars, control all up-to-date design tools for online and offline use, and become an integral part of a dynamic marketing team.\nAs part of your creative job, you will be required to interpret our marketing needs into design/UX solutions that create an impact and drive our brand forward. To complete your tasks, you are expected to be responsible for company-wide design language and master a variety of products, for both online and offline use, for example, company website product packaging, brand guidelines, company collateral, infographics, presentations, exhibitions, video art to name but a few.\nRoles & Responsibilities:\nThink creatively and lead the development of new design concepts, graphics, and layouts\nCultivate a solid body of work\nWork with a wide range of media and use graphic design software\nPrepare rough drafts and present your ideas\nAmend final designs for comments and gain full approval\nWork as part of a team with other marketing team members\n\nRequirements:\n\nRequirements:\nMin. of 3 years experience in graphic design roles – a must\nExperience working with Adobe: XD, InDesign, Photoshop, and Illustrator software – a must.\nAbility to perform independently and under pressure\nDemonstrable graphic design skills with a strong portfolio\nPossession of creative flair, versatility, conceptual/visual ability, and originality\nPrior experience working in consumer electronics companies and/or global companies – an advantage\nProfessionalism regarding time and deadlines\nAbility to interact, communicate, and present ideas\nEnglish – high proficiencyShow more Report"}, {"company": "Connecteam", "job": "Creative and Social Media Lead - Digital", "city": "Tel Aviv-Yafo", "date": "6d", "rating": "4.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=126&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b0097279&cb=1678899808734&jobListingId=1008519162488&jrtk=3-1-1grj3k2avp6dk801-1grj3cg4j227a000-6e313cf2cfcae3cd-", "description": "Marketing\n\nWho Connecteam is:\n\nConnecteam is a TLV-based startup that's on a mission to change the work experience for 80% of the world's global workforce - the frontline employees.\n\nOur business management platform helps thousands of businesses thrive by taking away the daily hustle and complexities of managing teams, so they can have the peace of mind to grow and run their business.\n\nWhat is Connecteam Digital?\n\nOur goal is to extend our vast knowledge from working with tens of thousands of customers, on business and employee management to every business owner and manager, by creating and delivering educational value and entertaining organic content via digital platforms.\n\nAs Connecteam Digital's Creative and Social Media Lead, you will be in charge of guiding and approving creatives and leading the Social Media channels plan (both Connecteam's and Connecteam Digital's).\nYou will work directly with our Head of Digital and be in charge of developing the social media strategy and growing all of our channels further, social media content publishing strategy, and engagement while being involved in the creative process for our Digital and social content.\nWhat's the job?\n\nAs Connecteam's Creative & Social Media Lead, you will be the leader of our Social Media team and the creative in social media and Digital's content series to help reach a mass audience and deliver value content to our current customers and similar target audience while growing our followership.\n\nWe see our developing Digital and social media division as a crucial channel to be able to deliver high-quality educational content to reach the maximum exposure of our current customer and targeted audience to become the leading content creator in that field!\n\nWe are looking for a strong strategic, operative and creative mind to be able to lead the social media strategy that includes regular posts, valuable content, engagement strategis, involvement, activities, collabs and contests, noise, RTM, rapid responses, intelligence, social listening.\n\nWhat you'll be doing:\n\nExecute the Social Media Strategy - both Connecteam's regular pages and Connecteam Digital's pages\nBuild and Manage the social media team\nWork closely with the Head of digital\\content and the digital content creator\nBe involved in the content creator's creative process and approval\nIn charge of aggregating and publishing content via social media from all stakeholders\nApprove posts before published\nExecute commenting and social listening strategy\nManage and execute publishing plan according to Gantt and editorial calendar\nWork with the Studio and Digital team's production stakeholders (videographer, producer, designer, etc.)\nIn charge of growing our accounts reach, engagement and followership\nIn charge of making social media noise, contests, activities, etc.\nIn charge of being highly involved on social media on behalf of Connecteam's channels\nEnsure consistency in the brand's voice, messaging, and style\nFollow up on results, optimize and improve forward\nOpen and manage more social channels\nBe on top of Social Media changes, updates, and new features to utilize\n\n\nWhich qualifications you'll need:\n\nNative written and spoken English - MUST\n+4 years of Experience in Leading and building roles of Digital and Social Media in Media, TV, Radio, Journalism, News, etc. - MUST\nProven record of developing, leading and growing Social Media teams\nStrong builder skills and strategic mindset\nStrong creative mindset\nStrong understanding of the Social Media space, algorithms, strategies and tactics\nInterest in the business world and helping business owners and managers grow their businesses\nSolid understanding of the digital space\nHigh-performance execution\nAutodidact and a can-do mentality\nExcellent interpersonal and organizational skills\nAbility to work under pressure and meet tight deadlines\nAbility to collaborate and work with diverse stakeholders\nEnthusiastic to learn and grow\nFlexible and agile\nHiring process with us:\n\nAt Connecteam, we aim to complete our hiring processes at lightning speed, keeping the time between when we receive your CV and you (hopefully) sign with us super short, communicative, and transparent.\nJoining Connecteam Is The Smart Move:\nWe build our people up. Every team member is treated as a long-term investment and we recognize the value in always nurturing and training them so they can go above and beyond in their skills and job duties.\nWe make an impact on our customer's business. We are on a mission to provide managers of all business types and sizes with the tools they need to communicate, operate, engage, and run their deskless workforce. Our product offers them an effective and affordable solution to run their business.\nWe get the job done. Connecteam employees are passionate in executing their job duties so they can drive the company forward and provide real value to our customers.\nWe have fun! From weekly happy hours to holiday parties, we always enjoy each other's company (and good food, of course). Connecteam is like one big, happy family!\nEveryone is welcome. Connecteam is committed to building an encouraging, caring, and supportive environment. We share a responsibility to support our team and enrich their lives.\nTogether we will shape the future of work!Show more Report"}, {"company": "Spike", "job": "Head of Design", "city": "Herzliya", "date": "30d+", "rating": "3.1", "link": "", "description": "Spike is looking for a super creative and independent Head of Design to lead and deliver innovative and effective design solutions for Spike’s ongoing activities.\nWhat will you do?\nLead the development and evolution of the company's brand identity, ensuring that all of Spike’s creative assets align with the brand guidelines and values.\nApply Spike’s visual language to all of our assets in a coherent, on-brand style.\nDesign (hands-on) all of Spike assets: website, landing pages, app store pages, social media, display ads and campaigns, blog posts, videos, decks, etc.\nOversee the Design team (currently one motion designer).\nWork closely with Marketing, CS, Product, and Dev teams around all creative needs.\n\nRequirements:\n\nYour background and experience\nGraphic design degree, with an impressive portfolio of marketing collaterals.\n4+ years of working as a Marketing designer preferably in tech companies.\nExtensive experience with web design (must!), UI/UX, and working with dev to build and QA all of the company’s online projects to perfection.\nExperience in designing various creative materials such as ads and banners, mobile app campaigns, social posts, App store pages, blog posts, and more.\nProficiency with essential design tools: Figma, Adobe Photoshop & Illustrator etc.\nGreat understanding of motion design concepts and processes, from storyboard creation to execution.\n\nAbout the company:\n\nAbout Spike:\nWorking with multiple workflow and communication apps can be overwhelming, time-consuming, and let’s be frank – annoying. And yet, you need all of them.\nThat’s why we made Spike — a place where you can email like chat, collaborate with your team, create notes, docs, plan, organize and keep it all together in one place – your inbox.\nSpike is used by over 100,000 teams worldwide, including teams at Philipps, Shopify, Fiverr, Zillow and more.\nSpike is backed by some of the world’s best investors - Insight Partners, NFX, Mozilla and more.\nSpike is located in Herzliya and this is a full-time positionShow more Report"}, {"company": "Lightricks", "job": "Marketing Studio Designer", "city": "Jerusalem", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=128&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7da6fe50&cb=1678899813029&jobListingId=1008459100383&jrtk=3-1-1grj3k6j4k60u801-1grj3cg4j227a000-e1f47f0b0a7c7901-", "description": "Creative & Design: Creative MarketingJerusalem\nWho we are\n\nLightricks is a pioneer in innovative technology that bridges the gap between imagination and content creation. With a mission to push the limits of technology to reimagine the way creators and brands express themselves, the company brings a unique blend of cutting-edge academic research and design to every user experience. Our photo and video editing tools, including Facetune, Videoleap, and Photoleap, offer endless possibilities and inspiration, while our creator services, Popular Pays, provides content creators the ability to partner with brands to monetize their work and offer brands opportunities to scale their content through tailored creator partnerships. We focus on putting creators in the center and empowering them from the moment inspiration strikes.\nThe Marketing Studio is an internal studio for the Lightricks Marketing department. We create stunning visuals for many marketing channels and build visual guidelines for all the Marketing Creative teams. We define the apps’ brand values in the various marketing campaigns.\nAs Marketing Studio Designer you’ll be working on a wide range of projects such as AppStore & Google Play Store visual language, newsletters design, social media materials and more. If you’re passionate about image making, typography, motion graphics & design trends - this is the opportunity for you!\nWhat you will be doing\nCreating visual assets that will appear on our app stores.\nCreating newsletters that engage and inspire our users.\nCrate design guidelines that highlight our brand's vision and fit marketing needs.\nCreating visual content for our social media channels such as instagram & TikTok.\nCollaborate with our product marketing managers & copywriters to refine the messaging we communicate within the content.\nKeep track of the latest design trends and research the market to distinguish ourselves from our competitors.\nKeep branding consistency within the Lightricks brand and our products.\nHave fun. Be creative.\nYour skills and experience\nBachelor's Degree in Visual Communication.\nExceptional online portfolio.\nStrong fundamentals in design, image making, typography, motion and attention to details.\nHighly proficient in Photoshop, Illustrator & Figma. After Effects - a plus.\nSelf-starter, self-motivated, ability to work independently and in a team environment.\nAbility to work under pressure and time constraints.\nStrong communication skills, both in Hebrew & English.Show more Report"}, {"company": "TechSee", "job": "Marketing Graphic Designer (Maternity leave replacement)", "city": "Herzliya", "date": "30d+", "rating": "4.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=129&ao=1136043&s=58&guid=00000186e636400c8a7d1577e894c8bc&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ff0f2c03&cb=1678899818038&jobListingId=1008441234902&jrtk=3-1-1grj3kbfbjm57801-1grj3cg4j227a000-2de17dc341b5e725-", "description": "About the Company:\nTechSee is the leader in Visual Engagement. TechSee is revolutionizing the technical support and field services industry through Augmented Reality and AI technology. A proven leader in the market, Techsee has hundreds of customers including Vodafone, Orange, Hitachi, and dozens of Fortune 500 companies. TechSee is rapidly expanding globally and is backed by leading venture capital firms like Salesforce Ventures, Telus, and OurCrowd.\nEmployees at TechSee are supported through a flexible work environment that allows for working from home or coming into one of the many WeWork offices.\nThe opportunity:\nTechSee is an established technology innovator, providing the world’s largest brands with interactive visual assistance at true global scale.\nThis is an opportunity to join a dynamic team that works with top global brands in the US and Europe. We are looking for a creative and highly skilled graphic design lead to join our growing global marketing team.\nThis role will work with the Marketing team to create a wide range of visual assets to drive the company’s sales and marketing performance.\nResponsibilities:\nManage the end-to-end design process, prioritizing and communicating as needed with all relevant stakeholders.\nMaintain and refine our visual brand language across all branded assets.\nGenerate graphic materials for marketing and sales collateral: presentations, brochures, white papers, emails, webpages, infographics, trade show booths, advertising, etc.\nEmpower the team with the guidelines, presentation and document templates and branded assets to enable content creation with minimal design oversight.\nEdit basic marketing videos and motion graphics (GIFs)\nAssist with other marketing-related and company projects as required\nRequirements:\n3+ years of experience in graphic design for a B2B marketing team in the tech sector.\nExperience presentation and document design as well as print requirements.\nStrong experience empowering teams do create their own assets in Google Slides, Docs, Canva\nFamiliarity with WordPress, Elementor, HTML, CSS – advantage.\nBasic knowledge of video and audio editing software (Primer, After Effects) - advantage.\nPassionate about turning marketing concepts into creative, visual deliverables.\nStrong team player, with excellent communications and interpersonal skills, experience with project management (Asana experience a plus)\nHighly organized, creative thinker and problem solver\nEnglish mother tongue\nAvailable to collaborate with partners and teams in the US during their morning hours.\nWhy work with us?\nOur culture encourages collaboration and emphasizes success, personal and professional development.\nTraining & Career path: Formal development of your skills, including leadership skills in addition to learning TechSee’s market-leading AI and AR solutions,.\nCompensation: Strong benefits and an ownership (equity) in a high-growth SaaS venture\nTools: Provide you with the resources needed to achieve your goals and development skills.\nWork environment: Hybrid work environment, with frequent virtual social activities to promote employee engagement.\nCulture: TechSee is a fun and exciting place to work, empowering its employees to bring out-of-the-box thinking to generate cool new ideas. Our culture encourages inclusive teams and emphasizes care and collaboration.\nSuccess: TechSee has established a global presence, trusted by Tier 1 enterprise customers across the telecom, consumer electronics, manufacturing, insurance and many other industries. Our product is used in the by companies like TELUS, Verizon, HIPPO, Lennar, Vodafone, Hitachi, Samsung, Heineken and more!\nThe company is headquartered in Tel Aviv with oﬃces in New York, London, and Madrid.Report"}, {"company": "Silverfort", "job": "Product Designer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.9", "link": "", "description": "Silverfort is a Tel Aviv-based cyber-security start-up that develops a revolutionary identity protection platform. Using patented technology, our product enables strong authentication across entire corporate networks and cloud environments, without any modifications to endpoints and servers. In addition, we use advanced behavior analytics to apply adaptive authentication policies and prevent cyber-attacks in real-time.\nOur mission is to provide industry-leading unified identity protection solutions for hybrid and multi-cloud environments. We develop cutting-edge cybersecurity technology that solves urgent customer needs today and is also a game changer for years to come.\nSilverfort has happy customers worldwide, strong market validation (including several industry awards), strategic partnerships with the largest security vendors in the world, and significant funding from leading VCs.\nIn this role and as the first Product Designer at Silverfort, you will be responsible for leading the design of our product, working closely with our engineering, product, and marketing teams to create intuitive and visually appealing user experiences.\nRequirements:\n\n3+ years of demonstrated experience with end-to-end (UX and UI) product design in a B2B product company\nExperience in designing dashboards and making complex data accessible and intuitive to take action upon\nExcellent human relations and a high level of service\nStrong skills in design software such as Sketch, Figma, or Adobe XD\nA strong portfolio that showcases aesthetic awareness and design problem-solving abilities\nAdvantage - experience working in a cyber security company\nResponsibilities:\n\nGenerate clear ideas, concepts, and designs of creative assets\nConduct a full design cycle - from collecting inspiration through creating a pixel-perfect design, ending with delivery, and supporting development\nCreate and improve our design system\nWork closely with the engineering team to guide them through the successful implementation of your design\nStay up to date with the latest UI trends, UX patterns, techniques, and technologies\nWe are an enterprise product that thrives to have a cutting-edge user experience\nDrive adoption with intuitive user flowsShow more Report"}]