[{"company": "Planned Parenthood Keystone", "job": "Medical Care Assistant - Bensalem", "city": "Central", "date": "7d", "rating": "3.5", "link": "", "description": "Planned Parenthood Keystone (PPKey) serves 37 counties in Pennsylvania, home to over half of Pennsylvania residents. We have administrative offices in the Lehigh Valley, Harrisburg, Warminster, and York. We operate 9 medical centers that serve over 22,000 patients annually and offer comprehensive sexuality education that reaches thousands of young adults.\nPlanned Parenthood Keystone is looking for individuals who are committed to supporting our shared goal of strengthening and enhancing our awareness and commitment to advancing the cause of racial & social justice in our organization.\nPlanned Parenthood Keystone is looking for a full-time, non-exempt, Medical Care Assistant at our Bensalem and Warminster Medical Centers. A Medical Care Assistant is responsible for providing exceptional customer service to our patients while serving as a member of our dedicated team of medical center employees.\nHere at Planned Parenthood Keystone we have a passion for creating a culture of exceptional customer service. So, we are looking for people that will not only continually exceed our patient's expectations, but will also take pride in cultivating positive relationships with patients and fellow employees.\nResponsibilities Include:\nPerform general reception duties including answering phones, scheduling appointments, and greeting & assisting patients/ visitors\nServe as the first point of contact for maintaining efficient work flow. Alert appropriate staff to any issues that may affect patient flow\nAccurately register and update the patient record, verify income and program status and update as necessary, including verifying purpose of the patient’s visit, assigning appropriate electronic template, and updating the patient information in the practice management system\nDetermines and collects patient fees, receives and records current charges, payments of accounts, records balance due at the end of the visit\nInform patients about general reproductive health care, abortion services, all FDA approved birth control methods, sexually transmitted disease testing and treatment, HIV testing, safer sex, and medical center procedures\nProvide factual, unbiased information to patients seeking abortion. Describe the difference between medication and surgical abortion\nEducates patients of fees, visit procedures, contraception, STDs, etc.\nCounsel patients on pregnancy outcome electives in a non-directive manner including adoption, abortion, and parenting. Provide community referral resources\nProvide room assistance for specialty procedures including, but not limited to colposcopy and loop electrosurgery\nPerforms appropriate lab procedures including venipuncture, urine dipstick, weight, blood pressure, anemia and RH factor tests\nSupports Advanced Practice Clinicians (APCs) by prepping patients, labs, and supplies\nPerforms infection control tasks in accordance to Planned Parenthood, CLIA and OSHA guidelines when working with specimens and cleaning instruments\nMaintain facility for cleanliness, appropriate instruments, and optimum supply levels. Maintain equipment for proper functioning in accordance with the policies and standards of Planned Parenthood and regulatory agencies\nAdhere to all HIPAA and patient privacy regulations. Maintain patient and medical center confidentiality\nComply with all medical protocols, policies and procedures, including any federal & state laws and regulations governing the services provided by Planned Parenthood\nWork collaboratively with center team to meet patient needs, individual/center productivity levels\nQualifications:\nGood interpersonal, problem solving, and communication skills\nAbility to read and interpret documents such as policies and procedures\nAbility to write routine reports and correspondence\nAbility and willingness to work a flexible schedule including nights and weekends\nComputer literacy, including competence in affiliate email, Internet, and patient management systems software\nStrong commitment to quality healthcare and excellent customer service\nAbility and willingness to travel. Reliable means of transportation\nEducation and Experience:\nCompletion of an accredited high school program or equivalent is required; further education and/or training preferred\nAdditional training and/or education in reproductive health or medical services is desirable\nActive Medical Assistant or Nursing Assistant Certification or a minimum of one year of experience working in a healthcare setting preferred\nPlanned Parenthood is an equal employment opportunity employer. We comply with all applicable laws prohibiting discrimination based on race, color, religion, gender and gender expression/identity, age, ethnicity, national origin, ancestry, physical or mental disability, uniformed service member/veteran status, marital status, medical condition, pregnancy, sexual orientation, citizenship status, genetic information, as well as any other category protected by federal, state, or local. We are committed to building an inclusive workplace that values racial & social justice. We strongly encourage all persons to apply, including people of color and members of the LGBTQ community.Show more Report"}, {"company": "UVA Medical Center", "job": "Certified Medical Assistant, Orthopedic Clinic – Ivy Mountain, Full Time", "city": "Central", "date": "1 day ago", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=1136043&s=58&guid=00000186e62f3f97954bc31e09f9b421&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_3f01402c&cb=1678899296533&jobListingId=1008526599539&jrtk=3-1-1grj34e6nmfrs801-1grj2ufvfghr8800-8d8eea0b9153cade-", "description": "Medical Assistants provide clinical support, assist with administrative tasks, and provide general support in an ambulatory setting under the\n\ndirection or supervision of the patient’s physician or LIP/RN designee in accordance with policy, procedure and competency to promote\n\npatient health and wellness. Duties may include: patient care, vital signs, assisting licensed health care professionals, performing\n\nvarious laboratory tests, quality control indicators, and clinical intake.\n\nThis position requires providing service to all age populations in a manner that demonstrates an understanding of the\n\nfunctional/developmental age of the individual served\nAssists in assuring effective and efficient clinic operations while maintaining consistent and accurate communication with team members, referring providers, and patients.\nAssists with data collection for physical, psychological, social, and cultural dimensions of patients according to professional practice standards and institutional policy/procedure.\nCompletes standardized rooming and performs clinical intake, data collection, and documentation.\nAs directed and in accordance with documented competencies, provides clinical support to licensed healthcare professionals during examinations and procedures. Clinical support services include but are not limited to preparing laboratory specimens, performing testing (i.e. point of care testing, CLIA waived testing ECG/EKG, spirometry, venipuncture/phlebotomy, specimen collection, etc.), appropriate cleaning and sterilization of instruments/equipment and rooms, disposing of contaminated supplies, performing wound care, administering medications.\nOrganizes and prioritizes daily work assignments to support patient needs, the interdisciplinary team, and operational efficiency.\nImplements age-appropriate interventions based on individual patient needs as directed by the Health Care Provider (HCP).\nReinforces patient/family teaching plan based on identified health education needs and the condition and age of the patient through approved educational materials or written instructions.\nProvides for a safe environment and safe delivery of care.\nMaintains supplies and equipment.\nDocument and capture charges for clinical support services rendered within the patient visit.\nPerforms administrative support responsibilities. As directed and in accordance with documented competencies, provides administrative support to licensed healthcare professionals. Administrative support services include but are not limited to draft letters and/or assist with completion of forms, facilitate scheduling, pend medication refills, assist with coverage of in basket messaging, assist with clinic/chart prep.\nDemonstrates teamwork in the delivery of patient care. Recognizes the importance of time sensitive issues.\nAssumes responsibility for professional development of self and others according to departmental policy.\nIn addition to the above job responsibilities, other duties may be assigned.\nPosition Compensation Range: $18.37 - $28.47 Hourly\nMINIMUM REQUIREMENTS\nEducation: High School Diploma or equivalent required. Graduation from a Medical Assistant Program accredited by the Commission on Accreditation of Allied Health Education (CAAHEP) or Accrediting Bureau of Health Education Schools (ABHES) is or Military Medical Specialist with twenty-four months experience and eligible for certification or registration.\nExperience: preferred, not required.\nCertification/Registration: Current Medical Assistant Certification through a recognized national professional association such as the AAMA (American Association of Medical Assistants), the AMT (American Medical Technologists), NAHP (The National Association of Healthcare Professions), the ARMA (American Registry of Medical Assistants), or the NHA (National Healthcare Association). Credentials must be obtained within 6 months from the date of hire. American Heart Association (AHA) Health Care Provider BLS certification is required with hire.\n\nPHYSICAL REQUIREMENTS\n\nThe job requires standing for prolonged periods and frequently bending/stooping/traveling. Ability to lift/push/pull 20 – 50lbs. May be exposed to chemicals, blood/body fluids, and infectious disease.\n\nCOVID Vaccination Requirement and Guidelines\nPlease visit the UVA COVID-19 Job Requirements and Guidelines webpage prior to applying for current information regarding vaccination requirements and guidelines for employment at UVA.\nThe University of Virginia, i ncluding the UVA Health System which represents the UVA Medical Center, Schools of Medicine and Nursing, UVA Physician’s Group and the Claude Moore Health Sciences Library, are fundamentally committed to the diversity of our faculty and staff. We believe diversity is excellence expressing itself through every person's perspectives and lived experiences. We are equal opportunity and affirmative action employers. All qualified applicants will receive consideration for employment without regard to age, color, disability, gender identity or expression, marital status, national or ethnic origin, political affiliation, race, religion, sex (including pregnancy), sexual orientation, veteran status, and family medical or genetic information.Show more Report"}, {"company": "MUSC", "job": "MUHA AI57 - SCRIBE- MCP Columbia Clinics (Northeast)", "city": "Central", "date": "30d+", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=103&ao=1136043&s=58&guid=00000186e62f3f97954bc31e09f9b421&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_56a43b57&cb=1678899297817&jobListingId=1008253230026&jrtk=3-1-1grj34feejm7s801-1grj2ufvfghr8800-b2761f493e9d80d0-", "description": "Minimum Education\n\nHigh School Diploma; Bachelor’s degree preferred\n\n\nMinimum Work Experience\n\nAt least 1 year of experience as a scribe preferred\n\nRequired Skills\n\nExperience with medical terminology\nExcellent computer skills\nImpeccable verbal, written, and interpersonal skills\nStrong attention to detail\nExcellent bedside manner.\n\n\nRequired Licenses\n\n[South Carolina, United States] Medical Assistants\n\nCertified Medical Assistant or Certified Medical Scribe Certification preferred.Show more Report"}, {"company": "Planned Parenthood Keystone", "job": "Medical Care Assistant - Warminster", "city": "Central", "date": "30d+", "rating": "3.5", "link": "", "description": "Planned Parenthood Keystone (PPKey) serves 37 counties in Pennsylvania, home to over half of Pennsylvania residents. We have administrative offices in the Lehigh Valley, Harrisburg, Warminster, and York. We operate 9 medical centers that serve over 22,000 patients annually and offer comprehensive sexuality education that reaches thousands of young adults.\nPlanned Parenthood Keystone is looking for individuals who are committed to supporting our shared goal of strengthening and enhancing our awareness and commitment to advancing the cause of racial & social justice in our organization.\nPlanned Parenthood Keystone is looking Full-time (35 hours/week), non-exempt, Medical Care Assistant based out of our Warminster Medical Center. A Medical Care Assistant is responsible for providing exceptional customer service to our patients while serving as a member of our dedicated team of medical center employees.\nYou will participate in a team approach to the delivery of quality reproductive healthcare in accordance with Planned Parenthood’s policies and medical protocols. The Medical Care Assistant must proficiently perform responsibilities in areas of medical center support operations: Front Desk, Patient Intake, and Clinical (Back Office).\nESSENTIAL FUNCTIONS:\nFront Desk Responsibilities:\nPerform general front desk duties including answering phones, scheduling appointments, and greeting & assisting patients/ visitors Follow the Planned Parenthood safety and security procedures for screening visitors\nServe as the first point of contact for maintaining efficient work flow.\nAlert appropriate staff to any issues that may affect patient flow\nAccurately register and update the patient record, verify income and program status and update as necessary, including verifying purpose of the patient’s visit, assigning appropriate electronic template, and updating the patient information in the practice management system Identify patient insurance, scan insurance documents, and verify insurance coverage and if necessary, complete benefits information to include Medicaid/ Medicaid Managed Care patients and Commercial insurance Determines and collects patient fees, receives and records current charges, payments of accounts, records balance due at the end of the visit\nAccurately accounts for pharmacy sales in the medical center Performs end of the day close and reconciles cash and credit cards against the day sheet and prepares bank deposits. Documents in notes any issues regarding balances, payments, credit, etc.\nPatient Intake Responsibilities:\nInform patients about general reproductive health care, abortion services, all FDA approved birth control methods, sexually transmitted disease testing and treatment, HIV testing, safer sex, and medical center procedures\nProvide factual, unbiased information to patients seeking abortion.\nDescribe the difference between medication and surgical abortion Educates patients of fees, visit procedures, contraception, STDs, etc.\nVerifies and correctly documents patient income as well as accurately determines eligibility for financial assistance funding or private pay\nCounsel patients on pregnancy outcome electives in a non-directive manner including adoption, abortion, and parenting.\nProvide community referral resources\nObtains informed consent and written signature on most recent patient education sheets\nClinical (Back Office) Responsibilities:\nProvide room assistance for specialty procedures including, but not limited to colposcopy and loop electrosurgery\nPerforms appropriate lab procedures including venipuncture, urine dipstick, weight, blood pressure, anemia and RH factor tests\nEnsures labs are prepped and packaged for the appropriate lab companies\nSupports Advanced Practice Clinicians (APCs) by prepping patients, labs, and supplies\nPerforms infection control tasks in accordance to Planned Parenthood, CLIA and OSHA guidelines when working with specimens and cleaning instruments\nActively participates with compliance measures for pharmaceuticals including removing expired products and rotating stock\nAbortion Care Responsibilities:\nAides in the completion of surgical abortion procedures by examining the products of conception in accordance with Planned Parenthood protocol\nMaintains an efficient workflow while adhering to all protocols related to working alongside MDs and RNs during abortion procedures in the Procedure Room, Post-Procedure Room or on Infection Control Alerts MDs to findings as needed\nGeneral Medical Center Responsibilities:\nWork collaboratively with the health center team to meet patient needs as well as individual and center productivity levels and patient cycle times\nCompliance with Throughput (TP) priorities, strategies and Team Centered Patient Care (TCPC) components\nProvide support services related to Telehealth in accordance with federal and state laws and applicable regulations\nMaintain facility for cleanliness, appropriate instruments, and optimum supply levels.\nMaintain equipment for proper functioning in accordance with the policies and standards of Planned Parenthood and regulatory agencies\nAssist with inventory maintenance including keeping records, stocking and ordering supplies\nParticipates in emergency drills and follows emergency procedures\nEnsure a culture that embraces diversity, fair and respectful treatment of all persons, and customer-focused delivery throughout the organization\nEnsure completion of all required training, including, but not limited to: CALs & CPR Adhere to all HIPAA and patient privacy regulations.\nMaintain patient and medical center confidentiality\nParticipate in the quality assurance/risk management process, including incident reports and follow up\nAdhere to the Personal protective Equipment (PPE) protocol as well as protocols outlined in the affiliate infection control program\nComply with all medical protocols, policies and procedures, including any federal & state laws and regulations governing the services provided by Planned Parenthood\nWork collaboratively with center team to meet patient needs, individual/center productivity levels\nCompetently use the patient information system software in all of its applications, if applicable to job\nServe as an Ambassador for the organization to inspire support and connection with the mission and services provided by the affiliate\nThe above essential functions are not an exhaustive list of required responsibilities, duties, and skills. Other duties may be added, or this job description may be amended at any time.\nVALUES AND COMMITMENTS:\nCommitment to Planned Parenthood’s mission and conviction to health equity and access to sexual and reproductive healthcare\nUnderstanding of racism and commitment to racial & social justice\nAwareness of multiple group identities and their dynamics, bringing a high level of self-awareness, empathy, and humility to interpersonal interactions; building of trust across diverse groups of people\nDemonstrated ability to communicate and hear effectively across differences and reflect and act on feedback related to identity and equity with the aim to learn\nCommitment to Planned Parenthood’s In This Together service ethos, workplace values, and service standards\nQUALIFICATIONS AND EXPERIENCE:\nRequired:\nCompletion of an accredited high school program or equivalent is required\nComputer literacy, including competency in affiliate email, Microsoft suite, internet, and electronic health record system, if applicable to job\nGood interpersonal, problem solving, and communication skills\nAbility to read and interpret documents such as policies and procedures\nAbility to write routine reports and correspondence\nAbility and willingness to work a flexible schedule including nights and weekends\nComputer literacy, including competence in affiliate email, Internet, and patient management systems software\nStrong commitment to quality healthcare and excellent customer service\nAbility and willingness to travel. Reliable means of transportation\nPreferred:\n1-2 years of experience with progressive responsibility in the reproductive health or general healthcare industry (ies).\nActive Medical Assistant or Nursing Assistant Certification\nSALARY AND BENEFITS:\nCompensation for this position starts at $17.25 per hour and goes up from there based on experience\nMedical, Dental, and Vision coverage options for you and eligible dependents\nShort Term Disability\nLife/AD&D and Long Term Disability policy voluntary coverage options\nGenerous vacation, leave, and holiday benefits\nPlanned Parenthood is an equal employment opportunity employer. We comply with all applicable laws prohibiting discrimination based on race, color, religion, gender and gender expression/identity, age, ethnicity, national origin, ancestry, physical or mental disability, uniformed service member/veteran status, marital status, medical condition, pregnancy, sexual orientation, citizenship status, genetic information, as well as any other category protected by federal, state, or local. We are committed to building an inclusive workplace that values racial & social justice. We strongly encourage all persons to apply, including people of color and members of the LGBTQ community.Show more Report"}, {"company": "Thermo Fisher Scientific", "job": "Assistant CRA", "city": "Tel Aviv-Yafo", "date": "24h", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=1136043&s=58&guid=00000186e62f3f97954bc31e09f9b421&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_8c81e8e9&cb=1678899300292&jobListingId=1008530093778&jrtk=3-1-1grj34hqcmfqd801-1grj2ufvfghr8800-64162bd2632109ff-", "description": "At Thermo Fisher Scientific, you’ll discover meaningful work that makes a positive impact on a global scale. Join our colleagues in bringing our Mission to life - enabling our customers to make the world healthier, cleaner and safer. We provide our teams with the resources needed to achieve individual career goals while taking science a step beyond through research, development and delivery of life-changing therapies. With clinical trials conducted in 100+ countries and ongoing development of novel frameworks for clinical research through our PPD clinical research portfolio, our work spans laboratory, digital and decentralized clinical trial services. Your determination to deliver quality and accuracy will improve health outcomes that people and communities depend on – now and in the future.\nOur global Clinical Operations colleagues within our PPD® clinical research services provide end-to-end support for clinical trials from study start up to monitoring through to study close out, across commercial and government contracts. Together, we help clients define and develop clinical programs, minimize delays, and complete high-quality, cost-efficient clinical studies.\nPosition Overview:\nPerforms remote activities on assigned projects in liaison with the Remote CRA, On-Site CRA and study CTM. Provides support with regards to site preparedness, logistical support to the monitoring process, and assist with assigned tasks for site management and remote monitoring in accordance with SOPs and regulatory guidelines. May be assigned limited site contact activities during study start-up, site management, recruitment and close out phases.\nEssential Functions:\nCompletes study and site management activities as defined in task matrix, and as applicable and directed for study assigned.\nCompletes and documents study-specific training.\nOrients and trains on any CRG/study-specific systems.\nProvides in-house support during pre-study assessments and with pre-study assessment waivers, as agreed for project.\nSupports to customize Site ICF with site contact details, as needed.\nPerforms remote review of EMR/EHR checklist and supports collection, as applicable assessments.\nVerifies document collection and RCR submission status; updates site EDL and verifies site information.\nReviews patient facing materials and review translations, as directed.\nSupports site staff with the vendor related qualification process, where applicable.\nProvides support by ensuring system access is requested/granted and revoked for relevant site staff during pre-activation and subsequent course of the study.\nProvides support to follow-up on site staff training, as applicable.\nCoordinates and supports logistics for IM attendance, as directed.\nSupports maintenance of vendor trackers, as directed.\nCoordinates study/site supply management during pre-activation and subsequent course of the study.\nSupports Essential Document collection, review and updating in systems, as applicable.\nFollows up and supports on missing study vendor data like ECGs, lab samples, and e-diaries, as directed.\nSupports ongoing remote review of centralized monitoring tools, as directed.\nSupports Site payments processes by coordinating with various functional departments within organization and site. Supports system updates and reconciliations, as directed and follows-up on site invoices throughout the study period.\nPerforms reconciliation tasks on assigned trials including but not limited to CRF and query status, deviations, SAEs and safety reports, as applicable.\nVerifies document collection status in CRG systems and drives action for missing/incomplete/expired documents and open document findings, as directed.\nMay perform other assigned site management tasks, as directed by RCRA and as per Task Matrix.\nMay perform a specific role profile for FSP opportunities according to Client requests.\nMaintains & completes administrative tasks such as expense reports and timesheets in a timely manner.\nKeys to Success:\nEducation and Experience:\nPrevious experience that provides the knowledge, skills, and abilities to perform the job (comparable to 1 to 2 years).\nIn some cases an equivalency, consisting of a combination of appropriate education, training and/or directly related experience, will be considered sufficient for an individual to meet the requirements of the role.\nKnowledge, Skills and Abilities:\nBasic medical/therapeutic area knowledge and understanding of medical terminology\nAbility to attain and maintain a working knowledge of ICH GCP, applicable regulations and CRG procedural documents\nEffective oral and written communication skills\nExcellent interpersonal and customer service skills\nGood organizational and time management skills and strong attention to detail, with tried ability to handle multiple tasks efficiently and effectively\nProven flexibility and adaptability\nAbility to work in a team or independently, as required\nWell-developed critical thinking skills, including but not limited to: critical mindset, in-depth investigation for appropriate root cause analysis and problem solving\nAdvanced digital literacy with good knowledge of MS Office ability to learn and use appropriate software. Leverage modern technology when applicable\nAbility to extract pertinent information from all study documents, electronic study data systems, CTMS and dashboards\nExcellent English language and grammar skills\nWhat we offer:\nWe hire the best, develop ourselves and each other, and recognize the power of being one team. We understand that you will want to grow both professionally and personally throughout your career, and therefore you will benefit from an award-winning learning and development programme, ensuring you reach your potential.\nAs well as being rewarded a competitive salary, we have an extensive benefits package based around the health and well-being of our employees. We have a flexible working culture, where PPD® clinical research services truly value a work-life balance. We’ve grown sustainably year on year but continue to offer a collaborative environment, with teams of colleagues eager to share expertise and have fun together. We are a global organization but with a local feel.\nOur Mission is to enable our customers to make the world healthier, cleaner and safer. Watch as our colleagues explain 5 reasons to work with us. As one team of 100,000+ colleagues, we share a common set of values - Integrity, Intensity, Innovation and Involvement - working together to accelerate research, solve complex scientific challenges, drive technological innovation and support patients in need. #StartYourStory at Thermo Fisher Scientific, where diverse experiences, backgrounds and perspectives are valued.Show more Report"}, {"company": "Baptist Health System KY & IN", "job": "Certified Medical Assistant PRN", "city": "Central", "date": "30d+", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=106&ao=1136043&s=58&guid=00000186e62f3f97954bc31e09f9b421&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_edcf0518&cb=1678899301934&jobListingId=1007987219338&jrtk=3-1-1grj34jevkf0k801-1grj2ufvfghr8800-273d6e0563f13005-", "description": "Job Description:\nJob Summary:\nThe Medical Assistant II (MA) will be responsible for the coordination of direct patient care activities and providing clinical support to providers within one of our clinical practices.\nDuties include but not limited to the following: obtaining patient medical history information, expediting patient flow, rooming patients, stocking clinic with supplies, navigating electronic health record system (EPIC), scheduling and following-up with appointments and assisting with medication fill and refill requests, checking for prior authorizations and scheduling tests, procedures and consultations.\nThe MA will communicate with pharmacies, insurance companies, patients and physicians in a respectful manner and will uphold Baptist’s mission and core values that drive service excellence.\nEssential Duties and Responsibilities:\nManages the coordination and flow of patients throughout the patients visit to create an exceptional patient experience.\nProactively check the provider’s schedule and review information within the patient record to ensure that all required information is available prior to their visit.\nProactively obtains any missing information from the patient to ensure that medical records are accurate and up to date, which helps to ensure better care is being provided.\nUpon arrival, captures patient’s vital signs, past medical, social and family history, medication usage and preferred pharmacy information.\nEnsures compliance with all state and federal regulatory requirements including HIPAA/OSHA compliance.\nMinimum Requirements:\nAt least 2 years of healthcare experience working as an MA, C.N.A, EMT, LPN or RN operating and providing care within a direct patient care setting.\nBasic computer skills, specifically with navigating within databases containing highly confidential information.\nBasic Life Support and other advanced training as appropriate.\nIf you would like to be part of a growing family focused on supporting clinical excellence, teamwork and innovation, we urge you to apply now!\nEmployees will be expected to comply with Baptist Health’s infectious disease and vaccination policies, which include but may not be limited to compliance with BHS’ mandatory vaccination policies for influenza and COVID unless reasonable accommodations are needed under applicable law\nBaptist Health is an Equal Employment Opportunity employer.Show more Report"}, {"company": "Planned Parenthood Keystone", "job": "Assistant Center Manager - Warminster", "city": "Central", "date": "7d", "rating": "3.5", "link": "", "description": "Planned Parenthood Keystone (PPKey) serves 37 counties in Pennsylvania, home to over half of Pennsylvania residents. We have administrative offices in the Lehigh Valley, Harrisburg, Warminster, and York. We operate 9 medical centers that serve over 22,000 patients annually and offer comprehensive sexuality education that reaches thousands of young adults.\nPlanned Parenthood Keystone is looking for individuals who are committed to supporting our shared goal of strengthening and enhancing our awareness and commitment to advancing the cause of racial & social justice in our organization.\nFull-time, non-exempt Assistant Center Manager based out of our Warminster Medical Center. As a member of the management and medical services teams, the Assistant Center Manager is responsible for assisting the Health Center Manager in the leadership and management of all health center services, systems, and personnel. Participates in a team approach to the delivery of quality reproductive health care in accordance with affiliate approved policies and current medical standards.\nHere at Planned Parenthood Keystone we have a passion for creating a culture of exceptional customer service. So, we are looking for people that will not only continually exceed our patient's expectations, but will also take pride in cultivating positive relationships with patients and fellow employees.\nThe responsibilities of this position include, but are not limited to:\nProvide center leadership to foster positive attitudes and trust among staff in accomplishing the goals and objectives of the affiliate. Maintain continuity of center operations during absences of the Health Center Manager\nAssist with hiring, supervising, training, and evaluating center staff in the provision of family planning, all FDA approved birth control methods, STD prevention and treatment, HIV testing, and abortion\nMaintain knowledge in all health center services in order to effectively supervise health center staff training & development\nParticipate in the quality/risk management process for medical protocols, regulatory agency compliance, HR policies, and workplace safety policies\nFacilitate center staff meetings as required and participate in medical, management, and organizational meetings as required\nProvide management and operational support, mentoring and training to locations and personnel throughout the organization as needed\nAssist with staff scheduling to ensure efficient center operations\nWork collaboratively with the health center team to meet patient needs as well as individual and center productivity levels and patient cycle times\nCompliance with Throughput (TP) priorities, strategies and Team Centered Patient Care (TCPC) components\nAssist with the timely completion of the practice management system data corrections\nAssist with developing the center budget, monitoring budget activity, & taking corrective action as needed\nAssist with maintaining a satisfactory facility appearance and optimal functioning of equipment. Respond to after-hours maintenance and security emergencies as needed\nAssist with the inventory control process including keeping records, stocking and ordering supplies, and assuring appropriate levels of materials\nProvide factual, non-biased information to patients seeking abortion. Describe the difference between medication and surgical abortion\nCompetently use the patient information system software in all of its applications on affiliate laptops for optimal center flow\nAssist in ensuring compliance with applicable federal, state, and local laws and regulations, health care licensing, contracts, grant requirements, family planning councils, Planned Parenthood policies and procedures, medical protocols, infection control plan, security standards, and employee handbook\nServe as a floating employee to all PPKey locations, as needed for staff sharing, to ensure appropriate coverage in order to meet patient demand\nAssist the Health Center Manager in the timely delivery of all center reports\nMaintain patient and health center confidentiality\nEnsure a culture that embraces diversity, equity, and inclusion of all persons\nEnsure completion of required annual training\nAdhere to all HIPAA and patient privacy regulations\nServe as an Ambassador for the organization to inspire support and connection with the mission and services provided by the affiliate\nQualifications & Experience (required):\nCompletion of an accredited high school program or equivalent is required\nAssociate’s Degree in a related field, or equivalent experience\nAbility and willingness to travel. Reliable means of transportation.\nAbility to travel for regional staff sharing as much as 20% on an \"as needed\" basis\nComputer literacy, including competency in affiliate email, Internet, and patient management systems software, if applicable to job\nExcellent interpersonal and communication skills that enable work in a collaborative and multi-faceted team environment\nAccuracy and attention to detail\nAbility to mentor individuals and lead a large team\nAnalytical thinking and problem solving skills\nComputer literacy, including competency in affiliate email, Internet, and patient management systems software\nAbility to organize, multi-task and effectively function in a fast paced environment to set and achieve short and long term goals\nAbility and willingness to work flexible hours including weekends, early morning, and/or evening hours\nAbility to work independently under minimal supervision\nQualifications & Experience (Preferred):\n1 or more years of health care experience with progressive responsibility\nSpanish language skills desirable\nDemonstrated leadership ability\nSalary & Benefits:\nCompensation for this position starts at $21.85 per hour\nMedical, Dental, and Vision coverage options for you and eligible dependents\nShort Term Disability\nLife/AD&D and Long Term Disability policy voluntary coverage options\n401 (k) Retirement plan with up to 2% employer match\nGenerous vacation, leave, and holiday benefits\nPlanned Parenthood is an equal employment opportunity employer. We comply with all applicable laws prohibiting discrimination based on race, color, religion, gender and gender expression/identity, age, ethnicity, national origin, ancestry, physical or mental disability, uniformed service member/veteran status, marital status, medical condition, pregnancy, sexual orientation, citizenship status, genetic information, as well as any other category protected by federal, state, or local. We are committed to building an inclusive workplace that values racial & social justice. We strongly encourage all persons to apply, including people of color and members of the LGBTQ community.Show more Report"}, {"company": "Hawk-Eye Innovations", "job": "Match Operations Assistant", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=108&ao=1136043&s=58&guid=00000186e62f3f97954bc31e09f9b421&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_5cca10d7&cb=1678899305682&jobListingId=1008447806531&jrtk=3-1-1grj34n4gklvm801-1grj2ufvfghr8800-7823f9a5ed478073-", "description": "Location: Onsite at stadiums within a 2hr radius of Tel Aviv\nContract: Consultant, Part-Time\nSalary: Up to €200 per day\nStart Date: Immediate\nWe are recruiting to fill Match Assistant roles within our expanding operations in UEFA Football. This is an exciting opportunity to work at the forefront of sports technology as part of a dedicated and dynamic team.\nThe role involves the setup and operation of our systems on-site at football stadiums throughout Europe for various football competitions, including (but not limited to) Champions League, Europa League and international European Qualification matches.\nWorking day expectations:\nMatch Day -> Arrival up to 7 hours pre-Kick Off\nMatch Day -> End of day up to 2 hours post game completion\nThere are also varied needs during the setup day/s which may require the consultants to be present on the day/s before match day.\nThe role requires the consultant to be flexible with work hours depending on the needs of the onsite team\n\nWe are looking for committed and passionate people that are willing, and able to commit to all UEFA matches in given stadiums. This is in order to provide the team with consistency throughout the competitions. Please consider that this work is likely to be midweek, Tuesday, Wednesday or Thursday on most occasions. Refer to the UEFA calendar (https://www.uefa.com/returntoplay/news/027c-16dee2d0b98f-a5040858c501-1000-2023-european-football-calendar/) to see more details of when fixtures may be.\nWe will equip you with the technical training, support and full exposure to our systems to perform your match day tasks but also encourage development and progression to help make an impact on what we do. Working as a Match Operations Assistant, is a great entry level route into full time employment with Hawk-Eye Innovations ltd.\nPlease attach your CV in English.\nKey Responsibilities\nIt is important to note that Match Operations Assistants have various responsibilities that will depend on the role assigned to them. In most cases, a maximum of two of the listed responsibilities below would be assigned per match:\nSet up the medical system\nRun cabling\nTake the Medical Tablets to these positions\nLaunch the software\nTroubleshoot issues with the hardware and associated software\nInteract professionally with and provide support to the medical teams who use the system\nSet up the audio system\nRun cabling\nTest the audio units\nTroubleshoot issues with the hardware and associated software\nInteract professionally with the Match Officials that will be using the audio system during the game\nWorking with the Electronic Performance and Tracking Systems (EPTS) Team Lead to set up EPTS\nLineup cameras (likely to include working at height, on ladders on on stadium catwalks)\nCoordinate with the EPTS Team Lead to troubleshoot any issues with hardware or software\nSet up / Operate the Referee Review Area Monitor (RRA)\nRun cabling\nTest functionality of RRA monitor and backup systems\nTroubleshoot issues with the hardware and associated software\nRaising of the RRA into position during pre-match tests and during the game when required\nOther Responsibilities:\nContribute as part of the team setting up goal-line and video review systems\nConducting pre-match checks of the systems in accordance with standard procedures\nLiaising with football officials, stadium/club personnel, match officials and host broadcasters both on-site and remotely\nMonitoring and operating the system during the match\nOrganising your logistics for travelling between stadiums locations as and when required\nSkills, Knowledge and Expertise\nESSENTIAL:\nBright and enterprising with excellent organisational, analytical and problem-solving skills\nProactive, responsible attitude and ability to work on your own initiative with minimum supervision\nTime management skills and ability to work in a high pressure, procedural, live broadcast environment\nAbility to liaise with clients and customers in a professional and approachable manner with attention to good communication.\nHigh proficiency in the English language required\nAble to adapt to flexible working conditions with irregular working hours\nPREFERRED:\nA technical background, ideally in IT or Broadcast\nAn interest in sport and/or sports analysis, ideally with a good knowledge of football and the rules of the game\nExperience working with VT/replay technology desirable, or live event / technical production\nPrepared to travel locally and, if required, further afield in Europe\nDriving licence preferred\nBenefits\nA high-autonomy role with real exposure to the forefront of the sports officiating and broadcasting world\nThe opportunity to experience some of the highest-profile sporting events around the globe\nAccess to some of the most intelligent, innovative and driven people in our industry\nAbout Hawk-Eye Innovations\nAbout Hawk-Eye\n\nHawk-Eye Innovations have been at the forefront of sports officiating and broadcast enhancement technology since 2001. The world’s biggest sporting events trust Hawk-Eye to make the right call when it matters most.\nHawk-Eye’s vision-processing, video replay and creative graphic technologies make sport fairer, safer, more engaging and better informed. Our innovations are constantly changing the face of sports officiating, production, content management, and fan engagement in every sport.\nHawk-Eye Innovations form a key part of the Sony Sports Innovations Group with a shared mission to deliver best-in-class officiating, broadcast and digital solutions to the sports world.\n\nOur Values\nAt Hawk-Eye Innovations, our three core values underpin our success, ensuring that we continue to be a leading innovator in sports technology on a global scale. Our business is filled with exceptional talent that helps to ensure that the World’s biggest sporting events trust us to make the right call when it matters the most. We deliver on this by ensuring that:\nWE ARE BRAVE\nConfident in solving almost impossible problems, pioneering and ambitious for our clients and for ourselves. We are bold leaders in the industry, driven by possibilities and striving with pace and energy. We understand our risks and love the challenge.\nWE ARE OWNERS\nOur business is our own; we feel every win, and especially the losses. We take pride in excellence and trust ourselves to do what’s right, relentlessly. We make decisions like owners, with endeavour and entrepreneurialism. We are serious about what we do, and have fun whilst doing it.\nWE ARE INCLUSIVE\nWe are one team; a community that’s connected and open. No secrets, no politics, just honesty and respect. We value diverse thinking, and diverse people - this helps us innovate. We treat people as people, who are all integral to our success and we celebrate as one.\n\n\nDiversity and Inclusion\nOur commitment to diversity and inclusion across race, gender, age, religion, identity, and experience drives us forward every day. We celebrate differences. We encourage different opinions and approaches to be heard, and then we come together and build.\n\nOur response to COVID 19\nDuring this time Team Hawk-Eye is working in a hybrid manner for all of our Head Office roles. Our operational teams are working onsite, Pioneering & Inspiring Change in Sport every day!\nHead Office Teams\nWe are currently working through a blend of in-person interactions (typically two days per week) and remote activity.\nOperational Teams\nOur operational teams are working on-site to ensure we can provide the highest level of service to our clients. We are taking the current guidance extremely seriously and are ensuring that the health, safety and well-being of our employees are at the highest standard.\nApplication Deadline\nMarch 17, 2023\nDepartment\nFootball\nEmployment Type\nContract\nLocation\nIsrael, Tel Aviv\nWorkplace type\nOnsite\nCompensation\n€200 / dayShow more Report"}, {"company": "The Rector & Visitors of the University of Virginia", "job": "Research Assistant Professor - Mathematical and Computational Epidemiology", "city": "Central", "date": "6d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=109&ao=1136043&s=58&guid=00000186e62f3f97954bc31e09f9b421&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ec3b53db&cb=1678899307027&jobListingId=1008519329663&jrtk=3-1-1grj34o9hk27b801-1grj2ufvfghr8800-3bb8d7a58d92dd45-", "description": "The Network Systems Science and Advanced Computing (NSSAC) division of the Biocomplexity Institute and Initiative (BII) at the University of Virginia is seeking applications for Research Assistant Professors in fields related to mathematical and computational epidemiology. BII performs world-class informatics research in life sciences, social sciences, and human health by integrating theory, modeling and simulation with computational and experimental science in a transdisciplinary, team science research environment.\n\nNSSAC is pursuing an advanced research and development program for interaction-based modeling, simulation and associated analysis, experimental design, and decision support tools for understanding large biological, information, social, and technological (BIST) systems. Extremely detailed, multi-scale computer simulations allow formal and experimental investigation of these systems. The need for such simulations is derived from questions posed by scientists, policymakers, and planners involved with very large complex systems. Our team is comprised of a diverse group of researchers from various domains including computer science, cognitive science, mathematics, biology, health science, electrical engineering, and economics. For additional information about NSSAC, visit: https://biocomplexity.virginia.edu/nssac\n\nThe position will be offered at the rank of assistant research professor and will be located in BII's location in Charlottesville, VA. Position reports to Madhav Marathe, Director of NSSAC and Professor of Computer Science in the School of Engineering and Applied Sciences.\nResponsibilities:\n\nCollaborates with and provides expertise to team science members including students, postdoctoral fellows, faculty, and sponsors;\nMentors undergraduate, graduate student, and postdoctoral research associates in NSSAC;\nLeads and collaborates in publication of scientific results in peer reviewed journals, professional conferences and other forums;\nEngages in collaborative work with peers both within the group and outside with the aim to achieve division objectives;\nRoutinely communicates research progress with supervisor, peers and other appropriate staff;\nIdentifies research opportunities; leads and participates in grant writing activities;\nParticipates fully in the intellectual life of the division and institute, and in the building of the division's reputation in research and academics.\nRequired Qualifications and Experience:\n\nPh.D. in computer science, biomedical engineering, mathematics, systems engineering or a closely related field;\nRecord of scholarly productivity, a demonstrated interest in creative and novel research endeavors, and ability to contribute significantly to highly functioning teams focused on complex real world challenges requiring a multi-disciplinary approach;\nDemonstrated record of scholarship in top-tier journals and an understanding of the external funding roles of Principal Investigator or a senior collaborator;\nExperience in developing peer-reviewable publications and evidence of publications in peer-reviewed journals;\nExplicit commitment to, and accomplishments in, teaching, research, and/or service notable to seniority;\nExperience mentoring undergraduate and graduate students;\nAbility to excel in a highly collaborative team science environment;\nStrong work ethic and ability to work individually as well as within high-performing and diverse team structures.\n\nPreference will be given to candidates that are collaborative in nature across disciplines and would complement or expand the division’s current strengths. Applicants with a respect for diversity and a passion for making a positive impact on the world in a collaborative environment are strongly encouraged to apply.\n\nTo apply, complete an application online through Workday and attach the following:\n\nCurrent Resume\nCover Letter\nContact Information for 3 references\nThree to four representative publications or similar research output products, e.g. software systems, data products etc.\n\n***Please note that you MUST upload multiple documents into the CV/Resume box. Applications that do not contain all of the required documents will not receive full consideration.\n*** Process for External Applicants:\nPlease apply through Workday, and search for 'R0033261'. Process for Internal UVA Applicants: Please apply through your Workday Home page, search “Find Jobs,” and search for ‘R0033261.’\n\nThe position will remain open until filled.\n\nFor questions regarding the position, please contact Madhav Marathe, Search Committee Chair, at marathe@virginia.edu.\n\nFor questions about the application process, please contact Daniel Strong, Senior Recruiter, at das6zb@virginia.edu.\n\nThis is a restricted position based upon the continued availability of funding.\n\nThe University will perform background checks on all new hires prior to employment. This position will also require an Education Verification (FSAKA).\n\nThe University of Virginia is annually ranked as one of the premier public institutions in the United States and is located in Charlottesville, a picturesque and vibrant small city perennially ranked as one of the best places to live in the U.S. More information about town, the school, faculty benefits and other topics can be found at http://uvacharge.virginia.edu/guide.html. UVA assists faculty spouses and partners seeking employment in the Charlottesville area. To learn more please visit https://dualcareer.virginia.edu\nMINIMUM REQUIREMENTS\n\n\nEducation: Ph.D. or terminal degree. ABD may be accepted.\n\nExperience: None\n\nLicensure: None\n\n\nPHYSICAL DEMANDS\n\n\nThis is primarily a sedentary job involving extensive use of desktop computers. The job does occasionally require traveling some distance to attend meetings, and programs.\n\nCOVID Vaccination Requirement and Guidelines\nPlease visit the UVA COVID-19 Job Requirements and Guidelines webpage prior to applying for current information regarding vaccination requirements and guidelines for employment at UVA.\nThe University of Virginia, i ncluding the UVA Health System which represents the UVA Medical Center, Schools of Medicine and Nursing, UVA Physician’s Group and the Claude Moore Health Sciences Library, are fundamentally committed to the diversity of our faculty and staff. We believe diversity is excellence expressing itself through every person's perspectives and lived experiences. We are equal opportunity and affirmative action employers. All qualified applicants will receive consideration for employment without regard to age, color, disability, gender identity or expression, marital status, national or ethnic origin, political affiliation, race, religion, sex (including pregnancy), sexual orientation, veteran status, and family medical or genetic information.Show more Report"}, {"company": "Lime", "job": "Legal Assistant, Tel-Aviv", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=110&ao=1136043&s=58&guid=00000186e62f3f97954bc31e09f9b421&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e90cece7&cb=1678899308280&jobListingId=1008359469403&jrtk=3-1-1grj34pl4klv4801-1grj2ufvfghr8800-9ef95016218e1fbf-", "description": "Lime is the world's largest shared electric vehicle company. We’re on a mission to build a future where transportation is shared, affordable and carbon-free. Our electric bikes and scooters have powered 400+ million rides in 250+ cities on 5 continents, replacing an estimated 100+ million car trips. Named a Time 100 Most Influential Company and Fast Company Brand That Matters, we achieved a fully profitable year in 2022, becoming the first in our industry to reach this milestone.\nLime is the world's largest shared electric vehicle company. We’re on a mission to build a future where transportation is shared, affordable and carbon-free. Named a Time 100 Most Influential Company in 2021, Lime has powered 350+ million electric bike and scooter rides in 200+ cities on 5 continents, saving an estimated 75+ million car trips. Learn more about how we help the world #RideGreen at li.me!\nWe are looking for an outstanding Legal Assistant to join the EMEA legal team at one of the fastest growing startups in the region. For this new and exciting position you will support the Israeli legal counsel on a wide spectrum of legal topics such as administrative and public law issues and commercial contracts, but with a focus on litigation work. You will also support the wider EMEA legal team on a whole range of legal issues. You will have a pragmatic, solution focused attitude and enjoy working in an informal, startup-style, structure.\nWhat you'll do\nYou will be the right hand of the Israel legal counsel and the main point of contact for supporting the day-to-day legal queries relating to operations in Israel;\nYou will provide technical legal support on a range of matters, including analysis of complex data sets for litigation purposes\nYou will work on a full range of legal topics concerning the Israel market, including regulatory compliance, litigation and personal injury law, commercial law, consumer law, insurance and civil liability, administrative and public law, and employment law\nYou will support the broader EMEA legal team on a wide range of legal issues.\nAbout you\nA law degree from an Israeli institution\nFluent in written and spoken Hebrew and English\nStrong interpersonal and communication skills\nAbility to work well under pressure with diligence, organization, and provide practical, business-friendly advice to stakeholders\nStrong analytical and strategic skills including the ability to drive issues to a quick resolution\nHigh degree of professional ethics and integrity\nWhy Lime?\nWhen you join Lime, you join a global community of smart, caring, talented individuals working together to deliver world-changing results; striving to create an experience that enables Limers to do their best work. Here are some ways we support and invest in our team:\nCompetitive salaries, performance-based annual bonus and pre-IPO equity\nHealth and wellness offerings for all team members starting day one including access to top-tier fitness and mindfulness apps\nFlexible vacation policies with ample paid holidays tailored to country of residence\nFully-paid leave following the birth or adoption of a child and financial, medical and educational support for Limers pursuing parenthood\nSupport for retirement and financial goals with unlimited access to financial advisors\nUnlimited, complimentary use of our vehicles in hundreds of cities around the world\nProfessional growth opportunities through quarterly learning days and top-tier tools\nOpportunities to connect across teams and locations to network, socialize and volunteer\nCulture of belonging with Employee Resource Groups that engage and promote cultural awareness and DEI training across all functions\nConsistent recognition of great work through meaningful rewards and career advancements\nBenefits and perks vary depending on the nature of your employment and country of residence. Terms and conditions may apply.\nIf you want to make an impact, Lime is the place for you. Not sure if you meet all the qualifications? If this role excites you we encourage you to apply. Explore all opportunities on our career page.\nLime is an Equal Opportunity Employer, but that’s just the start. We believe different perspectives help us grow and achieve more. That’s why we’re dedicated to hiring and developing the most talented and globally diverse team – which includes individuals with different backgrounds, abilities, identities and experiences.Show more Report"}, {"company": "UVA Medical Center", "job": "Athletic Trainer- UVA Orthopedic Center", "city": "Central", "date": "6d", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=111&ao=1136043&s=58&guid=00000186e62f3f97954bc31e09f9b421&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1eeca566&cb=1678899309832&jobListingId=1008519331400&jrtk=3-1-1grj34r4sm6rr801-1grj2ufvfghr8800-5c46b68945276e45-", "description": "Responsible for providing patient care, health teaching and a safe environment to patients in an inpatient or outpatient setting, or in the patient’s home as directed by physicians, physicians assistants, and in collaboration with registered nurses.\nCollaborates with the registered nurse under direction of a physician through data collection concerning the physical, psychological, social and cultural dimensions of patients according to practice standards and institutional policy/procedure.\nOrganizes and prioritizes patient care activities considering the needs of the patients and the interdisciplinary team.\nImplements age appropriate interventions based on individual patient’s needs as directed by the physician or physician assistant in collaboration with nursing\nMaintains efficient patient flow throughout the clinic experience.\nAssists in developing and implementing patient/family teaching plan based on identified health education needs and the condition and age of the patient.\nProvides for a safe environment and safe delivery of care.\nMaintains supplies and equipment.\nPerforms administrative support responsibilities.\nDemonstrates teamwork in the delivery of patient care.\nIn addition to the above job responsibilities, other duties may be assigned.\nPosition Compensation Range: $20.68 - $32.05 Hourly\nMINIMUM REQUIREMENTS\n\n\nEducation: Bachelor's degree in athletic training or exercise physiology.Experience: 1 year related experience or training.License/Certification: Athletic Trainer, Certified Athletic Trainer Certifications Board of Certification; American Heart Association (AHA) Health Care Provider BLS certification required.\n\n\nPHYSICAL DEMANDS\n\n\nJob requires standing for prolonged periods and frequently bending/stooping/traveling. Proficient communicative, auditory and visual skills; Attention to detail and ability to write legibly; Ability to lift/push/pull 20 – 50lbs. May be exposed to chemicals, blood/body fluids and infectious disease.\n\nCOVID Vaccination Requirement and Guidelines\nPlease visit the UVA COVID-19 Job Requirements and Guidelines webpage prior to applying for current information regarding vaccination requirements and guidelines for employment at UVA.\nThe University of Virginia, i ncluding the UVA Health System which represents the UVA Medical Center, Schools of Medicine and Nursing, UVA Physician’s Group and the Claude Moore Health Sciences Library, are fundamentally committed to the diversity of our faculty and staff. We believe diversity is excellence expressing itself through every person's perspectives and lived experiences. We are equal opportunity and affirmative action employers. All qualified applicants will receive consideration for employment without regard to age, color, disability, gender identity or expression, marital status, national or ethnic origin, political affiliation, race, religion, sex (including pregnancy), sexual orientation, veteran status, and family medical or genetic information.Show more Report"}, {"company": "Indian River State College", "job": "Administrative Assistant II", "city": "Central", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=112&ao=1136043&s=58&guid=00000186e62f3f97954bc31e09f9b421&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d01a0512&cb=1678899310965&jobListingId=1008423966710&jrtk=3-1-1grj34s9incdu801-1grj2ufvfghr8800-a23edaf97ae5dd75-", "description": "Job Description\nWorking at IRSC has its perks! In addition to helping drive change and having a positive impact by supporting our students, staff, and faculty, IRSC offers a comprehensive benefits package including:\nMedical, Dental, Vision, Life Insurance, and Flexible Spending\nPaid time off, including annual and sick leave and paid holidays\nFlorida Retirement System (FRS) participation\nVoluntary participation in 403(b) and 457(b) deferred compensation plans\nQUALIFICATIONS, KNOWLEDGE AND SKILL REQUIREMENTS:\nThe qualifications and skill requirements position include:\nAssociate’s degree from an accredited institution;\nMinimum of three (3) years of proven work experience in an administrative assistant or secretarial position;\nExcellent communication skills – both verbal and written;\nExcellent computer skills including strong foundation in Microsoft Office applications, including Word, Excel, Access, PowerPoint, and various office software;\nExcellent organizational and interpersonal skills as well as the ability to multi-task;\nAbility to work with people in pressure situations;\nAbility to work independently as well as with student, faculty, staff and co-workers and be self-motivated;\nValid Florida Driver’s License;\nAs this position works directly with college administrators, faculty, staff, general public, and students on a regular basis via telephone, e-mail, and in-person, the ability to interact positively with others is essential;\nAbsolute discretion in the handling and management of faculty and student files and issues;\nUnderstanding of FERPA, HIPPA, and other laws and college policies requiring confidentiality;\nThe following is preferred:\nMaster’s degree or higher from an accredited institution in an Industrial Arts, Career & Technical Education field, or Vocational Education field;\nESSENTIAL JOB FUNCTIONS AND RESPONSIBILITIES:\nThe essential job functions and responsibilities for this position include, but are not limited to:\nFunctioning as office manager and receptionist for Workforce Education;\nProcessing Period Activity Pay for full-time faculty as well as adjuncts;\nOrganizing and arranging meetings both on-line and in-person;\nMentoring and overseeing the work of Work Study students and part-time employees on a daily basis;\nMaking reservations for rooms and labs;\nCollecting, maintaining, and assisting with faculty course schedules;\nCreating and cancelling courses;\nAssisting in the resolution of student issues in Workforce Education & Advanced Technology programs;\nAssisting with advisement and registration of Workforce Education & Advanced Technology programs.\nSPECIFIC DUTIES AND RESPONSIBILITIES:\nThe specific duties and responsibilities for this position include, but are not limited to:\nOrganizing and maintaining Dean’s schedule and appointments;\nHandling incoming phone calls and e-mails;\nEntering and processing electronic reports, requisitions, work orders, travel authorizations, petty cash, registrations, letters, memos, and processing Period Activity Pay for full-time faculty overload, adjunct teaching credit and clock hour courses, and substitution payments;\nResponsible to his/her Dean for effective organization and professionalism within the Dean’s office;\nPrepare e-mails, letters and other correspondence that reflect the professional nature of a state college;\nProcess and handle all types of mail and packages;\nOperating and/or utilizing a variety of office machines and equipment;\nMaintain a list of daily events and obligations;\nMaintaining an accurate filing system of records, evaluations, syllabi, grade forms, instructor schedules, and other important documents;\nDemonstrate MS Word, MS Excel, MS Outlook proficiency and professionalism;\nCompleting other duties as assigned by the Dean of Workforce Education.\nPHYSICAL REQUIREMENTS:\nThe physical requirements for this position include:\nAbility to regularly lift and or move up to 25 pounds, frequently lift and/or move up to 50 pounds, and occasionally lift and/or move up to 50 pounds; Ability to sit, stand, walk, bend, reach up, stoop; Manual dexterity and balance required to operate standard office machines such as copier, fax, calculator, telephone, and other equipment as necessary; IRSC expects its employees to follow proper safety standards while employed by the College.\nClassification\nStaff\nSupervisory\nNo\nFLSA Exempt\nNo\nEmployment Type\nRegular\nCompensation and Application Deadline\n\"Salary Commensurate With Experience\" | Review of Applicants will Begin February 6, 2023 | Open until filledShow more Report"}, {"company": "The Rector & Visitors of the University of Virginia", "job": "Administrative Assistant | Biocomplexity Institute", "city": "Central", "date": "6d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=1136043&s=58&guid=00000186e62f3f97954bc31e09f9b421&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_22dbd58a&cb=1678899312011&jobListingId=1008519330418&jrtk=3-1-1grj34t9ri9hm801-1grj2ufvfghr8800-e39637436b9d236c-", "description": "About Us.\nThe Biocomplexity Institute (BI) integrates scientific research – from genetic sequencing to policy analysis – to tackle the complex task of understanding massively interacting systems and predict solutions to issues impacting human health, well-being, and habitat. We collaborate across many disciplines to discover connections between health, information networks, security, and infrastructure. The foundation of our methodology lies in information biology – the synthesis of mathematics, computation, informatics, and biology. We approach complex problem solving by assembling teams of scientists in a variety of fields to work together to create solutions that challenge the very fields in which the teams operate .\nTo learn more visit: https://biocomplexity.virginia.edu\nThe Role.\nWe are looking for both Intermediate and Senior Administrative Assistant s to join our dynamic Research Operations team, the administrative division of BI.\nAdministrative A ssistants directly support a variety of administrative needs of the Institute, from day-to-day office support to dedicated assistance to senior leadership, demonstrating professionalism, attention to detail , and exceptional organizational skills.\nResponsibilities will be varied and challenging, including tasks such as:\nProviding administrative coordination to support Institute operations and special projects\nAnticipating and preparing senior leadership for meetings, presentations, and programming as requested\nProcuring, coordinating, or preparing materials for meetings or drafting memoranda, correspondence, talking points, agendas, and other documents, as requested\nReviewing and answering correspondence, screening callers and visitors, which may include confidential matters\nCoordinating business travel, arranging meetings, calendar management, expense tracking, and reimbursement processing\nProviding support to event planning, document editing, project tracking and coordination\nAssisting with symposiums , conferences, site visits, and major Institute events\nIn addition to the above job responsibilities, other duties may be assigned.\nRequirements.\nAn a ssociate ’ s d egree and at least 2 years of professional experience in an office setting , with a preference for a bachelor’s degree\nAbility to arrange business travel, coordinate meetings, and support agenda management and expense tracking\nAbility to prepare reports and PowerPoints, handle information requests, research and collect data, read and review scientific papers\nAbility to work in a fast paced environment, handle multiple, competing, and simultaneous priorities effectively\nDemonstrated ability to effectively work and learn independently, seeking guidance when appropriate\nDemonstrated proficiency in oral and written communication skills with strong attention to detail and exceptional organizational skills\nAbility to present a professional demeanor while delivering a high level of internal and external customer service\nAbility to appropriately manage sensitive information and deploy diplomacy and tact in interactions with internal and external audiences that generate understanding, mutual respect, and goodwill.\nA positive attitude and ability to work well with management and in a fast-paced team environment\nIn addition to the qualifications listed above, applicants wishing to be considered for the Senior Level position also require:\nAt least 4 years of professional experience in an office setting. A Bachelor’s degree may be considered in lieu of experience.\nAbility to work independently and see a project to fruition with little oversight.\nDemonstrated ability to act independently and exercise judicious decision making on all fronts.\nFor both roles, the following are not required , but highly valued:\nA Bachelor’s Degree , with preference for degrees in English, Communications, a STEM field\nExperience supporting a senior leadership role\nExperience working in higher education, government, research institutions, or other closely related organizations\nSuperb written and oral communication skills, including experience with editing and evaluating written materials to correct errors and improve readability\nBenefits.\nFlexible Workplace: BI offers a flexible hybrid workplace, providing a balance of in-person and remote work for each employee. Due to the collaborative nature of our work, team members are expected to be present and attend team meetings and other critical functions in person. Since the du ties of this position include providing administrative support for senior leadership positions, events, and other in-person activities , w e expect this role to be in the office at least three and preferably 4 days a week in coordination with similar administrative roles at the Institute.\nTime Off: In addition to 11-15 paid holidays depending on the calendar year, the flexible University Leave program offers employees 22- 30 days per year depending on years of service. UVA employees also receive the additional benefit of 16 hours of paid leave per year for public service to contribute to the community.\nParental Leave & Care : The Paid Parental Leave policy offer s eight weeks of paid leave to employees who have been employed by UVA for 12 consecutive months. UVA also offers access to a backup care program for child and eldercare .\nPay : UVA provides market-based compensation that recognizes competitive starting pay, merit increases, promotional opportunities, rewards, and recognition.\nRecognition : Our culture encourages care and recognition for one another. We aim to measure, improve, reward, and celebrate individuals and team performance.\nHealth : Our health plan options are designed to support a healthy lifestyle for you and your family. Multiple choices allow you to assess your medical needs and choose the best plan while achieving a balance of low premiums and maximum flexibility for health, vision, and dental.\nWellness : UVA cares about your good health. Our programs encompass tools to help you emotionally, physically, and financially.\nCareer Development : Our culture of lifelong learning promotes an education benefits program that provides tuition toward your next degree, academic certificate program, or relevant professional development expenses. We will support you in your current role and foster development throughout your lifelong career.\nRetirement : Choose from excellent options as we partner to invest in your future. VRS offers a defined benefit + defined contribution plan, with UVA matching up to 3.5% for the Hybrid plan. Or choose ORP, a defined contribution plan based on tax-deferred accumulations. You contribute 5%, UVA contributes 8.9%\nTo Apply.\nPlease apply through Workday by searching “ Administrative Assistant – Biocomplexity.” Internal applicants must apply through their UVA Workday profile by searching ‘Find Jobs.’ Complete an application online with the following:\nResume/CV\nCover Letter outlining your interests in the role\nUpload all materials into the resume submission field, multiple documents can be submitted into this one field. Alternatively, merge all documents into one PDF for submission. Applications that do not contain all required documents will not receive full consideration.\nD iversity and inclusion are an integral part of our culture at the Biocomplexity Institute, and w e are dedicated to building a diverse, inclusive, and authentic workplace. We recognize and celebrate the value and impact diversity brings to our team and are committed to treating all applicants fairly and equally by encouraging candidates from all backgrounds to apply.\nAll roles within the institute are restricted positions and are dependent upon project need, availability of funding, and performance. This is primarily a sedentary job involving extensive use of desktop computers. The job does occasionally require walking some distance to attend meetings and programs. The University will perform background checks on all new hires prior to employment. This position also requires an Education Verification (FSAKA).\nThis position will remain open until filled. This is an Exempt level, benefited position.\nHow to Apply:\nApplications that do not contain all of the required documents will not receive full consideration, please note that multiple documents can be uploaded in the box.\nProcess for External Applicants: Please apply through Workday , and search for ‘ R0045154' . Complete an application online and attach a cover letter, CV/resume, and contact information for three references (name, email address, telephone number, and address).\nProcess for Internal UVA Applicants: Please apply through your Workday Home page, search “Find Jobs,” and search for ‘ R0045154 .’ Complete an application online and attach a cover letter, CV/resume, and contact information for three references (name, email address, telephone number, and address).\n\nCOVID Vaccination Requirement and Guidelines\nPlease visit the UVA COVID-19 Job Requirements and Guidelines webpage prior to applying for current information regarding vaccination requirements and guidelines for employment at UVA.\nThe University of Virginia, i ncluding the UVA Health System which represents the UVA Medical Center, Schools of Medicine and Nursing, UVA Physician’s Group and the Claude Moore Health Sciences Library, are fundamentally committed to the diversity of our faculty and staff. We believe diversity is excellence expressing itself through every person's perspectives and lived experiences. We are equal opportunity and affirmative action employers. All qualified applicants will receive consideration for employment without regard to age, color, disability, gender identity or expression, marital status, national or ethnic origin, political affiliation, race, religion, sex (including pregnancy), sexual orientation, veteran status, and family medical or genetic information.Show more Report"}, {"company": "The Rector & Visitors of the University of Virginia", "job": "Contagion in Public Health and Biological Systems Postdoctoral Research Associate", "city": "Central", "date": "6d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=114&ao=1136043&s=58&guid=00000186e62f3f97954bc31e09f9b421&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0f245f3b&cb=1678899313065&jobListingId=1008519329753&jrtk=3-1-1grj34uauncf3801-1grj2ufvfghr8800-03646e53723846c9-", "description": "The Network Systems Science & Advanced Computing (NSSAC) Division of the Biocomplexity Institute at the University of Virginia is seeking motivated, enthusiastic, self-driven candidates for a Postdoctoral Research Associate position. The incumbent will join the Contagion Science and Technology Program, a prestigious new strategic research initiative funded by the University of Virginia through its Prominence-to-Preeminence STEM Targeted Initiatives Fund. The Institute serves as the program’s organizing unit with broad and comprehensive partnership of the University of Virginia Schools of Engineering and Applied Science, Data Science, Medicine, and the College of Arts & Sciences.\nThe incumbent will have a unique opportunity to explore applications of computing and data sciences at the interface of epidemiological modeling and health sciences. Co-mentorship by experienced principal investigators from UVA’s School of Medicine and the Biocomplexity Institute will provide unique interdisciplinary working and learning environments.\nThe new Contagion Science team member will contribute to the creation and promulgation of research that leverages new and existing theoretical, engineering, and data science tools for the modeling of contagious phenomena. Research emphasis will be on techniques that integrate information across multiple resolutions of societal and biological organization. Strong candidates must show interdisciplinary research proficiency at the intersection of epidemiology, pathogen genomics, and public health. The ideas developed as a part of this program are expected to support the development of theories for understanding large-scale networked complex systems.\nAdditional responsibilities include but are not limited to: participating in unique learning and professional development experiences including the creation of research themes for the research roadmap; leading organization of workshops and other program relevant meetings; and, supporting the collaboration of existing and potential program partners such as, government agencies, industries, and researchers. This collective exposure allows Postdoctoral Research Associate to gain experience in effective engagement and project management with the research community.\nTo learn more about NSSAC, the Biocomplexity Institute, and the Contagion Science Program visit: https://biocomplexity.virginia.edu/nssac and https://contagion-science.virginia.edu/\nThe University of Virginia’s Biocomplexity Institute is located at the UVA Discovery Park: 994 Research Park Boulevard, Charlottesville, VA. BI offers a flexible hybrid workplace, providing a balance of in-person and remote work for each employee. All team members must have access to and maintain a safe home office environment with high-speed internet service and work collaboratively with colleagues using a variety of technologies and tools. Due to the collaborative nature of our work, team members are expected to be present and attend team meetings and other critical functions in person. Depending on the needs of the group, or as deemed by the manager, team members may be required to work periodically in open offices, meeting rooms or other shared workspaces.\nRequired Qualifications:\nPhD in any of the following fields: Computer science, computational biology, data science. Similar or related fields will also be considered however programming fluency is required\nThe selected candidate must hold a PhD at the time of appointment\nPreferred Qualifications:\nProven simulation/modeling/analysis experience in public health/epidemiology\nStrong programming skills\nExperience working with different types of public health/biological data incl. genomics\nInterest in public health policy\nTo apply, complete an application online through Workday and attach the following:\nCover letter conveying candidate’s particular areas of interest related to computational modeling and public health sciences.\nSummary of coursework (completed and current, if applicable)\nCV and list of references\nResearch statement describing previous work and potential future research directions, highlighting how the candidate would support and expand the ongoing research efforts\nIn addition to a competitive salary, the Contagion Science program will provide generous Conference and Research Travel funds.\n*** Please note that multiple documents MUST be uploaded into the CV/Resume box. Applications not containing all the required documents will not receive full consideration. ***\nProcess for External Applicants: Please apply through Workday, and search for R0039658.\nProcess for Internal UVA Applicants: Please apply through your Workday Home page, search “Find Jobs,” and search for R0039658.\nApplications will be reviewed on a rolling basis and the position will remain open until filled. This position is a restricted position and is dependent upon project need, availability of funding, and performance. The initial term is a one-year appointment; however, appointment may be renewed for an additional two, one-year increments, contingent upon satisfactory performance, continued available funding, and business need.\nQuestions related to the position may be directed to Savanna Galambos, Special Assistant for Administrative Affairs, skh7b@virginia.edu. Questions regarding the application process should be directed to Daniel Strong, Senior Recruiter das6zb@virginia.edu.\nThe University will perform background checks on all new hires prior to employment. This position also requires an Education Verification (FSAKA).\nPHYSICAL DEMANDS\n\n\nThis is primarily a sedentary job involving extensive use of desktop computers. The job does occasionally require traveling some distance to attend meetings, and programs.\n\nCOVID Vaccination Requirement and Guidelines\nPlease visit the UVA COVID-19 Job Requirements and Guidelines webpage prior to applying for current information regarding vaccination requirements and guidelines for employment at UVA.\nThe University of Virginia, i ncluding the UVA Health System which represents the UVA Medical Center, Schools of Medicine and Nursing, UVA Physician’s Group and the Claude Moore Health Sciences Library, are fundamentally committed to the diversity of our faculty and staff. We believe diversity is excellence expressing itself through every person's perspectives and lived experiences. We are equal opportunity and affirmative action employers. All qualified applicants will receive consideration for employment without regard to age, color, disability, gender identity or expression, marital status, national or ethnic origin, political affiliation, race, religion, sex (including pregnancy), sexual orientation, veteran status, and family medical or genetic information.Report"}, {"company": "Novo Nordisk", "job": "Rybelsus Product Manager", "city": "Kfar Saba", "date": "30d+", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=115&ao=1136043&s=58&guid=00000186e62f3f97954bc31e09f9b421&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9a1526a8&cb=1678899314671&jobListingId=1008326092542&jrtk=3-1-1grj34vt034av001-1grj2ufvfghr8800-2306b835994dde61-", "description": "Do you enjoy working in a dynamic business environment and is willing to make a difference in the lives of people living with diabetes? Are you ambitious, highly motivated, looking toward the future to create visible results? If YES, then we have an exciting job opportunity as Rybelsus Product Manager, in NovoNordisk Israel.\n\nThe position\n\nNovo Nordisk Israel is looking for a Rybelsus Product Manager to work in Israel. The position is reporting to the GLP-1RA lead. As Rybelsus Product Manager, you will drive growth of the Diabetes business of Novo Nordisk Israel. You will develop a local product marketing strategy with the GLP1RA leader & facilitate launch and sales execution as well as follow-up in the marketing programs with internal stakeholders. you will need to Develop a strong brand strategy and Design and execute the product marketing plan.\n\nResponsibilities & Challenges:\n\nIdentify business opportunities and develop mitigation plans and Establish and maintaining strong relations with Key Opinion Leaders and stakeholders.\nDevelop innovative interactions with Healthcare Professionals and Support the Patient Assistant Program.\nDevelop sales cycles, campaigns and promotional materials for the sales team and Participate and manage product symposia.\nResponsible for the Marketing budget and Collaborate closely with the brand team members ( sales & medical).\nWorking in close relations with Novo Nordisk global, business area and finance and Forecast sales based on market insights and profound understanding of the therapeutic area.\n\n\nQualifications\n\nIn order to considered you need to have a B.Sc. or other relevant bachelor degree havving a M.B.A in Business Management is an advantage. We expet you to have At least 2-3 years of experience as Product Manager. Experience in the pharmaceutical industry and High English and Hebrew are also skills required.\n\n\nCompetencies\n\nHigh Performing and Results oriented.\nInnovative and out of the box thinking.\nRole model, strong interpersonal skills.\nThe Ability to work in a cross-functional team.\nStrategic thinking and overview.\nBusiness mind set and commercial competencies.\nFocus on what matters, ability to set priorities and direction.\nStrong forecasting and analytical skills.\nExcellent presentation skills.\n\n\nAbout the department\n\nThe department is responsible for setting local portfolio strategy and for driving key marketing activities amongst Health Care Professionals. You will be a member of energetic and driven professionals and act to improve the daily lives of patients. You will cooperate with the Diabetes Sales Managers, Medical department and MAPA (Market Access & Public Affairs) department to implement key activities in the market. This position represents Novo Nordisk with the goal of maximizing sales and positioning Novo Nordisk as the leading company in diabetes and Obesity care.\n\n\nWorking at Novo Nordisk\n\nAt Novo Nordisk, we don’t wait for change. We drive it. We’re a dynamic company in an even more dynamic industry, and we know that what got us to where we are today is not necessarily what will make us successful in the future. We embrace the spirit of experimentation, striving for excellence without fixating on perfection. We never shy away from opportunities to develop, we seize them. From research and development, through to manufacturing, marketing and sales – we’re all working to move the needle on patient care.\nContact\n\nIf you believe you are qualified, and are willing to take the challenge, please send your CV directly via our online application tool.\n\nWe thank all applicants for their interest, however, only those candidates selected for inter-views will be contacted.\nDeadline\n\nApply before March 15/03/2023\n\nWe commit to an inclusive recruitment process and equality of opportunity for all our job applicants.\n\n\nAt Novo Nordisk we recognize that it is no longer good enough to aspire to be the best company in the world. We need to aspire to be the best company for the world and we know that this is only possible with talented employees with diverse perspectives, backgrounds and cultures. We are therefore committed to creating an inclusive culture that celebrates the diversity of our employees, the patients we serve and communities we operate in. Together, we’re life changing.Report"}, {"company": "Medpace, Inc.", "job": "Office Assistant", "city": "Rehovot", "date": "11d", "rating": "3.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=1136043&s=58&guid=00000186e62f3f97954bc31e09f9b421&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a3ce0d4c&cb=1678899315716&jobListingId=1008508308018&jrtk=3-1-1grj350u0kcl9801-1grj2ufvfghr8800-5b683b7bf884ecab-", "description": "Job Summary :\n\nOur corporate activities are growing rapidly, and we are currently seeking a full-time Facilities Office Assistant to join our team in Rehovot. This person will work in a team to accomplish tasks and projects that are instrumental to the company’s success. If you want an exciting career where you use your previous expertise and can develop and grow your career even further, then this is the opportunity for you.\nResponsibilities :\nWorking from the office reception desk, meet and greet clients, vendors and staff, answer main office phone and transfer calls, distribute accurate messages, coordinate incoming and outgoing courier and mail services;\nUpdate and maintain databases such as mailing lists, contact lists and client information.\nDevelop and maintain strong relationships with service vendors and landlords to ensure efficient maintenance and cleaning of the office, value for money and consistently high standards;\nAssist in the coordination and organisation of meetings, events and appointments;\nInventory, order and maintain office supplies organization;\nUse internal facilities management software to manage planned and reactive maintenance tasks;\nUnder direction of the Finance function, support local invoice flow; responsible for receiving and managing all the coming invoices using internal finance/invoice management systems;\nActs as local contact for building management and landlord in partnership with Facilities Management;\nSupports Fleet Coordinator with local company vehicles, purchase, repairs, sale, insurance, fuel tank devices, toll road payments;\nSubmit office expense invoices within allocated budget, escalating approval when necessary;\nUnder supervision, responsible for coordination of all health and safety procedures for a local office;\nUnder direction of IT function coordinate management of office telephony needs, including mobile phones and printing services;\nWork closely Regional Facilities Manager to provide reporting and information for country budget planning for facilities-related costs;\nAssist Regional Facilities Manager in property projects such as relocation, lease renewal and internal office moves and fit outs.\nQualifications :\nFluent in English and excellent spoken and written Hebrew;\nAt least 1 years experience in office administrative services/office management;\nBasic knowledge of office management, Health and Safety, Risk Assessments and emergency procedures required;\nKnowledge of MS Word, Excel, and PowerPoint;\nStrong communication skills (both written and verbal);\nExcellent organizational and prioritization skills with a high attention to detail.\nTravel: None\nMedpace Overview :\n\nMedpace is a full-service clinical contract research organization (CRO). We provide Phase I-IV clinical development services to the biotechnology, pharmaceutical and medical device industries. Our mission is to accelerate the global development of safe and effective medical therapeutics through its scientific and disciplined approach. We leverage local regulatory and therapeutic expertise across all major areas including oncology, cardiology, metabolic disease, endocrinology, central nervous system, anti-viral and anti-infective. Headquartered in Cincinnati, Ohio, employing more than 5,000 people across 40+ countries.\nWhy Medpace? :\n\nWhen you join Medpace, you become part of a team dedicated to supporting the development of ground-breaking drugs and devices. Our employees provide hope for those living with debilitating diseases. We invite you to be a part of something that is impacting millions of people around the globe while enjoying a competitive total compensation and benefits package and internal growth opportunities.\nAwards:\nMedpace historically named a Top Cincinnati Workplace by the Cincinnati Enquirer;\nRecognized by Forbes as one of America's Best Mid-size Companies in 2023;\nMedpace ranks amongst top CROs for site ratings across all 10 important attributes including CRA training, preparation & organization, accessibility of staff, open communication, and ensuring timely drug availability;\nContinually recognized with CRO Leadership Awards from Life Science Leader magazine based on expertise, quality, capabilities, reliability, and compatibility.\nWhat to Expect Next:\nA member of our recruitment team will review your qualifications and, if interested, you will be contacted for an interview.\nEO/AA Employer M/F/Disability/Vets\nWARNING: Please beware of phishing scams that offer opportunities with Medpace in exchange for sending money. These scammers pose as legitimate employees from actual companies. Please be advised that a Medpace employee will never ask you for a credit card, send you a check, or ask you for any type of payment as part of consideration for a role with our company. All of our careers require that you first complete an online application and go through some sort of interview process.Show more Report"}, {"company": "", "job": "Seeking Office Assistant", "city": "Israel", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=117&ao=1136043&s=58&guid=00000186e62f3f97954bc31e09f9b421&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0a008a98&cb=1678899316867&jobListingId=1007900524623&jrtk=3-1-1grj3521okhom801-1grj2ufvfghr8800-951c7c0b4a5f442d-", "description": "SeekingAssistant\nSeeking fluent Hebrew/English speaking assistant for regular part-time work. Must be comfortable in Israeli culture and know his/her way around the system. Approximately 10 hours per week, half on-site in Katamon, half from home. Flexible between 9 am and 4 pm.\nResponsibilities Include:\n\nOffice and personal assistance/administration, i.e. managing correspondences; scheduling and coordinating appointments; translating Hebrew>English and English>Hebrew; getting price quotes/market research; various municipal, educational, and tax registrations/filings; managing medical requests, paperwork and insurance; bookkeeping and accounting\n\nRequirements:\n\nDiscretion\n\nBilingual Hebrew and English – speaking, typing, writing\nComputer and tech savvy – including google drive, Word, Excel and Internet searches\nPlease respond to bwhousek@gmail.com and attach a resume.Show more Report"}, {"company": "Entourage Services", "job": "Call Center Medical Appointment Line Clerk", "city": "Central", "date": "30d+", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=118&ao=1136043&s=58&guid=00000186e62f3f97954bc31e09f9b421&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b2a947a7&cb=1678899318473&jobListingId=1008365532619&jrtk=3-1-1grj353irk61k801-1grj2ufvfghr8800-fd291c3b8720c3ea-", "description": "Call Center Medical Appointment Line Clerk\nPlace of Performance: RAF Lakenheath, UK\n\nGeneral Description:\n\nCall Center Medical Appointment Line Clerk shall engage with patients through phones and electronic means to answer/place calls and answer/place electronic messages in both specialty appointing, primary care appointments and/or referral management.\n\n\nSpecific Tasks:\nPerform within one or more of the following business lanes: Appointing Management or Consult Management with regard to primary and specialty care.\nUtilize the Automated Call Distribution (ACD) system and TRICARE Online Patient Portal Secure Messaging In Accordance With (IAW) established protocols and where applicable, use Standard Operating Procedures (SOPs), Booking Protocols, and Business Rules in combination with developed skill sets in the execution of the MTF mission. Shall meet or exceed the required metrics in accordance with Air Force Instruction. DoD, DHA, AF and MTF policies & instructions.\nHandle inbound ACD routed calls with each average handle/transaction time per month of less than or equal to one hundred and eighty (180) seconds per call. No individual day or hour average shall exceed two hundred and seventy (270) seconds.\nAnswer 90 percent (90%) of all inbound ACD routed calls with each average answer time per month at ninety (90) seconds This metric is known as Service Level. No individual day or hour average shall go below 75 percent (75%).\nHandle inbound ACD routed calls with each average speed of answer per month of less than or equal to 45 seconds per call. No individual day or hour average shall exceed ninety (90) seconds.\nManage inbound ACD routed calls to prevent calls from being dropped. Dropped calls shall not exceed, 8 percent (8%) of all answered calls. No individual day or hour average shall exceed 15 percent (15%) seconds.\nRecord 100 percent (100%) of all inbound ACD routed calls.\nMake outbound calls with each clerk’s average handle/transaction time per month, of less than or equal to one hundred and eighty (180) seconds per call. No individual day or hour average shall exceed two hundred and seventy (270) seconds.\nUtilize the Composite Health Care System (CHCS) Managed Care Program Module, Assignment Order Processing Module, or any Air Force mandated system(s), to identify appointment availability, schedule, cancel, and reschedule appointments, following local directives, established protocols, Booking Protocols, and the MTF Business Rules using the appropriate Access to Care (ATC) category, matched to the appropriate standard appointment types, and detail codes within the appropriate ATC standards.\nGenerate or receive, and electronically deliver, telephone messages (t-cons) to medical providers and clinic support staff by using CHCS or AHLTA, or any Air Force mandated system(s), per individual clinic guidelines; and any other applicable DoD, DHA, AF, and MTF policies & instructions.\nShall take the following actions concerning specialty care consults/referrals:\nDisposition referrals as “Appoint to applicable MTF, RAF Lakenheath, RAF Alconbury, and RAF Croughton” or “Defer to Network” within one (1) business day of receipt in accordance with Air Force Instruction, and the DHA Interim Procedures Memorandum. DoD, DHA, AF and MTF policies & instructions.\nReview referrals for administrative completeness, covered TRICARE benefit and required tests and pre-work. Coordinates with referring providers in cases where additional referral information is required.\nBook specialty care consults/referrals when contacted by the patient and the referral is dispositioned as “Appoint to RAF Lakenheath MTF. If the referral is dispositioned as RAF Alconbury or RAF Croughton, you will transfer the call to the appropriate referral line.” If the referral lacks a review disposition when the patient calls, then you will provide a “warm hand-off” to the specialty clinic to immediately review the referral and appoint or defer it.\nProactively contact patients with active specialty referrals until the specialty or behavioral health care appointment can be booked, the patient cancels the referral, or the message has been delivered three (3) times (first message NLT day 3 and final message NET day 14). Each contact attempt will be documented in CHCS or any Air Force mandated system(s).\nWhen the MTF cannot offer three (3) different appointments within the access to care standard, you will inform the patient that the specialty referral can be deferred to the network and will offer the patient an MTF appointment outside the standard. You will process the specialty referral according to the patient’s preference.\nAssist with ROFR determinations for specialty care that can be provided within the MTF using Service Availability (Capability) Listings and information systems that link the referral to the appointment to the ATC category and standard. ROFR shall be processed within the time limits outlined in the TRICARE Operations Manual.\nPerform/assist with appointing network specialty care referrals as allowed by the TRICARE Overseas Program (TOP) Contractor.\nClose all un-appointed referrals accepted by the MTF NLT 180 days beyond the order date.\nManage the “cancellation line” feature, ensuring that when patients call in to cancel appointments by leaving voice mail, you shall 60 message and go into AHLTA/CHCS, or any Air Force mandated system(s), to cancel the applicable appointment within same day or coordinate with the appropriate clinic to get the appointment cancelled within the same day.\nWhen patients request to cancel a specialty referral appointment or consult, you will document the cancellation reason in CHCS, or any Air Force mandated system(s), and send a t-con to the referring provider within one (1) business day of the cancellation. No individual weekly timeliness average of cancellation notifications will exceed two (2) business days.\nVerify beneficiary eligibility, using patient’s DOD ID number and two (2) patient identifiers, refer patient to DEERS and update patient demographics in CHCS per DoD Healthcare policy, and local MTF policies.\nAttend all training activities, per local MTF policies. Training may include but is not limited to topics designed to increase skills, enhance workflow or communication, update on standard operating procedures, adjust to changing mission requirements, address facility or installation issues or increase overall effectiveness and efficiency of operations.\nComplete all required training within the first month of assignment and be able to perform all functions required.\nProvide patients with specific instructions for their appointment/referral following local directives, established protocols, SOPs, Booking Protocols, and the MTF Business Rules.\nPerform other administrative and clerical duties in support of the medical care and operational support as required.\nAdvise patients of the provider, location, time and day of their booked appointments.\nCoordinate with specialty referral clinics (e.g., internal MTF, Veteran’s Affairs clinic, etc.) on special patient instructions and tests required prior to appointment.\nTrack initial specialty care and deferred to network primary care referrals to include obtaining reports from MTF, network, and non-network providers. The primary responsibility to obtain Network and purchased care results will be with the MTF.\nProcess initial specialty care and deferred to network primary care reports in the HAIMS following the business rules, DoD, DHA, AF and MTF policies & instructions, close the specialty referral in CHCS, and send a t-con to the referring provider or PCM within three (3) days of receipt of the report. No individual weekly timeliness average of network report notifications will exceed five (5) business days.\nInitiate efforts to capture network reports upon request of the referring provider or no later than 60 days from the date the specialty referral was ordered or as soon as a claim is discovered, whichever occurs first.\nWhen a CLR has not been received or documented in the EHR, the RMC will check the applicable claims database for a claim.\nIf a claim is found, the RMC will request the CLR from the rendering purchased care provider. If there is no response from the provider within 10 calendar days, repeat. If the provider still does not provide the CLR, the RMC will close the referral in CHCS using the status of “Deferred results received” and annotate {CRNRR} in soft brackets in the CHCS Review Comment Field indicating a claim was reported but no results were received. Notify the referring provider. Initiate TRICARE contractor procedures as per the TOM and/or the Memorandum of Understanding (MOU) with the TRICARE regional contractor. Additionally, forward a report to the TRICARE Regional Office each month that lists all provider names, specialty care rendered, and referral Unique Identifier Numbers for which no CLR has been received after two attempts or per MOU.\nClose all open specialty referrals deferred to the network NLT 180 days beyond the order date.\nPull NAL reports and enter them into AHLTA under the appropriate clinic.\nUse TOL Patient Portal Secure messaging to:\nRegister beneficiaries for TOL Patient Portal Secure Messaging Accounts IAW established protocols.\nOut-process beneficiaries from TOL Patient Portal Secure Messaging when the member PCSs, separates, retires, or any other reason where the member no longer needs access to the system.\nCommunicate with beneficiaries for scheduling appointments or concerning the use/activation of referrals.\nAnswers main office phone line(s). Directs telephone calls to appropriate section for assistance, handles independently or takes messages as required.\nReviews referrals for administrative completeness and researches covered benefits prior to processing.\nDetermines patient eligibility for services and arranges and schedules medical appointments for referred care.\nProvides general instructions to patients and ensures patients have necessary documentation for referred health care services.\nObtains updates and files medical records as needed.\nOrganizes and researches patient records, extract needed information, and review records for referral within established guidelines.\nRequest medical records and ensures arrival of medical records prior to appointment(s).\nInitiates and locates patient medical records as needed.\nObtains documentation as requested by healthcare providers (test results, or documentation not yet filed in records).\nEnsures referral results are returned to the referring provide and to the medical record within required timelines. Assists with follow up, written or verbal, as necessary.\nUtilizes the referral tracking data collection tool. Calculates metrics, and compiles monthly reports, as directed by the MTF.\nOrients and trains MTF personnel about the referral process and timelines.\n\n\nEducation:\nShall possess a high school diploma or General Educational Development equivalency. Completion of administrative assistant program is desirable.\n\n\nExperience:\n\nAt least six (6) months of experience in medical office doing scheduling or referral management.\nCustomer Service Training/experience.\nBasic knowledge and skill level includes: principles of excellent customer service; TRICARE benefits; quality control and risk management; medical terminology, medical forms and records management; HIPAA guidelines for release of medical information; general medical and legal ethics; excellent communications skills; strong organizational skills; and computer operations, including operational skills with Microsoft applications (Windows Operating system, Microsoft Word, Microsoft Access, and Excel,); personnel shall understand the importance of meeting deadlines.\nKnowledge of current ICD- 10 (International Classification of Diseases, tenth revision) coding desirable, but not required.\nShall have functioning knowledge of Government appointing MHS Guide to Access Success and referral management business rules (AFMS RMC Guide), Government appointing information systems, DHA, TJC or AAAHC, UEI, HIPAA, DoD Health Information Privacy Regulation, the Privacy Act, and DoD Privacy Program.\n\n\nCertifications:\nRequired to obtain a certification in Basic Life Support (BLS).\n\n\nKnowledge and Skills:\nA fully qualified typist (computer keyboard) with a minimum of 50 Words per Minute is required.\nGeneral office administrative and clerical skills to perform receptionist duties and answer telephones.\nStandard office equipment, such as personal computers, copiers, fax machines, and telephone systems.\nAn understanding of general medical ethics, telephone etiquette, and excellent communication, to be able to actively convey information through the exchange of thoughts, messages, or information, by speech or writing, with excellent customer service skills, a professional demeanor, appropriate interaction with clients and able to promote the best image of the government.\nAble to read, write, and speak English well and should not suffer from any reading, writing, speaking or hearing limitations, so as to ensure effective communication with customers on the phone.Show more Report"}, {"company": "The Rector & Visitors of the University of Virginia", "job": "Research Faculty in Statistical and Quantitative Sciences - Biocomplexity Institute", "city": "Central", "date": "6d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=119&ao=1136043&s=58&guid=00000186e62f3f97954bc31e09f9b421&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e04e7a0a&cb=1678899320100&jobListingId=1008519330513&jrtk=3-1-1grj3555ai4n8801-1grj2ufvfghr8800-bafec4569b3ec654-", "description": "The Social & Decision Analytics Division (SDAD) seeks applications for research faculty positions in statistical and quantitative sciences. SDAD is a leading research division in the Biocomplexity Institute & Initiative (BII) at the University of Virginia. BII performs world-class informatics research in life sciences, human health, and social sciences by integrating theory, modeling, and simulation with computational and experimental science in a transdisciplinary, team science research environment.\nSDAD develops evidence-based research and quantitative methods to inform policy decision-making and evaluation. This thematic focus includes research partnerships with local, state, and federal agencies and communities to address their questions by integrating and linking multiple heterogeneous data sources.\nSDAD researchers address complex social problems by leveraging today's diverse data flows, including administrative and government records, surveys, social media, and sensors. Through team collaboration, the research faculty candidate is expected to develop the capacity to discover, repurpose and redirect these data flows to solve critical social problems. Computational complexity is at the heart of SDAD research, and SDAD leverages the Biocomplexity Institute’s research capability and the High-Performance Computing infrastructure. This research includes data synthesis, integration and linkage, space-time modeling, applied and computational math, and creating data platforms and infrastructures to address program needs.\nTo learn more about SDAD and BII, please visit us at biocomplexity.virginia.edu .\nThe position will be in BII's location in Arlington, VA. The Position reports to the Division Director, Social and Decision Analytics (SDAD), Biocomplexity Institute. BI offers a flexible hybrid workplace, providing a balance of in-person and remote work for each employee. All team members must have access to and maintain a secure home office environment with high-speed internet service and work collaboratively with colleagues using a variety of technologies and tools. Due to the collaborative nature of our work, team members are expected to be present and attend team meetings and other critical functions in person. Depending on the needs of the group, or as deemed by the manager, team members may be required to work periodically in open offices, meeting rooms or other shared workspaces.\nThis is an open rank posting for research faculty (assistant, associate, and full) professor positions and requires a Ph.D. with relevant professional experience and appropriate credentials befitting the professorial ranks.\nApplications will be reviewed on a rolling basis and remain open until filled. The start date is flexible and based upon successfully completing the recruiting process and offer negotiations.\nResponsibilities : (for all ranks unless otherwise specified)\nContributes to developing and implementing statistical theory and methods for BII research.\nAdvises and coaches project team on challenging statistical and mathematical design and analysis issues\nCollaborates with and provides statistical science expertise to team science members, including students, postdoctoral fellows, faculty, and sponsors, on relevance and interpretation of analyses.\nMentors undergraduate, graduate students, and postdocs in the\nLeads and collaborates in the publication of scientific results in peer-reviewed journals, professional conferences, and other forums.\nEngages in collaborative work with peers both within the group and outside to achieve the above objectives.\nRoutinely communicates research progress with supervisor, peers, and other appropriate staff.\nLeads or participates in seeking and preparing grant writing initiatives.\nParticipate fully in the intellectual life of the division and institute and build the division's reputation in research and academics.\nQualifications : (for all ranks unless otherwise specified)\nPh.D. in statistics or in a closely related field.\nCredentials equivalent at the assistant, associate, and full professor\nAbility to excel in a highly collaborative team science environment.\nExperience with advanced approaches to statistics and data-driven model development.\nComputational skills:\nFluent in statistical coding environments (e.g., R, Python/Pandas)\nComfort with coding in non-statistical languages (e.g., Python, Java, C++)\nExperience using SQL to interact with relational databases (e.g., Postgres, SQL Server, Oracle)\nExperience conducting spatial analyses using a dedicated GIS application or common statistical libraries (e.g., R sf package, Geopandas)\nCommunication and team science skills:\nDemonstrated effective communication skills, both oral and written.\nExperience in developing peer-reviewable publications and evidence of publications in peer-reviewed journals.\nStrong work ethic and ability to work individually and within high-performing and diverse team structures.\nDepending on experience and seniority level, one must possess an appropriate level of independence.\nAdditional responsibilities and qualifications for associate and full-professor ranks:\nProvides expert opinions, performs statistical modeling and analyses, and leverages external experts to provide help on projects\nProvides leadership and guidance as the statistical expert on a project team, with general direction from the PI.\nSuccessful track record in obtaining external funding and publication record.\nEvidence of emergent or national reputation.\nAccountable for all statistical sciences aspects of the project studies and submissions, including quality, relevance, and scientific validity.\nPreferences:\nExperience with using many data sources, both traditional ones such as surveys and non-traditional ones such as administrative data, unstructured data, images, sensors, and social media.\nExperience with data synthesis, data integration and linkage, space-time modeling, numerical linear algebra, demography, and creating data infrastructures to address program needs.\nExperience working with foundations, and/or federal, state, and local government entities\nAnticipated Hiring Range: Rank and compensation are commensurate with candidate's experience, qualifications, and rank, with UVA benefits .\nApplication Instructions:\nComplete an application online through Workday and attach the following:\nCV\nCover Letter\n2-Page Research Statement\nContact Information for three (3) references\nMultiple documents may be uploaded into the CV/Resume box. Alternatively, you may merge all documents into one PDF. Applications that do not contain all the required documents will not receive full consideration.\nAll roles within the institute are restricted positions and are dependent upon project need, availability of funding, and performance.\nThis position will remain open until filled. This is an Exempt level, benefited position.\nThe University will perform background checks on all new hires prior to employment.\nThis position also requires an Education Verification (FSAKA).\nQuestions related to the positions may be directed to Savanna Galambos, Special Assistant for Administrative Affairs, skh7b@virginia.edu.\nPHYSICAL DEMANDS\n\n\nThis is primarily a sedentary job involving extensive use of desktop computers. The job does occasionally require traveling some distance to attend meetings, and programs.\n\nCOVID Vaccination Requirement and Guidelines\nPlease visit the UVA COVID-19 Job Requirements and Guidelines webpage prior to applying for current information regarding vaccination requirements and guidelines for employment at UVA.\nThe University of Virginia, i ncluding the UVA Health System which represents the UVA Medical Center, Schools of Medicine and Nursing, UVA Physician’s Group and the Claude Moore Health Sciences Library, are fundamentally committed to the diversity of our faculty and staff. We believe diversity is excellence expressing itself through every person's perspectives and lived experiences. We are equal opportunity and affirmative action employers. All qualified applicants will receive consideration for employment without regard to age, color, disability, gender identity or expression, marital status, national or ethnic origin, political affiliation, race, religion, sex (including pregnancy), sexual orientation, veteran status, and family medical or genetic information.Show more Report"}, {"company": "Novocure", "job": "Research Assistant Student", "city": "Haifa", "date": "28d", "rating": "3.4", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=120&ao=1136043&s=58&guid=00000186e62f3f97954bc31e09f9b421&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_41308bdf&cb=1678899321610&jobListingId=1008471161688&jrtk=3-1-1grj356lpk24r801-1grj2ufvfghr8800-406260a05c38df39-", "description": "Location:\nHaifa, IL, 3508504\nDescription:\nResearch Assistant Student\n\nNovocure is a leading medical device company developing a revolutionary treatment for cancer based on the use of electric fields. We are looking for student for research assistant position to join our preclinical team.\nThe jobholder will be part of the preclinical team and is required to assist in all research activities according to the procedures and to record scientific reports.\n\nESSENTIAL DUTIES AND RESPONSIBILITIES:\nResponsible for performing in vitro and in vivo experiments according to good laboratory practice.\nResponsible for maintenance of the lab area, working surfaces and the facilities equipment.\n\nQUALIFICATIONS/KNOWLEDGE:\nQualifications:\nStudent of Life Sciences / Biology or any similar field- with at least a year and a half of studies remaining\nKnowledge:\nExperience with animal handling – advantage\nExperience with cell cultures work– advantage\nKnowledge in cancer research – advantage\nExperience with FACS, fluorescent and confocal microscopy – advantage\n\nAvailability for at least 18 hours per week-at least 1 day in the middle of the week, the others during the weekend.\n\nABOUT NOVOCURE:\nOur vision\nPatient-forward: aspiring to make a difference in cancer.\nOur patient-forward mission\nTogether with our patients, we strive to extend survival in some of the most aggressive forms of cancer by developing and commercializing our innovative therapy.\nOur patient-forward values\n– innovation\n– focus\n– drive\n– courage\n– trust\n– empathyShow more Report"}, {"company": "The Rector & Visitors of the University of Virginia", "job": "Postdoctoral Research Associate (SDAD) - Biocomplexity", "city": "Central", "date": "6d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=121&ao=1136043&s=58&guid=00000186e62f3f97954bc31e09f9b421&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_1bd0949d&cb=1678899322669&jobListingId=1008519329379&jrtk=3-1-1grj357lkgrif801-1grj2ufvfghr8800-0337dbbfd6ed90aa-", "description": "The Social & Decision Analytics Division (SDAD) is seeking applications for multiple postdoctoral associates in statistics and social and behavioral sciences. SDAD is a leading laboratory in the Biocomplexity Institute & Initiative (BII) at the University of Virginia. BII performs world-class informatics research in life sciences, social sciences, and human health by integrating theory, modeling and simulation with computational and experimental science in a transdisciplinary, team science research environment.\nSDAD combines expertise in statistics and social and behavioral sciences to develop evidence-based research and quantitative methods to inform policy decision-making and evaluation. The researchers at SDAD span many disciplines including statistics, economics, sociology, psychology, political science, policy, health IT, public health, program evaluation, and data science.\nSDAD researchers address complex social problems by leveraging the diversity of data flows available today including administrative and government records, surveys, social media, and sensors. Through team collaboration, the postdoctoral candidate is expected to develop the capacity to discover, repurpose and redirect these data flows to solve critical social problems. Computational complexity is at the heart of SDAD research and SDAD leverages all the research capability of BII, along with the High-Performance Computing infrastructure.\nThe positions will be offered at the rank of postdoctoral associate and will be located in BII's location in Arlington, VA. BI offers a flexible hybrid workplace, and a balance of in-person and remote work for each employee. All team members must have access to and maintain a safe home office environment with high-speed internet service and work collaboratively with colleagues using a variety of technologies and tools. Due to the collaborative nature of our work, team members are expected to be present and attend team meetings and other critical functions in person. Depending on the needs of the group, or as deemed by the team manager, team members may be required to work periodically in open offices, meeting rooms or other shared workspaces.\nTo learn more about SDAD and BII, please visit us at biocomplexity.virginia.edu .\nRequired Qualifications:\nApplicants must be on track to receive a PhD in statistics, social and behavioral sciences, digital humanities or in a very closely related field and have received their PhD by the time of appointment.\nExperience with advanced approaches to statistics and data-driven model development.\nExperience with statistical software systems such as R, programming, and databases.\nExcellent communication skills, both oral and written, demonstrated through the development of publications and delivery of presentations.\nBe motivated, enthusiastic and self-driven.\nAbility to excel in a highly collaborative team science environment.\nPreference will be given to those applicants with:\nExperience using diverse sources of data, both traditional ones such as surveys, and non-traditional ones, such as administrative data and social media.\nTo apply, complete an application online through Workday and attach the following:\nCV\nCover Letter detailing your relevant experience and interest in the position\nSummary of your coursework\nIn addition, please have three confidential letters of reference sent to this email address: SDADjobs@virginia.edu .\n***Please note that you MUST upload multiple documents into the CV/Resume box. Applications that do not contain all the required documents will not receive full consideration.***\nProcess for External Applicants: Please apply through Workday, and search for 'R00 29628 .\nProcess for Internal UVA Applicants: Please apply through your Workday Home page, search “Find Jobs,” and search for ‘R00 29628 ’\nReview of applications is ongoing and will continue until the positions are filled.\nQuestions related to the positions may be directed to Savanna Galambos, Special Assistant for Administrative Affairs, skh7b@virignia.edu. Questions regarding the application process should be directed to Daniel Strong, Senior Recruiter, das6zb@virginia.edu .\nAll roles within the institute are restricted positions and are dependent upon business need, availability of funding, and satisfactory performance. These are one-year appointments; however, appointments may be renewed for an additional two, one-year increments, contingent upon satisfactory performance, the continued available funding and business need.\nThe University will perform background checks on all new hires prior to employment. This position also requires an Education Verification (FSAKA).\n\nEducation: Doctoral degree\n\n\n\nPHYSICAL DEMANDS\n\n\nThis is primarily a sedentary job involving extensive use of desktop computers. The job does occasionally require traveling some distance to attend meetings, and programs.\n\nCOVID Vaccination Requirement and Guidelines\nPlease visit the UVA COVID-19 Job Requirements and Guidelines webpage prior to applying for current information regarding vaccination requirements and guidelines for employment at UVA.\nThe University of Virginia, i ncluding the UVA Health System which represents the UVA Medical Center, Schools of Medicine and Nursing, UVA Physician’s Group and the Claude Moore Health Sciences Library, are fundamentally committed to the diversity of our faculty and staff. We believe diversity is excellence expressing itself through every person's perspectives and lived experiences. We are equal opportunity and affirmative action employers. All qualified applicants will receive consideration for employment without regard to age, color, disability, gender identity or expression, marital status, national or ethnic origin, political affiliation, race, religion, sex (including pregnancy), sexual orientation, veteran status, and family medical or genetic information.Show more Report"}, {"company": "The Rector & Visitors of the University of Virginia", "job": "Postdoctoral Research Associate (NSSAC) | Biocomplexity", "city": "Central", "date": "6d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=122&ao=1136043&s=58&guid=00000186e62f3f97954bc31e09f9b421&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_fab71368&cb=1678899323761&jobListingId=1008519328894&jrtk=3-1-1grj358osmfot801-1grj2ufvfghr8800-b4942d0d57ad92a1-", "description": "About Us.\nThe Biocomplexity Institute (BI) integrates scientific research – from genetic sequencing to policy analysis – to tackle the complex task of understanding massively interacting systems and predict solutions to issues impacting human health, well-being, and habitat. We collaborate across many disciplines to discover connections between health, information networks, security, and infrastructure. The foundation of our methodology lies in information biology – the synthesis of mathematics, computation, informatics, and biology. We approach complex problem solving by assembling teams of experts in a variety of fields to work together to create solutions that challenge the very fields in which the teams operate.\nTo learn more visit: https://biocomplexity.virginia.edu\nThe UVA Biocomplexity Institute is located in the UVA Research Park at 994 Research Park Boulevard, Charlottesville, VA.\nThe Role.\nThe Network Systems Science & Advanced Computing (NSSAC) Division is seeking motivated, enthusiastic, self-driven postdoctoral associates for positions in machine learning, data analytics, and high-performance computing.\nThis role provides the opportunity to collaborate with a large team of researchers working on a diverse range of projects from genomic analysis to high performance network science. The postdoctoral researcher will work on developing novel machine learning, data analytics, and HPC methods and will contribute to multiple projects funded through DARPA, NSF, NIH, NASA, IARPA, and others. They will also have opportunities to work with our collaborators at multiple universities, including Stanford, MIT, Virginia Tech, University of Maryland College Park, Yale, and Princeton as part of a new multi-disciplinary research project.\nRequirements.\nRequired Qualifications:\nPhD in any of the following fields: artificial intelligence, machine learning, high-performance computing, algorithms, statistics, applied mathematics, economics or in a very closely related field. Candidates must hold a PhD at the time of appointment.\nExperience programming in java, python, or C++.\nExcellent communication skills, both oral and written, demonstrated through the development of publications and delivery of presentations.\nDemonstrated ability to work successfully in a highly collaborative team science environment.\nPreferred Qualifications:\nPreferred application areas include public health, sustainable infrastructures, and network science.\nResearch experience with big data, social science, data visualization, and multi-scale simulations.\nExperience with databases and computing on clusters.\nProgramming for parallel computing.\nBenefits.\nFlexible Workplace: BI offers a flexible hybrid workplace, providing a balance of in-person and remote work for each employee. Due to the collaborative nature of our work, team members are expected to be present and attend team meetings and other critical functions in person.\nTime Off: In addition to 11-15 paid holidays depending on the calendar year, the flexible University Leave program offers employees 22- 30 days per year depending on years of service. UVA employees also receive the additional benefit of 16 hours of paid leave per year for public service to contribute to the community.\nParental Leave & Care : The Paid Parental Leave policy offer s eight weeks of paid leave to employees who have been employed by UVA for 12 consecutive months. UVA also offers access to a backup care program for child and eldercare .\nPay : UVA provides market-based compensation that recognizes competitive starting pay, merit increases, promotional opportunities, rewards, and recognition.\nRecognition : Our culture encourages care and recognition for one another. We aim to measure, improve, reward, and celebrate individuals and team performance.\nHealth : Our health plan options are designed to support a healthy lifestyle for you and your family. Multiple choices allow you to assess your medical needs and choose the best plan while achieving a balance of low premiums and maximum flexibility for health, vision, and dental.\nWellness : UVA cares about your good health. Our programs encompass tools to help you emotionally, physically, and financially.\nCareer Development : Our culture of lifelong learning promotes an education benefits program that provides tuition toward your next degree, academic certificate program, or relevant professional development expenses. We will support you in your current role and foster development throughout your lifelong career.\nRetirement : Choose from excellent options as we partner to invest in your future. VRS offers a defined benefit + defined contribution plan, with UVA matching up to 3.5% for the Hybrid plan. Or choose ORP, a defined contribution plan based on tax-deferred accumulations. You contribute 5%, UVA contributes 8.9%\nTo Apply.\nPlease apply through Workday by searching “ Administrative Assistant – Biocomplexity.” Internal applicants must apply through their UVA Workday profile by searching ‘Find Jobs.’ Complete an application online with the following:\nCover letter detailing your relevant experience and interest in the position.\nSummary of coursework (completed and current, if applicable).\nCV and list of references.\nUpload all materials into the resume submission field, multiple documents can be submitted into this one field. Alternatively, merge all documents into one PDF for submission. Applications that do not contain all required documents will not receive full consideration.\nD iversity and inclusion are an integral part of our culture at the Biocomplexity Institute, and w e are dedicated to building a diverse, inclusive, and authentic workplace. We recognize and celebrate the value and impact diversity brings to our team and are committed to treating all applicants fairly and equally by encouraging candidates from all backgrounds to apply.\nQuestions related to the positions may be directed to Savanna Galambos, Special Assistant for Administrative Affairs, skh7b@virignia.edu .\nAll roles within the institute are restricted positions and are dependent upon project need, availability of funding, and performance. This is primarily a sedentary job involving extensive use of desktop computers. The job does occasionally require walking some distance to attend meetings and programs. The University will perform background checks on all new hires prior to employment. This position also requires an Education Verification (FSAKA).\nThis position will remain open until filled. This is an Exempt level, benefited position.\nHow to Apply:\nApplications that do not contain all of the required documents will not receive full consideration, please note that multiple documents can be uploaded in the box.\nProcess for External Applicants: Please apply through Workday , and search for ‘ R0045160' . Complete an application online and attach a cover letter, CV/resume, and contact information for three references (name, email address, telephone number, and address).\nProcess for Internal UVA Applicants: Please apply through your Workday Home page, search “Find Jobs,” and search for ‘ R0045160 .’ Complete an application online and attach a cover letter, CV/resume, and contact information for three references (name, email address, telephone number, and address).\n\nCOVID Vaccination Requirement and Guidelines\nPlease visit the UVA COVID-19 Job Requirements and Guidelines webpage prior to applying for current information regarding vaccination requirements and guidelines for employment at UVA.\nThe University of Virginia, i ncluding the UVA Health System which represents the UVA Medical Center, Schools of Medicine and Nursing, UVA Physician’s Group and the Claude Moore Health Sciences Library, are fundamentally committed to the diversity of our faculty and staff. We believe diversity is excellence expressing itself through every person's perspectives and lived experiences. We are equal opportunity and affirmative action employers. All qualified applicants will receive consideration for employment without regard to age, color, disability, gender identity or expression, marital status, national or ethnic origin, political affiliation, race, religion, sex (including pregnancy), sexual orientation, veteran status, and family medical or genetic information.Show more Report"}, {"company": "The Rector & Visitors of the University of Virginia", "job": "Social Contagion in Human Systems Postdoctoral Research Associate", "city": "Central", "date": "6d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=123&ao=1136043&s=58&guid=00000186e62f3f97954bc31e09f9b421&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7cb69fa9&cb=1678899327900&jobListingId=1008519349381&jrtk=3-1-1grj35cpijm65801-1grj2ufvfghr8800-999b297a36f0d940-", "description": "The Network Systems Science & Advanced Computing (NSSAC) Division of the Biocomplexity Institute at the University of Virginia is seeking motivated, enthusiastic, self-driven candidates for a Postdoctoral Research Associate position. The Research Associate will join the Contagion Science and Technology Program, a prestigious new strategic research initiative funded by the University of Virginia through its Prominence-to-Preeminence STEM Targeted Initiatives Fund. The Biocomplexity Institute serves as the program’s organizing unit through a broad and comprehensive partnership with the University of Virginia Schools of Engineering and Applied Science, Data Science, Medicine, and the College of Arts & Sciences.\nThe incumbent will have a unique opportunity to explore the application of computing and data sciences at the interface of computational modeling and social sciences. Co-mentorship by experienced principal investigators from the College and Graduate School of Arts and Sciences and the Biocomplexity Institute will provide unique interdisciplinary working and learning environments.\nThe new Contagion Science team member will contribute to the creation and promulgation of a research roadmap that leverages new and existing theoretical frameworks, engineering techniques, and data science tools. The modeling at single or multiple levels of scale of individual behaviors and interactions will provide the technical and theoretical basis to better address the interconnected nature of contagious phenomena. The ideas developed as a part of this program are expected to support the development of theories for understanding large-scale networked complex systems. Strong candidates will have research interests in use cases such as epidemics and pandemics; social epidemiology; diffusion/containment of behaviors/information in large social networks; public health policy; modeling and simulations; and/or interdisciplinary science.\nAdditional responsibilities include but are not limited to: participating in unique learning and professional development experiences including the creation of themes for the research roadmap; leading the organization of workshops and other program relevant meetings; and supporting the collaboration of existing and potential program partners such as government agencies, industries, and researchers. This collective exposure allows the Postdoctoral Research Associate to gain experience in effective engagement and project management with the research community.\nTo learn more about NSSAC, the Biocomplexity Institute, and the Contagion Science Program visit: https://biocomplexity.virginia.edu/nssac and https://contagion-science.virginia.edu/\nThe University of Virginia’s Biocomplexity Institute (BI) is located at the UVA Discovery Park: 994 Research Park Boulevard, Charlottesville, VA. BI offers a flexible hybrid workplace, and a balance of in-person and remote work for each employee. All team members must have access to and maintain a safe home office environment with high-speed internet service and work collaboratively with colleagues using a variety of technologies and tools. Due to the collaborative nature of our work, team members are expected to be present and attend team meetings and other critical functions in person. Depending on the needs of the group, or as deemed by the team manager, team members may be required to work periodically in open offices, meeting rooms or other shared workspaces.\nRequired Qualifications:\nPhD in a social or behavioral science field (e.g., Political Science, Sociology, Economics, Psychology, Social Epidemiology/Behavioral Medicine, Anthropology, Neuroscience) with an emphasis on computational modeling, mathematical analysis or PhD in computer science/math/statistics/physics/data science with an application in social/behavioral/transdisciplinary science.\nSimilar or related fields will also be considered.\nThe selected candidate must hold a PhD at the time of appointment\nProgramming fluency in a general-purpose programming language (e.g., python, julia, R, C) is required\nPreferred Qualifications:\nExperience working with diverse types of social science data sets\nStrong programming and data analytical skills\nProven simulation/modeling/analysis experience\nEvidence of prior work/interest in social or behavioral sciences\nTo apply, complete an application online through Workday and attach the following:\nCover letter conveying your particular areas of interest in computational social sciences\nSummary of coursework (completed and current, if applicable)\nResearch statement describing previous work and potential future research directions\nCV and list of references\nIn addition to a competitive salary, the Contagion Science program will provide generous Conference and Research Travel funds\n*** Please note that multiple documents MUST be uploaded into the CV/Resume box. Applications not containing all the required documents will not receive full consideration. ***\nProcess for External Applicants: Please apply through Workday, and search for R0039657 .\nProcess for Internal UVA Applicants: Please apply through your Workday Home page, search “Find Jobs,” and search for R0039657 .\nApplications will be reviewed on a rolling basis and the position will remain open until filled. This position is a restricted position and is dependent upon project need, availability of funding, and performance. This is a one-year appointment; however, appointment may be renewed for an additional two, one-year increments, contingent upon satisfactory performance, continued available funding, and business need.\nQuestions related to the position may be directed to Savanna Galambos, Special Assistant for Administrative Affairs, skh7b@virginia.edu . Questions regarding the application process should be directed to Daniel Strong, Senior Recruiter das6zb@virginia.edu .\nThe University will perform background checks on all new hires prior to employment. This position also requires an Education Verification (FSAKA).\nPHYSICAL DEMANDS\n\n\nThis is primarily a sedentary job involving extensive use of desktop computers. The job does occasionally require traveling some distance to attend meetings, and programs.\n\nCOVID Vaccination Requirement and Guidelines\nPlease visit the UVA COVID-19 Job Requirements and Guidelines webpage prior to applying for current information regarding vaccination requirements and guidelines for employment at UVA.\nThe University of Virginia, i ncluding the UVA Health System which represents the UVA Medical Center, Schools of Medicine and Nursing, UVA Physician’s Group and the Claude Moore Health Sciences Library, are fundamentally committed to the diversity of our faculty and staff. We believe diversity is excellence expressing itself through every person's perspectives and lived experiences. We are equal opportunity and affirmative action employers. All qualified applicants will receive consideration for employment without regard to age, color, disability, gender identity or expression, marital status, national or ethnic origin, political affiliation, race, religion, sex (including pregnancy), sexual orientation, veteran status, and family medical or genetic information.Show more Report"}, {"company": "Novocure", "job": "Animal facility technician", "city": "Haifa", "date": "1 day ago", "rating": "3.4", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=124&ao=1136043&s=58&guid=00000186e62f3f97954bc31e09f9b421&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_fdd4e158&cb=1678899328952&jobListingId=1008527660312&jrtk=3-1-1grj35dr7klv1801-1grj2ufvfghr8800-6d5ed182f93578fc-", "description": "Location:\nHaifa, IL, 3508504\nDescription:\nAnimal Facility Technician\n\n\nNovocure is a global medical device company with R&D based in Haifa. The company is growing quickly as it commercializes TTFields therapy: a novel treatment for aggressive cancers using alternating electric fields.\n\nWe are looking for an Animal Facility Technician to join the preclinical team and to assist in all animal facility activities.\n\nFull time position in our R&D center,Haifa, Israel\n\nESSENTIAL DUTIES AND RESPONSIBILITIES:\nThe jobholder is responsible for the facility equipment maintenance, will be in charge on maintenance of the order and the hygiene environment of the animal facility, recording all procedures in a GLP standard, to provide assistance and support in all technical tasks relevant to the animals housing and care, and to perform procedures on animals in accordance with protocols requirements in coordination with researchers.\n\nQUALIFICATIONS/KNOWLEDGE:\nQualifications:\n\nExperience in animal technician studies or Vernerian assistant - advantage\nKnowledge:\nRead and write in Hebrew and English\nOrganized and responsible\nAbility to perform physical work\nResponsible attitude and an understanding of the need for confidentiality\nGood communication skills and teamwork\nAn awareness of the ethical issues surrounding this work\nAttention to details\nMaintain personal and other employees' safety.\nSupport other activities in the preclinical research team as required.\nSupervising junior staff including technicians.\nEnsuring that quality standards are met (GLP when required).\n\nOur vision\nPatient-forward: aspiring to make a difference in cancer.\nOur patient-forward mission\nTogether with our patients, we strive to extend survival in some of the most aggressive forms of cancer by developing and commercializing our innovative therapy.\nOur patient-forward values\n– innovation\n– focus\n– drive\n– courage\n– trust\n– empathy\n\n#IL-GK1Show more Report"}, {"company": "", "job": "Personal Assistant", "city": "Israel", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=125&ao=1136043&s=58&guid=00000186e62f3f97954bc31e09f9b421&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_3bdf150a&cb=1678899330373&jobListingId=1007037385085&jrtk=3-1-1grj35f8cklut801-1grj2ufvfghr8800-28206b8a18a8c880-", "description": "Seeking Personal Assistant\n\nSeeking fluent Hebrew/English speaking assistant for regular part-time work. Must be comfortable in Israeli culture and know his/her way around the system. Hours are approximately 20 hours/week (4-5 hours over 4-5 days), flexible between 9 am and 4 pm. Katamon location.\n\nResponsibilies Include:\n\nOffice and personal assistance/administration, i.e. managing correspondences; scheduling and coordinating appointments; translating Hebrew>English and English>Hebrew; getting price quotes/market research; various municipal, educational, and tax registrations/filings; managing medical requests, paperwork and insurance\n\nbookkeeping and accounting (i.e. paying bills, bank reconciliations, preparing end of year financial summaries, fbar and donation filings)\n\nmanaging outside workers, including household/rental property repairs, gardener, etc.\n\nRequirements:\n\nDiscretion\n\nBilingual Hebrew and English – speaking, typing, writing\n\nComputer and tech savvy – including google drive, Word, Excel and Internet searches\n\nExcellent organizational skills\n\nBoth attention to detail and “Rosh Gadol”\n\nAble to multitask\n\nCan work independently and take initiative\n\nTo Apply:\n\nPlease send an email written in English to bwhousek@gmail.com and tell us about yourself, your past work experience, and why this job is a good fit with your skills, experience, and schedule. Please attach a resume.Show more Report"}, {"company": "", "job": "Care Manager/Clinic Nurse", "city": "Israel", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=126&ao=1136043&s=58&guid=00000186e62f3f97954bc31e09f9b421&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c8a0daa0&cb=1678899333944&jobListingId=1006984038538&jrtk=3-1-1grj35injjoqp801-1grj2ufvfghr8800-7291a9a3586cdb3f-", "description": "EMA Care specializes in assisting individuals to navigate the Israeli Healthcare System. Through excellent communication and customer service, we improve access to quality care, organize healthcare services, and guide individuals to meet their health goals and optimal function.\n\nEMA Care works with visitors as well as Israeli citizens. Our goal is to consolidate medical care and streamline efficiencies, so our clients receive optimal healthcare with the least amount of waiting.\nEMA Care is staffed by medical professionals offering Case Management, 24/7 Telemedicine services, and ER support.\n\nIf you are passionate about healthcare and helping people receive excellent heath services, then we would like to hear from you.\n\nEMA Care is looking for a dynamic Nurse Case Manager for management of students and private clients (individuals and groups). This job is remote with flexible hours. Room for professional growth and a great opportunity to work with a professional and supportive team.\n\nIf you are passionate about healthcare and helping people receive excellent heath services, then we would like to hear from you.\n\nDuties, Responsibilities, & Skills\n\nAssesses clients regarding their chief complaint\nMust have excellent physical assessment skills\nExperience working with medical protocols\nCommunicates care plan with client, EMA Care team and others as medically necessary\nOversees case management for assigned clients\nCollaborates with client/client staff to ensure care plan is understood\nProvides clear direction for administration of care plans\nFollows up with client/client staff regarding current cases for schools\nDocuments appropriately\nExperience working with Word, Excel, and Cloud based documents\n\nQualifications\n\nRegistered Nurse, Nurse Practitioner, or Physician Assistant\nLicensed in Israel or equivalent Western country\nNative-level English\nConversational Hebrew\nRelevant clinical experience of at least 2 years\nHigh-level interpersonal skills\n\nPlease send CVs to adam@emacare.comShow more Report"}, {"company": "The Rector & Visitors of the University of Virginia", "job": "Computer Science and Systems Modeling Postdoctoral Research Associate", "city": "Central", "date": "6d", "rating": "4.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=127&ao=1136043&s=58&guid=00000186e62f3f97954bc31e09f9b421&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_71110924&cb=1678899335040&jobListingId=1008519329738&jrtk=3-1-1grj35jpincfg801-1grj2ufvfghr8800-943c70e2c6fe5832-", "description": "The Network Systems Science & Advanced Computing (NSSAC) Division of the Biocomplexity Institute at the University of Virginia is seeking motivated, enthusiastic, self-driven candidates for a Postdoctoral Research Associate position. The associate will join the Contagion Science and Technology Program, a prestigious new strategic research initiative funded by the University of Virginia through its Prominence-to-Preeminence STEM Targeted Initiatives Fund. The Institute serves as the program’s organizing unit with a broad and comprehensive partnership of the University of Virginia Schools of Engineering and Applied Science, Data Science, Medicine, and the College of Arts & Sciences.\nThe incumbent will have a unique opportunity to explore applications of computing and data sciences at the interface(s) of network systems modeling, computer science and engineering, multidisciplinary data science and/or machine learning or graph modeling and mining. Co-mentorship by experienced principal investigators from the School of Data Science, the School of Engineering and Applied Sciences, and the Biocomplexity Institute will provide unique interdisciplinary work- and learning environments.\nThe new Contagion Science team member will contribute to the creation and promulgation of a research roadmap that leverages new and existing theoretical frameworks, engineering techniques and data science tools for the modeling of individual components and their interactions to address the interconnected nature of contagious phenomena. Furthermore, the ideas developed as a part of this program will lead to new general theories for understanding large-scale networked complex systems. The successful candidate is expected to publish basic and applied research results in the flagship conferences and journals at the confluence of these areas, and to seek and pursue new funding and teaming opportunities.\nAdditional responsibilities include but are not limited to: participating in unique learning and professional development experiences including the creation of themes for the research roadmap; leading organization of workshops and other program relevant meetings; and, helping to coordinate the collaboration of existing and potential program partners such as, government agencies, industries, and multidisciplinary researchers. This collective exposure allows Postdoctoral Research Associate to gain experience in effective engagement and project management with the research community and to focus on advancing research programs and computing.\nTo learn more about NSSAC, the Biocomplexity Institute, and the Contagion Science Program visit: https://biocomplexity.virginia.edu/nssac and https://contagion-science.virginia.edu/\nThe UVA Biocomplexity Institute is located in the UVA Discovery Park at 994 Research Park Boulevard, Charlottesville, VA. BI offers a flexible hybrid workplace, providing a balance of in-person and remote work for each employee. All team members must have access to and maintain a safe home office environment with high-speed internet service and work collaboratively with colleagues using a variety of technologies and tools. Due to the collaborative nature of our work, team members are expected to be present and attend team meetings and other critical functions in person. Depending on the needs of the group, or as deemed by the team manager, team members may be required to work periodically in open offices, meeting rooms or other shared workspaces.\nRequired Qualifications:\nPhD in any of the following fields or specializations: Network systems modeling, computer science, engineering, multidisciplinary data science and/or machine learning, graph modeling and mining\nSimilar or related fields will also be considered, however programming fluency is required. The selected candidate must hold a PhD at the time of appointment\nA strong track record of publications in selective conferences and/or journals\nPreferred Qualifications:\nExperience in network systems modeling, multidisciplinary data science,\nCoursework or experience in data analytics, computer science and engineering\nPrior experience working in interdisciplinary teams/environment\nTo apply, complete an application online through Workday and attach the following:\nCover letter conveying your particular areas of interest\nResearch statement describing previous work and potential future research directions\nSummary of coursework (completed and current, if applicable)\nCV and list of references\nIn addition to a competitive salary, the Contagion Science program will provide generous Conference and Research Travel funds\n*** Please note that multiple documents MUST be uploaded into the CV/Resume box. Applications not containing all the required documents will not receive full consideration. ***\nProcess for External Applicants: Please apply through Workday, and search for R0039656 .\nProcess for Internal UVA Applicants: Please apply through your Workday Home page, search “Find Jobs,” and search for R0039656 .\nApplications will be reviewed on a rolling basis and the position will remain open until filled. This position is a restricted position and is dependent upon project need, availability of funding, and performance. This is a one-year appointment; however, appointment may be renewed for an additional two, one-year increments, contingent upon satisfactory performance, continued available funding, and business need.\nQuestions related to the position may be directed to Savanna Galambos, Special Assistant for Administrative Affairs, skh7b@virginia.edu . Questions regarding the application process should be directed to Daniel Strong, Senior Recruiter das6zb@virginia.edu .\nThe University will perform background checks on all new hires prior to employment. This position also requires an Education Verification (FSAKA).\nPosition Compensation Range: $47,500.00 - $85,000.00 Annual\nMINIMUM REQUIREMENTS\n\n\nEducation: Doctoral degree\n\nExperience: None\n\nLicensure: None\n\n\nPHYSICAL DEMANDS\n\n\nThis is primarily a sedentary job involving extensive use of desktop computers. The job does occasionally require traveling some distance to attend meetings, and programs.\n\nCOVID Vaccination Requirement and Guidelines\nPlease visit the UVA COVID-19 Job Requirements and Guidelines webpage prior to applying for current information regarding vaccination requirements and guidelines for employment at UVA.\nThe University of Virginia, i ncluding the UVA Health System which represents the UVA Medical Center, Schools of Medicine and Nursing, UVA Physician’s Group and the Claude Moore Health Sciences Library, are fundamentally committed to the diversity of our faculty and staff. We believe diversity is excellence expressing itself through every person's perspectives and lived experiences. We are equal opportunity and affirmative action employers. All qualified applicants will receive consideration for employment without regard to age, color, disability, gender identity or expression, marital status, national or ethnic origin, political affiliation, race, religion, sex (including pregnancy), sexual orientation, veteran status, and family medical or genetic information.Show more Report"}, {"company": "", "job": "MEDICAL RESEARCH ASSISTANT", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=128&ao=1136043&s=58&guid=00000186e62f3f97954bc31e09f9b421&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ca44721c&cb=1678899336204&jobListingId=1007989892862&jrtk=3-1-1grj35ku9k24r801-1grj2ufvfghr8800-af097d89d37a3da2-", "description": "Synodex is hiring a medical research assistant, for a full-time remote position.\n\nSynodex is a subsidiary of Innodata Inc. (Nasdaq: INOD) Innodata, a US public company with over 5,000 employees at 10 locations across the globe. Synodex works to harness Innodata’s global infrastructure and vast expertise and apply it to accurately process medical records, at scale.\n\nWhat will you be doing?\nApplying medical knowledge to software systems to improve data qualityMonitoring performance of data entry toolsSupporting medical analytical functionsUtilizing medical knowledge to review data entry methods, identify system improvement and productivity metric benchmarking\n\nRequirements:\nMedical degree\n\nWorking MS Office knowledge\nFluent in English\nKnowledge of medical codes - an advantage\n\nWe are an equal opportunity employer.\n\nSend English CV to israeljobs@innodata.com with “Medical Research Assistant” in the subject line\nOnly relevant applicants shall be contacted.Show more Report"}, {"company": "", "job": "Seeking to Hire Secretary-Dr. Assistant for Medical Office", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=129&ao=1136043&s=58&guid=00000186e62f3f97954bc31e09f9b421&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_2447bc65&cb=1678899337274&jobListingId=1007518665131&jrtk=3-1-1grj35lv9k6dt801-1grj2ufvfghr8800-b1b2e26b368331b5-", "description": "Qualifications:\nPeople Person\nBilingual – English/Hebrew\nComputer Comfortable\nFast English Typist (50 words per minute)\n\nApproximate Hours 8:45-15:30\n\nSunday, Monday, Wednesday and Thursday\n\nSubstitute position for six months; possible potential of long term employment.\n\nLocation: Givat Shaul\n\nPlease send CV to medicalsecretary613@gmail.com\n\nWe will only respond to relevant CV’sReport"}, {"company": "", "job": "Administrative Assistant", "city": "Jerusalem", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=130&ao=1136043&s=58&guid=00000186e62f3f97954bc31e09f9b421&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9937fa24&cb=1678899338776&jobListingId=1007936465887&jrtk=3-1-1grj35ndvjfmj801-1grj2ufvfghr8800-ab5590b23beead24-", "description": "Support/Admin Assistant\nJob: 10 hours a week. Jerusalem\nRequirements\n\nFluent in Hebrew, English at mother-tongue level\nExcellent computer and technical skills\nVery strong follow-up skills, until a job is complete\nDiscretion\n\nResponsibilities May Include\n\nMedical paperwork - appointments, hafnayot, etc\nBook keeping, bill paying\nManaging vendors\nRegistrations - utilities, cars, etc\nLocal errands\nEtc.\n\nPlease submit your resume to ktrsjm@gmail.com\n\nThank you.Show more Report"}]