[{"company": "Confidential", "job": "Director of Brand Management", "city": "Tel Aviv-Yafo", "date": "22d", "rating": "", "link": "", "description": "You’ll be managing the dedicated business unit managers with full ownership of P&L, drive the growth of the team and business and be responsible for developing, defining, and overseeing the store managers day to day activity. Main responsibility:Laed brand managers team and work cross functionally with multiple departments on product features and goals.Create and oversee store managers business KPI’s.Working with your brand managers to establish efficient and integrated workflows and working processes: monthly KPIs, inventory planning, strategic development of the brand etc.Inspiring, steering and developing your team a 360° point of view, this includes new product development, new channel launches, content & creative development, performance marketing and supply-chain & logistics optimizationScaling your brand(s) by driving profitable growth and developing expansion strategiesAnalyzing market trends and customer needs and defining product range development and extensionPartnering with internal/external stakeholders to develop a go-to-market strategy and facilitate successful product launches and international expansionAnalyzing PPC and other marketing campaigns; optimizing conversion, click-through-rate and advertising cost of saleEnsure all activities are in compliance with applicable rules, regulations, policies and proceduresAdditional responsibilities as requestedQualifications:5+ years of experience in a highly analytical role where you led a business unit, had P&L responsibility, engaged in strategic decision-making and drove revenue and margin growth (General Manager, Founder, Product Owner)Bachelor’s degree in Business, Marketing, or a related fieldEffective leadership and coaching skillsExcellent communication and relationship skillsDetail-oriented with strong analytical abilitiesExcellent mathematical, writing, verbal and computer skillsAbility to adapt to new tasks with little noticeStrong desire to winDeep understanding of project management and driving growth initiatives across multiple cross-functional teams such as marketing, content, supply chain and technologyDemonstrated ability to problem solve as well as create and execute growth / optimization initiatives through data-driven decision makingPositive energy, collaborative attitude, “no excuses, only solutions” mindset and ability to work comfortably in a diverse and international environmentAdvantage: Exposure to managing a portfolio of products or digital brands, preferably on Amazon or ShopifyJob Type: Full-timeSalary: 12,345.00₪ - 100,000.00₪ per monthAbility to commute/relocate:תל אביב -יפו, מחוז תל אביב: Reliably commute or planning to relocate before starting work (Preferred)Show more Report"}, {"company": "Gimmonix Technologies", "job": "Head of Account Management", "city": "Tel Aviv-Yafo", "date": "27d", "rating": "", "link": "", "description": "Job DescriptionOur Growth team at Gimmonix takes our business and products across the world. The team delivers significant revenue making a direct and meaningful impact to Gimmonix’s bottom-line and customers. The Head of Account Management is responsible for leading the Account Managers and team, who nurture existing clients by attending their requests and proactively upselling and cross selling our Solutions.Your roleYou'll have global scope and will work closely with clients technology and product management teams to develop a coherent strategy that is aligned with our brand and clients ’ objectives.You will be the voice of the customer, advocating for clients' needs. leading clients growth within our Solutions, defining and establishing the methodology of account management lifecycle.Looking for someone who’s demonstrated: strong data-driven business decisions, great team leadership and tried ability to deliver results under strict timelines. Your initiatives will expand the breadth of business, identify and develop business opportunities; lead collaboration with partners; spearhead internal cross-functional project development; and deliver on financial goals.ResponsibilitiesLeading and nurshiring new opportunities with existing clientele base, and managing Account Management team in a variety of areas such as client satisfaction, client retention and churn prevention,, account management, leading enterprise client projectsEvaluate opportunities, prioritize initiatives that encourage and lead to client usage growth of our Solutions Develop a plan for improving customer experience and drive initiatives with clients to increase business; take care of all solutions within the company to increase the connections between our network of clients.Identify potential improvements in the solutions that will lead to a higher conversion rate.Empower your team to incubate benefits that increase customer demand, are exciting for their customersDefine team and individual KPIs in the line with targetsUse data to identify, evaluate, and manage strategic business opportunities with significant potential incremental revenueOngoing communication of business performance and team progress on initiativesCo-develop a strategy with each supplier and stay aligned on goals, initiatives and targets to strengthen our external relationshipsCollaborate closely with product management, Customer support, Business Development and marketing teams .Lead deal development including prospecting, negotiating, and project development with current clients.Skills and Qualifications5-7 Years of Sales/Account Management experience in the travel industry with at least 2 years leading a team.Experience building a business from scratchExperience with travel technologyNative or close-to-native Hebrew and fluent English knowledge on a business levelExperience in an analytical role in an ecommerce, technology company, consulting, or product management preferredExtensive experience in identifying and prioritizing high-impact improvement opportunitiesExcellent communication, influencing and relationship building skillsDemonstrated ability to work through complex business problems and partner with internal clients with a consultative approach.Strong analytical/modeling skills with ability to convert raw data into actionable business insightsExcellent verbal, written and data visualization skills are a must-have.Ability to communicate in a clear and effective mannerAbility to prioritize among conflicting demands in a fluid environmentAbility to commute/relocate:Tel Aviv-Jaffa, מחוז תל אביב: Reliably commute or planning to relocate before starting work (Required)Show more Report"}, {"company": "Tailor Brands", "job": "Junior Product Marketing Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.4", "link": "", "description": "About Us\nWith over 30 Million users on our platform, we’re here to change the future of business. Our all-in-one platform makes starting a business affordable and accessible to everyone – we welcome more than 800k new business owners every month. From our products to our careers, there are endless opportunities for growth.\nOur team | Our core | Our dream fulfillers\nWhen we started Tailor Brands, we wanted to help people to accelerate their growth and fulfill their dreams. This also defines us internally; we put our focus on maximizing individual impact and creating an environment of absolute transparency.\nAbout the role\nAs a Junior Product Marketing Manager, you’ll be managing Tailor Brand’s email funnels, automation, pop-ups, and user journeys: from ideation, through configuration to analysis & optimization.\nYou’ll be Tailor Brand’s go-to person with everything related to email automation - collaborating with content, paid acquisition and product, orchestrating Tailor Brands’s automated communications aligned with business and brand goals.\nWe’re looking for an individual who’s a self-starter — someone who knows how to get things done but always seeks ways to innovate and test new ideas.\nManage email automation and email funnels, including content messaging strategy\nMonitor email performance, deliverability, analyze results, and enhance campaigns accordingly. Refine email marketing strategy to increase engagement, retention, and conversions\nManagement of triggered email campaigns throughout the customer lifecycle to maximize business KPIs\nInitiating, conducting and measuring A/B tests in emails\nPrioritize and manage multiple projects at once with exceptional attention to detail\nDrive competitive analysis and market research\nProvision of creative briefs for content & design teams to create assets for emails\nWork closely with Product Managers, Designers, Developers, and CS teams\nRequirements:\n\nPassion and knowledge about the Product Marketing field, especially Email Marketing experience, managing large scale global email campaigns\nAn analytical B.A./B.Sc. from a leading academic institution\nStrong analytical and project management skills\nTime management and attention to details\nExcellent interpersonal, communication and cross-group skills\nA passion for innovating and bringing new ideas to the table, and turning your approved ideas into actionable projects while seeing them through from start to finish\nFluency in spoken/written English\nNice-to-haves\nKnowledge & experience in HTML & CSS\nProven experience in the SaaS industry\nWe are located in Tel Aviv but Hybrid mode is on!\nOur team is currently working in hybrid mode. Those who prefer to work in our office can do so in a safe environment.Show more Report"}, {"company": "SysAid Technologies", "job": "Product Marketing Manager", "city": "Lod", "date": "29d", "rating": "3.9", "link": "", "description": "SysAid is a service automation company delivering software for organizations that want to get more done. Our SaaS ITSM (IT Service Management) and Asset Management solutions serve more than 5000 customers across the globe. We do the heavy lifting for IT and anyone delivering services in the digital workspace by leveraging automation, analytics, and AI.We are looking for a PMM, a strong candidate who is a product-oriented individual with extensive experience creating and executing marketing strategies and campaigns that increase product awareness and adoption.In this role, you’ll be able to partner with product management teams, develop and launch new products, drive measurable business results by crafting and executing the go-to-market plans, and sales and marketing materials, and will be ready to step into a key- role at a fast-growing and dynamic tech companyWhat you’ll do:* Be an expert in SysAid products and our market. Understand our customers’ interests and needsDevelop product marketing strategies including product launches, GTM, and targeted campaignsAnalyze personas to map out our customers’ needs and translate SysAid product capabilities into value propositionsEducate both internal and external stakeholders on our product features and their benefits.Work closely with sales and product teams to develop key messaging, value propositions and key differentiatorsCreate sales collateral and tools that align with the buying process and help move prospects & customers through the sales cycleCreate marketing materials (e.g. sales documentation, product videos, website copy, blog posts, ) that articulate the benefits of our productsAssist sales on calls when appropriate to provide deeper dives into the product.Speak and present both internally and externally to promote the story of our product.Conduct market analysis to obtain an understanding of the competitive landscape and help establish product differentiatorsRequirements:What we’re looking for:* 3+ years in a product marketing position for an enterprise software companyExperience marketing to IT and IT Service Management is a significant plusFamiliar with product marketing tactics (e.g. integrated marketing campaigns)Excellent communication and writing skills (in English) and an ability to sell ideas through professional presentationsAbility to create, update, and maintain various sales collateral and marketing materialsProven track record of executing successful product launchesExceptional project management skillsExperience in market and competitive analysisAnalytical mind and strong quantitative skillsPrefer working in a collaborative, cross-team capacityJob Type: Full-timeShow more Report"}, {"company": "Check Point Software Technologies Ltd.", "job": "Technical Product Marketing", "city": "Tel Aviv-Yafo", "date": "1 day ago", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=1136043&s=58&guid=00000186e6357e808825b08639dff975&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e7402776&cb=1678899688255&jobListingId=1008526320149&jrtk=3-1-1grj3gcn3kclj801-1grj3avmhi9he800-0555af49719a1f53-", "description": "Your Team\n\nCheck Point Product Marketing is looking for a top-notch Technical Marketing Engineer to expand the team. The Technical Marketing Organization works alongside Product Marketing and plays a key role in providing the technical aspects of every marketing campaign to our partners, customers, and SEs. This means setting the technical direction, validating campaign assets that are being developed, and establishing product demo environments.\n\nIn this role, you will work with best-in-class cybersecurity technologies and become the global subject matter expert for our Quantum Network Security and Threat Prevention related products. You will be setting up the relevant solutions in a lab environment, working closely with Development Heads, PM, PMM and SEs to properly document technical concepts and real-world use cases and to educate our employees and customer base.\nYour Impact & Responsibilities\nBuild out and manage lab environments to replicate customer environments.\nDevelop technical content including videos, blogs, white papers, datasheets and webinars.\nWork closely with Product Management on product feedback for future improvements.\nEvangelize our solutions portfolio to our customers through events, workshops, webinars and other external communications channels.\nDevelop thought-leadership materials designed to accelerate our business momentum and better engage customers.\nYour Knowledge & Skills\n2-5 years of recent and progressive Technical Marketing Engineering/Technical Product Marketing.\nExcellent English\nHands-on experience in setting up lab environments and building demo environments\ndelivering high-quality technical marketing collaterals with a creative flair to bring fresh ideas into marketing campaigns.\nStrong writing skills are essential - must be able to create a wide range of marketing content such as presentations, white papers, datasheets, solutions briefs, etc…\nExceptional communication and strong public speaking and presentation skills.\nAbility to communicate effectively to both technical and business-level audiences in a compelling and differentiating manner.\nComfortable operating in an ambiguous, fast-paced, complex environment with an ability to manage multiple projects simultaneously.\nProfound understanding of Check Point Products, broadly – an advantage\nBackground with cyber/network/cloud technologies – being Tech savvy – an advantageShow more Report"}, {"company": "Nexar", "job": "Technical Product Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": "Nexar is building the first over-the-top vehicle-to-vehicle network on the planet, to predict and prevent collisions. We use AI, machine vision, sensor fusion, real-time networking, and quite a few other buzzwords, to create a new, delightful, and really safe, driving experience, powered by your smartphone, with the potential of saving the 1,300,000 people who die on the road every year.On the way, we capture and understand driving the world’s roads probably better than anyone else, with drivers from dozens of countries using Nexar for their commute or as part of their job. Nexar offers its business partners data applications providing insights from the road by leveraging the knowledge extracted by performing deep analytics through deep learning at an extremely large scale (with billions of images captured per week). Nexar’s network provides crowd-sourced intelligence of how the road the world around the road looks like and how it’s changing day to day.We are looking for a talented, experienced Technical Product Manager to own and lead the full lifecycle of data applications, and the underlying data platform that powers these data applications for our automotive OEM partners.In this role, you will partner closely with engineers, designers, business leaders and our customers - to execute and deliver on Nexar’s product strategy, through entrepreneurial thinking, professionalism, teamwork, constant learning, and an appetite for success.ResponsibilitiesTechnical Product Management - Ideating, launching and iterating on Nexar’s data applications and data platform.Customer Development - Collecting, managing and responding to feedback; participating in discussions in key customer accounts; working closely with the sales and marketing teams to better understand applicability.Customer Research - Participating/guiding customer research on new areas of exploration; collecting data about our competitor’s capabilities; developing an informed point of view in regards to technology trends.Product Definition - Working very closely with engineering, research and testing teams in order to document user stories and precisely define capabilities; prioritising stories and maintaining a roadmap.Experimentation - Developing, testing and measuring hypotheses.Process Improvement - Actively implementing new ways to improve the products and processes at our growing companyRequirementsProven technical product management experience in a related B2B field, either enterprise software, packaged software, SaaS or on-demand.Track record of ownership and results, from inception to ongoing research and support, including roadmap prioritisation and delivery.Analytical understanding of business considerations and competitive landscape.Deep understanding of the technical trade-offs, architecture and unit economics of complex products and platforms, especially at a very large scale of data processing (comfortable thinking in Petabytes).Experience defining effective technical capabilities into products or solutions to address customer needs.Experience developing human-facing B2B products in areas of mobility, automotive, and mapping.Experience creating and maintaining a developer program and a family of APIs.A creative, flexible thinker - with a sense of structure. Comfortable with being out of your comfort zone.Ideally with a degree in computer science, electrical engineering or a related field.Curious. Energetic. Excellent communicator. Opinionated. Never violent.Things move fast and change fast. Keep up.Job Type: Full-timeSalary: Up to 45,000.00₪ per monthShow more Report"}, {"company": "Fiverr", "job": "Associate Product Marketing Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "", "description": "Fiverr is looking for an Associate Product Marketing Manager to join our Growth Team.\nWe're looking for someone who can plan, develop and implement marketing and user experience initiatives, aimed to create better experiences in order to increase retention and conversion rates, and influence uplifts in customer value and engagement.\nThe Associate Product Marketing Manager will be responsible for various plans and activities, from ideation through execution to post analysis, utilizing the available channels and initiating new ones, and monitoring and optimizing our customer performance.\nWe are looking for a motivated, innovative, and results-driven person, with a passion for marketing, user experience, and optimization.\nOur work model is hybrid, combining remote and on-site work. This allows us to get things done when and where we are most productive.\nRequirements:\n\n1 year of experience as a Product Marketing Manager - a must\nFamiliar with creating GTM strategies for new products and features and experienced in the execution of relevant marketing campaigns and activities.\nStrong analytical skills, highly capable of interpreting data, performing qualitative research, and translating results into actionable key takeaways\nFamiliarity with data system concepts, databases, BI, Usability tests and market research.\nExperience in working with multiple internal partners, including product, design, content, customer success, and support.\nExcellent written and verbal communication skills\nEnglish – Advanced, proficient at a high level\nAt Fiverr, we’re not about checklists. If you don’t meet 100% of the requirements for this role but still feel passionate about the position and think you have the right skills and qualifications to excel at it, we want to hear from you.\nWhat am I going to do?:\n\nBe the voice of (existing and potential) customers; aggregate and synthesize feedback and product ideas from user research, market insights, and extensive product understanding, to assess business impact and influence product development.\nCollaborate with product managers and cross-company partners to develop and launch successful products.\nBe responsible for the product’s GTM plans and implementations; manage all aspects of product launches such as messaging, internal communication, collateral, and rollout strategy.\nCollaborate in coordination of testing of new features and products for relevant target audiences. Track product launches and measure their success.\nOrganize and deliver relevant training to ensure internal teams are effectively educated, aligned, and informed on the product perspective messaging.\nEqual opportunities:\n\nAt Fiverr, we prioritize diversity. We celebrate difference and embed it into every aspect of our workplace and product, as well as our community. Fiverr is proud and committed to providing equal opportunity employment to all individuals regardless of race, color, religion, sex, sexual orientation, citizenship, national origin, disability, Veteran status, or any other characteristic protected by law. In addition, Fiverr will provide accommodation to individuals with disabilities or a special need.Show more Report"}, {"company": "DoorLoop", "job": "Senior Data Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=108&ao=1110586&s=58&guid=00000186e6357e808825b08639dff975&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b48f883b&cb=1678899692667&jobListingId=1008440987692&cpc=BA15C3E50D27FFE8&jrtk=3-1-1grj3gh10jc8t801-1grj3avmhi9he800-54ca41fb4a28cc75--6NYlbfkN0Bg8kaLZpGmonnt516iCDBz1BXXYWwUs3o81vaiU99V9TLG472jvwa0fELsyMFCbJIwFfNgDGDlDNBAZocAjRsGInWfsqI9DliyMkOIGBt6VFBNKJzzVXp24PE5wDbwrWxBpc4fD0-ClI7yXJVx1azSBMNPQwI6rbbkQ0RxWJ8tAPxpRQmsfPPhcGDSxMc-9L4uHDI3XM0uqLEohvSoMHK7WDw-uTvxwDo3QyFMwiCYAEzXPZCzNXDp3CC2ch5uQR_LHBv8KFrhKhDH8Xs_41J3j1-Q-65F0DMO-moEHwu1vXQQQlOpu6XWuY0WH40LhcXzwtoP34-ZnyOVoA4nulVT195m74oVM_4lEOmBWnl37O_P9vPbeIEN59EhsLI6ipHlUb-hgI_DQkaRzZAtVV3tlENQI84R-O_CUpdyM-YclHu_gWRiCaQ29N21sVKb-C5AB9gYqXuie9NIYvZfTiNrC0NFYX0dnSnwlm43vxfqe2asjmFv-09JaFfI6eo8GwELgszoHDffILcz2eczrRxI0dBOchrjbRynGlwdKiZHAQsveb4dLpJ-zxCCItybKg2vBgsfBYZi3wn_A7R_6xkGL83O9OoTPaM-l0v_al2FkA%3D%3D", "description": "About DoorLoopCertified as a Great Place to Work®, DoorLoop is a property management software used by landlords and property managers in over 100 countries.As a software company with $30M in funding, 3 offices worldwide (Miami, London, Israel), and tens of thousands of units being managed, we are one of the fastest growing tech companies.If you want to work with a team that values transparency, feedback, and growth, DoorLoop is for you.The RoleWe are looking for a super talented Senior Data Analyst to join our team in Tel-Aviv. If you are excited about what you are about to read, we invite you to apply!We are looking for someone who has a good understanding of relational databases, hands-on experience in SQL and/or Python, and data visualization tools such as Tableau and Power BI. You will be working closely with the product, marketing, customer success, and engineering teams, to improve conversions, LTV, churn, product A/B tests, and more. You will collect and analyze the data and help answer the toughest issues each team is facing in order to drive insights..Some additional qualities about you and this role:You will identify, analyze, and interpret trends or patterns in complex data sets to drive actionable insights.You will define and implement KPIs across different teams: product, business, marketing, and customer success.You will implement product features, measure their performance, and provide recommendations.Gain a deeper understanding of how customers use our product, and advise us on how to improve.You will translate product/business requirements, and create a clear visualization which \"tells the story\" using a BI tool or other platformQualifications & Requirements4+ years of experience as a Data/Business Analyst.B.S in one of the following: Industrial Engineering, Statistics, Mathematics, Economics, or a related field.An ability to understand complex business models and simplifyExperience in product analysis including working with BI events and performing A/B tests.High level of SQL is a must.Experience in BI visualization tools such as Tableau, Amplitude, or similar and performing A/B tests.Experience in data modeling, ETL development, and data warehousingTeam player, effective interpersonal skills, and good vibes. Ability to manage relationships with key partners and the ability to work independently.Experience in a fast-paced, dynamic work environment.Bonus PointsExperience in Python is a plus, but not a must.Experience working with Salesforce is a plus, but not a must.Benefits & PerksUnlimited paid time off with unlimited personal, vacation, and sick days.Annual company retreat in the US with our Miami team (all expenses paid).Career development with unlimited access to Udemy's courses and other growth opportunities.Monthly investment classes from our co-founders on how to invest your money in a diversified portfolio of real estate, stocks, crypto, NFT, & more.No micromanagement - We believe responsible people thrive on freedom.Great equipment - Ergonomic chairs, Mac or PC laptops, dual monitors, standup desks, and more.No rules - No dress code, policies, or handbooks. Just do great work & have fun!Job Type: Full-timeAbility to commute/relocate:תל אביב -יפו, מחוז תל אביב: Reliably commute or planning to relocate before starting work (Required)Show more Report"}, {"company": "Quantum Machines", "job": "Product Marketing - Student (Master physics)", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.6", "link": "", "description": "Quantum Machines is the global leader in control systems for quantum computing, providing the hardware and software tools researchers and businesses need in order to build quantum computers from the ground up. We are pushing the envelope in a field on the verge of exponential growth, bringing about opportunities like those made possible with the invention of classical computing 50 years ago.\nWe are assembling the strongest team of professionals in the world with the goal of revolutionizing how quantum computers are built and controlled, while accelerating their arrival. Come join a multi-disciplinary world-class team and work on a new class of problems at the cutting-edge of technology, science, and business.\nQuantum Machines is backed by top tier investors such as Battery Ventures, Red Dot Capital Partners, TLV Partners, and Avigdor Willenz’ investment group.\nWe are looking for one physics student (BSc or MSc) with a passion for communication and for writing technical-marketing content. The ideal candidates have taken quantum mechanics courses and are eager to learn about the challenges of the scientific and industrial community around quantum computing and control. You will be guided in learning about the key players of today’s quantum ecosystem and keeping up to date with research and industry efforts.\nResponsibilities:\nDevelop a deep understanding of the technology, ecosystem, customer challenges and industry trends, in order to create related content such as social media posts, white papers, web pages, brochures, presentation and more\nCreate sales tools as product brochures, case studies, product videos and product presentations\nProduce and review technical notes and product marketing material for QM - a thriving international quantum control company.\nWork closely with internal peers such as Product, R&D and CTO Teams to summarize into text that convey our value to customers in the best way.\nRequirements:\nBasic quantum mechanics university course (must)\nExcellent writing skills (must)\nAble to study independently and eager to learn\nAdvanced or technology-oriented quantum mechanics courses (plus)\nFluent in English (spoken and written) – Danish NOT required (plus)\nSome experience with scientific and technical writing (plus)\nExpecting 40%-60% as a part-time positionReport"}, {"company": "SMSEdge", "job": "Junior customer success manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=110&ao=1136043&s=58&guid=00000186e6357e808825b08639dff975&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_08c5dc94&cb=1678899695559&jobListingId=1007230867782&jrtk=3-1-1grj3gjrrkltk801-1grj3avmhi9he800-a8ad1dbe770d66ea-", "description": "Job Description\nDay-to-day responsibilities include:\nCommunicating with new and existing clients, understanding their needs and onboarding them.\nWorking with telecom companies to improve and add delivery channels.\nConnecting and negotiating with communication providers.\nReviewing and understanding key performance statistics, ultimately deriving conclusions and recommendations based on campaign performance.\nEnsuring customers see maximum success with their sms marketing campaigns.\nRequirements:\nEnergetic, with a can do attitude.\nCommunicative and a team player.\nAnalytical with ability to interpret data and analytics into meaningful insights.\nCreative, self-starter, who can multitask while working under pressure.\nEnglish - High Proficiency - MUST\nSend CV to: jobs@smsedge.io\nProduct Information\nPresentation - smsedge.com/presentation\nVideo - smsedge.com/video\n\nApply via email at: jobs@smsedge.comShow more Report"}, {"company": "Fiverr", "job": "Product Marketing Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "", "description": "Fiverr is looking for a Product Marketing Manager to join our Growth Team.\nWe're looking for someone who can plan, develop and implement marketing and user experience initiatives, aimed to create better experiences in order to increase retention and conversion rates, and influence uplifts in customer value and engagement.\nThe Product Marketing Manager will be responsible for various plans and activities, from ideation through execution to post analysis, utilizing the available channels and initiating new ones, and monitoring and optimizing our customer performance.\nWe are looking for a motivated, innovative, and results-driven person, with a passion for marketing, user experience, and optimization.\n﻿Our work model is hybrid, combining remote and on-site work. This allows us to get things done when and where we are most productive.\nRequirements:\n\n3+ years of experience as a Product Marketing Manager\nExperience in creating GTM strategies for new products and features and execution of relevant marketing campaigns and activities.\nStrong analytical skills, highly capable of interpreting data, performing qualitative research, and translating results into actionable key takeaways\nFamiliarity with data system concepts, databases, BI, Usability tests and market research.\nExperience in working with multiple internal partners, including product, design, content, customer success, and support.\nExcellent written and verbal communication skills\nEnglish – Advanced, proficient at a high level\nAt Fiverr, we’re not about checklists. If you don’t meet 100% of the requirements for this role but still feel passionate about the position and think you have the right skills and qualifications to excel at it, we want to hear from you.\nWhat am I going to do?:\n\nBe the voice of (existing and potential) customers; aggregate and synthesize feedback and product ideas from user research, market insights, and extensive product understanding, to assess business impact and influence product development.\nCollaborate with product managers and cross-company partners to develop and launch successful products.\nBe responsible for product’s GTM plans; manage all aspects of product launches such as messaging, internal communication, collateral, and rollout strategy.\nCoordinate testing of new features and products for relevant target audiences. Track product launches and measure their success.\nOrganize and deliver relevant training to ensure internal teams are effectively educated, aligned, and informed on the product perspective messaging.\nEqual opportunities:\n\nAt Fiverr, we prioritize diversity. We celebrate difference and embed it into every aspect of our workplace and product, as well as our community. Fiverr is proud and committed to providing equal opportunity employment to all individuals regardless of race, color, religion, sex, sexual orientation, citizenship, national origin, disability, Veteran status, or any other characteristic protected by law. In addition, Fiverr will provide accommodation to individuals with disabilities or a special need.Show more Report"}, {"company": "Seeking Alpha", "job": "Junior Partnerships Specialist", "city": "Raanana", "date": "13d", "rating": "4.4", "link": "", "description": "Seeking Alpha helps over 200K users to invest better and meet their financial goals faster. Our product is always evolving, so we are looking for a junior-level partnership manager to help us scale our affiliate and influencer programs, showcase our product, drive subscribers, and strengthen our brand.\nAs Seeking Alpha’s Partnerships Manager, you will be responsible for creating, growing, and managing our partnerships’ programs from the ground up, and updating the stakeholders regularly. You will report to the partnerships’ team leader.\nWhy we’re a great company to work for?\nSeeking Alpha is a company on the verge of Hyper-Growth, and it is exactly the right time to get on this spaceship before it leaves the atmosphere.\nWe have an awesome product. Our cutting-edge investing tools are helping 200,000 paying subscribers exceed their financial goals.\nWe care about work-life balance: We work primarily from home, provide lots of perks, and insist that you enjoy them.\nWe invest in people. We consider each employee a long-term investment, and we see value in continuously nurturing and training our teammates.\nRequirements:\n\nExcellent verbal and written communication skills in English\nStrong recruitment and negotiation skills\nSocial media knowledge- An advantage\nA hard worker and eager to learn\nStrong analytical skills\nLocation - You can be located anywhere in Israel to succeed in this position – our HQ is in Raanana, but we work most of the time remotely, and always will.\nResponsibilities:\n\nBuild the partnerships program with research, reaching out, closing deals, and monitoring partners’ activity. You will regularly analyze performance, identify areas of improvement, and recommend ways to increase partnerships-generated revenues.\nAmong other responsibilities, you will:\n﻿Initiate primary reach out with financial publishers, comparison engine partners, and influencers\nBuild the relationship, and function as the main POC for our partners\nCommunicate and monitor brand guidelines in various channels\nProactively monitor traffic sources on all campaigns in order to acquire the target ROI for all marketing campaigns\nSet and manage monthly, quarterly and annual goals for revenue growthShow more Report"}, {"company": "Plarium", "job": "Junior Survey Researcher", "city": "Herzliya", "date": "16d", "rating": "4.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=1136043&s=58&guid=00000186e6357e808825b08639dff975&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e9249376&cb=1678899699285&jobListingId=1008493539271&jrtk=3-1-1grj3gng8k615801-1grj3avmhi9he800-d2410d82e3b060b0-", "description": "About the department\nAbout Research department-The research department is responsible for the\n\nanalysis of players research, competitive offering\n\nand market trends.\nResponsibilities\nAs a Junior Survey Analyst, the new team member will perform\ncustomer research, based on questionnaires for product and marketing departments.\nThe researcher will present the findings to the internal\ncustomer and deliver a structured report.\nWhat we expectQuestionnaire writing experience -Must!!!Perform statistical analysis of surveys.Qualitative research as well; playtests, interviews,\ndiaries, etc.\nPresenting reports to all levels of managementWork with a wide range of internal clients\nDesiredAdvantage – Experience in Gaming companiesExperience with data analysis: Excel, SPSS, R,\nPython\nExperience with Power PointAdvantage: Background in academic research\nWhat we offer our Employees\nYour wellbeing: Flexible, hybrid work experience with talented professionals. Also, high work life balance derived from our people-oriented approach\nYour health: top notch health insurance to employees and immediate family. Furthermore, gym membership or a variety or workout options\nYour future: personal and professional tools to assist with your development and journey\nYour contribution: A variety of social and charitable initiatives, that we take pride in\nYour home away from home: A newly renovated office that includes breakfast every morning, a barista to give you your coffee during your workday, an in house gym and workout studio to balance all the delicious food and if you are a musician a fully equipped music room to play around in\nAnd an opportunity to work with the best of the best locally and globally in the gaming fieldShow more Report"}, {"company": "Kramer", "job": "Product Manager", "city": "Central", "date": "10d", "rating": "5.0", "link": "", "description": "Who are we?\nKramer is a leading player and pioneer in the Pro AV industry.\nKramer audio visual experiences power creativity, collaboration, and engagement. From AVSM to advanced cloud-based communication, collaboration and control solutions, Kramer creates audio visual experiences that are more engaging, more inclusive and more connected than ever before.\nAbout the role\nWe are looking for top talent expert, passionate and motivated Product Manager to join our team and deliver seamless technology experiences in a hybrid, always-on world and will influence and contribute to the growing Kramer PRO AV market and will be responsible for:\nManage one of the company’s core product lines\nBe the owner during the entire Product Life Cycle and related processes\nDefine the product line strategy & roadmap and its execution\nSecure product investment by building compelling business cases for innovative products\nHave full market knowledge on technology trends & competitors’ offerings\nDefine the customer value and differentiation\nInteract with the company’s customers and partners to define product requirements and plans\nPrepare relevant product documents and collateral, such as: Initiatives, Epics, product description and presentations\nOrchestrate R&D and sales teams in a high-technological and dynamic environment\nDefine the product line positioning and marketing messages\nDefine and manage the correct product readiness plan to ensure that the business is ready to sell, deliver and support the product\nRequirements:\nMinimum of 5 years of experience as a Product Manager in Software Products company\nBachelor’s degree in a relevant technology-related or equivalent experience\nMBA – an advantage\nDemonstrated success defining and launching excellent products\nProven experience working with customers and partners\nHas the drive to push products to new highs\nExcellent communication, presentation and teamwork skills\nProven ability to influence cross-functional teams without formal authority\nCan prioritize and make decisions in a changing agile environment\nBe fully proficient in English\nMust be able to travel 30% of the time\nit4ErDqgcYShow more Report"}, {"company": "Imagen", "job": "Marketing Analyst", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "", "description": "Imagen is developing a disruptive technology for the professional photo editing market. We use edited photos from each of our users, to create personalized AI profiles and to reduce and eliminate editing efforts. Creating a personalized profile based on user data gives great value to our users and creates many challenges.With a very strong market validation, a crazy month-over-month growth, and a top-tier VC backing us, we’re looking for the first team members to join our team. It’s an opportunity to be part of something huge and be a leader in a fast-growing company.What will you do:Lead the marketing data activities in the companyAnalysis and decision-making based on data insightsVisualize data with dashboards to address key questions for the company’s in-house teams like Marketing, Growth, Product, and moreDesign and execute BI ETL flowsRequirements:BA / BSc in Industrial Engineering and Management / Information Systems / Engineering / Economics / Statistics / Mathematics / similar background.3+ years of experience as a Data Analyst / BI Analyst / similar positions2+ years of experience with B2C data-driven productsStrong SQL experience querying large, complex data setsExperience in building BI visualizations and dashboards (Tableau – an advantage)Knowledge of Python for data prep and analysis – an advantageJob Type: Full-timeShow more Report"}, {"company": "lusha", "job": "Product Marketing Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=1136043&s=58&guid=00000186e6357e808825b08639dff975&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0062a403&cb=1678899703063&jobListingId=1008326149153&jrtk=3-1-1grj3gr4vkblj801-1grj3avmhi9he800-f724f4664fd772b9-", "description": "Description\nLusha is growing and we are searching for an experienced Product Marketing Manager to join our team!\nIf you are a skilled marketing professional who is motivated by customer insights, excited about product launches, passionate about the user journey, and thrives in a cross-functional, fast-paced environment - read on!\nAs a PMM, you will focus on launching new products and features, and develop product positioning and messaging that hits every stage of the funnel.\nYou will:\nTell stories about how our products work and drive value for our users and customers.\nCreate sales enablement collateral and content that helps onboard & guide our users.\nDevelop go-to-market strategy plans and execute launches across web, social, email, ads etc.\nOwn the lifecycle from awareness to advocacy to develop messaging that helps differentiate Lusha.\nManage and prioritize a workload of multiple projects with a variety of stakeholders.\nYou are:\nA storyteller. You have deep empathy for users and are able to adapt how you communicate to best engage your audience. You have excellent verbal and written communication skills.\nData-oriented. You like working with data and insights and pair that with your passion for users to generate balanced and thoughtful points of view for how to take our products to market.\nOrganized. You are able to manage highly interdependent, multifaceted projects and keep various work streams on track - even those with many moving parts.\nA self-starter. You know how to identify opportunities and take initiative.\nPassionate about technology. You are keen to learn about how things work and are able to explain technical concepts in ways that everyday people can understand.\nAmbitious. You are eager to make an impact. You thrive in a fast-moving, dynamic, growth environment and are able to operate at the strategic level and the micro-detail to get things right.\nA team player. You will collaborate across the Marketing team and with every team at Lusha. You are able to work with a range of disciplines to execute your work.\n4+ years of relevant work experience in marketing, product marketing, product management, or strategy.\nAt least 2 years of product marketing or go-to-market.\nB2B tech experience.\nMajor plus: experience with PLG companies that have a high-touch enterprise component.\nWhy Lusha?\nLusha connects you to your most relevant potential customers by creating simple, self-served products that provide access to meaningful and insightful B2B data. We offer ways to leverage data as an enabler for better, smarter, and faster conversions at every stage of the customer lifecycle. Lusha was named Top 100 G2 Best Software Company and Top 100 Fastest-Growing product in 2020. Based in the center of Tel Aviv, Lusha is a fast-growing startup that offers its 300+ employees the opportunity to take an active role in shaping the future of the company. While all of us are dedicated to that mission, we surely know how to have a good time.Show more Report"}, {"company": "Kramer", "job": "Product Line Manager (PLM)", "city": "Central", "date": "7d", "rating": "5.0", "link": "", "description": "Who are we?\nWe are audio-visual experts from around the world designing the future of engagement technology.\nOur audio-visual experiences power creativity, collaboration, and engagement. From signal management to advanced cloud-based communication, collaboration and control solutions, Kramer technology breaks down walls, bridges gaps, and makes people feel closer together even when they're far apart.\nWe believe that technology can amplify the human experience and help people reach their potential. Our vision for the future calls for fantastic thinkers and doers, from all corners of the world and all walks of life. We trust each other. We empower each other. We speak from the heart, and we always go the extra mile for our colleagues and customers.\nAbout the role\nWe are looking for Product Line Manager (PLM) to lead Kramer’s portfolio of Audio-Visual products.\nPassionate and self-motivated product leader with 5-8 years of experience in similar position.\nHighly innovated with substantial technical relevant knowledge, i.e., in Video distribution, Control, Networking, Audio, etc.\nCapable to define a winning product & strategy and to engage and collaborate with all departments (R&D, sales and Marketing WW)\nRequirements\nB.Sc. In EE/Computer Engineering\nMBA is an advantage.\nProven experience of defining new products in ProAV market with focus on HW - is big advantage.\nAutodidact and highly motivated person\nTeam player\nExceptional communication skills in English\nn1we74D6RfShow more Report"}, {"company": "Arbox", "job": "Product Marketing Manager", "city": "Bnei Brak", "date": "13d", "rating": "", "link": "", "description": "We are looking for an experienced Product Marketing Manager to join our growing Marketing team. As a PMM, you will be the link between Product, Marketing & Sales, responsible to develop product positioning and messaging informed by user research, market insights, and product understanding.\nA key part of your role will be to become an expert on Arbox’s customer pain points, requirements, and journey, plan go-to-market strategies, and ensure that we effectively communicate the value of our product.\nCome join our amazing marketing team and be part of our journey\n\nRequirements:\n\nYou are a self-starter, independent, and ambitious. Excited about pushing new initiates and managing ongoing projects, from a-z.\nYou are a team player with a can-do attitude and exceptional communication skills who can exchange feedback constructively, and who is comfortable working on new, changing, and fast-paced projects.\nYou are quick to adapt to new workflows and are not afraid of a challenge.\nYou know how to create and tell a compelling story while distilling complex concepts into clear, concise language and business value.\nA professional-level English speaker and professional writer who is passionate about quality marketing content, you are a critical thinker with an eye for detail.\nYou are curious and eager to learn new tools and technologies, and you keep up with the latest trends in the marketing world.\nAnalytical thinker with a passion for numbers, reports, analysis, and A/B testing.\nComfortable managing multiple projects simultaneously and working with others to meet deadlines, ensure quality and accuracy, and track results.\nMust-Have Experience\n1-2 years working in product marketing positions.\nExperience in Google Analytics, Google Tag Manager, Google Optimize or other A/B testing tools - advantage.\nUnderstands marketing metrics and KPIs and how to assess them.\nExperience in SaaS environments. - advantage.\nFluent English speaker.\nBring your Spark :)\nAbout Us:\n\nOur mission is to help small to medium owners transform from industry experts to business experts. Using Arbox allows our customers to simultaneously grow their businesses while focusing on doing what they do best – building their community and making their clients feel happy and fulfilled.\nDreaming big from the get-go, our SaaS product has been a game-changer for our hyper-growing worldwide client base with millions of end-users.\nArbox has an energized, innovative, fun, and supportive culture. We look for positive, friendly, creative, and dynamic people with a passion to succeed and join this amazing journey!\nWhat your Arbox day will look like:\n\nConduct market research to understand trends, competitive landscape, and target personas.\nWork across teams to plan and manage launches of new products, features, and capabilities.\nShare ideas and provide input for new business opportunities and product capabilities.\nTell a story: drive product messaging and positioning that stand out in the market.\nWork closely with sales, and customer success to identify needs, and sharpen product differentiation, competitiveness, and offerings based on feedback from customers, sales, and competitive offerings.\nAnalyze, package, and optimize the product funnel and lead journey.\nContribute to content, email, social media, and community strategy.Report"}, {"company": "VectorBuilder, Inc.", "job": "Israel Territory Manager (BioTech Company - PHD in Biology Preferred)", "city": "Tel Aviv-Yafo", "date": "1 day ago", "rating": "2.7", "link": "", "description": "VectorBuilder is a rapidly growing biotechnology company specializing in advanced genetic engineering solutions for research and medicine. In particular, VectorBuilder has established itself as a global leader in a range of products and services related to gene delivery, including vector design and optimization, vector cloning, virus packaging, library construction and screening, stable cell line generation, and GMP manufacturing of clinical-grade plasmids, mRNAs, proteins and viruses.One highlight of VectorBuilder's innovative solutions is a revolutionary online platform for designing and ordering custom vectors. This award-winning platform has become highly popular with researchers around the world and has grown into an industry standard for its rich functionalities, extensive experimental validations, and easy-to-use graphical user interface. By leveraging the popularity of this platform, VectorBuilder has built a comprehensive portfolio of offerings covering virtually all gene delivery needs from bench to bedside.We are currently seeking a Territory Manager to oversee the Israel area to join our team!Qualifications:Degree in Molecular Biology, Biochemistry, Genetics or related field (Ph.D. highly preferred)High self-motivation, ability to work independently and as a collaborative team playerExcellent communication, negotiation, and sales skillsAbility to interact with customers with confidence and easeFluency, both verbal and written, in EnglishStrong attention to detailHighly desired but not required:Experience in account management or marketingMinimum 2 years of Pharmaceutical/Biotech/Medical device experienceExperience in molecular biology techniques especially DNA cloning and virus packagingExperience with selling and presenting detailed scientific subjects in a clear and understandable mannerExperience working with HubSpot is a plus but not requiredKey responsibilities:Increase sales within the designated territoryAct as a point of contact for existing and potential customers within assigned territoryCommunicate with clients via email, phone, video call, webinar, virtual product shows/conferences (and in the future: in-person meetings, presentations, product shows/conferences) to promote VectorBuilder offeringsDiscover and reach out to new potential clients (cold calling)Answer customer questions about features, pricing, and additional servicesCultivate strong, long-lasting client relationshipsCollaborate with sales representatives from different territories to share best practices and support a cohesive sales approachDemonstrate strong product/service knowledgeWork closely with internal departments to provide high-level technical support and guidance to customersMaintain high customer satisfaction levels through excellent customer serviceCompensation is based on experience. Ranges from $40000.00-$80000.00 USD per year.Job Type: Full-timePay: 142,000.00₪ - 287,000.00₪ per yearAbility to commute/relocate:Tel Aviv-Jaffa, מחוז תל אביב: Reliably commute or planning to relocate before starting work (Required)Application Question(s):Please list your minimum and desired salary.If offered the position, how soon are you able to start?Education:Undergraduate (Required)Experience:Sales: 1 year (Preferred)Pharmaceutical/Biotech/Medical device: 2 years (Required)Willingness to travel:25% (Preferred)Report"}, {"company": "OPSWAT", "job": "Director of Product (MetaAccess)", "city": "Herzliya", "date": "8d", "rating": "3.3", "link": "", "description": "OPSWAT is a global cyber security company providing solutions for enterprises since 2002 to identify, detect, and remediate advanced security threats from data and devices coming into and out their networks. Trusted by over 1,000 organizations worldwide and with over 30 anti-malware engines, 100+ data sanitization engines and more than 25 technology integration partners, OPSWAT is a pioneer and leader in data sanitization, vulnerability detection, multi-scanning, device compliance, and cloud access control.\n\nOPSWAT. Protecting the World's Critical Infrastructure\nThe Position\n\nThe Director of Products will be responsible for all go-to-market activities for OPSWAT's IT Security MetaAccess product. This is a hands-on leadership position with the responsibility of planning and launching new and existing products to scale existing businesses. Reporting directly to the VP of Products, this person will play a key leadership role to help the company continue its hyper growth and achieve overall business objectives.\n\nWhat You Will Be Doing\n\nWork closely with sales, marketing, product management and others on product strategy and its alignment with the go to market plans.\nLead cross-functional teams to launch and promote our products and solutions.\nDefine ideal customer profiles, target personas. and value propositions for relevant market segments.\nDevelop and execute GTM programs and integrated marketing campaigns that drive demand.\nCreate thought leadership content, including white papers, webinars, emails, presentations, press releases, customer case studies, and product videos.\nDevelop sales enablement tools, including training, battle cards, playbooks, and value messaging guides.\nResearch competitive products and create competitive analysis materials to enable sales.\nProvide content for and represent the company at various speaking engagements, conferences, press interviews, industry analyst briefings, etc.\nWhat We Need From You\n\n8+ years B2B product marketing or product management experience, including 5+ years in cyber security.\nProven track record of collaboration with marketing and sales teams to drive results.\nStrong interpersonal skills, ability to influence others and lead cross-functional teams.\nCyber security domain experience is required, preferably experience in Enterprise Security, CISSP, CWP, CSPM.\nDemonstrable background in writing marketing content (white papers, website content, data sheets, etc.).\nBachelor's degree required (MBA preferred).\nExcellent written and oral communication skills.\n\nOPSWAT is an equal opportunity employer. We celebrate diversity and are committed to providing an environment where equal employment opportunities are extended to all employees and applicants, free of discrimination and harassment of any type. All employment decisions are based on individual qualifications, job requirements, and business needs without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other category protected by federal, state, or local laws.Show more Report"}, {"company": "Radware", "job": "Product Marketing Manager – Temporary", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=121&ao=1136043&s=58&guid=00000186e6357e808825b08639dff975&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_5ab0dc27&cb=1678899711249&jobListingId=1008414862437&jrtk=3-1-1grj3h350k62n801-1grj3avmhi9he800-d6e98accec8b36cf-", "description": "Product Marketing Manager – Temporary - (2300000V)\nThe Security Product Marketing Manager will be part of Radware's Global Portfolio Marketing team, responsible for the go-to-market activities of Radware’s leading security products.\nWe are looking for an experienced content creator who can work across our different product lines and create compelling and strategically correct assets which go straight to the customer pain points.\nKey responsibilities include:\nResponsibility for all product marketing activities for specific product lines.\nCraft compelling messages that translate technical details into benefits for the user.\nBuild marketing assets (presentations, datasheets /brochures, whitepapers, and so on) to support Radware’s products/services.\nCreate demand generation content such as blogs, social media posts, case studies, etc.\nSupport the Sales organization with development of internal and external sales tools and training.\n\nWhat do you need to succeed?\n2+ years experience in product marketing or product management with marketing responsibilities.\nBackground in content creation and writing with attention to quality and detail.\nExcellent English presentation and writing skills.\nStrong team player – great interpersonal and cross-group working skills to interact with colleagues, cross-functional teams, and third parties.\nPassionate about technology and ability to understand it.\nBSc/BA Computer Science, Engineering, Business, Marketing, or equivalent experience; MBA is an advantage.\n\nWe'll be happy if you also have knowledge and experience in cybersecurity, DDoS or application security, or certifications in information technology such as CISSP or CISM.\nLocation and Logistics:\nThe position is based in Tel Aviv, with a hybrid work model\n\n#LI-ML1\n\nPrimary Location: IL-IL-Tel Aviv\nWork Locations: Radware Israel, Tel Aviv 22 Raoul Wallenberg Street Tel Aviv 69710\nJob: Product MarketingShow more Report"}, {"company": "EntryPoint", "job": "Product Marketing and Content Leader", "city": "Israel", "date": "30d+", "rating": "3.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=122&ao=1136043&s=58&guid=00000186e6357e808825b08639dff975&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_fcbf951a&cb=1678899712540&jobListingId=1008425286392&jrtk=3-1-1grj3h4enkcmq801-1grj3avmhi9he800-d3d8b8ed82cd29a0-", "description": "Product Marketing and Content Leader\n15/03/2023\nCoordinate between product teams and marketing for effective delivery of our uniqueness;\nDevelop content strategy and campaigns aligned with short-term and long-term marketing targets\nCollaborate with marketing and design teams to plan and develop content, style and layout\nCreate and publish engaging content\nEdit, proofread and improve writers’ posts\nLiaise with content writers to ensure brand consistency\nManage content distribution, including online channels and social media platforms, to increase lead generation and web traffic\nEnsure compliance with law (e.g. copyright and data protection)\nStay up-to-date with developments and generate new ideas to draw audience’s attention\n\nRequirements\n\nProven record as product marketing\nBackground in selling B2B solutions and/or SaaS solutions, preferably communications solutions\nTeam management – advantage\nBackground in Telecommunications – advantage\nHands on experience with MS Office\nSelf-employed personality with good organizational and time-management skills\nKnowledge of SEO and web traffic metrics and social media\nExcellent writing skills in English\nAttention to details\n\nמספר משרה: 4441Show more Report"}, {"company": "Check Point Software Technologies Ltd.", "job": "Product Marketing Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=123&ao=1136043&s=58&guid=00000186e6357e808825b08639dff975&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_4b8befae&cb=1678899713765&jobListingId=1008264786226&jrtk=3-1-1grj3h5kck6ec801-1grj3avmhi9he800-6e8d303f45ea1fdb-", "description": "Your Team\n\nWe’re looking for a self-starter Product Marketing Manager with 3-5 years experience taking cyber security solutions to market. Harmony is one of Check Point’s fastest growing suite of products and we are looking for a motivated and creative, hands-on expert to join our team.\nYour Impact & Responsibilities\nDrive product launch and develop go-to-market plans, manage the development of sales enablement tools and training for field sales force and reseller partners.\nDevelop the sales tools (PPTs, feature briefs, case studies, white papers, product brochures) to support the sales process of the company’s solutions and drive clarity and consistency of message.\nDevelop thought-leadership materials designed to accelerate our business momentum and better engage customers.\nPresent our products and solutions in formal and informal settings.\nEvangelize our solutions portfolio to our customers through events, webinars and other external communications channels.\nDrive sales enablement activities; act as key contact with the sales organization driving communications of product direction, positioning, key messages and sales collateral.\nTravel for presentations, training, tradeshows and events – up to 25%\nYour Knowledge & Skills\n3-5 years of experience as a Product Marketer at a cyber security vendor - MUST\nExcellent English (English as a mother tongue – preferred)\nWork experience within enterprise security or networking targeting large enterprise customers is highly desirable.\nHands-on experience delivering high-quality marketing materials with a creative flair to bring fresh ideas into product positioning and marketing campaigns.\nStrong writing skills are essential - must be able to create a wide range of marketing content from scratch (presentations, white papers, datasheets, brochures, etc.).\nExceptional communication and strong public speaking and presentation skills.\nAbility to communicate effectively to both technical and business-level audiences in a compelling and differentiating manner.\nComfortable operating in an ambiguous, fast-paced, complex environment with an ability to manage multiple projects simultaneously.\nBA/BS or equivalent experience.Show more Report"}, {"company": "Craft.io", "job": "Director of Content Marketing", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=124&ao=1136043&s=58&guid=00000186e6357e808825b08639dff975&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b36c02d2&cb=1678899714919&jobListingId=1007651948249&jrtk=3-1-1grj3h6o0k60l801-1grj3avmhi9he800-6d7365b44e3e07cc-", "description": "About Craft.io\n\nCraft.io is revolutionizing product management with an end-to-end platform for product professionals.\n\nWith Craft.io, product professionals enjoy a single source of product truth where they create their product strategy and roadmaps, collect and analyze valuable customer feedback, prioritize features and tasks, write specs, and monitor the work of the dev teams.\n\nThousands of product professionals from companies like SAP, Kimberly-Clark, Danone, Sysco, Novartis, and Marks & Spencer use Craft.io, and we are proud to provide them with everything they need to become better at what they love doing - building and shipping great digital products.\n\nAt Craft.io, we work hard but try not to take ourselves too seriously. We are highly adaptable and constantly evolving, passionate about our product, and live to bring value to our customers consistently. Our work environment is dynamic, innovative, and fun, backed by a solid product, strong leadership, and a well-funded future.\nAbout the Director of Content Marketing role\n\nWe’re looking for an experienced content writer, a veteran in creating content for B2B SaaS companies with proven success in creating great content and executing a marketing penetration strategy.\n\nOur ideal candidate is someone who can develop a content strategy, create a content plan and calendar, write great content for a wide variety of marketing materials, and manage freelance content writers.\n\nBottom line: if you’re a hard worker as well as a visionary, Craft.io may be the right place for you.\nWhat will you actually do?\n\nBecome an expert in the Product Management software space, know our competitors, and learn where we can beat them\nPlay a key role in the Craft.io branding process and positioning\nDevelop and implement a content strategy\nOwn and create all Craft.io content and marketing materials\nWrite a lot of content, both long-form and short-form, such as eBooks, guides, reports, case studies, website content, landing pages, blog posts, ad copy, emails, press releases, articles, and more\nManage content publication cycles, including graphic designers, writers, and web developers\nTake the initiative and remain flexible - this is a startup, after all :)\nNative-level English - must have\n2+ years experience as Content Marketing Manager working for B2B SaaS company - must have\nExperience with writing for enterprise software companies as a target audience - must have\n\nExperience with different types of writing: newsletters, customer stories, white papers, etc. - must have\nExtremely organized with high attention to detail and a love for being deep in the weeds - must have\nExperience communicating with freelance writers, internal stakeholders, and management - must haveShow more Report"}, {"company": "Nebius", "job": "Product Marketing Manager", "city": "Tel Aviv-Yafo", "date": "15d", "rating": "", "link": "", "description": "Nebius Israel is a new brand in Israel. The Nebius Israel platform combines the technical advantages of cloud hyperscalers with an unparalleled level of transparency and compliance, made possible by collaboration with trusted local partners in a joint venture. We offer a unique opportunity to join the first steps of Nebius Israel, grow with us and make a powerful impact.\nNebius Israel is looking for a superstar, results-oriented Product Marketing Manager. In this role, you will be responsible to build dedicated go-to-market plans for the Israeli market that will generate demand, progress the pipeline, enable higher close rates, shorten the deal cycle, and monetize our customer base. In this important role, you will interface, collaborate with and leverage team members across the product, business, R&D, Finance, and functional marketing teams to educate and enable our customers, partners, and sales team on the value of the Nebius Israel services and solutions.\nYour job is to:\nLead product-related marketing campaigns and activities\nDrive market research and competitive analysis\nDevelop product messaging and positioning that differentiates our services and solutions. A clear understanding of our target markets, buyer personas, competition, partner ecosystem, and our products.\nBuild go-to-market plans per product/use case including messaging/positioning. Content creation and sales enablement tools.\nDevelop both business and technical product-related content, including whitepapers, solution briefs, presentations, videos, webinars, case studies, and more.\nPlan and execute feature launches cross-functionally with Sales, Marketing, and Support teams.\nDevelop sales enablement materials to arm the sales team with competitive intelligence that drives sales productivity and pipeline conversion\nWhat we expect from you:\n5+ years of product marketing experience in B2B companies / cloud hyperscalers\nAt least 2 years of experience in a market-facing role (e.g. delivering presentations to customers and prospects, conducting competitor analysis, and market research)\nExceptional ROI-tracking skills, able to prove what is or isn't working\nMust be a strong public speaker, comfortable in front of large, senior-level groups, and a solid writer\nExcellent people and management skills to interact with staff, colleagues, cross-functional teams, and third parties\nUnderstand and resolve complex technical, strategic, and business issues\nStrong analytical and project management capabilities\nFluent in English and Hebrew – verbal and written\nPrevious experience in the Cloud ecosystem – a significant advantage\n\nAs an employer we provide our employees with ambitious challenges, exceptional and thoughtful colleagues, and a competitive compensation and benefits package.\nWe strive to find the most talented, enthusiastic, self-driven individuals to achieve our common goals together in a fast-paced collaborative environment.\nLooking for a new challenge? Join us now!Report"}, {"company": "Investing.com", "job": "Product Marketing Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=126&ao=1136043&s=58&guid=00000186e6357e808825b08639dff975&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_0e7524ce&cb=1678899717406&jobListingId=1008452133841&jrtk=3-1-1grj3h90ukf20801-1grj3avmhi9he800-82b132d1e06c0955-", "description": "Investing.com, the leading global financial news & data platform, is on the lookout for a talented Product Marketing Manager with a proven track record of excellence & creative thinking to join our marketing team and serve as a focal point between Investing’s Product and Marketing teams.What you’ll be doing:Collaborate and become the liaison for product managers to fuel decision-making with marketing understanding and insightsBuild the marketing story and go-to marketing plan of product launches, aligning key stakeholders and cross-functional teamsInitiate adoption and retention initiatives with different stakeholders (CRM, ASO, UA, Social, Content) to hit KPIs that achieve overall successAnalyze user needs and behavior, identify market opportunities and turn insights into action items – from product requirements to concepts and marketing initiativesLead ad-hoc product campaigns and optimize product and marketing funnelsWhat you’ll bring:2+ years of product marketing experienceHigh-level understanding of the mobile apps world, especially in the B2C fieldBackground in digital content, communications, or PR (Advantage)Analytical and quantitative / statistics skills to support data-driven decision-makingProject management, exceptional communication, and presentation skillsSelf-driven, problem-solver, motivated with strong interpersonal skillsAbility to work well in a team environmentB.A/B.Sc in communication, marketing, business management, or economics from a leading universitiesEnglish level – ProficientWho we are:Investing.com was founded in 2007 and now has over 350 employees worldwide.With 60 million monthly unique visitors, 4 billion page views, over 500 million sessions, and over 300,000 financial instruments covered, Investing.com is one of the top two global financial websites. Investing.com offers unlimited access to cutting-edge financial market tools such as real-time quotes and charts, customized portfolios, personal live alerts, calendars, calculators, and financial insights, free of charge. In addition to the global stock markets, Investing.com also covers world indices, ETFs, commodities, bonds & interest rates, cryptocurrencies, futures, and options“. Investing.com strives to be a one-stop-shop for traders and investors with apps available.What we offer:The chance to join one of the leading financial markets platforms in the worldChallenging assignments in a global environmentHigh-energy working environmentExcellent benefitsAs with all Investing.com positions, we’re looking for someone who is self-motivated and meticulous, with a creative and resourceful mind, bright and proactive, and that works well independently and as part of a team.As part of our Privacy Policy, your resume and information will be kept confidential.Job Type: Full-timeShow more Report"}, {"company": "InspHire", "job": "Head of Product", "city": "Herzliya", "date": "6d", "rating": "5.0", "link": "", "description": "An International B2C company is looking for a brilliant Product Guru to join its management team, someone with marketing and UX experience and with a technical background to manage and lead the company's product department.\n\nThe Head of Product and the product team will be responsible for various plans and activities, from ideation through execution to post analysis, utilizing the available channels and initiating new ones, and monitoring and optimizing our customer performance.\n\nResponsibilities:\n\nOwn web/mobile product features roadmaps from end to end.\nCollect and analyze requirements, write clear and detailed MRDs, PRDs, UI/XU & flow, wireframes, define AB test and user stories, prioritize backlog and handle development/engineering.\nManage a team of 4 product owners remotely.\nAnalyze the success of the feature once it's released to production, responsible for the usage data and patterns, and run tests to optimize & improve performance and business results\nWork closely with all relevant cross-functional teams (R&D, Marketing, Content, SEO, Design, BI/BA, etc.) to guarantee smooth, efficient implementation\nFind opportunities for key initiatives to improve the customer experience.\nManage ongoing maintenance and improvement of product features\n\nRequirements:\n\nAt least 5 years of experience as a Product Manager or Product marketing in the ecommerce field or B2C Industry.\nManagerial experience - manage a team of 4 product owners.\nDeep understanding of the customer journey and marketing (UI/UX)\nStrong analytical skills, highly capable of interpreting data, performing qualitative research, and translating results into actionable key takeaways\nFamiliarity with data system concepts, databases, BI, Usability tests and market research.\nExperience in working with multiple internal partners, including product, design, content, operation, customer support.\nTechnical Skills: ability to talk with R&D on technical language, understand SDLC / possible technical possibilities and limitations, experience with multi-project integrations.\nExperience with AB testing\nGoal-oriented, highly motivated, takes full ownership of projects.\nMover & shaker, who adapts well to a dynamic and rapidly changing environment\nStrong organizational and analytical skills, high attention to details\nGreat communicator who is able to clearly convey messages in written and oral form (in English)\nDeep understanding of the digital marketing and performance marketing terms.\nRussian language - is an advantage.\nAbility to partner with cross-functional disciplines and to influence effectively\nA problem solver – highly inventive thinker that will provide insightful, innovative solutions to any problem\nProject management abilities and passion for digital products.\n\nIf you feel the above describes you perfectly- Apply now!Show more Report"}, {"company": "Nayax", "job": "Product Marketing Manager", "city": "Herzliya", "date": "30d+", "rating": "4.1", "link": "", "description": "Nayax is looking for an experienced Product Marketing Manager to join our successful marketing team. The Product Marketing Manager’s responsibilities include leading the development and execution of product marketing plans, providing ad-hoc support to account teams throughout the sales lifecycle for all marketing-related elements, as well as continuously planning, building, and executing marketing collateral, customer-facing activities, enablement plans, and sales tools.\nThe Product Marketing Manager will be part of the Product Marketing team and will report to the Senior Product Marketing Manager.\nIN THIS POSITION YOU WILL:\nConduct market research to understand our consumers’ preferences then target and segment our customers effectively based on this research.\nCreate marketing collateral that will enable the sales team, and educate them through relevant materials (such as value proposition, SWOT, objection handling, battle cards and more.)\n Oversee product launches, feature releases, and product positioning.\nRequirements:\n\nWE ARE LOOKING FOR SOMEONE WITH:\nBachelor's degree or equivalent experience in a related area\n2+ years' of product marketing experience\nStrong verbal, written, and presentation skills\nUnderstanding of payments / Fintech domains and ecosystem – strong advantage\nAble to research and understand strategies to implement with sales and in the field\nContent writing experience – strong advantage\nFluent English – written and spoken\nGood Hebrew level\nADVANTAGES:\nUnderstanding of payments / Fintech domains and ecosystem\nContent writing experience\nWhy You Will Love This Job\nYou will have a leading role in defining marketing strategy and content creation for the industry’s most advanced solutions and practices\nYou will use state-of-the-art marketing tools and practices\nYou will have the opportunity to work in a multinational environment for the global market leader in its field\nYou will have a central and noticeable role in the company with frequent presentations, webinars, and discussions with stakeholders\nWho we are:\n\nNayax is a leading global end-to-end retail technology platform for unattended & attended commerce. Our mission is to simplify commerce and payments for retailers while driving growth, optimizing operations, and enhancing consumer engagement.\nNayax Israel is located in the prestigious Herzliya Hills, just a short drive north of Tel Aviv or a very short walk from the train station.\nOur open space offices accommodate our 400+ employees and when we’re not hard at work, you can find us enjoying an afternoon coffee on the balcony. We’re the largest Nayax site, housing over 20 different departments.\nFor a glimpse of what it's like to work at Nayax, check out our Instagram account! https://bit.ly/3G3QDc4.\nCheck out Nayax's page under \"Best Cool Israeli Companies 2022\" by Secret Tel-Aviv: https://bit.ly/3LqzElA.\nNayax is constantly growing and we are always on the lookout for enthusiastic, innovative and eager individuals to join us in our growth!Show more Report"}, {"company": "Artlist", "job": "Product Marketing Manager", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.7", "link": "", "description": "Artlist is a creative technology company providing video creators with high-quality music, sound effects, footage and digital assets for video, as well as powerful video and image editing software. With our revolutionary license and cutting-edge creative tools, we’re on the fast track to becoming the ultimate 360 degree solution for video creators.\nToday, Artlist is the go-to licensing provider for creators in over 160 countries. Among our 16M clients are Google, Apple, Nike, Coca-Cola, Ikea, Mercedes, Samsung, Wix, Netflix, Dior and more.\nArtlist consists of:\nArtlist.io, a royalty-free musicSFX, stock footage and creative asset platform\nMotionArray.com, an all-in-one marketplace for creators that offers video templates, presets, music, SFX, stock footage, motion graphics and stock photos\nFXhome, a cutting-edge video, VFX and image editing software\nWe are looking for an experienced and motivated Product Marketing Manager.\nIn this role, you will be responsible for developing and executing marketing strategies and go-to-market plans of our new features and products. You will work closely with the product development team to understand the features and benefits of our products and will be responsible for positioning them in the market. You will also collaborate with various teams to optimize and improve user journey and to drive product launches\nWake up to this:\nAnalyze, package and optimize user journey from first exposure and into life cycle while constantly suggesting ways to improve KPIs.\nDevelop go-to-market plans for new and existing products and features.\nLead cross-functional execution and planning to support product launches and scaled adoption efforts.\nCollaborate with the product team to understand the features and benefits of our products and to develop messaging and positioning.\nResearch and understand the competitive landscape, target audience and personas to correctly position the offering in the context of our USPs.\nAnalyze product performance and customer feedback using A/B testing, interviews and other tools to inform product roadmap and marketing efforts.\nCommunicate the vision and value of Artist Business and develop the messaging and marketing tools that facilitate the process.\nCollaborate with various teams, including content marketing, design, UA, data and sales to drive product awareness and adoption.\nRequirements:\n\n3+ years of experience as a Product Marketing Manager or similar experience in Saas /B2C companies.\nDemonstrated experience developing and executing go-to-market plans.\nExperience with project management and the ability to juggle multiple projects at once.\nStrong analytical skills and ability to use data to inform decisions.\nFamiliarity with data system concepts, databases, BI, A/B testing and market research.\nExcellent communication and presentation skills.\nExperience in working with internal interfaces: marketing, product, design, customer service and sales.Show more Report"}, {"company": "Seperia", "job": "Head of Product Marketing", "city": "Herzliya", "date": "15d", "rating": "4.5", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=130&ao=1136043&s=58&guid=00000186e6357e808825b08639dff975&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_5c6b36b3&cb=1678899721567&jobListingId=1008496371526&jrtk=3-1-1grj3hd8njiih801-1grj3avmhi9he800-cd29d8ed85917c91-", "description": "Who We Are:\n\nSeperia builds and operates global fintech review sites. From 2003, we have been driving millions of sales to our partners (advertisers). We do it by focusing on value added content, wrapped within an engaging web product and matched with high-intent traffic.\n\nWe’re looking for an ambitious and talented Head of Product Marketing to join the team.\n\nWhat You Will Do:\n\nLeading a small team of Project Managers, including (but not limited to): hiring, training and responsibility for personal development.\nDrive the execution of our products (review sites) through their entire lifecycle: market research, competitive analysis, planning, positioning, roadmap development and ongoing product optimization.\nManage communication with international brands, evaluate their performance metrics, and drive product monetization.\nAnalyze users’ needs, web page performance, market trends and partnerships from an ROI perspective.\nEstablish project management processes, data-driven & measurability as a culture in your team.\nWork closely with external development teams to track progress and ensure timely and high-quality deliverables.\nWork closely with marketing teams, design and finance.\n\nWhat You Need:\n\nGreat written & verbal communication skills (Hebrew & English) – must.\nAn independent and performance-oriented attitude with the ability to drive people and processes.\n2+ years of experience in web product management, marketing project management or global website management – must.\nManagerial experience – must.\nWeb-savvy individual.\nTechnical capabilities & experience working with developers.\n\nExtra beneficial skills:\n\nExperience in managing websites via WordPress.\nKnowledge in online advertising.\n\nWhat We Offer:\n\nHuge potential for growth. Our company is growing and we’re looking for someone who can grow with us.\nFreedom – we care less about formalities, and more about results. With a dynamic, informal environment, we keep excellence, innovation, and results at the forefront.\nUpside – as a performance product company, we develop global-level, scalable marketing assets with no glass ceiling. You can enjoy a growing upside.Show more Report"}]