[{"company": "Sedgwick", "job": "Data Scientist (REMOTE)", "city": "Israel", "date": "14d", "rating": "3.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=101&ao=1136043&s=58&guid=00000186e630855e9c8211108675b120&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_94947b04&cb=1678899378993&jobListingId=1008498409875&jrtk=3-1-1grj36un8irm9801-1grj311e3pkjk800-50348caaaeca9326-", "description": "Taking care of people is at the heart of everything we do, and we start by taking care of you, our valued colleague. A career at Sedgwick means experiencing our culture of caring. It means having flexibility and time for all the things that are important to you. It’s an opportunity to do something meaningful, each and every day. It’s having support for your mental, physical, financial and professional needs. It means sharpening your skills and growing your career. And it means working in an environment that celebrates diversity and is fair and inclusive.\nA career at Sedgwick is where passion meets purpose to make a positive impact on the world through the people and organizations we serve. If you are someone who is driven to make a difference, who enjoys a challenge and above all, if you’re someone who cares, there’s a place for you here. Join us and contribute to Sedgwick being a great place to work.\nGreat Place to Work®\nMost Loved Workplace®\nForbes Best-in-State Employer\nData Scientist (REMOTE)\nEssential Responsibilities May Include\nExecute data science projects as identified by Sr Data Scientists, leadership, and stakeholders\nHelp to build, prototype, and deploy machine learning models in sandbox and production environments\nProduce reports to communicate metrics and outcomes of stakeholder interest\nAssist with developing and maintaining end-to-end ETL data pipelines\nWork to explore new internal data sources and their utility within projects\nCommunicate modeling challenges, findings, and outcomes to stakeholders\nQualifications\nBachelor's or advanced degree preferred\nMinimum one year of predictive modeling, data science, and analysis experience with solid background in the using data visualization tools and libraries and data exploration, data wrangling, and feature engineering\nExperience writing Python or R code, and notebook environments\nKnowledge of writing code in Python or R, and notebook environments\nKnowledge of common unsupervised/supervised ML techniques\nTaking Care of You\nCareer development and promotional growth opportunities\nA diverse and comprehensive benefits offering including medical, dental vision, 401k, PTO and more\n#datascience\n#datascientist\nSedgwick is an Equal Opportunity Employer and a Drug-Free Workplace.\nIf you're excited about this role but your experience doesn't align perfectly with every qualification in the job description, consider applying for it anyway! Sedgwick is building a diverse, equitable, and inclusive workplace and recognizes that each person possesses a unique combination of skills, knowledge, and experience. You may be just the right candidate for this or other roles.\nSedgwick is an Equal Opportunity Employer and a Drug-Free Workplace.\nIf you're excited about this role but your experience doesn't align perfectly with every qualification in the job description, consider applying for it anyway! Sedgwick is building a diverse, equitable, and inclusive workplace and recognizes that each person possesses a unique combination of skills, knowledge, and experience. You may be just the right candidate for this or other roles.Show more Report"}, {"company": "Merck KGaA Darmstadt Germany", "job": "Production Scientist", "city": "Rehovot", "date": "8d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=1136043&s=58&guid=00000186e630855e9c8211108675b120&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_5e785521&cb=1678899380079&jobListingId=1008512379749&jrtk=3-1-1grj36vo2klu1801-1grj311e3pkjk800-063f1b285ea24846-", "description": "Work Your Magic with us!\n\n\nReady to explore, break barriers, and discover more? We know you've got big plans - so do we! Our colleagues across the globe love innovating with science and technology to enrich people's lives with our solutions in Healthcare, Life Science, and Electronics. Together, we dream big and are passionate about caring for our rich mix of people, customers, patients, and planet. That's why we are always looking for curious minds that see themselves imagining the unimaginable with us.\n\n\nA career at our company is an ongoing journey of discovery: our 60,300 people are shaping how the world lives, works and plays through next generation advancements in Healthcare, Life Science and Electronics. For more than 350 years and across the world we have passionately pursued our curiosity to find novel and vibrant ways of enhancing the lives of others.\n\n\nUnited As One for Patients, our purpose in Healthcare is to help create, improve and prolong lives. We develop medicines, intelligent devices and innovative technologies in therapeutic areas such as Oncology, Neurology and Fertility. Our teams work together across 6 continents with passion and relentless curiosity in order to help patients at every stage of life. Joining our Healthcare team is becoming part of a diverse, inclusive and flexible working culture, presenting great opportunities for personal development and career advancement across the globe.\n\n\nAUTHORITY\n\n\nManufacturing of synthetic peptides according to the production PMPs, in accordance with compliance and QA requirements.\nPMPs updating.\nOrder raw materials for the manufacturing process up to 1000 NIS.\nOperating production and analytic equipment.\nUse of corporate electronic data systems.\nIn-process control tests of manufactured products.\nWorking with SAP.\nQUALIFICATIONS\n\n\nEDUCATION/LANGUAGES\n\nPractical engineer certificate - Engineer BSc in Biotechnology / Chemistry at a minimum, preferably with MSc in science (optional with adequate experience) .\nBSc in chemistry at a minimum, preferably MSc in Chemistry or degree in natural sciences (optional with adequate experience\nFluent in English and Hebrew\nPROFESSIONAL SKILLS & EXPERIENCE\n\n\nSome experience of working in a similar environment (manufacturing &/or laboratory)\nExperience in laboratory work in peptide synthesis - advantage\nExperience in HPLC - advantage\nExperience in MS - advantage\nPERSONAL SKILLS & COMPETENCIES\n\n\nAction-orientated.\nOrganized.\nHonesty and integrity.\nAccuracy.\nSpecializing in Chemistry\nManual dexterity required to handle materials and operate machinery.\nCapable of independent, timely decision-making and problem-solving.\nTechnical, process orientation.\nTechnical skills with devices.\nComputer and controlled equipment literate.\nWorking with SAP.\nEffective oral and written communication skills in English and Hebrew\nWhat we offer: We are curious minds that come from a broad range of backgrounds, perspectives, and life experiences.\nWe celebrate all dimensions of diversity. Applications from individuals are encouraged regardless of age, disability, sex, gender reassignment, sexual orientation, pregnancy and maternity, race, religion or belief and marriage and civil partnerships. We believe that it drives excellence, innovation, and human progress. We care about our customers, patients, and our rich mix of people. This diversity strengthens our ability to lead in science and technology.\nWe are committed to creating access and opportunities for all and empower you to fulfil your ambitions. Our diverse businesses offer various career moves to seek new horizons.\nJoin us in building a culture of inclusion and belonging that impacts millions and empowers everyone to bring their curiosity to life!\n\n\nWhat we offer: We are curious minds that come from a broad range of backgrounds, perspectives, and life experiences. We celebrate all dimensions of diversity and believe that it drives excellence and innovation, strengthening our ability to lead in science and technology. We are committed to creating access and opportunities for all to develop and grow at your own pace. Join us in building a culture of inclusion and belonging that impacts millions and empowers everyone to work their magic and champion human progress!\n\nApply now and become a part of our diverse team!Show more Report"}, {"company": "Natural Intelligence", "job": "Data Scientist", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "", "description": "Founded in 2009 and 100% self-funded to this day, Natural Intelligence is a leader in online multi-vertical marketplaces. Our global brands, Top10.com and BestMoney.com, help millions worldwide make informed decisions every day. Our proprietary platform, xMatch, harnesses AI and ML technologies in order to help consumers make easier choices and find the right products and services tailored to their needs.\nWe are looking for a top-notch Data Scientist to lead the design and implementation of the machine learning models and pipelines in Natural Intelligence’s experimentation and personalization platforms, using cutting-edge technology and tools.\nResponsibilities\nEnd-to-end ownership, from design to deployment, on models and components of our experimental and personalization systems.\nDevelop models that help us understand and describe our customers – e.g. learning how to extract deep interests and tendencies from event streams.\nDevelop production code for both batch and real-time models in collaboration with our data and service engineering teams.\nRequirements:\n\nBSc / MSc in a quantitative field (math, statistics, computer science. etc.)\n3+ years of experience in a role developing predictive or explanatory models or experimentation processes with real-world data\nDeep statistical & mathematical knowledge (regression, linear algebra, properties of distributions, etc.) and the ability to understand, utilize and innovate on state-of-the art machine learning algorithms and statistical modeling\nStrong background in Python with experience in Data & ML packages and OOP\nExperience writing SQL queries\nDeveloping production systems - an advantage\nExperience with AWS ecosystems - an advantageOnly suitable CVs will be considered.Report"}, {"company": "AMBITION", "job": "Data Scientist לסטארט אפ בתל אביב", "city": "Israel", "date": "7d", "rating": "3.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=104&ao=1110586&s=58&guid=00000186e630855e9c8211108675b120&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_3c831e2e&cb=1678899382559&jobListingId=1008516836499&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj3726incfu801-1grj311e3pkjk800-30205a6acda32f63--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNCE_dxy7VFKIodvoo05NGu4C0ApSQpxvIrtz555RDdLpEA2LYjfZSR3g4x1uo4HhLCGky0JM3SjHToO5BmLceateAkS_sKGJRXDXX-aoOgSQCdKbbVuh1Yipdh5RYbcSqZkt2a9jOGmIdCuJJBWmY6wMpGRJDkElVTNkM5QqNozis06xs1nu570wEBCUrah8g2g3Qh6STaWhN90SKrIdw0ugVsHPKTxF58vKBRSpsLxO40AdxPufsgCMi0PKVWxQU4s13csHdY1j-cv5FmVzKfa1Pg00VHllmpR8VzBtDPN7uAw1qob3VcbkTrK452Zr6XHmSMPz1T0bPdMaR7UNk6pP7LaTbyOfmV9-cI4qsJUznWrAIywty5hJKBuZglqmgH3ziDIc0NyyxQ39J40Rg8slJyy52nSqu_bzUFe1cANGCR1dXks4O9W-j1_OcJD2r4-un4Tw_6IKC-u7nGKgQRp-lgGODYI7rsNmCEr9kDplD7lpbCfTemhSJvBwFC55U9Yjdvrs19gaz6XdpP8DrZwBmwoe1pnGW5L086kmhw1sVqHcDMVQLXhA3ea7pFGUZbjfpmWNBzW5yQA2tfjk0FZ6c3UwqXaVhQjsC1DtyiF8SR-CvSxeEAOxh2m5wHLTY28Z4XrGMq5GG82mHkemQ5ZQLua4R2zysY%3D", "description": "Data Scientist לסטארט אפ בתל אביב Data Scientist לסטארט אפ בתל אביב M.Sc. in Computer Science, Statistics, Applied Mathematics, Electrical Engineering or related field. Publications at top tier machine learning conferences or medical journals. 3+ years of hands-on experience building machine learning solutions to real world problems.\n\nStrong theoretical and technical experience from research to production. Strong research capabilities, problem solving and critical thinking skills. Ability to communicate clearly scientific data to different stakeholders. 3+ experience with Python and the Data science stack (Pandas, NumPy, Visualizations packages, Keras, etc.).\n\nExperience with data engineering and orchestration tools (e.g. Argo, Kubernetes, etc.) - Advantage. Experience with medical datasets is an advantage - (e.g. EMR, Administrative).Show more Report"}, {"company": "Emendo", "job": "Scientist - ( mRNA) Biomolecules development and production", "city": "Rehovot", "date": "30d+", "rating": "2.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=1136043&s=58&guid=00000186e630855e9c8211108675b120&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_6465c74b&cb=1678899383792&jobListingId=1008425731471&jrtk=3-1-1grj373cfkbl9801-1grj311e3pkjk800-f6aecc84edb8f919-", "description": "Location:Rehovot, 1 Holtzman St. Science Park, Israel\nAbout the Position:\nEmendoBio seeks a motivated individual to join our Biomolecules development and production department. At Emendo Bio, we develop a transformative gene editing technology to cure severe genetic diseases. If you seek a meaningful job working with great colleagues using cutting-edge science – this may be your opportunity. The exciting and fast-paced environment offers the opportunity to work at the cutting edge of cellular engineering research.\n\n\nDescription:\n\nInvolved in forming a new team.\nResponsible for overseeing activities within a team.\nPlanning research workflow and monitoring progress toward goals.\nPlay a key role in the process development of novel projects.\nIndependently design, execute and analyze experiments.\nKeeping track of and structuring various tasks and documents.\nWrite protocol and SOPs.\nRead scientific literature relevant to the project.\nAdhere to Lab Notebook guidelines regarding accurate documentation of protocols.\n\n\nRequirements:\n\nPh.D. Years of industry experience in molecular biology, biochemistry, or a closely related field.\nExperienced in IVT mRNA translation and purification.\nHands-on experience in FPLC purification methods.\nExperience in HPLC-based analytic methods.\nExperience in biochemical assay development.\nFamiliarity with the Design of Experiment (DoE) methods (advantage).\nAble to work independently and as part of a team.\nStrong communication, problem-solving, organizational, and delegation skills\nScientific English speaking/writing capabilities.\nComputer proficiency.Report"}, {"company": "Brainstorm Cell Therapeutics", "job": "R&D Scientist", "city": "Israel", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=106&ao=1136043&s=58&guid=00000186e630855e9c8211108675b120&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_580e13a4&cb=1678899385131&jobListingId=1008017600091&jrtk=3-1-1grj374m9kblo801-1grj311e3pkjk800-56fd84c27b9600e4-", "description": "Mid-Level | Full-time position | Petach Tikva, Israel\n\nTo apply: email CV to Hkaspi@brainstorm-cell.com. Please state position + applicant’s name in subject line.\n\nBrainStorm’s R&D team consists of a fantastic group of scientists working together to bring new stem cell and exosome -based therapies to the clinic to improve patients’ wellbeing. If you are a passionate scientist looking to make a positive impact on patient health- this is an opportunity to join our team!\n\nJob Description:\n\nIn this role, reporting to BrainStorm’s Preclinical Research Manager, the R&D scientist is expected to demonstrate diligence, flexibility and creative scientific and analytical breadth, to be capable of independent work and to have excellent time-management skills.\nA can-do attitude and collaborative disposition is a must, and an ability to communicate in a clear and professional manner.\n\nMain tasks will include:\n\nResearch – plan, execute and analyze experiments and lab processes, both independently and with team members, according to the department’s research plan and milestones\nProject management– manage outsourced projects and prepare reports\nScientific guidance– consult on ongoing projects, research literature and databases\nScientific writing– prepare presentations, publications and SOPs as needed\n\nQualifications:\n\nMust have:\n\nExpert scientific background- PhD or Post-doc (nanoparticles/cell therapy/RNA therapeutics/peptides/drug delivery systems/neuroimmunology)\nStrong interpersonal skills, an enthusiastic team player\nPlenty of scientific curiosity, capable of independent work\nA quick learner with a proactive approach\nStrong oral and written communication skills\nWillingness to occasionally travel abroad\nExtracellular vesicle engineering experience, targeted nanoparticle experience and cargo linking experience are specifically desirable\n\nOptional:\n\nExperience in production of animal cell culture derived products (e.g. extracellular vesicles, viruses or antibodies)- a plus\nExperience in GMP-compliant cell manufacturing in bioreactors, and bioprocessing (TFF)- a plus\nExperience across multiple scientific fields and technologies- a plus\nPrevious experience in the biotech industry- a plus\nScouting experience- a plus\nExperience with AI-based scientific tools and databases- a plusShow more Report"}, {"company": "Deloitte", "job": "Data Scientist", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=107&ao=1136043&s=58&guid=00000186e630855e9c8211108675b120&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a5510eef&cb=1678899386266&jobListingId=1008356253392&jrtk=3-1-1grj375qbk630801-1grj311e3pkjk800-a04eb282896055d3-", "description": "Description\n\nDeloitte Analytics is part of Deloitte Israel consulting practice, and we are seeking a highly motivated and skilled data scientist with experience in finance and natural language processing (NLP).\n\nHow your day will look like:\n\nYou will take an integral part in our local and global projects and a wide range of industries and organizations across the globe\nYou will Collect and analyze large datasets from various sources and develop predictive models using machine learning algorithms\nWorking with predictive and probabilistic models, clustering algorithms, classification models, timeseries modeling, search and recommendation techniques.\nApply NLP techniques to extract relevant information from textual data and build sentiment analysis models.\nProduction implementation of translating product/business requirements into a technical solution.\nRequirements\nMaster's in Computer Science or another relevant field such as Computer Science, Statistics, Applied Mathematics, or Economics.\n1-3 years of experience in data science, preferably in the finance industry\nUnderstanding of NLP techniques for text representation, semantic extraction techniques, data structures and modeling.\nStrong knowledge of Python, and version sharing (GIT)\nWorking knowledge of SQL family language\nFluent English\nSpark, Big data and research experience -an advantage\nExperience applying reinforcement learning modeling, GAN – an advantage\nMongoDB/AWS/Elasticsearch experience – an advantage\n\nFull time Job﻿\n\nLocation: Tel Aviv, Hybrid\nWe at Deloitte believe that diversity and inclusion among our people is a critical component of our success and that is why we cultivate an organizational culture that contains and embraces diversity in all its forms.Show more Report"}, {"company": "Glassbox Ltd.", "job": "Data Scientist", "city": "Petah Tikva", "date": "23d", "rating": "4.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=108&ao=1136043&s=58&guid=00000186e630855e9c8211108675b120&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b54fdd3a&cb=1678899387329&jobListingId=1008481207360&jrtk=3-1-1grj376r5m6q0801-1grj311e3pkjk800-328e598a8540abf7-", "description": "Glassbox is looking for a Data Scientist to join our ML & Data team\n\nWe are Glassbox, the world's leader in digital experience intelligence (DXI), and on a mission to deliver frictionless digital journeys to leading brands and their customers all over the world.\n\nWe are a hyper-growth scale-up company that continues to grow quarter-on-quarter and our customers love us - named a 2022 leader in nine G2 categories based on customer reviews!\n\nSo, now is the perfect time to come to Glassbox and help us accelerate our global leadership position!\n\nWill you join us on this journey?\n\n\nAs an Experienced Data Scientist in our ML team, you will surely get excited with the opportunity of handling exceptional volumes of customer data (hundreds of billions of monthly events!) and help us facilitate cutting-edge Machine Learning technologies at large scale for some of the largest organizations in the world.\n\nYou will work closely with several teams within Glassbox - Product team, Data Engineering, as well as several R&D teams and take a pivotal role in defining our next generation ML platform infrastructure and roadmap.\n\n\nWhat You Will Do\n\nResearch, develop, and maintain ML models, from ideation to productization\nUnderstand Business/Customer/Product requirements and translate them into elegant/flexible capabilities and solutions\nBe a part of a full-cycle Data Science team, participating in Design and Architecture discussions of complex large scale systems\nContribute to the team effort of driving the organization to a more data-oriented approach and philosophy\nClosely collaborate with Data and ML Engineers in order to drive the execution and delivery of features and models, adapting data pipelines and ML models packaging as micro-services\nHands-on development of custom data models and algorithms to apply to data sets using predictive modeling to optimize customer experiences and other business outcomes\nContribute in building the research best-practices in Glassbox and push towards thought leadership for ML in the CX domain\n\nWhat You Will Need\n\nExceptional at planning, setting expectations, defining goals and meeting commitments\nMaster degree (or equivalent) in Computer Science or related research-oriented field\n5+ years of proven experience as a Data Scientist\nProven experience in leading solutions from proof of concept, rigorous design and implementation through to production of highly scalable, enterprise-class solutions\nExtensive hands-on and theoretical background in data mining, advanced statistical analysis and machine learning practices and techniques (clustering, decision tree learning, NN, etc) and their real-world advantages/drawbacks - Experience with times series a big plus\nExpert implementation skills in Python, SQL, and popular machine learning frameworks (scikit-learn, TensorFlow, keras, etc)\nIndependent self-starter and team player with excellent communication and interpersonal skills\nDegree or equivalent experience in a quantitative field (Computer Science, Statistics, Mathematics, Engineering, etc.)\nExcellent / Fluent written and spoken English\n\nAdvantage\n\nBig Advantage - Prior experience and understanding of digital customer experience (CX) or similar business domain\nThrives and enjoys working in startups and fast paced environmentReport"}, {"company": "Apiiro", "job": "Data Scientist", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.9", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=109&ao=1136043&s=58&guid=00000186e630855e9c8211108675b120&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d5698079&cb=1678899388454&jobListingId=1008331027568&jrtk=3-1-1grj377u0kf1s801-1grj311e3pkjk800-97f7babb3e1b860c-", "description": "Data Scientist\n\nWhat We're About\n\nWe're an experienced and diverse team focused on solving one of the biggest challenges CIOs and CISOs have - allowing development teams to move fast without compromising on security controls and risk management. we're looking for strong and fun people to join us and take a significant part in shaping our technology, product, and culture.\n\nWhat You're About\n\nYou have at least five years of experience as a data scientist and proficiency in machine learning. You have a solid software engineering background and hands-on experience (writing code for production).\n\nYou have a Ph.D./M.Sc. in math, physics, engineering, computer science, or an equivalent science degree.\n\nPreferably, you have experience in NLP, or with the cybersecurity industry, startups environment and you have led a team of data scientists, and built data infrastructure.\n\nYou are experienced with solving complex data science problems from ideation to production and writing code in Python using Python data-science frameworks. You are well experienced with multiple programming languages as C#, java, node.js, as well as with cloud tools and cloud ML platforms.\n\nWhat You Will Do\n\nYou will be a part of a strong ML/AI team, work on end-to-end ML projects from data extraction through model validation to model deployment.\n\nYou will engage in translating business and product requirements, goals, and challenges as well as customers' feedback into data-pipelines and model framework.\n\nResearch, design, develop, test, and deploy models and systems by applying data-driven Machine Learning and AI solutions, from conceptual analysis to production - are all part of your role.\n\nYou will extract various types of data from external data sources to identify interesting and relevant features patterns. You will be required to utilize data mining techniques, perform statistical analysis, and build prediction models accordingly.\n\nYou will be presenting insights to customers, business, and engineering teams, while working closely with apiiro's team on data cycle-related processes - extraction, labeling, verification, and integrations.Report"}, {"company": "Triple Whale", "job": "Data Scientist", "city": "Israel", "date": "23d", "rating": "4.9", "link": "", "description": "What Do We Do?\nTriple Whale centralizes and simplifies all the metrics used by Shopify sellers, enabling them to save more time and make more money. We help e-commerce businesses accurately track and forecast all kinds of metrics, including changes in profits and operational metrics. Our goal is to infuse AI into e-commerce, empowering shops to have an accurate picture of their business and make optimal choices that boost their bottom line. Launched in mid-2021, Triple Whale already has over 6,000 clients, top-tier investors, and growing hubs in Columbus, Austin, North Carolina, and Israel (Jerusalem and Herzliya).\nAbout the Role\nThe AI department is focused on bringing value to our customers through the development of algorithms and analytical solutions. As a data scientist in the department, you will be a valuable member of an innovative and technical data science team working on various problems. The department uses a wide variety of advanced techniques and algorithms to provide maximum value from data in all shapes and sizes (such as classification models, NLQ, anomaly detection, image generation, time series, and more).\nThe team uses versatile methods and state of the art tools to deliver the most accurate insight and optimal decisions to our customers. We are responsible for the design, research and development of these tools, hence part of our work includes writing and deploying production code.\nThis role is hybrid, with 3 days a week in-office (Jerusalem or Herzliya).\nWhat You'll Be DoingUnderstand and explore the e-commerce domain, research, build and deliver sound insights, recommendation and automation solutions.Collaborate with fellow team members on exciting and challenging projects.Use state of the art tools to achieve high and robust performance.Research, develop and maintain our AI repositories with quality algorithms by writing maintainable, performant code.Implement the MLOps philosophy in everything you do.Collaborate with Product Managers, Dev and Data Engineers to provide great impact at scale while expediting model life-cycle.Constantly search for data driven value propositions for our clients.Constantly improve our model’s quality, and performance.Desire to continually keep up with advancements in data science practices.\nQualifications2+ years experience as a data scientist, applied researcher or similar in the industryM.Sc/Ph.D in exact sciencesExperience in Machine Learning techniques, Time Series, NLP, Optimization, DNN, Recommendation Systems, Bayesian Optimization, and Data Science best practices.Deep theoretical knowledge in ML algorithms related to the relevant disciplines,Ability to write clean and concise code, ideally in Python, with the ability of writing production level code and the experience of deploying it.Excellent communication skills with the ability to clearly explain complex concepts to business stakeholders and the ability to work closely within a team.Creative thinker with a proven ability to innovate through data exploration and application of complex and multi-discipline solutions.Curiosity, high level of self learning capabilities.Experience using CI/CD tools - mandatory.Experience using Cloud (preferably GCP) and Distributed frameworks, e.g. Spark/Kubernetes - Advantage.\nOur Values\nWe Are Customer Obsessed: From our mission to every detailed project, everything we do is designed to create a positive impact for our customers.\nWe Move (Very!) Quickly: The speed at which we work, iterate, and deliver value is our most competitive advantage.\nWe Are Trustworthy: Candor, directness, and honest communication helps us learn, grow and improve so we can win together.\nWe Are Curious: We extend beyond our comfort zone and ask questions that guide us towards new, creative, and bold paths.\nWe Act Like A Mensch: We act with honor, integrity and empathy, and have deep respect for our customers and each other.\nIn the News\nTriple Whale raises $25M for its smart Shopify data platform\nColumbus e-commerce startup Triple Whale aims to triple in size\nBusinessinsider: BusShopify merchants have doubled ad spend on TikTok to reel in customers, as privacy changes make Facebook a ‘complete nightmare’ for customer acquisition.\nTriple Whale Raises $27.7M to Develop Default Ecommerce Operating System for Shopify BrandsShow more Report"}, {"company": "Vesttoo", "job": "Senior Data Scientist", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "", "description": "Who we are:\nWe’re Vesttoo.\nWe connect the insurance industry and the capital markets by combining proprietary AI-powered technology with expertise in data science, insurance and finance so that insurers have the capacity they need and investors have opportunities to diversify with confidence.\n Our digital insurance risk transfer platform, the Vesttoo Marketplace, is where insurers and global investors connect. It is the source of deal flow for many of our investment products, providing transparent, data-driven analytics to all participants.\nBeyond all that, we are a dynamic, fast growing and an exciting start-up, in a diverse and friendly atmosphere, where both our employees and our business are in the center.\nWhat you'll do:\nAs a data scientist at Vesttoo, you'll be responsible for end-to-end algorithm development that creates insurance risk models, Starting from raw data, algorithm design, implementation, and defining requirements for deploying algorithms to production. You will be working with state-of-the-art technologies coupled with Vesttoo’s unique internally developed suite of tools and methodologies.\nWe are looking for accomplished data scientists, both mid-career and senior practitioners, who will be able to contribute immediately and have significant impact as individual contributors and leading projects.\nRequirements:\n\nMust have:\nRelevant graduate degree (at least M.Sc.) from a university\n7+ years of data science experience\nUnderstanding of Bayesian modeling and inference and kernel density estimation\nExperience in Python and relevant scientific packages\nProven ability to design and implement machine learning algorithms\nExperience writing high-quality, testable, and reusable code under a source control environment\nAbility to deep dive into details without losing the big picture\nSelf-starter and can learn new technologies and tools quickly\nAdvantages:\n\nAdvantages:\nPh.D in relevant field\nExperience with the insurance or finance domains\nExperience working with cloud services such as AWS\nExperience writing requirements for deploying algorithms to production\nExperience working in a startup companyShow more Report"}, {"company": "Neura", "job": "Data Scientist Leader", "city": "Herzliya", "date": "30d+", "rating": "4.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=112&ao=1136043&s=58&guid=00000186e630855e9c8211108675b120&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_99a791cf&cb=1678899392172&jobListingId=1007551130278&jrtk=3-1-1grj37bgp2bmk001-1grj311e3pkjk800-92098c0f49f5e761-", "description": "We are looking for a talented data scientist leader which will develop new and innovative behavioral models to enrich Neura’s AI capabilities by using prediction, detection, clustering, supervised and unsupervised and any other type of models and techniques.\nYou'll be expected to:\nMentoring and managing data science team and leading all Neura data science and data analysis capabilities and efforts\nDevelop new and innovative behavioral models to enrich Neura’s AI capabilities by using prediction, detection, clustering, supervised and unsupervised and any other type of models and techniques.\nAnalyze large amounts of data and bring insights to inform our product and improve existing models.\nAd hoc and lean start up modelling and algorithms for new product lines.\nBe responsible for monitoring model performance and accuracy.\nWork closely with our product team and engineers to bring your models to production.\nWorking closely with the business team to understand, define and analyze Neura core product features and their demonstrations to customers.\nBecome familiar with our data collection process and work closely with engineers developing new data sources.\nWe need you to have:\nExperience with:\n\nAt least 4 years of experience in machine learning and data analysis.\nData analysis with large scale datasets.\nMachine learning and modeling.\n- Ad- hoc analysis and troubleshooting skills.\nExcellent in Python: numPy, SciPy, Pandas, matplotlib, scikit-learn.\nManagerial and mentoring experience.\nBonus points if you've already:\n\nHave worked with Spark and/or Scala.\nExperience in Business Intelligence data analysis\nWe need you to be:\nA problem solver with strong interest in new ML methods and technologies.\nA source of innovation, bringing your own ideas to the table.\nSomeone who can work well in a team but can work independently and efficiently without supervision.\nSomeone who takes ownership of their work and cares about real-world outcomes.\nSomeone who feels comfortable in a dynamic start-up environment\nVery good managerial and leaderships skills in data science\nTerms:\nhttps://www.theneura.com/job_candidate_privacy/Report"}, {"company": "TriEye", "job": "photonics researcher", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "", "description": "TriEye is the pioneer of SWIR sensing technology. Based on nanophotonics research,\nTriEye’s technology is disrupting the world of vision sensors for the automotive market along\nwith other exciting applications.\nWe are looking for an exceptional talent to join our Photonics team as a Photonic Scientist,\ninvolved with fundamental aspects of the development of a state-of-the-art solid state laser\nfor Automotive vision systems.\nRequirements:\nHold at least M.Sc. degree in Physics, EE or equivalent (PhD is preferred)Have at least 5 years of experience in solid-state laser research and developmentHave at least 5 years of experience in R&D in the industry, preferably with product\ndevelopment.Regularly use mathematical models for problem solving and validation of\nhypotheses.Fluent in MATLAB/Python or equivalent scientific coding platform and regularly use\nthem in your workNot intimidated by difficult problems, positive attitude towards solving themHumble, respectful, team player, hard-worker.\nYour Day to Day:\nMapping-out material and performance related limitations of the laserReviewing related literature and building some hypotheses through simplified\nphysical modelsPlanning and executing experiments to validate the hypotheses.Offering and testing design improvements to reduce the above limitations.Consulting other team members, helping out with other\nresearch/production/productization activitiesProposing and testing design solutions / new architectures to improve the product in\nterms of performance, manufacturability, cost, size and reliability\nWhy should you be a TriEyoneer?:\n\nTiming is everything! You want to be a part of a fast-growing deep-tech company\nbacked by industry leaders, as it enters a significant stage of global growth.Inspiring skill development by providing growth opportunitiesInterest in supporting TriEye’s mission to improve and save lives by making Short-\nWave Infrared (SWIR) technology accessible to everyone. Harnessing the power of\nSWIR sensing to provide superior vision, enables access to mission-critical image\ndata even in the most challenging visibility conditions. This is a unique opportunity to\ntake an active part in building a world’s first technology.\nBenefits:\nFree Gym MembershipParkingHolidays and Birthday giftsCibusGenerous vacation allowanceHappy hours and team events\nGeneral statement:\n\nTriEye is an equal opportunity employer. Qualified applicants will receive consideration for\nemployment without regard to race, color, religion, sex, sexual orientation, gender identity, national\norigin, disability, or protected veteran statusShow more Report"}, {"company": "Fiverr", "job": "Data Scientist", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.3", "link": "", "description": "We are looking for an experienced Data Scientist who can leverage and develop innovative machine learning, NLP, and AI technologies, for solving problems within a wide scope.\nAs a part of our Data Science group, you will work on highly complicated challenges, from research to production, and help shape our algorithms and ML platform. You will work with Developers, Analysts, Product Managers, and business owners on growth opportunities and new ideas.\nYou should have a strong background and experience in the machine learning pipeline through business understanding, research, data exploration, feature engineering, model building, performance evaluation, testing, production-level code and deployment, model monitoring, and maintenance.\n﻿Our work model is hybrid, combining remote and on-site work. This allows us to get things done when and where we are most productive.\n\nRequirements:\n\nMSc in Computer Science/Engineering or related field with a focus on applied statistics, AI, machine learning, or related fields - a must\n5+ years of production environment experience, working with predictive and probabilistic models, clustering algorithms, classification models, search and recommendation techniques - a must\nProven record for successful production implementation of translating product/business requirements into a technical solution.\nTeam player, Ability to handle several tasks simultaneously.\nStrong knowledge in Python, SQL, and NoSQL.\nSpark and Big data technologies experience – an advantage.\nResearch experience - an advantage.\nExperience with e-commerce - an advantage.\nAt Fiverr, we’re not about checklists. If you don’t meet 100% of the requirements for this role but still feel passionate about the position and think you have the right skills and qualifications to excel at it, we want to hear from you.\nWhat am I going to do?:\n\nTake leading roles in projects such as search engine ranking, promoted ads in Fiverr’s search results, recommendations, users segmentation and personalization, online bidding optimization, text analysis, real-time predictions, live streaming data handling, exploration-exploitation problems, etc.\nWork closely with various departments in the company to provide advanced Data Science solutions end to end.\nWrite and own production models and code.\nIndependent research and innovation in new content and technological domains.\nLead and advise other team members.\nContinuously produce new initiatives and improvement ideas.\nAct as a leader of Fiverr’s Data Science ML platform. Develop models framework solutions for the group.\n\nEqual opportunities:\n\nAt Fiverr, we prioritize diversity. We celebrate difference and embed it into every aspect of our workplace, from our community to our product. Fiverr is proud and committed to providing equal opportunity employment to all individuals regardless of race, color, religion, sex, sexual orientation, citizenship, national origin, disability, Veteran status, or any other characteristic protected by law. In addition, Fiverr will provide accommodation to individuals with disabilities or a special need.Show more Report"}, {"company": "HiredScore", "job": "NLP Data Scientist", "city": "Tel Aviv-Yafo", "date": "22d", "rating": "4.5", "link": "", "description": "HiredScore brings deeply integrated big data and AI solutions to the global Fortune 500. By leveraging data from companies' Human Resources Data ecosystem, HiredScore enables to automate and augment the hiring process, enriching recruiters' decisions with smart insights and candidate prioritization grades of A, B, C, or D using NLP and Machine Learning algorithms.\nHiredScore's Artificial Intelligence Engine uses past company hiring data, global hiring data, and other data sources including labor market data, employee performance data, and CRM data, to revolutionize the end-to-end recruiting workflow as well as integrate seamlessly with other HR Systems such as chatbots, assessment tests, video interviews, and other automation tools. HiredScore's mission is to bring data science into the Human Resources domain.\nWe’re looking for a Senior NLP Data Scientist to join our growing Data Science group and play a key role in building new cutting-edge data-driven products and algorithms. We are a lean, fast-paced, entrepreneurial company, and by joining us you will work on NLP and other data science challenges, to have the chance to make a true impact on the lives of millions of job seekers as well as improve the HR processes of Fortune 500 companies.\nRoles & Responsibilities:\n\nWork closely with product teams to build new products end-to-end: requirements gathering, data exploration, feature engineering, model building, performance evaluation, and deployment to production.\nCreate AI products based using SOTA DL\\ML approaches that bring real value to the HR-Tech domain.\nPerform in-depth analysis and evaluation of complex Machine Learning pipelines.\nHelp the largest companies (Fortune 500) in the world hire the best candidates in the fairest and most compliant way.\nWhat You Need:\n\n3+ years of experience in researching and developing machine learning and/or statistical models.\n3+ years of experience in software development in a scalable production environment.\nExperience with Deep Learning frameworks (PyTorch, Keras)\nExtensive experience developing with Python.\nBachelor’s degree in Computer Science or another quantitative field, MSc is an advantage.\nAdvantages:\n\nExperience with Natural Language Processing (NLP) is an advantage.\nAdvantage: Start-up experienceReport"}, {"company": "WorldQuant", "job": "Quantitative Researcher", "city": "Ramat Gan", "date": "29d", "rating": "4.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=1136043&s=58&guid=00000186e630855e9c8211108675b120&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_3763ab17&cb=1678899396680&jobListingId=1008470609616&jrtk=3-1-1grj37fvbncd7801-1grj311e3pkjk800-4cabe68107967600-", "description": "WorldQuant develops and deploys systematic financial strategies across a broad range of asset classes and global markets. We seek to produce high-quality predictive signals (alphas) through our proprietary research platform to employ financial strategies focused on exploiting market inefficiencies. Our teams work collaboratively to drive the production of alphas and financial strategies – the foundation of a balanced, global investment platform.\nWorldQuant’s success is built on a culture that pairs academic sensibility with accountability for results. Employees are encouraged to think openly about problems, balancing intellectualism and practicality. Excellent ideas come from anyone, anywhere. Employees are encouraged to challenge conventional thinking and possess an attitude of continuous improvement. That’s a key ingredient in remaining a leader in any industry.\nOur goal is to hire the best and the brightest. We value intellectual horsepower first and foremost, and people who demonstrate an outstanding talent. There is no roadmap to future success, so we need people who can help us build it. Our collective intelligence will drive us there.\nThe Role: Research is at the core of WorldQuant. Through rigorous exploration and unconstrained thinking about how to apply data to the financial markets, our researchers are in constant search of new alphas. We strive to understand data in ways our competitors don’t believe is possible. Researchers at WorldQuant employ tested processes seeking to identify high-quality predictive signals that we believe are undiscovered by the wider market. These signals are mathematical expressions of data that are used as inputs in our quantitative models.\nWorldQuant is seeking an exceptional individual to join the firm as a Quantitative Researcher. The person must have a strong understanding of the investment research process to create computer-based models that seek to predict movements of global financial markets. While prior finance experience is not required, a successful candidate must possess a strong interest in learning about finance and global markets. Candidates will have a research scientist mind-set; be a self-starter, a creative and persevering deep problem solver who is motivated by unsolved challenges.\nIts Impact: As we pursue our goal of creating new alphas, we need researchers who will lead us there. WorldQuant’s unique investment platform is a leader amongst its peers and the methodology we employ is innovative. We desire people who will help us in our steadfast pursuit to succeed.\nJob Responsibilities (including, but not limited to, the following):\nBuilding algorithmic, computer-driven models\nConducting research on academic quantitative finance literature\nExploring and handling data\nApplying an alignment of innovative methods in Applied Mathematics, Computer Science and Financial Economics.\nWhat You'll Bring:\nB.Sc. or an advanced degree from a leading university in a quantitative or highly analytical field (e.g. Electrical Engineering, Physics, Computer Science, Mathematics)\\\nRanked in the top 10% of bachelor’s degree class\nPrevious experience as a quant in a research focused capacity\nShown ability to program in C/C++ on a Unix/Linux platform is a plus\nExcellent problem solving abilities and judgment with a strong attention to detail, creative, self-starter\nMature, with the ability to operate in a collaborative, team-oriented culture\nStrong English language skills; ability to communicate sophisticated concepts in simple terms\nInterested and qualified candidates please send resumes to WQIsraeljobs@worldquant.com.\nCopyright © 2022 WorldQuant, LLC. All Rights Reserved.\nWorldQuant is an equal opportunity employer and does not discriminate in hiring on the basis of race, color, creed, religion, sex, sexual orientation or preference, gender identity, age, marital status, citizenship, national origin, disability, military status, genetic predisposition or carrier status, or any other protected characteristic as established by applicable law.Show more Report"}, {"company": "Gotfriends", "job": "Data Scientist לחברת סטארט-אפ בתל אביב קו רכבת", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=117&ao=1136043&s=58&guid=00000186e630855e9c8211108675b120&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_435b4fc3&cb=1678899398249&jobListingId=1008450585300&jrtk=3-1-1grj37hfbjm7s801-1grj311e3pkjk800-35568b6a5f46eabe-", "description": "מיקום: ת\"א והמרכז\nתיאור המשרה:\nאנחנו מחפשים Data Scientist עם מוטיבציה ונסיון שתצטרף/יצטרף לצוות המצוין שלנו לביצוע של מחקר ופיתוח באופן שווה. עבודת Research to Production וכן שילוב עבודת Reinforcement Learning ו- Deep Learning בשוטף.\nאנחנו מפתחים טכנולוגיה הנותנת פתרונות בתחום הבינה המלאכותית.\nפועלים כיום בארץ ובאירופה ועתידים לפתוח בקרוב פעילות גם בארה\"ב.\n\nתנאים מעולים!\nחבילת אופציות, שכר גבוה, ימי חופשה ללא הגבלה, איזון בית עבודה ומשרדים Dog Friendly.\nנשמח לתת פרטים נוספים עלינו ועל המשרה, שלח/י קורות חיים.\nדרישות המשרה:\n3 שנות נסיון בפיתוח אלגוריתמים עם Machine Learningתואר שניPythonShow more Report"}, {"company": "Comet.ml", "job": "QA Automation Lead", "city": "Tel Aviv-Yafo", "date": "1 day ago", "rating": "4.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=118&ao=1136043&s=58&guid=00000186e630855e9c8211108675b120&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_7a3f40c4&cb=1678899399382&jobListingId=1008526131265&jrtk=3-1-1grj37ijsklsm801-1grj311e3pkjk800-03781c32d24046be-", "description": "Tel Aviv, Israel\nJoin us to advance data science and machine learning.\n\nComet is accelerating the machine learning development process for data science and ML teams. From the individual data scientist tracking training runs to the enterprise team moving hundreds of models into production, Comet is the platform used by some of the most innovative builders in the industry. We started Comet to make it possible for teams to manage and optimize models across the complete ML lifecycle and achieve business value faster.\nYou’re welcome here\n\nWorking in Comet’s fast, dynamic startup environment is challenging and fun. We are looking for people who are customer-focused, work collaboratively, and want to be a voice in advancing Comet’s leadership in the marketplace. If you are excited about empowering technology innovators around the globe in creating world-changing machine learning models, Comet is the right place for you.\n\nComet is backed by more than $63 million in venture-capital funding, and we are the MLOps platform of choice for teams at Ancestry, The RealReal, Uber, WorkFusion, and Zappos. We are a remote-first company with offices in New York City (U.S.A.) and Tel-Aviv (Israel). And we’re just getting started. CRN featured Comet as one of the 10 hottest machine learning and data science startups in 2021.\n\nComet is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees without regard to race, religion, color, sex, gender identity, gender expression, sexual orientation, national origin, ancestry, citizenship status, uniform service member status, marital status, pregnancy, age, medical condition, physical or mental disability, genetic information/characteristics, and any other characteristic protected by State or Federal law.\nMotivation\n\nWe are looking for a Quality Assurance (QA) automation lead to lead and execute exploratory and automated tests to ensure product quality. QA engineer responsibilities include designing and implementing tests, debugging and defining corrective actions. The QA engineer role plays an important part in our company’s product development process. Our ideal candidate will be responsible for conducting tests before product launches to ensure software runs smoothly and meets client needs. If you hold an engineering background and enjoy providing end-to-end solutions to software quality problems, we’d like to meet you. Ultimately, you should monitor all stages of software development to identify and resolve system malfunctions to meet quality standards.\n\nResponsibilities:\nIn charge of all of the quality assurance aspects at Comet\nLeads a team of QA engineers\nDesign and implement test automation code\nReview requirements, specifications and technical design documents to provide timely and meaningful feedback\nCreate detailed, comprehensive and well-structured test plans and test cases\nEstimate, prioritize, plan and coordinate testing activities\nDesign, develop and execute automation scripts using open source tools such as Cypress, Playwright utilizing TypeScript and/or Python or other language\nIdentify, record, document thoroughly and track bugs\nIn charge of thorough regression testing when bugs are resolved\nRun manual tests when automation script is impossible\nDevelop and apply testing processes for new and existing products to meet client needs\nLiaise with internal teams (e.g. developers and product managers) to identify system requirements\nMonitor debugging process results\nInvestigate the causes and communicate that to the team\nStay up-to-date with new testing tools and test strategies\n\n\nRequirements:\nProven work experience as a software QA lead for at least 5 years\nStrong knowledge of software QA methodologies, tools and processes\nExperience in writing clear, concise and comprehensive test plans and test cases\nHands-on experience with both white box and black box testing\nHands-on experience with automated testing tools\nSolid knowledge of SQL and scripting\nExperience working in an Agile/Scrum development process\nExperience with performance and/or security testing is a plus\nBonus\nBS/MS degree in Computer Science, Engineering or a related subject\nHave some understanding of AI and ML\nWorked on SaaS Systems\nHave a get-things-done approach.Show more Report"}, {"company": "Riskified", "job": "Director of Data Science", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=119&ao=1136043&s=58&guid=00000186e630855e9c8211108675b120&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_38f67c2b&cb=1678899400610&jobListingId=1008411566623&jrtk=3-1-1grj37jqk20ht001-1grj311e3pkjk800-df4dc0a36dd16cb8-", "description": "About Us\n\nRiskified empowers merchants and shoppers to realize the full potential of eCommerce by making it safe, accessible, and frictionless. Our global team helps the world's most-innovative eCommerce merchants eliminate risk and uncertainty from their business. Merchants integrate Riskified's machine learning platform to create trusted customer relationships, driving higher sales while reducing costs. Riskified has reviewed hundreds of millions of transactions and approved billions of dollars of revenue for global brands and fast-growing businesses across industries, including Wayfair, Wish, Peloton, Gucci, and many more. As of July 29th, 2021, Riskified has begun trading on NYSE under the ticker RSKD. Check out the Riskified Technology Blog for a deeper dive into our R&D work.\n\nOur Research Team\nWe are focused on bringing value to Riskified through the development of models and analytical solutions across domains. We use a wide variety of advanced techniques and algorithms to provide maximum value from data in all shapes and sizes: classic ML and deep learning, supervised and unsupervised, NLP, anomaly detection, graph theory, and more.\nWe use the most cutting-edge solutions - from event driven (Kafka), to big data solutions (Spark), Cloud operations (Docker & Kubernetes), Workflow orchestration (Airflow & Argo) and Machine Learning Platforms (Databricks & Kubeflow), working in Python and R.\nWe're a friendly, fun and diverse team. We're passionate about making data-driven decisions, being open-minded and creative, while communicating openly and honestly. We thrive in a continuous learning culture to promote growth and remain at the forefront of technological innovation.\nAbout the Role\n\nAs a director of Data Science, you will lead, mentor and manage a group of talented team leaders and data scientists, responsible for the centralized data science teams which support Riskified's flagship products. Riskified's suite of solutions are AI-based and as such we contribute to the company's bottom-line on a daily basis. We have a dynamic product suite and are dealing with an ever changing landscape of fraud, so we're looking for someone who can learn and adjust quickly as the company and our product suite expand. The foundations group encompasses the centralized data science teams that support our product oriented data science teams. Each team is responsible for different domains that support all our various products - this is a technically oriented group that works in close collaboration with the multiple departments in the organization to implement solutions end to end. You'll report to the VP Data Science and be a part of the data science management team, establishing research vision, goals and culture. You will work closely with stakeholders in the Product and Development departments, striving to maximize Riskified's business KPI's and optimize analytic performance. You'll focus on delivering as much value, as early as possible by understanding what's important for the business.\nWhat You'll Be Doing\nMentor and work closely with your team leaders to foster a culture that values performance, innovation and high-impact results, while creating a balanced environment for team members to thrive in\nBuild Group's vision and strategy to meet department goals, and be able to clearly articulate it to top management and peer groups.\nEvaluate machine learning options, take part in designing research plans, set technical direction and quality standards, and guide implementation\nLead process changes to improve group performance and effectiveness\nTake overall responsibility for recruiting and scaling the group to support its growth needs\nTake part in forming the Data Science culture, vision and cross-department processes\nDefine group KPIs to track the business value of the main projects\nQualifications\n4+ years proven experience as group leader, managing multiple managers and teams, with strong leadership skills for coaching and mentoring - A MUST\n2+ years experience as a data science manager\n3+ years proven experience as a data scientist in production environments\nExcellent understanding of machine learning theory, statistics and applied mathematics\nProven experience working closely with product management and senior leadership across the company.\nExcellent communication and problem-solving skills; ability to clearly explain complex concepts\nExperienced with data science and software development best-practices; experience with Agile methodology in a research environment\nSolid business acumen - understands what's important for the bottom-line of the business and drives research to create measurable value\nFluent in verbal and written English\nLife at Riskified\n\nWe are a fast-growing and dynamic tech company with 750+ team members globally. We value collaboration and innovative thinking. We're looking for bright, driven, and passionate people to grow with us.\n\nCOVID-19 Update:\n\nOur Tel-Aviv team is currently working in a hybrid of remote and in-office work for all our team members. We have recently moved to our new space in Tel Aviv - check it out here!\n\nSome of our Tel Aviv Benefits & Perks:\n\nEquity for all employees, Keren Hishtalmut, pension\nPrivate medical insurance, extra time off for parents and caregivers\nCommuter and parking benefits\nTeam events, fully-stocked kitchen, lunch stipend, happy hours, yoga, pilates, functional training, basketball, soccer\nWide-ranging opportunities to volunteer and make an impact\nCommitment to your professional development with global onboarding, skills-based courses, full access to Udemy, lunch & learns\nAwesome Riskified gifts and swag!\nIn the News\n\nGeektime: Riskified Goes Public\n\nWalla!: Happy Hour at the Riskified Offices\nGeektime Insider: A look at Riskified Tel Aviv\n\nGlobes: Riskified to contribute the highest amount up to date to Tmura\n\nGlobes: Riskified is among Israel's fastest growing companies\n\nTechCrunch: Riskified Prevents Fraud on Your Favorite E-commerce Site\n\nCTech: Riskified's VP HR on Post-COVID Flexible Work RoutinesShow more Report"}, {"company": "Blue dot Corp", "job": "Data Scientist", "city": "Israel", "date": "30d+", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=120&ao=1136043&s=58&guid=00000186e630855e9c8211108675b120&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b754ffea&cb=1678899401626&jobListingId=1008164590444&jrtk=3-1-1grj37koukhra801-1grj311e3pkjk800-ede30e8371183118-", "description": "About us\nFounded in 2013, Blue dot is a market pioneer, developing the first technology-based and dynamically updated financial platform for employee-driven transactions in the market. The all-in-one Blue dot Tax Compliance Platform harnesses digitization, tax compliance, and automation to process and analyzes each customer’s VAT, Taxable Employee Benefits, and Corporate Income Tax from expense data in real-time. As a privately held company, Blue dot’s technological breakthrough has raised $92M in private equity funding and attracted a large portfolio of Fortune 500 clients, while partnering with global brands like SAP, PwC, KDS, and many more. Blue dot is fully dedicated to providing its clients with value, not only in terms of revenue but in the peace of mind that comes from full compliance.\nResponsibilities\nBlue dot is seeking a passionate Data Scientist to join our team and develop new innovative Data Science ideas from conception to realization. We are looking for an analytical problem solver that isn’t intimidated by diving into unknown territories.\nQualifications\n MSc degree in a quantitative discipline\n 4+ years experience as a data scientist\n 2+ years experience with Python\nExperience with writing production code and model deployment\n Knowledge of Machine Learning (both classic ML and DL, supervised and unsupervised) algorithms, best practices, project life-cycle\n Solid knowledge in statistics (Hypothesis tests etc.)\n Willingness to own a project from research to deployment\n Autodidact; Interest in DS concepts\nYou are a researcher at heart with strong mathematical intuition\n Team player\nAdvantage\nWorking with databases, such as SQL, MongoDB\nNLP experience\n Computer vision experienceReport"}, {"company": "Gotfriends", "job": "Data Scientist Researcher בחברה מרשימה", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=121&ao=1136043&s=58&guid=00000186e630855e9c8211108675b120&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_3fbd6013&cb=1678899403060&jobListingId=1008450584846&jrtk=3-1-1grj37m77k25f801-1grj311e3pkjk800-081a5c4f1c6c41b7-", "description": "מיקום: ת\"א והמרכז\nתיאור המשרה:\nמדובר בחברה מצליחה בתחום ה-Ecommerce. פיתחו פלטפורמת SaaS מבוססות אלגוריתמים חדשניים שנותנת פתרונות ל-Ecommerce Marketing בכדי ליצור חווית לקוח ייחודית. פלטפורמה זו כוללת את כל פתרונות השיווק הדרושים למותגים תחת קורת גג אחת הכוללים ביקורות גולשים, מועדוני לקוחות, חבר מביא חבר ושיווק באמצעות SMS. מנגישה ומעודדת גולשים להוסיף המלצות ותוכן משלהם באתרים עצמם. ממוקמים בתל אביב- קו רכבת ומשלבים מודל עבודה היברידי. מונים 350 עובדים בארץ.\nמהות התפקיד- חלק מצוות של 6 חוקרים ו-2 מהנדסים, עבודת Research to Production עם נטייה לצד המחקרי. הצוות מפתח אלגוריתמים שונים בנושאים Machine Learning, Deep Learning, Reinforcement Learning, NLP, Computer Vision, Recommendation Systems. התפקיד כולל הובלה של פרויקט מחקר מקצה לקצה אשר אליו יצוותו מפתחים שיעסקו בפיתוח הפתרונות בפועל. עיקר העיסוק Machine Learning, Deep Learning, Reinforcement Learning, Recommendation Systems, Clustering.\nדרישות המשרה:\n3 שנות ניסיון כ-Data Scientist/Researcherתואר שני טכנולוגיניסיון ב-Deep Learning/Reinforcement Learningניסיון ב-PythonReport"}, {"company": "Sensi.ai", "job": "Senior Data Scientist", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "", "description": "About Sensi:\nSensi is on a mission to change the way we, as a society, take care of every older adult who needs it. We are leveraging the power of AI and data to ensure safety, dignity, and satisfaction in every caregiver-care recipient interaction.\nWhy Sensi\nIf you want to work with a purpose - Sensi is the place for you! Join us in creating an ideal care environment for older adults and making Sensi a new industry standard for the long-term care industry. Sensi offers unique professional growth opportunities and the ability to impact the future of our company.\nAbout the role:\nAs a Senior Data Scientist you will join Sensi's multidisciplinary AI team, composed of data scientists, data analysts and data engineers. This team is responsible for our strategic AI-enabled components dealing with classical and advanced audio signal processing, deep learning techniques, NLP and machine learning.\nYou will report to the Head of AI and work closely with Product, Business and R&D teams to support across-the-board decision making to execute company business goals.\nResponsibilities:\nBe an expert in your domain, drive execution and quality, guide, mentor and collaborate with your team members.\nBe passionate and tech-savvy in data and data science domains with the ability to provide business context and shape data and data pipelines directions.\nAbility to lead research and find solutions for complex problems.\nTaking ownership and being responsible for leading the end-to-end delivery; starting from innovation, experimentation, and development and ending with deployment to production.\nBuild culture, trust, and working relationships that enable your team to influence product roadmaps that are driven by customer data.\nPartner and collaborate with product, business data taggers, engineering, and other stakeholders to understand the business to shape Sensi data strategy and AI roadmap and correlate it with business needs.\nLead continuous improvements in process and tools to drive quality and decision-making. Automate manual processing, CI/CD, MLOps, optimizing data delivery, re-designing infrastructure for better scalability.\nMonitoring models performance in production, continuously working on methods to improve quality and performance\nRequirements:\n\nAt least 3 years of experience as Data Scientist (Deep-learning) in a tech company\nA scientific degree in relevant fields: EE, CS, Mathematics, Statistics, or similar (MSc. or PhD. advantage)\nExperience working with management, business leads, developers, and marketing teams to successfully meet deadlines in a fast-paced, rapidly changing environment.\nHands-on experience in taking ML/DL models from inception to production.\nExperience and strong knowledge in Machine-Learning (mandatory), Deep Learning (mandatory).\nExperience with NLP, ASR and/or Diarization - Advantage\nExperience in Data processes (mandatory) and best practices in a SaaS environment (advantage)\nEngineering skills - Ability to take a model to production\nLast but not least - People and communication skillsShow more Report"}, {"company": "ThetaRay", "job": "Data Engineer", "city": "Hod HaSharon", "date": "30d+", "rating": "4.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=123&ao=1136043&s=58&guid=00000186e630855e9c8211108675b120&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_2239aa9d&cb=1678899405945&jobListingId=1008299155017&jrtk=3-1-1grj37otknccj801-1grj311e3pkjk800-74ede8752382e166-", "description": "DESCRIPTION\nThetaRay is the leading provider of AI-based Big Data analytics.\nWe are dedicated to helping financial organizations combat financial crimes through money laundering and facilitating malicious crimes such as terrorist financing, narco-trafficking, and human trafficking which negatively impact the global economy.\nOur Unsupervised and Semi-Supervised Intuitive AI solutions enable clients to manage risk, detect money laundering schemes, uncover operational issues, and reveal valuable new growth opportunities.\nThetaRay is looking for a Data Engineer to join our growing team of data experts.\nThe hire will be responsible for designing, implementing, and optimizing data pipeline flows within the ThetaRay system.\nThe ideal candidate has experience in building data pipelines and data transformations and enjoys optimizing data flows and building them from the ground up.\nThe Data Engineer will support our data scientists with the implementation of the relevant data flows based on the data scientist’s features design and construct complex rules to detect money laundering activity.\nThey must be self-directed and comfortable supporting multiple production implementations for various use cases.\nKey ResponsibilitiesImplement and maintain data pipeline flows in production within the ThetaRay system based on the data scientist’s designDesign and implement solution-based data flows for specific use cases, enabling the applicability of implementations within the ThetaRay productBuilding a Machine Learning data pipelineCreate data tools for analytics and data scientist team members that assist them in building and optimizing our product into an innovative industry leaderWork with product, R&D, data, and analytics experts to strive for greater functionality in our systemsTrain customer data scientists and engineers to maintain and amend data pipelines within the productTravel to customer locations both domestically and abroadBuild and manage technical relationships with customers and partners\nTravel to customer locations abroad\n\nREQUIREMENTS\n2+ years of hands-on experience with SQL.experience with Spark scripting languages: PySpark/Scala/Java/RHands-on experience with data transformation, validations, cleansing, and ML feature engineeringHands-on experience working with Apache Spark cluster - an advantage.BSc degree or higher in Computer Science, Statistics, Informatics, Information Systems, Engineering, or another quantitative field.Experience working with and optimizing big data pipelines, architectures, and data sets - an advantage.Strong analytic skills related to working with structured and semi-structured datasets.Build processes supporting data transformation, data structures, metadata, dependency, and workload management.Experience performing root cause analysis on internal and external data and processes to answer specific business questions and identify opportunities for improvement.Business-oriented and able to work with external customers and cross-functional teams.Fluent in English & Hebrew both written and spoken\nNice to have\nExperience with LinuxExperience in building Machine Learning pipelineExperience with ElasticsearchExperience with Zeppelin/JupyterExperience with workflow automation platforms such as Jenkins or Apache AirflowExperience with Microservices architecture components, including Docker and Kubernetes.Show more Report"}, {"company": "Lightricks", "job": "Data Science Researcher", "city": "Jerusalem", "date": "30d+", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=124&ao=1136043&s=58&guid=00000186e630855e9c8211108675b120&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_2f6fbdcf&cb=1678899407168&jobListingId=1008351187820&jrtk=3-1-1grj37q7j2gof001-1grj311e3pkjk800-71193e9d4fe99a19-", "description": "Data: Data ScienceJerusalem\nWho we are\n\nLightricks is a pioneer in innovative technology that leads to breakthrough moments throughout the creation process. With a mission to push the limits of technology to reimagine the way creators express themselves, we bring a unique blend of cutting-edge academic research and design to every user experience.\n\nOur photo and video editing tools, including Facetune, Videoleap, and Photoleap, offer endless possibilities and inspiration, while our creator services, Popular Pays, provides content creators the ability to partner with brands to monetize their work and talents. We focus on putting creators in the center and empowering them from the moment inspiration strikes\n\nThe Data science team drives business and engagement optimization at Lightricks. We use machine learning and deep learning models to personalize our users' experience and optimize business KPIs. Our classification and recommendation systems allow us to provide better experiences for our users and carve Lightricks’ path to success.\nWhat you will be doing\nOwn machine learning and deep learning based projects: ideation, research, evaluation, production implementation and monitoring.\nHelp solving complex diverse problems, and work with several stakeholders on a daily basis including product managers, developers, BI analysts and more.\nBuild predictive machine learning models based on historical streams and usage data. For example, churn prediction and treatment optimization, product features recommendations and more\nYour skills and experience\n3+ years of experience as a data scientist in the industry. Experience from b2c companies is a plus.\nStrong background in machine learning, preferably in personalization related fields\nFamiliarity with Deep Learning, NLP, Computer vision or Recommender systems - an advantage\nHands-on experience with data science projects from research to production\nMSc or PhD in Computer Science, Data Science or a related field.\nProficiency with Python and SQL\nTeam player with excellent communication skillsShow more Report"}, {"company": "Glassbox", "job": "Data Scientist", "city": "Israel", "date": "23d", "rating": "4.6", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=125&ao=1136043&s=58&guid=00000186e630855e9c8211108675b120&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9c1a76f4&cb=1678899408188&jobListingId=1008482980121&jrtk=3-1-1grj37r7lnce2801-1grj311e3pkjk800-8b1b372d6f1a3465-", "description": "Data Scientist\nIsrael - R&D - Full-time - Senior\nGlassbox is looking for a Data Scientist to join our ML & Data team\n\nWe are Glassbox, the world's leader in digital experience intelligence (DXI), and on a mission to deliver frictionless digital journeys to leading brands and their customers all over the world.\n\nWe are a hyper-growth scale-up company that continues to grow quarter-on-quarter and our customers love us - named a 2022 leader in nine G2 categories based on customer reviews!\n\nSo, now is the perfect time to come to Glassbox and help us accelerate our global leadership position!\n\nWill you join us on this journey?\n\n\nAs an Experienced Data Scientist in our ML team, you will surely get excited with the opportunity of handling exceptional volumes of customer data (hundreds of billions of monthly events!) and help us facilitate cutting-edge Machine Learning technologies at large scale for some of the largest organizations in the world.\n\nYou will work closely with several teams within Glassbox - Product team, Data Engineering, as well as several R&D teams and take a pivotal role in defining our next generation ML platform infrastructure and roadmap.\n\n\nWhat You Will Do\n\nResearch, develop, and maintain ML models, from ideation to productization\nUnderstand Business/Customer/Product requirements and translate them into elegant/flexible capabilities and solutions\nBe a part of a full-cycle Data Science team, participating in Design and Architecture discussions of complex large scale systems\nContribute to the team effort of driving the organization to a more data-oriented approach and philosophy\nClosely collaborate with Data and ML Engineers in order to drive the execution and delivery of features and models, adapting data pipelines and ML models packaging as micro-services\nHands-on development of custom data models and algorithms to apply to data sets using predictive modeling to optimize customer experiences and other business outcomes\nContribute in building the research best-practices in Glassbox and push towards thought leadership for ML in the CX domain\n\nWhat You Will Need\n\nExceptional at planning, setting expectations, defining goals and meeting commitments\nMaster degree (or equivalent) in Computer Science or related research-oriented field\n5+ years of proven experience as a Data Scientist\nProven experience in leading solutions from proof of concept, rigorous design and implementation through to production of highly scalable, enterprise-class solutions\nExtensive hands-on and theoretical background in data mining, advanced statistical analysis and machine learning practices and techniques (clustering, decision tree learning, NN, etc) and their real-world advantages/drawbacks - Experience with times series a big plus\nExpert implementation skills in Python, SQL, and popular machine learning frameworks (scikit-learn, TensorFlow, keras, etc)\nIndependent self-starter and team player with excellent communication and interpersonal skills\nDegree or equivalent experience in a quantitative field (Computer Science, Statistics, Mathematics, Engineering, etc.)\nExcellent / Fluent written and spoken English\n\nAdvantage\n\nBig Advantage - Prior experience and understanding of digital customer experience (CX) or similar business domain\nThrives and enjoys working in startups and fast paced environmentShow more Report"}, {"company": "Bruker", "job": "Application Scientist", "city": "Israel", "date": "26d", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=126&ao=1136043&s=58&guid=00000186e630855e9c8211108675b120&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d61524cb&cb=1678899409216&jobListingId=1008477459411&jrtk=3-1-1grj37s7tmfqm801-1grj311e3pkjk800-5f5c7c61ef3b25da-", "description": "Overview:\n\nBruker’s Semiconductor Division is the leader in advanced X-ray metrology and defect inspection tools for the silicon and compound semiconductor industries. The division offers the most comprehensive portfolio tools, based on X-ray technologies including XRR (X-ray reflectometry), XRF (X-ray fluorescence), XRD (X-ray diffraction), XRDI (X-ray diffraction imaging) and others.\nThe X-ray business unit is based in Migdal Ha’Emek, Israel with facilities in Durham UK, Karlsruhe, Germany and support offices and sales representatives worldwide.\nWe have an immediate opening for an Application Scientist to join our application team.\nThe Application team, specializes in x-ray based metrology products. As part of your responsibilities, you will be performing product demonstrations, develop new measurement and analysis schemes for our customers, perform data analysis and provide reports. As an application scientist, you will be working with multiple different departments within Bruker in Israel and around the world. The ideal candidate should enjoy a dynamic and fast-paced business environment, have strong communication skills, and be willing to travel at least 25% of the time.\nBruker Technologies Israel is a people-orient organization. We encourage employees to share their unique perspectives and leverage their strengths in diverse strong teams. We offer a competitive, family-friendly environment.\nResponsibilities:\nProvides technical expertise through presentations, product demonstrations, installation, and maintenance of company products.\nDevelop measurement schemes, model, and analyze customer applications to demonstrate the product capabilities.\nSupport of the core technology, engineering, and production teams in the qualification of the new technologies, algorithms, methodologies, software, and hardware features.\nEnsures that the product application/solution is functioning according to specifications including inspection of tools performance prior to shipment and following installation.\nProvide support to field application engineers, and sales staff as well as customer personnel by disseminating technical information, provide training and help with troubleshooting.\nWe offer a hybrid model (home/office) as an option .\n\nQualifications:\n\nDegree in Materials engineering, Chemical engineering, chemistry, physics, or other relevant engineering degrees (B.Sc. minimum, M.Sc. is preferred).\nAdvantage for: Job experience in the semiconductor field.\nGood knowledge of Materials Engineering basics (thermodynamics, kinetics, diffusion, basic crystallography, etc.). Knowledge of the processes in microelectronics - bonus\nFamiliarity with characterization techniques (preferably hands-on work and results analysis). Experience in matching and mismatch analysis of the different techniques - bonus. Experience in XRF and classical XRR - bonus, XRD or HR XRD - bonus\nGood knowledge of statistics and data analysis.\nFluent in English and experience in technical writing\nServiceability, and ability to manage customer expectations. - bonusShow more Report"}, {"company": "Octopol", "job": "Data Scientist", "city": "Raanana", "date": "30d+", "rating": "3.6", "link": "", "description": "We are looking for an experienced data scientist to join our Data Science group.\n The ideal candidate is a true data science enthusiast who can take full responsibility and lead a project from idea to production.\nWe are looking for a person with a strong background and experience in machine learning research and pipeline combined with business understanding, data exploration, feature engineering, modelling, testing, production-level code and deployment, model monitoring, and maintenance.\nResponsibilitiesTake leading roles in projects such as real-time predictions, data handling, market manipulation, etc.Work closely with other teams, developers, and business owners.Write and own production models and code.Independent research and innovation in new content and technological domains.Solve business problems and integrate solutions into production.\nRequirements:\n\n 4+ years as a Data Scientist.MSc degree in a quantitative discipline.Excellent hands-on SQL skills.Strong proficiency in R or Python.Experience with writing production code and model deployment.Knowledge and experience with Machine Learning algorithms, best practices, project life cycle, etc.Solid knowledge in statistics.Willingness to own a project from research to deployment.Experience in FinTech, Algo Trading – a big advantage.Show more Report"}, {"company": "Meta", "job": "Research Scientist Intern , Generative Models (PhD) (Tel-Aviv)", "city": "Tel Aviv-Yafo", "date": "29d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=128&ao=1136043&s=58&guid=00000186e630855e9c8211108675b120&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_16dcb658&cb=1678899411947&jobListingId=1008470174146&jrtk=3-1-1grj37us8ma4i801-1grj311e3pkjk800-271610fee7e1b917-", "description": "Meta AI is seeking Research Interns to join our team in Tel-Aviv to work on innovative research projects that will power the next generation of large-scale generative models in images and videos.As a research intern, you will work closely with our research team and contribute to the development of state-of-the-art generative models.\n\n\nResearch Scientist Intern , Generative Models (PhD) (Tel-Aviv) Responsibilities:\n\nParticipate in the research and development of generative models.\nCollaborate with Facebook AI Research (FAIR) scientists to facilitate research that enables learning the semantics of data (images, videos, audio).\nApply knowledge of relevant research domains along with expert coding skills to platform and framework development projects.\nAnalyze, process, and annotate large datasets for use in the training and evaluation of AI systems for use in both research and production tasks.\nAdapt machine learning and neural network algorithms to best exploit modern parallel environments (e.g. distributed clusters, GPUs).\n\n\nMinimum Qualifications:\n\nCurrently pursuing a PhD degree in Computer Science, Electrical Engineering, or a related field.\nExperience in PyTorch, Python or C/C++.\nMust obtain work authorization in the country of employment at the time of hire, and maintain ongoing work authorization during employment\n\n\nPreferred Qualifications:\n\nIntent to return to degree-program after the completion of the internship/co-op.\nStrong knowledge of machine learning, deep learning, and generative models.\nFirst-authored publications at workshops or conferences.\nAbility to work independently and as part of a team.\nAbility to communicate complex research in a clear, precise, and actionable manner\nA strong interest in theoretical and empirical research and for answering hard questions with research\nProven track record of achieving results as demonstrated by grants, fellowships, patents, as well as first-authored publications at workshops or top AI conferencesReport"}, {"company": "מכון ויצמן", "job": "Staff Scientist Position for Cryo", "city": "Rehovot", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=129&ao=1136043&s=58&guid=00000186e630855e9c8211108675b120&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_51fd0225&cb=1678899413185&jobListingId=1008421856137&jrtk=3-1-1grj3801skf28801-1grj311e3pkjk800-05f6724679a756cf-", "description": ".A staff scientist position is available at the Electron Microscopy Unit of the Weizmann Institute of Science\n\nThe EM Unit is a large facility serving all science groups at the Weizmann Institute for all applications and methods in electron microscopy, correlative light microscopy, and CT (https://www.weizmann.ac.il/ChemicalResearchSupport/electron-microscopy/a...). There are 10 PhD-level staff scientists, each with expertise in specific fields and techniques. Our equipment includes TFS Titan Krios, Talos Arctica, Titan Themis, Talos F200X and Tecnai F20 and T12 TEM microscopes, two dual beam FIB instruments including a Zeiss Crossbeam for cryo-lamella production, and cryo-FIB-SEM blockface imaging, and correlative light microscopy and MicroCT instrumentation\n\nPlease send your CV and enquiries to Nadav Elad and Sharon Wolf (Nadav.elad@weizmann.ac.il and Sharon.wolf@weizmann.ac.il)\nהשכלה וכישורים נדרשים:\nWe are currently seeking a PhD-level staff scientist who will specialize in cryo-EM applications including single-particle (SPA) applications, cryo-tomography, and general cryo-TEM imaging. The position involves providing support and training, participating in collaborative research projects, developing protocols and maintaining cutting-edge capabilities and workflows\n\nThe applicant should have a PhD in a relevant field, preferably with postdoctoral experience. The position is on tenure-track with benefits and travel funShow more Report"}, {"company": "K Health", "job": "Senior Data Scientist (NLP)", "city": "Tel Aviv-Yafo", "date": "29d", "rating": "3.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=130&ao=1136043&s=58&guid=00000186e630855e9c8211108675b120&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_bde03788&cb=1678899414268&jobListingId=1008471144377&jrtk=3-1-1grj3814gh7jb801-1grj311e3pkjk800-26d365f231b7489a-", "description": "Who we are:\n\nK Health is a venture-backed, fast-growing start-up with a mission to use the power of shared knowledge to get everyone access to higher quality, more affordable health care. We're looking for mission-driven individuals to join our growing team and help us eliminate healthcare inequalities and build a better, healthier future for us all.\n\nNamed as one of FastCompany's Most Innovative Health Companies of 2022 and to the 2021 CNBC Disruptor 50 list, K Health is using Artificial Intelligence (AI) to build the smartest digital healthcare platform in existence. Our data-driven app brings together the knowledge of thousands of doctors and the anonymous medical records of millions of people to help diagnose and treat what's wrong. We offer a free symptom checker and 24/7 access to doctors to ask questions, refill prescriptions, get care for your kids, and more. Right from your phone—no insurance needed.\n\nSince we were founded in 2016, K Health has raised over $270M in VC funding and our Series E funding round brought us to Unicorn status. Our current partners include the Mayo Clinic Platform, Anthem, and Maccabi Health Services.\nAbout the role:\n\nOur data science team is looking for a strong researcher with proficiency in modern NLP methods, a passion for innovation and ingenuity in defining and turning theoretical problems into products.\n\nIn this role, you will utilize our unique textual clinical data to plan and build game-changing NLP based solutions that will provide immediate medical benefit for millions of people around the world. You will have an end to end responsibility for your models - from ideation and research to full productization and monitoring.\n\nCollaborating in research and production environments, you must have proven experience in researching and developing machine learning algorithms and good interpersonal skills. We highly appreciate independent thinkers and doers.\n\nWhat you'll be doing:\n\nLead the research and development of new product features backed by state of the art clinical AI\nDevelop and advance our NLP algorithms to solve clinical problems improving the quality and efficiency of the patient's medical resolution in interaction\nIntegrate NLP algorithms with ML solutions tailored to a specific clinical need\nDesign and build scalable and efficient pipelines for data preprocessing, information extraction, and model training\nStay up-to-date with the latest NLP research and best practices, and integrate them into our products\nCommunicate technical concepts and solutions to non-technical stakeholders\n\nWhat we're looking for:\n\n3+ years of industry experience in researching NLP problems and implementing solutions using methods including Deep Learning approach (utilizing standard frameworks such as PyTorch, TensorFlow, Hugging Face, etc.)\nM.Sc./PhD in Computer Science / Statistics / Engineering / Mathematics / Physics with applied focus on NLP / machine learning / deep learning or related fields\nStrong knowledge of Machine learning and statistical modeling\nStrong background in Python\nExperience in data exploration and visualization\nTechnical skills in the higher end of the data science stack\nFast learner, proven problem-solving skills\nA positive attitude, daring, curiosity and willingness to learn and teach\nPassion for medicine, health, wellbeing, and the desire to make a positive impact\nAdvantage for experience with medical data, medical AI\n\nBenefits & Perks: #LI-Hybrid\n\n20 paid vacation days, 18 days sick leave, and 10 3-day weekends\nHybrid work schedule with team meals and stocked fridges\nCommuter Benefits\nCommunity focused events\nPension Plan\nStipend per day for food\nStock options for every full-time employee\nVocational Studies Fund\n\nK Health offers competitive compensation packages along with stock options based on industry benchmarks for function, level, and geographic location. Offer amounts are determined by multiple factors such as a candidate's experience and expertise.\n\nWe're deeply committed to building teams as diverse as the patients we serve and strive to cultivate an environment where everyone can bring their most authentic self to work. We depend on our differences to make our team stronger, our workplace more dynamic, and our product accessible to all of our users.\nK Health is proud to be an Equal Opportunity Employer and considers applicants for employment regardless of race, ethnicity, religion, color, national origin, ancestry, disability, medical condition, genetic information, marital status, sex, gender, gender identity, gender expression, sexual orientation, pregnancy, childbirth and breastfeeding, age, citizenship, military or veteran status, or any other class protected by applicable federal, state, and local laws.Show more Report"}]