[{"company": "Global-e", "job": "QA Engineer - IL", "city": "Petah Tikva", "date": "6d", "rating": "3.2", "link": "", "description": "We're looking for a QA Engineer to join the Global-e Core R&D department and take a significant part in the delivery of Global-e's core system.\nWe’re looking for someone who's passionate about technology and software testing, with end-to-end experience in testing web applications in a complex, cloud-based environment.\nThe core group is responsible for the most important components of the system providing a multi-tenant, fully customizable checkout experience; APIs for e-commerce platforms integration; end-to-end payments solutions that involve third-party integration in a secured payment environment.\nRequirements:\n\nAt least 3 years of proven experience in manual testing web applications\nProven experience with writing and executing STP / STD / STR\nProven experience in writing SQL queries (MSSQL)\nExceptional interpersonal skills\nStrong ability to deep dive into the problem and find the root cause\nPrevious experience with e-commerce systems - strong advantage\nExperience with Postman -advantage\nB.Sc. in Computer Science or other technical fields – advantage\nExperience working in SCRUM methodologies – strong advantage\nGlobal-e is an equal opportunity employer. Our team is made up of people from a wide variety of backgrounds and lifestyles. We embrace diversity and welcome applications from people of all walks of life. Our people play the key role in our success, and we are always looking for more driven, talented, and ambitious individuals to join our growing international family.Report"}, {"company": "BUFFERZONE Security", "job": "QA Engineers", "city": "Herzliya", "date": "30d+", "rating": "3.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=102&ao=1136043&s=58&guid=00000186e64138dca5381d1b475b8a99&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_254614ff&cb=1678900465117&jobListingId=1006729600525&jrtk=3-1-1grj483btkhoo801-1grj42ea0227a001-c1bae74f345d1b04-", "description": "We are looking for motivated and talented people to join our team. If you are looking for a challenging position in a fast-paced start-up environment, please send your CV to us at careers@bufferzonesecurity.com.\nBUFFERZONE’s QA team is responsible for verifying that all product releases meet the highest standards. As a member of the QA team, the QA engineer will be responsible for planning, writing and executing product test plans, both manual and automatic. The job requires a good understanding of the MS Windows environment, Windows applications, client-server systems, and security applications.\n\nResponsibilities\nPlanning test cycles according to Product Requirements, Design Documents and work plans\nWriting detailed and creative manual and automated test plans\nCreating and executing tests\nProviding technical support for the product when needed, mostly in English\n\nRequirements\nExcellent English – spoken and written\nSelf-motivated and independent learner\nTeam-oriented, methodical and organized\nEnergetic and willing to work in a fast paced environment\nPrior experience with Active Directory, networks, file sharing systems, security software\n2-3 years experience in QA – an advantage\nBachelor’s degree in Computer Science, Engineering or equivalent technical field experience – an advantage\nPrior experience with JIRA – an advantageShow more Report"}, {"company": "ironSource", "job": "Manual QA Engineer", "city": "Tel Aviv-Yafo", "date": "24h", "rating": "4.3", "link": "", "description": "ironSource Aura, a revolutionary large-scale mobile platform, is looking for a great QA Engineer to join a new emerging team that will be working on our main product. Our team uses the latest and greatest technologies to build scalable products which reach and influence millions of users around the world. The team’s technological stack includes Web, Android, Frontend, Backend, Data and more.\nWe value team players with technical excellence and a sense of ownership who know how to choose the right tool for the right task.\nRequirements:\n\n1-2 years of experience in manual mobile QA\nStrong analytical and problem-solving skills\nExperience in writing QA test plans\nAbility to multitask and work on multiple technical areas simultaneously\nA great team player, who loves to be part of a technical team\nExcellent written and verbal communication skills, fluent written and verbal English\n\nRole:\n\nJoin a top-notch engineering team and work on disruptive products\nAssure that our millions of users around the world will receive state of the art products\nWork with product and engineering to define testing plans and scope\nPerform functional testing for new features, regression testing, and track defects\nBusiness Unit:\n\nR&D\n\nAdvantages:\n\nB.Sc in CS/Engineering/Mathematics/Physics or equivalent\nExperience with testing tools such as adb, fiddler and logcat\nExperience in mobile testing\nExperience with SQL\nExperience with writing test plan\nExperience with Android studio + adb commandsShow more Report"}, {"company": "ESN Global Media", "job": "QA Engineer", "city": "Ramat Gan", "date": "20d", "rating": "4.1", "link": "", "description": "We are looking for a QA Engineer to join our team.\nFor this position, you'll need to have great technical skills, prior experience testing consumer products, and a comprehensive understanding of QA workflow and technology in general.\nYou should have a keen eye for detail and excellent communication skills. If you are also adept at executing test cases manually and are passionate about quality - we'd like to meet you.\nRequirements:\n\nAt least 1 year experience working as a QA engineer with consumer-based productsExperience in running manual tests on web and mobile applicationsLove of process, documentation, and methodologyStrong interpersonal, relationship management, and facilitation skillsExcellent written and verbal communication skills in EnglishAbility to drill down into the smallest of details while guarding the true essence of the productShow more Report"}, {"company": "Unleash Labs", "job": "Junior QA Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=1136043&s=58&guid=00000186e64138dca5381d1b475b8a99&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_65eb2e88&cb=1678900469469&jobListingId=1008312736637&jrtk=3-1-1grj487jskblo801-1grj42ea0227a001-688b85a5fdbf4a2e-", "description": "Unleash is powering the productivity revolution by providing users with a centralized way to search through their cloud based apps and local desktop. A light weight search interface allows users to enter their search query and receive relevant ranked results which are yielded in seconds.\n\nAs a user centric company, we place a great deal of emphasis on users experience when building our product and have fun doing it!\n﻿\nWe are a fresh and energetic startup, post round A in funding ($12M), led by a strong team of second timer founders and top angel investors and VCs from the Sillicon Valley and Tel Aviv. Our expanding team is made up of enthusiastic and dedicated members working together to revolutionize the productivity world. We believe that collaboration across teams - where everyone is accessible, from our newest hires to the founders - combined with a vested interest in our teams well being are the keys to our successful working environment.\n﻿We are looking for a Junior QA Engineer to join our R&D team and continue growing our product!\n\nYour main responsibilities will include:\n\nPlanning and execution of tests on both Front and Backend sides as well as integrations with external services\nExecuting hands-on manual tests of the companies products on different OS\nUse a variety of tools for debugging and executing tests\nReporting and tracking issues (bugs and tasks)\nWorking collaboratively with other team members from the Product and Development teams\nReport to QA Team lead\nRequirements and Qualifications:\n\nGraduate of a software testing course or a relevant academic degree\nAt least 1 year of experience as a manual software tester\nUnderstanding of client/server model\nExperience working with Linux & Mac\nGood inter-personal skills\nIf you are a bright, pro-active, ambitious and naturally curious person who shares our value of teamwork, and you hold these skills, send us your CV!Report"}, {"company": "Via", "job": "QA Engineer", "city": "Tel Aviv-Yafo", "date": "2d", "rating": "3.9", "link": "", "description": "Via is using technology to transform transportation around the world. From changing a single person's daily commute to reducing humanity's collective environmental footprint — we've got huge goals.\n\nAs a QA Engineer, at Via, you will be a part of the end-to-end quality assurance team, working in close collaboration with our product and development teams on new product launches. in this role you will act as the critical link between technical teams and implementation with our partners. You'll be a powerful part of Via's testing service, making sure we deliver reliable and delightful products.\n\nWhat You'll Do:\n\nBuild and run organized processes of manual QA testing\nDevelop and execute test plans covering sanity, functional, regression, and performance tests in an end-to-end environment\nInvestigate, identify and report bugs discovered in our flows\nValidate and test a wide variety of technologies and platforms\nCreate documentation, implement new QA processes and improve existing ones\nVerify that real-world use cases and user expectations are simulated and met during the validation process\n\nWho You Are:\n\n1- 3 years experience working as a QA engineer with consumer-based products\nYou have experience in running manual tests on web and mobile applications\nYou have a love of process, methodology, and documentation - specifically in writing test documents like STD, STP, STR\nAbility to work across multiple new projects simultaneously - you're organized, independent, and eager to learn\nYou're a team player with strong interpersonal, communication, and relationship management skills\nAbility to drill down into the smallest of details while guarding the true essence of the product - you are passionate about the end user experience\nExperience in a fast-paced environment with a rapidly growing product\n\n\nWe're Via, and we build technology that changes the way the world moves. We pioneered the TransitTech category to ensure that the future of transportation is shared, dynamic public mobility — the kind that reduces carbon emissions across congested cities, minimizes reliance on private cars, and provides everyone with accessible, efficient, and affordable ways of getting around.\n\nWith the addition of Remix into our portfolio, we created the first end-to-end TransitTech solution for cities and transit agencies, offering world-class software, service design, and operational expertise to fundamentally improve the way the world moves.\n\n\nWe're committed to building and nurturing a team as diverse as the communities we serve. Bringing transportation equity to the world begins with championing equal opportunity in our own offices. All backgrounds, identities, and voices are welcomed and celebrated here.\n\nReady to join the ride?\n\nVia is an equal opportunity employeReport"}, {"company": "vFunction", "job": "Manual QA Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=107&ao=1136043&s=58&guid=00000186e64138dca5381d1b475b8a99&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_cfd5acd2&cb=1678900472203&jobListingId=1008459641601&jrtk=3-1-1grj48aa3p2kk801-1grj42ea0227a001-e4ee805f76f58597-", "description": "vFunction is the first and only AI-driven platform for architects and developers that intelligently and automatically transforms complex monolithic applications into microservices, restoring engineering velocity and optimizing the benefits of the cloud. Designed to eliminate the time, risk, and cost constraints of manually modernizing business applications, vFunction delivers a scalable, repeatable factory model purpose-built for cloud native modernization.\nWith vFunction, leading companies around the world are accelerating the journey to cloud-native architecture and gaining a competitive edge.\nWe are a first-of-a-kind, cloud-native modernization platform that uses dynamic analysis, static analysis, data science, and automation to enable organizations to transform 100s of Java monolithic applications a year into microservices and provide continuous modernization.\nJob Description:\nWe are looking for a Manual Quality Engineer to join our team, to help us test and improve our product.\nAs part of the role, you will work closely with the R&D team and our PM. Your role includes testing API, creating, executing, and maintaining automated UI tests, and investigating test results on daily basis. We expect you to raise issues, flag problems, find bugs and errors, work professionally with R&D teams, and help troubleshoot issues. You will proactively bring new ideas and promote innovation, design test strategies, and test plans and document technical issues.\nRequirements:\n3+ years of proven experience as a Quality Engineer\nExperience in UI and REST API testing.\nStrong knowledge of Unix/Linux OS, SQL, and Networking.\nAbility to handle complex technical environments and troubleshooting.\nAbility to write technical documents.\nAbility to work independently and in a team.\nBe organized and detail oriented.\nGood verbal and writing in Hebrew and English (A Must)\nPreferred Skills:\nExperience testing in a Java code environment.\nExperience working with public clouds.\nKnowledge of JVM tuning and profiling.\nKnowledge of Docker, Kubernetes, or other containerization platforms.\n\nPlease contact us with questions or to apply.Show more Report"}, {"company": "Aiola", "job": "QA Engineer", "city": "Herzliya", "date": "1 day ago", "rating": "5.0", "link": "", "description": "At aiOla, we live by our mission - to bridge the gaps between Human Intelligence and Artificial Intelligence while connecting the “AI promise” for the masses. aiOla provides you with real-time, natural language ontology-driven, user-friendly, multi-sourced business insights, and intelligence on the go. With vital intelligence at their fingertips and fast access to everything they need to know when they need to know it, your frontline employees are supercharged for success.\nOur growing team of Product, Data Science, Data Engineering, Analytics, and Customer Success professionals in Israel and in the US is composed of passionate, bright minds and uncompromising ambition, boasting hundreds of years of collective experience!\naiOla's unique culture is shaped by its people - with exceptional individuals, eager to learn from one another and create extraordinary solutions. Surround yourself with visionaries and creators, enthusiastic about generating a real impact on everything they do, and you will never cease to learn and grow. Join Us in Pushing the Limits of Human Intelligence!\nResponsibilities:\nTake responsibility from the spec phase to post-production support\nCreate detailed, comprehensive, and well-structured test plans and test cases.\nTake an active role in version testing and pre-release processes\nPlan, analyze, design and execute manual and automated e2e tests of new and legacy features\nCreate new automated tests\nInvestigate customer issues\nBe a part of agile team\nWork closely with other QA engineers, developers, product and architects.\n\n\n\nRequirements:\n\nBSc in Computer Science.\nExcellent analytical and problem-solving skills\nAttention to detail, self-learner, with good communication skills\nStrong knowledge of QA Documentation and methodologies - Advantage\nPrevious Experience writing automated tests - Advantage\nExperience in TS/JS programming languages - AdvantageReport"}, {"company": "Viber", "job": "QA Engineer - Temp Position", "city": "Ramat Gan", "date": "20d", "rating": "4.4", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=109&ao=1136043&s=58&guid=00000186e64138dca5381d1b475b8a99&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a9a0f795&cb=1678900474959&jobListingId=1008487597890&jrtk=3-1-1grj48d0ejrp9801-1grj42ea0227a001-6a4d66cf9a71125e-", "description": "Viber is one of the most popular apps in the world, and the most downloaded app to have come out of the start-up nation. Working with Viber is a unique opportunity to influence the hundreds of millions of people using our messaging app.\n\nThe QA Team at Viber tests innovative features and products at the user level, both manually and with automated tools. We work with development engineers to understand technical implementations and with the product team to define the desired user experience.\n\nAs a QA Engineer at Viber you will be responsible for understanding the domain and the product in detail, coming up with the test strategy, planning, and test cases, all while focusing on delivering the best possible user experience.\nThis position is a temp position for 9 months\n\nResponsibilities\nReview product and technical documentation to ensure the requirements that meet the goal are unambiguous and verifiable\nPlan and execute test plans, test cases, and produce test reports\nPush for and strive to resolve issues without compromising quality\nMaintain effective communication between all project members at all testing stages to ensure all information regarding product quality has surfaced\nWorking with automation tools – writing test cases and monitoring results\nRequirements\n2+ years of QA experience\nTest planning and design (STP, STD, and STR) experience\nDeep understanding of QA processes and test methodologies\nMobile testing experience\nApplications testing experience\nEnglish proficiency – both speaking and writing\nStrong technical background\nExcellent written and verbal communication skills\nAdvantages\nAutomation tools/test writing experience\nBasic knowledge in coding/scripting in any language\nAcademic degree in Engineering, Computer Science or related field\nISTQB course/certification\nAbility to understand client and server logsShow more Report"}, {"company": "Unleash", "job": "Junior QA Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.3", "link": "", "description": "Unleash is powering the productivity revolution by providing users with a centralized way to search through their cloud based apps and local desktop. A light weight search interface allows users to enter their search query and receive relevant ranked results which are yielded in seconds.\nAs a user centric company, we place a great deal of emphasis on users experience when building our product and have fun doing it!\n\nWe are a fresh and energetic startup, post round A in funding ($12M), led by a strong team of second timer founders and top angel investors and VCs from the Sillicon Valley and Tel Aviv. Our expanding team is made up of enthusiastic and dedicated members working together to revolutionize the productivity world. We believe that collaboration across teams - where everyone is accessible, from our newest hires to the founders - combined with a vested interest in our teams well being are the keys to our successful working environment.\nWe are looking for a Junior QA Engineer to join our R&D team and continue growing our product!\nYour main responsibilities will include:\nPlanning and execution of tests on both Front and Backend sides as well as integrations with external services\nExecuting hands-on manual tests of the companies products on different OS\nUse a variety of tools for debugging and executing tests\nReporting and tracking issues (bugs and tasks)\nWorking collaboratively with other team members from the Product and Development teams\nReport to QA Team lead\nRequirements and Qualifications:\nGraduate of a software testing course or a relevant academic degree\nAt least 1 year of experience as a manual software tester\nUnderstanding of client/server model\nExperience working with Linux & Mac\nGood inter-personal skills\nIf you are a bright, pro-active, ambitious and naturally curious person who shares our value of teamwork, and you hold these skills, send us your CV!Show more Report"}, {"company": "Rivery", "job": "QA Engineer", "city": "Ramat Gan", "date": "30d+", "rating": "5.0", "link": "", "description": "Rivery’s SaaS platform provides a fully-managed solution for data ingestion, data transformation, data orchestration, reverse ETL and more with built-in support for your data operations development and deployment lifecycles.\nRivery’s data solutions are used by some of the world’s biggest brands, enterprises, and startups in over 20 countries. Our platform helps data professionals, CIOs, BI analysts, and marketing experts solve complex data challenges. As our company grows, we are looking for the brightest minds across multiple disciplines to join our teams in the US, UK, and Israel.\nWe are looking for a QA Engineer to join our growing R&D department.\nAs part of your role in Rivery you will work closely with all R&D engineers, helping them test their developments, define DODs and improve the stability and quality of our service.\n\nIn this role you will:\n\nDesign, develop and execute test scenarios for our service\nWrite test documents such as STP, STD, STR\nUse different testing techniques such as system, integration & API, UI testing\nRequired skills:\n\n3 + years of experience as a manual QA engineer\nExperience with UI and API testing\nKnowledge in various DBs such as MongoDB, MySQL, Postgres etc.\nAbility to self-learning and a passion for discovering & learning new things\nHigh attention to details\nStrong knowledge in QA processes and methodologies (experience in writing and executing STP, STD, STR)\nFamiliarity with formal testing tools like swagger, postman, wire mocks etc.\nAdvantages:\n\nPython knowledge\nWillingness to expand to automated testsShow more Report"}, {"company": "Lemonade", "job": "QA Engineer", "city": "Tel Aviv-Yafo", "date": "24h", "rating": "3.6", "link": "", "description": "We're looking for an experienced QA Engineer who is passionate about technology and inspired by great UX.\n\nYou'll be instrumental in bringing features to the finish line while collaborating closely with developers, as well as with the Product, Data, and Machine Learning teams—all with the goal of delivering a seamless, joyful experience for our customers.\n\nIn this role you'll\nAnalyze user stories to identify test cases, ensuring an appropriate mix of manual and automated test coverage\nMentor others and promote effective quality assurance strategies and best practices\nUse data to assess the quality and identify improvement tasks that should be prioritized\nProvide an assessment of delivery readiness and collaborate with other teams to ensure timely release\nHelp maintain our outstanding customer experience by having a diligent eye for UI details\nWhat you'll need\n4+ years experience as a QA engineer\nHands-on experience running manual tests on multiple platforms for user-facing products\nAbility to create beautifully written test plans, define testing strategies, and document knowledge\nExperience in coaching and mentoring junior QA engineers\nSuperior analytical skills, with a problem-solving attitude\nExcellent written and verbal communication skills in English\nExperience with Postman and API requests\nExperience with UI or API automation tools (Cypress, Testim, Loadmill, etc.) is a major advantage\nAbility to work in an office environmentShow more Report"}, {"company": "RecrutiX", "job": "QA Engineer - database products", "city": "Israel", "date": "1 day ago", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=1110586&s=58&guid=00000186e64138dca5381d1b475b8a99&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_adb20a1b&cb=1678900479661&jobListingId=1008528078902&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj48hiqkblv801-1grj42ea0227a001-d5ed8ddda10520fb--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBV4Er2R3GvIzh06eqkk7BZDY4tHmMKCQ2iU2nXWIgrtECFE02siKSB6P4R9GP0Oc7yo4RjsT5ZbhoFMkpH7AI0dH74FebC-zrW_RHhuE9tG-TdnZaCbdf0fuwREsPKk6a4hH6uVqNgY0rhZ42GU72yfM96ITA9UDZGpVHhbvoddWnFG2s9dht3nWH_-J3aPinOaZwNO786dqchcwjqR3vP9HB3rTmLGFuINhvK_gUEuFLDAnl_o7JcMQUuz6ctkO-COPC01bYRzlPpZB1MD1CMYUsg7x0-9Pc3rhuVBGioakXrI5ytqI1lcU0rQ82o1bmHkSyI4SY2yTfp92523lqATUjOIs4O7G1JfbH4-ArkjWIlxTqVIKtJOasDvJU-54Hw4_Q3efZHYv5ugVcCJlXFhdNou2jv7fgUf1117F_7iLdwVW3REMYOrhyMWLgrYxMtv158d-KTqALr4zlZVUXJIIQDn_LkL-pjtjUf7GALo5xPErZ1e85NrL0ZG_a76mZSSk9uOoOQJ2WHZLzakRPKt7tbln86VHjFSjf3IKC9K0Iuh4-A443ygxur5MmRCXkfcIEbxZdmXyzC2f_4YSrCaM43Edpo-IvcvVrmPUW_gQ2xIZmD3VFZJU2MCBkef8PmVwi-BAKBhRTLe_Cmiu16ciDUGLpnDyU%3D", "description": "We are looking for a talented QA Engineer to join our Engineering team and help build the company’s cloud cybersecurity solution for the automotive industry. This role is full-time and is Herzliya Israel based. Responsibilities Interface daily with our R&D teams to identify and resolve problems found during testing Work in close cooperation with product management architects and developers Deeply understand the business and technical requirements of existing and new products Work according to high execution standards, while adhering to project goals and ensuring high quality Create and execute manual Tests 3+ years experience as a QA Engineer Experience with database products such as PSQL - a must Proven experience in functional, regression, and integration testing Ability to write clear, concise, and comprehensive test plans Ability to research and resolve technical issues Highly organized and able to consistently deliver excellent quality on a timely manner Self-directed, flexible, and adaptable Excellent English communication capabilities (verbal and writing) Strong team player Knowledge and previous experience working with cloud platforms (primarily Azure and AWS) Practical knowledge of application security and vulnerabilities - an advantage Experience with Selenium-based tools - an advantageShow more Report"}, {"company": "Zota Technology Limited", "job": "QA Integrations", "city": "Tel Aviv-Yafo", "date": "20d", "rating": "3.6", "link": "", "description": "We are:\n\nZotapay is a payment gateway technology hub, serving as a one-stop-shop for online businesses, enabling them to accept payments from anyone, anywhere. We are connected to over 1000 financial institutions worldwide, allowing us to centralize a range of global and local payment methods, on one payment page.\n\nAbout the opportunity:\n\nThe Integration Team is looking for an Integration Engineer with a passion for managing integration projects and cooperating with different parties. Your mission will be to complete payment gateway integration project with our providers.\nWhat you will do:\n\nKeep engagement up with a high-speed development process and ongoing deliveries - executing and adjusting your project plans accordingly\nManual QA and verification of integrations and workflow\nWork closely with the development team and gateway providers to deliver new products\nReport bugs and work out the solutions\nProvide information on the completed integration to the operation team\nAssist on side-tasks related to product improvement\nRequirements:\n\nAt least 1 year of tech project management or manual QA experience\nKnowledge of tools, concepts, and methodologies of QA – nice to have\nFamiliarity with REST API documentation, Postman, JSON, Browser stack\nPassion for troubleshooting and constant self-learning\nAbility to quickly learn new features and adapt to innovations\nSharp attention to detail\nFluent in spoken and written English\nGreat team player with the ability to work with minimal supervision\nSpecific skills\nWhat happens after you apply?\n\nOur HR team is invested in creating the best candidate experience possible, so we will be in touch, once we have reviewed your CV, regarding any next steps.\n\nIn the meantime, you can check out our website and social media pages to learn more about us.Show more Report"}, {"company": "code value", "job": "QA Engineer", "city": "Herzliya", "date": "7d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=115&ao=1136043&s=58&guid=00000186e64138dca5381d1b475b8a99&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_529698a2&cb=1678900481839&jobListingId=1008514797496&jrtk=3-1-1grj48jnhk62o802-1grj42ea0227a001-c24e13cdf29344a9-", "description": "About The Position\nAbout Us:\nCodeValue, founded in 2010, is a leading dynamic software development and consulting services company.\nWe deliver tailor-made innovative solutions and services ranging from focused product and technology analysis, to comprehensive development and in-depth consultancy.\nOur solutions address varied needs across every domain, from startups and mid-size firms, government agencies, public and private enterprises, and global corporations.\nTechnology is at the heart of everything we do. We consider ourselves lucky since we are able to turn our hobby into a prosperous career. Being a dynamic software development and consulting company means we never stop learning, evolving… Growing. Join us and always be one-step ahead!\nRequirements\nWe're looking for responsible, hardworking, willing to work in a dynamic and demanding environment, Independent, fast learner, motivated team player.\nSkills:\nAt least 3 years of hands-on experience in a similar role.\nTesting experience with event driven and microservices architecture.\nExperience with API testing.\nStrong knowledge in QA processes and methodologies (experience in test planning, test design, test strategy, and test execution).\nStrong analytical abilities and troubleshooting skills.\nAbility to quickly learn new concepts and software.\nA responsible and dedicated worker, willing to work in a dynamic and demanding environment.\nMotivated team player who helps drive the team forward.\nFamiliarity with formal testing tools like swagger, postman, wire mocks etc.\nNot a must but a great advantage\nGood knowledge and Experience in SQL.\nExperience with Scrum methodology.\nExperience with Mongo DB, Rabbit MQ.\nStrong web technology skills and experience with testing web applications.Show more Report"}, {"company": "Eitan Medical", "job": "SW QA Engineer", "city": "Netanya", "date": "7d", "rating": "3.6", "link": "", "description": "Eitan Medical is a fast-growing global medical device company, developing and manufacturing innovative drug delivery and infusion solutions across the continuum of care – from the hospital to the home. We are looking for an excellent SW QA Engineer to join the R&D team.\nJob Description:As a software testing Engineer you will be responsible for designing, planning and execution of test scenarios.Responsibility for finding defects and failures during system development and verification by manual and automatic testingInterface with the project's development teams to deliver a high quality product to be used on people.\nDirect Manager: SW QA Team Leader\nRequirements:\n\nEducation:\no QA course and / or ISTQB certification or a scientific degree - advantageJob skills:\no 1-2 years of experience in writing and running manual tests\no Experience in converting software requirement specification documents into testing documents.\no Experience in writing Software Test Plan - an advantage\no Knowledge in automation testing – an advantage\no Past experience in a medical device company – big advantage\nComputer skills:\no Knowledge of all major Office applications (Word, Excel, PowerPoint);\no SQL DB – writing and running queries (Join Level)\nLanguage skills:\no Fluent English - writing and verbal.\nPersonality: Highly motivated, able to work under pressure and meet aggressive schedulesShow more Report"}, {"company": "Vulcan Cyber", "job": "Manual QA Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.8", "link": "", "description": "Vulcan Cyber helps cybersecurity teams stay on top of their game with end-to-end cyber risk management. Some of the world’s biggest companies turn to Vulcan to go beyond scanning data and actually mitigate cyber risk.\nEvery day, we work to become the essential tool for cybersecurity teams worldwide. We're looking for people who can make us better, keep us on our toes and help us transform the industry for good.\nRight now, we’re looking for a Manual QA Engineer to join our team in TLV.\nIf you're a Vulcan, you have big ideas, live for the challenge, and love what you do and the people you do it with. You know that the best perk isn't the free food, the dog(s) in the office, or the remote working policy (don't worry, we have those too). It's the feeling that you're an integral part of building something great.\nFeeling the vibe? Keep reading.\nWe are seeking a skilled Manual QA Engineer to join our team and help us improve the quality and efficiency of our releases. The main goals of this position are to identify and troubleshoot bugs, and to ensure that our products meet the needs and expectations of our customers. The ideal candidate will have a strong understanding of testing methodologies, the ability to analyze and translate business requirements into effective test cases, and the ability to work effectively in a fast-paced agile environment.\nWhat you'll do:\nAnalyze and translate business requirements and user stories into test cases, testing suites, and testing scripts.\nTroubleshoot customer scenarios and reproduce them in-house.\nDesign and implement tests, debugging, and review system requirements.\nAct as a quality gate for releases.\nWhat you have:\nAt least 3 years of experience testing complex web applications.\nDeep understanding of various testing methodologies.\nStrong analytical and technical skills.\nWorking experience in a high-paced agile environment.\nWhat we'd love to see:\nExperience with testing tools such as Postman and Cypress.\nStrong problem-solving skills.\nCybersecurity experience.Show more Report"}, {"company": "מיקרופוקוס", "job": "QA Automations Engineer", "city": "Israel", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=118&ao=1110586&s=58&guid=00000186e64138dca5381d1b475b8a99&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d7a177e0&cb=1678900485850&jobListingId=1007892433967&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj48nkjkhr2801-1grj42ea0227a001-22a0f2c931f77a9a--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNCyO9D9YVC0ZKip1rXlUIpC9ugSsv6CUIXBvXnHzS3FmrSVX7mxugvN5FdNF8QMLo58n6SEYGVoG7-STGxeOF29teL83Ph4yBab6EIQSlbSUcVODxdYwshKv-vpNmyjeiDS53DNlrUB3seE5K9nF-W7MZuoO9ffp7_d51V1Jbiqp1dWDe3U6wNbnptVwOWhbO1SSC2pMEWl3cm6Rr8f7xgp7qMIpBee04HfdUoQi4vnEVEhSv-wmKiNfhWpXMn6oPG9KsLwEtDh7W-notIoDzwJeUWsucUjiJOJRznidOefM3SwSXvK6qcYyYS8Pq1qFBCBqQ7hecS-T3_pu0G3062yuZH7xm4nobZYX7PKUcZMuCr6sB00zMIjFh_o_m0uDR3ZmIkxI1PZNVFCI2VUznL8ZTRVTZ3aMRz6tSvZy9RqcIUD2PuXs2VHj3kAW-Bsnh7aLQ_x38Q0_LH-lpSh_rPA1prX0oiuR0RnErQaBBsY0qkkz2FlHNr1ByH_seqrOjKTK8NLWub6XvGNHl6HLIVcPFu14X6TcHrjkJ50LsX2PJ6xsCBiAeEj2IqLFxc5PYkzX2WiVx5Dryt4mxX8oYe7jWh_GX9BNA0U2yAlt_0hAFJX9CYEE2yW8awqmmw0qg3ExAXRCm5CXFU9gmWiPP01umY51uZvVqE%3D", "description": "We are looking for a talented Software Quality Engineer to lead our rapid agile plans and join the growing R&D team which builds our LoadRunner Cloud products suite. Responsibilities: Take full testing ownership and lead the quality of OneAnalysis Product Write automated tests over existing automation framework as well as contributing to extend the frameworks according to product needs File defects with appropriate supporting information for development to investigate and prepare a fix Work with Developers during the entire product lifecycle, Participate in the Agile/SCRUM process Cooperate with UX, UI and functional architect for specifications, user interaction and graphic design Work according to high execution standards, while adhering to project goals and ensuring high quality Bachelor’s Degree in Computer Science (or equivalent) Demonstrate a strong sense of ownership which drives you to find ways to do things better, faster, and more efficiently Good understanding of the Agile software development lifecycle Solid English communication capabilities (verbal and written) Demonstrate strong knowledge with test strategies, test design and test types Experience with UI testing, and preferably with framework development Experience with JavaScript, TypeScript Experience with Protractor - big advantage Experience in test automation – Prefer, at least 2 years of experience Experience in manual testing – Must, at least 2 years of experienceShow more Report"}, {"company": "Splitit", "job": "QA Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.0", "link": "", "description": "About Splitit\nOur mission is to help consumers responsibly enrich their lives by leveraging the credit they’ve already earned in a new and impactful way. Today consumers want control of how they pay for the things they want and need. Splitit is the only Installments-as-a-Service solution that enables consumers to use their existing credit to break payments into smaller, bite-sized pieces to pay over-time with no interest, applications or fees. That keeps money in the hands of shoppers to use as they want. By helping shoppers pay small we help businesses grow big. That’s a win-win. Splitit operates globally, with teams distributed around the world with offices in Atlanta (HQ) , Melbourne, and Tel Aviv.\nSplitit is looking for an experienced QA Engineer that lives and breathes technology to help us achieve the best quality through manual testing and monitoring. You will be a part of the QA team who are responsible for Splitit’s product quality while executing at a fast pace. You will be part of the execution process, as well as responsible for improving it, and make business critical decisions.\nThis role requires excellent communication skills, as well as deep technical knowledge. Ultimately, you will ensure that our products, applications, and teams work flawlessly.\nResponsibilities include:\nMaintain and improve the quality driven execution of the organization, including its processes and procedures.Drive the company's quality strategy with the evolution of the company and its highly technical product.Help in driving the culture of quality, helping teams to be more independent and efficient in delivering with high quality.\n\nProfessional Requirements:\n2+ years of experience as a QA Engineer.Experience in project management and QA methodology.Knowledge in testing methodology, product lifecycle.Experience working with web apps.Experience in Functionality, usability, performance, Sanity and regression tests.Experience in writing and executing SQL queries.Familiarity with Postman and API tests.Ability to work and make decisions under pressure.\n\nPersonal Requirements:\nHighly organized and accurate, good eye for detailResponsible and dedicatedA team player with excellent interpersonal relationship skillsAble to work independentlyExcellent English skillsReport"}, {"company": "ONE ZERO Digital Bank", "job": "QA Engineer", "city": "Tel Aviv-Yafo", "date": "8d", "rating": "4.5", "link": "", "description": "ONE ZERO is seeking a skilled Quality Assurance (QA) engineer to develop and execute exploratory tests. This role involves designing and implementing tests, debugging and defining corrective actions, reviewing system requirements and tracking quality assurance metrics (e.g., defect densities and open defect counts).\nRequirements:\nA minimum of 3 years of experience as a quality assurance engineerKnowledge of QA processes and methodologies (experience with test planning, test design, test strategy, and test execution)Experience in testing Mobile applications- both iOS & AndroidExperience with API testing tools (Postman, Playground, etc.)Ability to read logs and identify critical informationExperience with project management tools (Jira, TFS)The ability to communicate in English (verbally and in writing)Strong analytical abilities and troubleshooting skillsAdaptability to new concepts and softwareSelf-motivated and capable of dealing with ambiguity in order to solve problems\nResponsibilities:\nDevelop and execute testing plans leveraging comprehensive knowledge of complex system business logicConduct end-to-end (E2E) testing of mobile (iOS, Android) and service components with a holistic understanding of the entire systemAnalyze & debug logs and tracesInvestigating production issuesCollaborate closely with Product and R&D teams to ensure that high-quality deliverables are achieved.\nAdvantages:\nA fintech background is a big advantage\nScrum methodology experienceAutomation testing and framework experienceExperience with SQL/Oracle DB, MongoDB\nExperience with sniffers such as: Charles, Wireshark etc.Report"}, {"company": "myteam", "job": "Junior Manual QA Engineer - AVA", "city": "Israel", "date": "15d", "rating": "4.3", "link": "", "description": "AvaTrade company, located in Herzliya is looking for a Manual QA\nThe Role / Responsibilities:\nWrite and execute manual tests.\nUse bug-tracking systems to submit, track and manage defects.\nAnalyze the results of the tests performed and provide meaningful reports to the project team.\nMaintain software testing artifacts.\nUse queries to create test data and analyze results.\nWork with other testers and key stakeholders to ensure coverage for each software release.\nAssist with the analysis of story-level requirements.\nClarify functional requirements.\nRequirements:\n3 years in Software Quality Assurance-Must\nExcellent understanding of the Test Life Cycle\nAbility to multi-task and learn quickly is a must.\nGood knowledge of HTML, CSS, web and mobile standards is required.\nWorking with log analytics tools (like Cora Logix/Sumo Logic)\nExcellent understanding of web-based Client/Server architecture\nExperience in SQL query writing\nExperience with e-Commerce systems and CRM systems.\nExperience with TFS/Jira\nExperience with Scrum/Agile methodologyReport"}, {"company": "Intercontinental Exchange", "job": "Manual QA Tester", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=122&ao=1136043&s=58&guid=00000186e64138dca5381d1b475b8a99&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_34e9c79e&cb=1678900490475&jobListingId=1008331138566&jrtk=3-1-1grj48s4ikf2u801-1grj42ea0227a001-06208f3442bd8580-", "description": "Job Purpose\nMarket Data is looking for an Experienced QA Engineer to join our team in Tel Aviv. Be an integral part of all the product development lifecycle: plan the testing activities, set bugs, manage specific modules testing plans and assist to R&D. Responsible for building and executing test strategy and plans across multiple product lines in the fields of high frequency and large-scale market data.\nResponsibilities\nTake responsibility from the spec phase to post-production support:\nCreate detailed, comprehensive, and well-structured test plans and test cases.\nPerform the manual test plan, Identify, document and track bugs\nplan production deployment perform post production sanity.\nLead the production support of this development.\nEnrich the automation with the new feature tested\nKnowledge and Experience\nExperience as a QA Engineer testing complex server-side application (not only API testing)\nunderstanding of the server components integration and load limitation\nStrong knowledge of QA Documentation and methodologies.\nKnowledge in SQL- ability to understand, read and write SQL queries\nSolid knowledge of software quality assurance methodologies (ISTQB certificate advantage)\nExperience with the full product release cycle\nSchedule\nT his role offers work from home flexibility of up to 2 days per week .Show more Report"}, {"company": "אביבית דבוש גיוס והשמה", "job": "QA Automation Manager /QA Automation Developer", "city": "Israel", "date": "2d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=123&ao=1110586&s=58&guid=00000186e64138dca5381d1b475b8a99&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_02d98e17&cb=1678900491548&jobListingId=1008525853156&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj48t6hk25h801-1grj42ea0227a001-1e4c12acfa4eb587--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNAySOC0vL1bnH0kYBOB2o0TojTOD6nq89bkB8TMtTSR0KiDIoy7Glov9IW3CwY9UxDsj0EggtZlNxfOUTQkioFq51mPN3WbfKwPpK977n4S5MohORzPrarCYnNIzZS-wcd2m_t6X8RUyBtaVIhbKauQt4RofNamkMLqYXr1pK2OOxfr5CcqZPPiVnEi0MTZtmASQ8JNi-4PuBXIaYziMBELCF2DbfS7aBldSBSOYPMBL_4Nuj1ls-MyXU-i0jabdAycuSWCRxd49puR3w-prTVjA-vMykKUCGsxvUI5iAr0jvSuDHhrUq5nPe65bvN2tKAu2z8fa70VZ9HkapWqDhTEPF35PNw6wCn4tTmPKfRpLhP90dz2GdWKnP_phFuLsXaBroMX3WkFFufoIgZ3IdyHh_HcOITvp0GLPHTlb0TKIoMmoRESELcweyaIm_tDHlqUR6Rnk3VVJUZvu9dN6pkAq-ZDTWEqEHo5m5igH4QXME1Z99ExfIoGzFNTnP1SjVsmd8NZfVp_7nGfrBjWFtXaHquy_vVRWwTFFbbc5yiVU60hp-5iMlHD-D7O6O6H-9F6qMfJuKEvkqywcxyCU6YNwK9V8ii04mOpMGHz_BzIyw63msz_zcyCOarmWsAa9nNp5OQp2HYgz9SFf0562CECr2PWbELWPN4%3D", "description": "QA Automation Manager 5+ years of proven work experience in QA Automation – Must 2+ years of proven work experience in Managing QA Automation teams – Must Solid knowledge of software QA and Automation methodologies, tools, and processes. – Must Experience in Building / Maintaining / Enhancing infrastructure for QA Automation - Must Solid knowledge of Linux OS and Monitoring/Testing Linux resources (Memory, CPU, Limits, Etc.) – Must Experience coding in Python – Must Solid Experience in SQL – Must Proven experience in a cloud environment (AWS/GCP/Azure) Experience working in an Agile environment Experience working with a large scale system Proven work experience with Databases B.Sc. in Computer Science or Information Systems Senior QA Automation Engineer At least 3 years of SW Engineering experience with an Object-Oriented Programming language (Python/Java/C++/C#/etc..) Automation testing experience (methodologies, tools, and processes) Experience with a Software source control system (Git/Mercurial) Basic knowledge in Linux/Unix operating systems Ability to multitask, display flexibility, and work independently. Strong analytical skills.\n\nAbility to see the big picture and at the same time to pay attention to details A team player with excellent communication and interpersonal skills Experience in CI/CD process and Test Management Systems - advantage Understanding of the networking principles (e.g. DNS, routing) - advantage Familiar with Cloud Providers technologies - advantage.Show more Report"}, {"company": "Nayax", "job": "QA Engineer (Embedded)", "city": "Herzliya", "date": "6d", "rating": "4.1", "link": "", "description": "Nayax is looking for a QA Engineer to join the Embedded group. You'll work in a fascinating and diverse multi-disciplinary environment, utilize your testing skills together with your passion for technology and help create an exciting and unique product released in high quality.\nYou should apply if you are a communicative, analytical, problem solver, tech savvy, who doesn't fear a challenge. We offer a great working environment in a successful company and development opportunities going forward.\nThe QA Engineer will report to Embedded Software QA Team Leader.\nIN THIS POSITION YOU WILL:\nPlan, conduct, and monitor manual testing and inspection of features and physical products.\nWrite test plans.\nInvestigate customer complaints.\nCollect and compile statistical quality data.\nAnalyze data to identify areas for improvement.\nPrepare reports to communicate outcomes of quality activities.\n\nRequirements:\n\nWE ARE LOOKING FOR SOMEONE WITH:\n0-1 year of experience as a Manual QA Engineer.\nKnowledge in STD, STP, STR documentation.\nKnowledge of tools, concepts, and methodologies of QA.\nProficient in English - a must.\nAttention to detail.\nGood analytical and troubleshooting skills.\nA good team player – a must.\nADVANTAGES:\nProduct or industry-specific experience (payment/embedded)\nKnowledge with SQL\nKnowledge with Jira\nExperience with Python for automated scripts\nWHY YOU WILL LOVE THIS JOB:\nYou will have the opportunity to work in a multinational environment for a global market leader.\nInterested in automation? In the near future we plan on becoming fully automated.\n\nWho we are:\n\nNayax is a leading global end-to-end retail technology platform for unattended & attended commerce. Our mission is to simplify commerce and payments for retailers while driving growth, optimizing operations, and enhancing consumer engagement.\nNayax Israel is located in the prestigious Herzliya Hills, just a short drive north of Tel Aviv or a very short walk from the train station.\nOur open space offices accommodate our 400+ employees and when we’re not hard at work, you can find us enjoying an afternoon coffee on the balcony. We’re the largest Nayax site, housing over 20 different departments.\nFor a glimpse of what it's like to work at Nayax, check out our Instagram account! https://bit.ly/3G3QDc4.\nCheck out Nayax's page under \"Best Cool Israeli Companies 2022\" by Secret Tel-Aviv: https://bit.ly/3LqzElA.\nNayax is constantly growing and we are always on the lookout for enthusiastic, innovative and eager individuals to join us in our growth!Show more Report"}, {"company": "LiveU", "job": "QA Engineer", "city": "Kfar Saba", "date": "30d+", "rating": "4.4", "link": "", "description": "What’s LiveU\nLiveU is driving the live video revolution, providing live video streaming for TV, mobile, online and social media. Let your audience become part of your story with high-quality and flawless live video, transmitted from anywhere in the world, through the use of our patented bonding and video transport technology. LiveU creates a consistent bandwidth and a reliable connection so you can acquire, manage and distribute high-quality remote live broadcasts.\nLocation: Kfar-Saba, Israel\nWe're looking for a motivated and diligent QA engineer with at least 1 year of experience ,to join our growing team.\nYou will be working closely with cutting edge technology in a fun and dynamic environmentResponsible for the quality of the Core functionality of all LiveU's productsRepresent the QA discipline in a scrum team, create, review and execute manual and automated test plansFocal point for specific features from start to end of development\nRequirements:\n\nB.A degree in any field\nExperience in embedded system testing\nAt least 1 year of experience in a similar role\nLinux: system administration, networking and debugging\nOpen and flexible to work in an Agile culture\nFamiliarity with defects tracking systems and tests creation tools\n Cognitive and interpersonal skills\nIndependent and fast learner\nCuriosity, problem finding and solving skills\nEffectively communicates in a dynamic and fast-paced team\nExcellent communication skills in both Hebrew and English\nAdvantages:\nWorking with docker\nWorking with GIT\nISTQB certification or other QA course graduate\nBasic capability of scripts writingShow more Report"}, {"company": "Imomony", "job": "Manual QA Engineer", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "2.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=126&ao=1136043&s=58&guid=00000186e64138dca5381d1b475b8a99&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_3fbb444b&cb=1678900494865&jobListingId=1006775189270&jrtk=3-1-1grj490e0joq9801-1grj42ea0227a001-186af7b048d2367c-", "description": "We’re looking for magnificent, creative and curious Manual QA Engineer to join our great QA team\nQualifications:\nIf you have:\n\n2-3 years of experience in Manual testing from Internet / Online companies\nIn Client -experience / Server and Web security, Writing STP, STD and STR Documents\nFamiliarity and experience with SQL\nExperience working in an Agile / Scrum – an advantage\nExperience working around Linux / Unix- an advantageShow more Report"}, {"company": "קווליטסט", "job": "Manual QA Tester", "city": "Israel", "date": "30d+", "rating": "3.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=127&ao=1110586&s=58&guid=00000186e64138dca5381d1b475b8a99&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_e53332be&cb=1678900495976&jobListingId=1008451918422&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj491gs34av001-1grj42ea0227a001-112425d27b61c6e4--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNBh999vSCxEVZCJ4KPH77PMzjalCdn_JC5vsVZAxqHEYFDpDP224AHWdDn8pbxdx8TUCwYXRxLdNyrjFnW9N1cu2I_DJ-Sefe7yumbH6zXOnbmn-piW1hj5oQ9jrVSZuOtYy7Iwr1lGmivat4nbT-PAtgUQlpyXFQZ55ecXvKFVfge0DReBNSjdXrrNvbwSzyqtJDtYELD811WdZxcmOZEm61rySkCihf7tA1kE0TrkiNVmWQnBfbwOqcB9qmk0qeolG61LXkzHAN0WzKmh_ALG5KWiLnnSE0PvY--vQSCfJ4m04NwVYF9UjvSn2ZI219RjROuPpcfehYbI_vaiPDn0reRy50DwASu4dgpBYimwUi42hkKZ3pNiVbXG8hEQ9bLk0NpFLqniYDyfhFXYpbsGmPh0zeDScZC93PGCLY2UyvJtf7kcDNyxo__99RQoIO0U-mT8CfCKMuHnh5RVNfZ57mT9PlYVYHhzwRbInOQ4TmJXtC3HbxbstgxqgdLqy3ozIqxF-v3azbBRLqmFwUIh1Z3_4Eu2LNvBVsyaabUVoVkZ857LRXsT0svi5ow6VHfbj3RPKtdopd_k3vik-rFXLtqUztpf31PVQPTahm6QlXGWsaFbp5PXQmCMy73Q8kdZWLrRBDJROaLCWc4vh7K9Hh6GmVpEsvQ%3D", "description": "Qualitest is looking for a talented QA engineer to work with one of Israel's leading Defense industries. This position is located in Haifa At least one year of experience in QA system testing At least one year of experience Reading system requirements and writing tests according to them Quality Center or any other bug tracking tools Someone who is looking for a long-term job Testing and supporting development of precise guided munition products. Review and analyze system specifications as well as execute test cases (manual) and analyze results. Report bugs and errors to development teams and help troubleshoot issuesReport"}, {"company": "Munters", "job": "Manual QA engineer", "city": "Petah Tikva", "date": "30d+", "rating": "3.8", "link": "", "description": "Looking for the perfect job Climate? Come join us at Munters.\n\nOur controllers are the #1 product in the climate control and agriculture field.\n\nWe also keep our internal atmosphere worm and familial.\n\nIf this sounds interesting, your place is with us.\nWhat will you do?\nDesign and execute manual tests based on specifications\nRunning tests on a multidisciplinary product\nUse different testing techniques such as system, integration & API, UI testing\nUse bug tracking system, to submit, track and manage defects\nWrite test documents such as STP, STD, STR\nHelp troubleshoot issues\nDesired Skills and Experience\n2+ years of experience as a manual QA engineer\nAbility to self-learning and a passion for discovering & learning new things\nHigh level of English\nHigh attention to detail\nExcellent communication skills\nAdvantages\nQA Course\nFamiliarity with: bug tracking systems\nISTQB certification\nExperience in software quality assurance testing on a multidisciplinary system\nExperience in Agile development methodologies\nExperience in testing WEB applicationReport"}, {"company": "Medulla", "job": "לחברת סייבר סקיוריטי מעולה דרוש/ה QA Engineer", "city": "Israel", "date": "30d+", "rating": "3.7", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=129&ao=1110586&s=58&guid=00000186e64138dca5381d1b475b8a99&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_3f942e82&cb=1678900498103&jobListingId=1008333133789&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj493htma4r801-1grj42ea0227a001-88932f7fa52cc988--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tLyD-0efAv7tLflrpwFbiNDufml3-demlxrWTocDeqnLuRQe-DQ5bnAvAcHn54vgtf_DGPHmDN1pTZIW8Owc5T4MgAvo-_JAhEs7Oj1yWNZ4JSMXXuU4ao8gg4HglHnhVGP91EDUu4GwZ5tg3QZKCDEV7egyi8hGBqyFFQqQzb_oFDig1dPemYSDRDZuIhC6DmcC7s78HVXz5P2M0lAMlygKSjhY0LC8ThpMUfAUgl7JNTnfvdKHYfkyxhbewgVzaxHpwGPXa6rabWoS_bL8SgiINyYqfc1khYPFVqYb99js9xo040CYEoEOZ4i6r95jsSTQm4JWOQ935RynUTz2ZffQe99pypF7fNWuxRp5J8PtuJ4ZFxQ9wdFt5nrMttry-frMYiUcNlbHZaIU9kD6czF7UG45vsmj5GxhScl3se5C8dxFeLoPthSlRBJzh4R7OZ7R6lFa0g6go6qfLJdaGnK-7f_LUMvc79LTX0-BAeg6n7rbhnV__GWHH_Le-aUSXAuk93OJAI_Hpdq57PnrBQIYojCeWvDwCcH76X-mSUp7Xpa2csdyrX7lpEg46EMcpofXdqc5dXmBgkvHYDim4r_1EQU_iSnO1bfAOt8UO_JY1R2ssH3tMusXbcdFNb5lCvR8Ujn7khvU1kIq2rGqHhXQky93psiIg3wF89OvN4vvH3QXPWesvsU%3D", "description": "חברת סייבר סקיוריטי בתחום הרכבים האוטונומיים מחפשת QA Engineer למשרה מעניינת ומאתגרת המשלבת בדיקות ידניות ואוטומציה ועבודה על מערכות מורכבות. **משרה היברידית הממוקמת בהרצליה לפחות 3 ניסיון בבדיקות- חובה SQL- חובה ניסיון עם WEB- חובה הבנה במוצרי saas- azure, aws . דאטה בייס -יתרון משמעותי. ניסיון עם תשתיות אוטומציה וסלניום- יתרוןShow more Report"}, {"company": "אנטריפוינט", "job": "QA ENGINEER", "city": "Southern", "date": "29d", "rating": "3.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=130&ao=1110586&s=58&guid=00000186e64138dca5381d1b475b8a99&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_cef64fea&cb=1678900499755&jobListingId=1008470436895&cpc=AC285F3A3ECA6BB0&jrtk=3-1-1grj4956kjm5o801-1grj42ea0227a001-51bd15173f1c085a--6NYlbfkN0BOqqEOgXhlYR4G3B635Slk54T0Cmn-Zft61xKqT0v1tGRBbjy15RxGaEEw7KZU_HLkpz7fXyhUyZD4sCVu0vCr8HyXNusnycnLr-zB7we-orlGgtl7eYAW7MMS2beTTiH6RpRZuogsF0o6fJpG03JrOp2Lfeco-1hx1F8qMgWRfegnXClOffbhZpvauKR-cTMZsSP0xK23aGn5IzJz70xFbRHzcpVdztxzeDjhwD7qrLwCBmkOIdHoRc4UAEDoCZ_E3wFq0Cyt9bZkHYxhHsUgdPK7kBrN-GX7pVzeP7tWk3IzcOucoL8I31htXJXNrFGec_YrC0PITbCpJotequZ83B17_UHpC3KVAMzZZ7sVrYeXiFB3b0UoeWRc8hWBjsTiqX8vVw68whEtzWA-6_7hfafaYWVZZDKbUhCXa5TpiU-cH1DZ7U4-ibM3gux4tUgQMjlkTQo5uVwRT6T8STGFUAUlMhfwDvtYAaxjeKzC0u8IyOKzuJj5SZdr7MoGgZmzqge5oiBIPaQKsPs3kZaig3FqBZXAL_3Fc34EXqAgRcXmgbom6hSjpTubh7Fyba1FusPc5P5PutuE7-9FhlrdooJicE-0cJdxD51KHOZuCBP63nb8JF_lasWC16kZUBSL0BZTAonfXTqgp-FIe09hdkLbJoGz4l9W5AZiByxk4IxXqXIV6Qt40yKuJkfaPifgIHTRbFxrU8gTYoEMUQRnM4I9-xyYe0GtgtGCoF0G_A%3D%3D", "description": "לחברת מדיה הממוקמת בתל אביב דרוש/ה QA ENGINEER עם ניסיון ב WEB&MOBILE למשרה מלאה. 3+ ניסיון QA ידני ניסיון בבדיקות אתרים/וואב אפליקציות ניסיון בבדיקןת אפליקציות מובייל ניסיון בכתיבת מסמכי הבדיקות (STP, STD, STR)Show more Report"}]