[{"company": "Locusview", "job": "Talent Acquisition Specialist", "city": "Herzliya", "date": "13d", "rating": "4.0", "link": "", "description": "Locusview is a global growth stage SaaS startup in the digital construction management space that enables infrastructure organizations to scale execution and optimize their capital investments. Our platform leverages mobile, web, and hardware technologies to create guided workflows in the field and back offices to optimize safety and efficiency at all stages of long-cycle work from planning to execution and close-out.\nIn order for us to keep growing, we're looking to expand our HR Team and seek for a talented, creative and data driven Talent Acquisition Specialist to join us and become an integral part of our growth efforts!\nIn this role you will:\nManage the full lifecycle of hiring for multiple positions end to end both locally and globally.\nActively source top talents for our growing departments using several, innovative sourcing channels, both locally and globally.\nWork closely with hiring managers to identify the business needs, develop and implement hiring strategies to bring in “best in class” talents.\nBuild and maintain a strong talent pipeline for key positions while leading processes of tracing and developing new outreach opportunities and tools.\nJoin the HR team and be an active participant of our team’s initiatives such as welfare, employer branding, etc.\nWork closely with our employees to drive referral opportunities and make Locusview a “hiring organization”.\nRequirements:\n\n2+ years of proven Hands-on experience managing full life cycle recruitment at a fast paced environment (preferably startup companies).\nSignificant understanding of technical skills and requirements, deep understanding of the company's products and business needs.\nExperience conducting HR behavioral interviews for several positions.\nExperience utilizing several hiring tools (such as sourcing, LinkedIn campaigns, referral programs) to attract top talents.\nHigh understanding of Sourcing tools such as Boolean search, Recruiter etc.\nExcellent English&Hebrew level - both written and verbal.\nData driven, work well with data analysis and make data driven decisions\nExceptional interpersonal skills.\nAbility to multitask and prioritize workload.\nA passion for learning, proactive & Can-do attitude.Show more Report"}, {"company": "OTORIO", "job": "Global Talent Acquisition Specialist", "city": "Tel Aviv-Yafo", "date": "10d", "rating": "4.0", "link": "", "description": "Who we are:\nOTORIO is an end-to-end OT cyber security company whose proactive digital risk mitigation solutions are deployed at enterprises worldwide to protect business continuity and ongoing operations. Together with our partners, we provide comprehensive risk assessments, penetration tests and Incident response for various industries such as maritime, pulp and paper, Oil and Gas, and more, enabling our customers to effectively secure their digital transformations in converged OT-IT-IIoT networked environments. Our global team brings the extensive mission-critical experience of top nation-state cyber security experts combined with deep operational and industrial domain expertise.\nOur company prides itself on our ability to create value through collaboration and creativity in order to achieve the extraordinary. Everything we do is done with passion with a vision to change the future of the Industrial OT world, all while making customers our top priority.\nAs the Global Talent Acquisition Specialist, you will be responsible for managing the total hiring process on a global level for the organization. You will work closely with hiring managers and the HR team across different regions (mainly USA) to ensure the timely and effective hiring of qualified candidates. You will be responsible to develop strategies, manage the employer brand, and implement best practices that will help OTORIO attract top talent.\nKey Responsibilities:\nDevelop and implement global recruiting strategies to attract top talent across different regions\nWork with hiring managers to identify staffing needs, create job descriptions, and determine candidate qualifications\nSource and identify candidates through a variety of channels, including social media, referrals, and networking\nScreen resumes, conduct interviews, and assess candidates' qualifications, skills, and experience\nCoordinate and schedule interviews with hiring managers and other stakeholders\nEnsure a positive candidate experience throughout the recruitment process\nDevelop and maintain a pool of qualified candidates for future hiring needs\nUse data and analytics to track recruiting metrics, identify areas for improvement, and report on the effectiveness of recruiting efforts\nStay up-to-date on global recruiting trends and best practices, and share insights and knowledge with hiring managers and HR teams\nBuild and maintain strong relationships with candidates, hiring managers, and HR teams across different regions\nRequirements:\n\nBachelor's degree in Human Resources, Business Administration, or a related field\nMinimum of 3 years of experience in global recruiting from hi-tech companies\nStrong understanding of global recruiting practices and regulations\nExcellent communication, interpersonal, and relationship-building skills\nAbility to work independently and manage multiple priorities in a fast-paced environment\nStrong problem-solving and decision-making skills\nKnowledge of different sourcing techniques and tools\nAbility to work across different time zones and cultures\nStrong attention to detail and organization skills\nFluent English - writing and verbalShow more Report"}, {"company": "Foretellix", "job": "Talent Acquisition - Sourcing and Recruiting Specialist (Temporary Position)", "city": "Israel", "date": "7d", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=103&ao=1136043&s=58&guid=00000186e63db8868ae1ac31b3e65af8&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_633b69f6&cb=1678900198697&jobListingId=1008516655637&jrtk=3-1-1grj3vv6q2eor001-1grj3re8hi9he800-d27022a36be4e484-", "description": "About The Position\nWorking in a company that develops a revolutionary system for qualifying autonomous vehicles,\nwe are looking for a temporary replacement for the next 8 months, there may be a long-term option. We’re looking for someone enthusiastic about people, recruiting and sourcing, to help us keep growing and help continue to make Foretellix an excellent startup, with excellent people.\n﻿Main Activities:Be part of the autonomous vehicle revolution, and help change the world…Drive sourcing activities, including:\no Build a diverse talent pipeline through sourcing.\no Stimulate our pipelines to provide excellent candidates, from a variety of sources.\no Bring new initiatives to utilize new sources.\no Screen our candidates, CVs and job applications with various techniques.\no Attract and meet candidates by emails, phone interviews, face to face interviews and more.\no Work with Head-hunters, placement agencies, social networks, and more.Work closely with hiring managers throughout the recruiting process to understand deeply the position and the team’s requirements.\nRequirements\n3-5 years of experience as a sourcing, staffing, and hiring specialist, focusing on SW positions in the high-tech industry. Startup environment experience is preferred.Experienced in effective sourcing platforms and tools, including Boolean searches, LinkedIn Recruiter, Facebook, and more.BSc in Human Resources, or equivalent.People person and a team player with excellent interpersonal and communication skills.Proficient with MS Office, Gmail, etc.Experience with hiring software such as Comeet, Noviopus, or others.Excellent verbal and written communication skills, in Hebrew and English.Experienced and fluent with phone/Zoom interviews, f2f interviews, and referral interviews.Resourceful, professional, can-do attitude.\n﻿Advantages:\no Working at high-tech companies, within a recruiting team.\no Having natural networking capabilities.\no Experienced with recruiting at Europe & USA.Show more Report"}, {"company": "Connecteam", "job": "Technological Talent Acquisition Specialist", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.7", "link": "", "description": "On Connecteam's HR team, we work on the front lines of our company's growth. We believe in insatiable curiosity, unique perspectives, and raw talent. We're looking for this in you and each candidate you'll bring through our door. As an ambassador to our candidates, you'll live and breathe our values, expertly communicate our mission and work in lock-step with our hiring managers and interview teams.\n\nWhat You'll Do\n\nUsing social media (LinkedIn, Facebook, etc.) for proactive sourcing and advertising Jobs.\nIdentify ways to improve our recruiting process.\nMaintaining good quality talent pipeline.\nDevelop and maintain innovative sourcing channels and recruitment campaigns.\nWorking closely with hiring managers at the R&D department to understand their goals and needs.\nProviding a first-class candidate experience.\n\nRequirements\n\nSourcing experience for R&D Positions.\n2+ years of experience in R&D recruiting from a Technical Recruitment Agency - must\nGreat learning capabilities.\nAbility to communicate across all levels of the organization as well as externally.\nAbility to understand relevant skills and target non active candidates.\nTeam Player\nRecruitment must be your passion:)\nJoining Connecteam Is The Smart Move:\nWe build our people up. Every team member is treated as a long-term investment and we recognize the value in always nurturing and training them so they can go above and beyond in their skills and job duties.\nWe make an impact on our customer's business. We are on a mission to provide managers of all business types and sizes with the tools they need to communicate, operate, engage, and run their deskless workforce. Our product offers them an effective and affordable solution to run their business.\nWe get the job done. Connecteam employees are passionate in executing their job duties so they can drive the company forward and provide real value to our customers.\nWe have fun! From weekly happy hours to holiday parties, we always enjoy each other's company (and good food, of course). Connecteam is like one big, happy family!\nEveryone is welcome. Connecteam is committed to building an encouraging, caring, and supportive environment. We share a responsibility to support our team and enrich their lives.\nTogether we will shape the future of work!Report"}, {"company": "Motorola Solutions", "job": "Junior Talent Acquisition Specialist - Israel", "city": "Tel Aviv-Yafo", "date": "8d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=105&ao=1136043&s=58&guid=00000186e63db8868ae1ac31b3e65af8&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b4061292&cb=1678900202766&jobListingId=1008514109441&jrtk=3-1-1grj4036ckhrc801-1grj3re8hi9he800-e7ca763572ef74e3-", "description": "Company Overview\nAt Motorola Solutions, we believe that everything starts with safety.Its the constant that empowers people to confidently move forward. It can fill a flight or sell out a stadium. It can care for a patient or graduate a class.\n\nAs a global leader in public safety and enterprise security, we create and connect the technologies that help to keep people safe where they live, learn, work and play. Our integrated technology ecosystem unifies critical communications, video security and access control, and command center software, enabling collaboration in more powerful ways.\n\nAt Motorola Solutions, were ushering in a new era in public safety and security. Bring your passion, potential and talents to a career that matters.\n\nDepartment Overview The EMEA Talent Acquisition organization supports all hiring countries in Europe, Middle East and Africa comprising nearly 40 possible hiring locations. The largest recruiting locations include Poland, Germany, Israel, and the United Kingdom.\nThis role is based in Tel Aviv, Israel and is reporting to the EMEA Talent Acquisition Leader.\nJob Description\nIn this position, the Recruiter will\n\nBe responsible for meeting recruiting needs as reflected in requisition requests and conducting associated strategic hiring plans for Israel and EMEA Region.\n\nBe supporting local campaigns through knowledge sharing, best practice, personal experience and market awareness.\n\nBe driving consistency of brand messaging externally .\n\nSupport external sourcing initiatives e.g. universitygraduate recruitment, career fairs etc.\n\nProvide subject matter expertise to hiring communities around the total endtoend staffing solution.\n\nSupport vendor management for key locations or functions.\n\nPerform other tasks on request.\n\nBasic Requirements\n1 year of experience in a recruitment role\n\nExcellent communication skills.\n\nAbility to work independently and efficiently.\n\nFluent English and Hebrew.\n\nAbility to work with stakeholders at all levels of the organization.\n\nPassive candidate sourcing experience.\n\nTravel Requirements\nRelocation Provided\nPosition Type\n\nReferral Payment Plan NoShow more Report"}, {"company": "TangoMe", "job": "Global Talent Acquisition Specialist", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=106&ao=1136043&s=58&guid=00000186e63db8868ae1ac31b3e65af8&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ce623500&cb=1678900204019&jobListingId=1008461518510&jrtk=3-1-1grj404cvjm4g801-1grj3re8hi9he800-7e357c68e9b3f4ce-", "description": "DESCRIPTION\nTango is a successful, market leader, a live-streaming Platform with 450+ Million registered users, in an industry projected to reach $240 BILLION in the next couple of years.\nThe B2C platform, based on the best-quality global video technology, allows millions of talented people around the world to create their own live content, engage with their fans and monetize their talents.\nTango live stream was founded in 2018 and is powered by 350+ global employees operating in a culture of growth, learning, and success!\nThe Tango team is a vigorous cocktail of hard workers, creative brains, energizers, geeks, overachievers, athletes, and more. We push the limits to bring our app from “one of the top” to “the leader”.\nThe best way to describe Tango's work style is not to use the word “impossible”. And we believe that success is a thorny path that runs on sleepless nights, corporate parties, tough releases, and of course our users' smiles (and as we are a LIVE app, we truly get to see our users all around the world smiling right in front of us in real-time!).\nDo you want to join the party?\nRESPONSIBILITIES\nManage the full cycle of the global recruiting process in our global sites as: Kyiv, Cyprus, Poland, and Dubai.\nSupport global hiring managers to build high-performance teams and partner wherever needed\nDevelop relationships across multiple teams and influence management on hiring decisions\nLeverage multiple sourcing strategies and channels, including internal referrals, to provide high-quality candidates for open positions\nIdentify, engage, and secure top talent, including passive and active candidates\nScreen incoming technical resumes, interview and qualify candidates, facilitate assessment exercises, and advocate for candidates to hiring teams\nBe knowledgeable about our business and be on point for HR-related questions (i.e. benefits, comp, etc.)\nWork to improve upon existing programs and develop global innovative strategies around finding our future team\nProvide excellent customer service to our hiring teams on all sites and ensure a seamless candidate experience for all potential candidates\nREQUIREMENTS\nRussian, Hebrew, and English- MUST. Fluent verbally and written.\nBachelor's degree required\nMinimum of 2 years of experience in full life-cycle global recruiting and sourcing experience in High-Tech companies, preferably in the tech space\nExperience with recruiting candidates from Eastern European countries, an especially Russian speaker\nStrong ability in using Google Suite (Google Sheets, Google Docs, and Google Slides, in particular)\nExperience in Comeet- big advantage!\nAdaptability – utilizes a flexible approach to managing competing priorities and stakeholders, and stays focused and organized in a fast-paced work environment\nTime management and prioritization skills to ensure assigned responsibilities are completed in an efficient manner.\nCommunication skills (presentation, verbal, written, etc.); is able to effectively communicate to all levels of management, both internally and externally\nProven background in using innovative research and proactive sourcing methods\nAbility to act as a consultant through the hiring process, immigration, compliance, compensation, leveling guidelines, etc.Show more Report"}, {"company": "RYB Technologies", "job": "Talent Acquisition Specialist 500189", "city": "Israel", "date": "30d+", "rating": "5.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=107&ao=1136043&s=58&guid=00000186e63db8868ae1ac31b3e65af8&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_cf6dccb4&cb=1678900205173&jobListingId=1007259511837&jrtk=3-1-1grj405h2klvh801-1grj3re8hi9he800-8c89a51272265610-", "description": "A leading ERP software company is searching for a Talent Acquisition Specialist. This is an exciting opportunity for an independent, out of the box thinker, to join a small, growing human resources team focused on finding the best talent.\nJob Responsibilities:\nManage the full end-to-end recruitment cycle for positions located mainly in Israel, and for global positions as needed.\nPost job descriptions, filter resumes, conduct face-to-face, remote, and telephone interviews, evaluate candidates, and make recommendations for next-steps.\nSource and attract candidates on LinkedIn and other social networks.\nUtilize recruitment platforms and internal database to identify talent.\nRecruit on recruiting platforms and collaborate with outsourcing companies.\nRecruit for a range of positions in the software field, including, but not limited to software developers, project managers, customer service and support.\nDaily communication with hiring managers to understand specific needs and requirements.\nRequirements:\nBachelor's degree in social sciences or relevant field - required\nProven technical recruitment experience required\nStrong understanding of technical positions and concepts\nExperience sourcing and managing candidate pipelines on LinkedIn and other recruitment platforms\nQualifications:\nAbility to learn quickly\nDiligent and detail-oriented work methods\nStrong communication skills\nHighly loyal, with the ability to keep discreet information confidential\nAbility to work independently and within a small team\nAbility to changes direction quickly, multi-task, and work in a fast-paced environment\nGood command of English and the ability to interview in English - an advantage\nThis is a full-time position, with flexible hours and the possibility to work in a hybrid model\n(4 days in office and 1 day remote)\n\nSend cv to jobs@rybtech.comShow more Report"}, {"company": "Adidas", "job": "Talent Acquisition Specialist - Retail (External)", "city": "Holon", "date": "9d", "rating": "4.0", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=108&ao=1136043&s=58&guid=00000186e63db8868ae1ac31b3e65af8&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ef31db9a&cb=1678900206309&jobListingId=1008511960229&jrtk=3-1-1grj406juklu7801-1grj3re8hi9he800-02db61fd6fc7e38f-", "description": "Purpose:\nThis position will take both operational and strategic roles to support the continuing growth of the market through attracting and acquiring top talent, within Retail division and back office. The position will partner with hiring managers to anticipate and meet the evolving needs of the organisation to deliver the best talent to the organisation.\nKey Responsibilities:\nDevelop and implement strategic sourcing initiatives for recruiting diverse talent.\nOwnership of the entire recruitment process including requisition approval, hiring manager briefing, job advertising, candidate sourcing, application review, candidate screening, interview, reference/background checks and offer process.\nBuild strong working relationships with HR and Hiring Managers.\nHighlight trends and themes discovered by working with internal customers, talking to candidates and staying on top of market trends.\nDevelop and execute assessment centres for high volume hiring for our retail division.\nLeverage candidate databases (internal and external) to identify prospective candidates to create awareness and invite them to apply for open positions including cold calling prospects.\nProvides coaching and advice to candidates and hiring managers throughout the interview process.\nConduct weekly check-ins with active candidates and hiring managers throughout the entire recruiting process for each role.\nBuild and maintain candidate pools of strong former candidates and new prospective candidates and build proactive talent pipelines.\nUtilize recruitment systems effectively following key standards, documenting key actions and ensuring all data is accurate for reporting purposes.\nSupport planning and gathering information for quarterly review meetings with key customers that will provide an overview of recruiting achievements as well as opportunities to improve hiring performance moving forward.\nPlan and participate in strategic planning meetings with key business partners to understand current and upcoming requirements in order to build a plan on how to effectively recruit for positions.\nSupport additional recruitment initiatives as needed.\nStay abreast and current on latest recruiting and industry trends to continuously evolve candidate pipe line and service levels.\n\nKnowledge, Skills and Abilities:\n\nAbility to multi-task and prioritize workload in a fast paced environment.\nStrong interpersonal and relationship building skills.\nStrong written and verbal communication skills.\nAbility to manage change with ease and flexibility and influence hiring behavior.\nAbility to set clear goals and deliver into key objectives with minimal supervision.\nGood ability to understand business needs and assess talent against those needs.\nAction oriented and proactive approach to working with hiring managers, HR teams and candidates at all levels of the company.\nEnd to end recruitment experience at a variety of levels.\nPassionate about recruiting top talent demonstrated by high level of energy, positive & upbeat attitude.\nProven ability to use behavioural interviewing techniques.\nAbility to exercise good judgment and decision making skills. Able to manage confidential and sensitive information and use appropriately.\nStrong organization, multi-tasking and follow-up skills in order to manager high volume recruitment.\nAdvanced MS Office skills and experience in applicant tracking systems\nAbility to communicate effectively in Hebrew and English, both written and oral.\n\nMinimum Qualifications:\n\nRelevant University degree\nMinimum of 4 years’ experience in Talent Acquisition specifically In retail field hiring\nTrack record for delivering high impact customer experiences\nStrong proficiency with technology and grasping new technology solutions\nTrack record of driving globally recruiting initiatives (i.e. proactive recruiting, internal recruiting, diversity, etc) and achieving goals\nDemonstrated ability to drive holistic recruitment strategy (i.e. employer branding, social recruiting, etc.)\n\nAT ADIDAS WE HAVE A WINNING CULTURE. BUT TO WIN, PHYSICAL POWER IS NOT ENOUGH. JUST LIKE ATHLETES OUR EMPLOYEES NEED MENTAL STRENGTH IN THEIR GAME. WE FOSTER THE ATHLETE’S MINDSET THROUGH A SET OF BEHAVIORS THAT WE WANT TO ENABLE AND DEVELOP IN OUR PEOPLE AND THAT ARE AT THE CORE OF OUR UNIQUE COMPANY CULTURE: THIS IS HOW WE WIN WHILE PLAYING FAIR.\nCOURAGE: Speak up when you see an opportunity; step up when you see a need..\nOWNERSHIP: Pick up the ball. Be proactive, take responsibility and follow-through.\nINNOVATION: Elevate to win. Be curious, test and learn new and better ways of doing things.\nTEAMPLAY: Win together. Work collaboratively and cultivate a shared mindset.\nINTEGRITY: Play by the rules. Hold yourself and others accountable to our company’s standards.\nRESPECT: Value all players. Display empathy, be inclusive and show dignity to all.\n\nADIDAS CELEBRATES DIVERSITY, SUPPORTS INCLUSIVENESS AND ENCOURAGES INDIVIDUAL EXPRESSION IN OUR WORKPLACE. WE DO NOT TOLERATE THE HARASSMENT OR DISCRIMINATION TOWARD ANY OF OUR APPLICANTS OR EMPLOYEES. WE ARE AN EQUAL OPPORTUNITY EMPLOYER.\n\nJOB TITLE:\nTalent Acquisition Specialist - Retail (External)\nBRAND:\nadidas\nLOCATION:\nHolon\nTEAM:\nHuman Resources\nSTATE:\nM\nCOUNTRY/REGION:\nIL\nCONTRACT TYPE:\nFull time\nNUMBER:\n495142\nDATE:\nMar 6, 2023Show more Report"}, {"company": "Via", "job": "Talent Acquisition Specialist", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.9", "link": "", "description": "Via is using technology to transform transportation around the world. From changing a single person's daily commute to reducing humanity's collective environmental footprint — we've got huge goals.\n\nAs a Talent Acquisition Specialist at Via, you'll play a direct role in growing, scaling, and operationalizing the talent processes that are the cornerstone of Via's success. As a people first organization, you will work in partnership with hiring managers to find the very best candidates for a variety of business functions, implementing thoughtful and creative strategies to engage top talent in markets around the world. As Via continues to scale, you will play a critical role in building the foundation of our talent strategy.\n\nWhat You'll Do\n\nPartner with hiring managers to understand their hiring needs, helping to create and implement strategies for candidate outreach.\nProactively map, track, and source top talent across major US markets; leveraging your strong research skills, you'll become a subject matter expert in industry trends and complex talent searches.\nBe laser focused on creating a best-in-class candidate experience throughout the interview experience\nDevelop robust internal processes to optimize the efficacy, agility and impact of the strategic growth function\nMake data-driven decisions, using relevant metrics to assess the effectiveness of your sourcing strategies and demonstrate results.\nLead top-of-funnel outreach initiatives for candidates across business functions\nConduct initial conversations and preliminary interviews with candidates across teams and functions.\nChampion our team's commitments to AD&I in all aspects of your work.\n\nWho You Are\n\nIntellectually curious, collaborative, and eager to grow in a fast-moving People Operations function.\nResults-driven; you're motivated to meet and exceed your goals.\nReliable, independent, and able to manage high-priority projects in a fast-paced environment.\nA savvy, tactful, and graceful communicator – you intuitively find the right tone in every situation, and enjoy working with others.\nAnalytical and innovative; you're a natural problem-solver, and you approach new challenges with creativity.\nTechnically savvy; you may already know some Boolean operators, and you're excited to explore new platforms.\nExcellent English speaker and writer\n\nWe're Via, and we build technology that changes the way the world moves. We pioneered the TransitTech category to ensure that the future of transportation is shared, dynamic public mobility — the kind that reduces carbon emissions across congested cities, minimizes reliance on private cars, and provides everyone with accessible, efficient, and affordable ways of getting around.\n\nWe created the first end-to-end TransitTech solution for cities and transit agencies, offering world-class software, service design, and operational expertise to fundamentally improve the way the world moves.\n\nVia was founded with the guiding principle that we go further when we go together. We are dedicated to building a diverse, inclusive and authentic workplace. If you're excited about this role but your past experience doesn't align perfectly with every qualification in the job description, we encourage you to apply anyways. You may be just the right candidate for this or other roles. All backgrounds, identities, and voices are welcomed and celebrated at Via.\n\nReady to join the ride?\n\nVia is an equal opportunity employer.Show more Report"}, {"company": "AKT", "job": "Talent Acquisition Specialist - Israel Based", "city": "Israel", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=110&ao=1136043&s=58&guid=00000186e63db8868ae1ac31b3e65af8&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_51e169dd&cb=1678900208954&jobListingId=1007687382405&jrtk=3-1-1grj4096gk6e5801-1grj3re8hi9he800-2c73b2a55c88d35d-", "description": "As one of the largest SAP Cloud People Solutions consultancies in the EMEA region, AKT is hiring for Talent Acquisition Specialist.\nThis is an onsite position - our offices are located in Azrieli Center Holon, Israel\nKey Responsibilities\nManage recruiting lifecycle activities including attraction, sourcing, interviews, selection and offer preparation\nAnnual manpower planning and forecasting\nAttract potential candidates on social media and through professional networks\nSupport staff augmentation processes\nMaintain company’s talent pool\nOwn, maintain and update the records in SuccessFactors Recruiting module\nNetworking with relevant talent, globally\nJob Requirements\n3-5 years of experience as a Talent Acquisition specialist\nProven experience of managing talent acquisition processes in consulting / professional services companies - a huge advantage\nProven experience of managing talent acquisition processes for IT positions - an advantage\nProven experience of managing talent acquisition processes in global companies\nStrong reporting, action management capability\nLanguage skills: Hebrew and English (business fluent). Other languages - an advantage\nPersonal Skills\nOrganized, being able to multitask, prioritize tasks and meet deadlines\nAnalytical and capable to exercise sound judgment\nHands-on and detailed oriented\nAutonomous and capable of take proactive action with little or no direction\nExcellent written and oral communication and interpersonal skills\nTeam player with strong commitment to accomplish tasks and goals\nAKT offers\nStimulating and collaborative working environment\nInternal knowledge transfer, training and coaching\nInternational business environment (offices in Israel, UK, Germany, France, India and Czech Republic)Show more Report"}, {"company": "JobInfo", "job": "Talent Acquisition Specialist**", "city": "Central", "date": "30d+", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=111&ao=1136043&s=58&guid=00000186e63db8868ae1ac31b3e65af8&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_cb856776&cb=1678900210260&jobListingId=1007429168781&jrtk=3-1-1grj40admkhor801-1grj3re8hi9he800-2288f18173bcdfea-", "description": "Job Description:\n•Manage end to end recruitment Processes- CV screen, phone interviews, HR interviews, reference checks, salary offers and contracts.\nCreatively recruit top-notch candidates and maintain a strong pipeline of talent while executing a meaningful candidate experience.Develop and maintain innovative sourcing channels and recruitment campaignsWork closely with hiring managers in order to build and facilitate the best hiring processes.Develop strong and effective partnerships with relevant vendorsOngoing HR support including on-boarding and off-boarding support\nAdditional Positions:\nCategory:\nHuman Resources\nJob Qualifications:\nThis position will be responsible for sourcing, recruiting, screening, and recommending placement of applicants for all positions throughout our site. The Talent Acquisition Specialist will be a valuable contributor to the growth of the organization.\n\n3+ years of experience as a Talent Acquisition Specialist.\nProven experience in recruiting E2E positions for R&D, Product, Marketing, etc.Proven sourcing skills and experience with recruiting databases and Social Media platforms\nExcellent interpersonal and communication skillsSelf-sufficient and able to work independentlyA team player and always looking to improve the department/companyExcellent organizational and collaboration skillsExcellent verbal and written communication skills in Hebrew and English\nA Bachelor’s degree in business, psychology, organizational behaviour, or related fieldsShow more Report"}, {"company": "Edwards Lifesciences", "job": "EIIC HRBP - Maternity Leave Replacement", "city": "Israel", "date": "6d", "rating": "4.1", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=112&ao=1136043&s=58&guid=00000186e63db8868ae1ac31b3e65af8&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_2c45e63a&cb=1678900211273&jobListingId=1008517357539&jrtk=3-1-1grj40bg82hsa001-1grj3re8hi9he800-40c69e2c6ae7576b-", "description": "Edwards is a global leader in patient-focused medical innovations for structural heart disease, as well as critical care and surgical monitoring.\n\nLocation: Caesarea\nScope: Full time (maternity leave replacement)\nReports to head of HR, Israel\n\nKey Responsibilities :\nProvide on-going, daily support to the site HR Leader for human resources processes and projects.\nAct as the first point of contact for HR inquiries, identifying and delivering solutions to employees and team leaders. Provide HR consultation on the company's processes such as performance, development etc.\nResponsibility for the full employee life cycle, Own and support onboarding to offboarding, including internal moves.\nRecruitment: Work with local managers & local recruiter to define job descriptions, profiles & recruitment process. Conduct HR interviews, negotiate terms of employment with candidates.\nData Management – Maintaining employee files, performing regular system audits, managing all HR systems, ensure compliance, maintain data up to date.\nAnalyze data trends and metrics. Keep up to date with market situation and regularly monitor development of local labor market.\nPartner with Corporate Global Mobility, Compensation and other COE’s\n\nEducation and Experience:\nBachelor's Degree in Behavioral Sciences or Business Administration (with specialization in HR)\nMinimum 3 years' experience as HRBP/HR Specialist in a global company\nExtensive knowledge and understanding of HR functional areas including Talent Acquisition, Compensation, Benefits, Payroll, Welfare, Training and Organizational Development\nStrong talent assessment skills. Proven experience in hiring and retaining employees.\nDemonstrated experience in a global work environment, Matrix work experience - an asset.\nFluent in Hebrew and English - Written and Verbal\nKnowledge of Israeli labor law.\nProven expertise in usage of MS Office Suite and HR systems. Experience with Workday -an advantage.\n\nCompetencies:\nAbility to advise employees and managers, Ability to build and maintain strong relationships across the organization.\nHighly proactive with \"can do\" mentality, willing to roll up the sleeves.\nwell organized, methodological, accurate and able to work fast, Capable at organizing and structuring work, strong operational focus.\nResilient, self-directed, independent, with sound judgment,\nAbility to prioritize and manage multiple projects.\nDemonstrated experience prioritizing conflicting demands from multiple stakeholders.\nData driven with solid analytical skills .\nExcellent written and verbal communication skills and interpersonal skills.\n\nAbout Edwards Lifesciences\n\nEdwards Lifesciences is the global leader in patient-focused medical innovations for structural heart disease, as well as critical care and surgical monitoring. Driven by a passion to help patients, the company collaborates with the world’s leading clinicians and researchers to address unmet healthcare needs, working to improve patient outcomes and enhance lives. Headquartered in Irvine, California, Edwards Lifesciences has extensive operations in North America, Europe, Japan, Latin America and Asia and currently employs over 13,000 individuals worldwide.\n\nFor us, helping patients is not a slogan - it’s our life’s work. From developing devices that replace or repair a diseased heart valve to creating new technologies that monitor vital signs in the critical care setting, we focus on helping patients regain and improve the quality of their life.\n\nCOVID Vaccination Requirement\n\nEdwards is committed to complying with the requirements and guidance from our government authorities and to protecting our vulnerable patients and the healthcare providers who are treating them around the world. As such, all Healthcare Interacting positions require COVID-19 vaccination, which includes anyone who directly interfaces with patients and those who interact with healthcare providers as part of their role. If hired, as a condition of employment, you will be required to submit proof that you have been fully vaccinated for COVID-19, unless you request and are granted a medical or religious accommodation for exemption from the vaccination requirement. This vaccination requirement does not apply in countries where it is prohibited by law to impose vaccination. In countries where vaccines are less available, or other requirements exist, we may institute alternate measures that optimize patient safety and healthcare provider safety, which may include regular COVID testing or specific masking requirements.\n\nFor United States Applicants Only:\nEdwards is an Equal Opportunity/Affirmative Action employer including protected Veterans and individuals with disabilities.\nKnow your Rights: Workplace Discrimination is Illegal Poster\nDisability accommodation for employment applicants\nEdwards E-Verify\nFamily and Medical Leave Act (FMLA)\nEmployee Polygraph Protection Act (EPPA)\nPay Transparency NoticeReport"}, {"company": "", "job": "Talent Acquisition Specialist", "city": "Israel", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=113&ao=1136043&s=58&guid=00000186e63db8868ae1ac31b3e65af8&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_95b1b3ab&cb=1678900213207&jobListingId=1007379290829&jrtk=3-1-1grj40db2gfqc801-1grj3re8hi9he800-b7d2342e0b632305-", "description": "Work from home (office in Jerusalem)\n\nYou are:\n\nA recruitment professional with a passion for people with the skills to spot great talent. You understand the complexities and nuances of others and can evaluate facts versus opinions. You like to push yourself out of your comfort zone to achieve greatness. You’re tech-savvy and analytical and love learning new technologies and tools. You’re a critical thinker, able to see how we can improve ourselves and our challenges as a department and team. You’re creative, forward-thinking, resourceful, solutions-oriented, and desire to make a strong impact. You are a self-starter and are an auto-didact. You can multitask and juggle multiple projects at the same time with ease. You’re able to thrive in fast-paced high performing environments, can work under tight deadlines, and enjoy this challenge. You have fluent level English and strong conversational Hebrew to communicate with both Israelis and internationals, to give your opinion, and listen to others in a collaborative environment.\n\nWe are:\n\nThe HR team, working hard to attract, retain and invest in the best talent there is to drive our rapid growth. We are responsible for making sure the company is functioning and continuing to grow while maintaining our core values. We work closely with our managers and employees to continue to create a positive work environment and employee experience. We’re passionate about people; we listen to what is wanted, what is needed, and what makes others feel fulfilled and happy as part of an organization. We are striving to create a truly innovative HR team and process.\n\nYou will:\nManage end to end recruitment for tech roles while having a key part in our company growth as we scale\nAct as the first point of contact for candidates, reviewing candidate CVs, conducting Zoom interviews, to managing offers and contract negotiations\nWork closely with hiring managers to identify their needs for job requirements, position processes, and candidates in the pipeline and give your recommendations and guidance\nEnsuring smooth processes and positive candidate experiences along the way\nManage our ATS system to track candidates, adding valuable data and insights for each position you own\nAssist with our employer branding and recruitment campaigns to target talent, bringing creativity and ideas to the table, including using analytics and metrics to optimize conversion\nRecruit candidates through various methods and channels, via social media, events, conferences, etc\n\nYou have:\n2+ years relevant experience, including 1 year as an in-house Recruiter\nExperience in sourcing, qualifying candidates, building pipelines, and managing the entire interview process\nCreative recruitment marketing strategies and ideas, ways to build our brand and add value to our social media presence\nUnderstanding of metrics and data\nExcellent communication and negotiation skills\nFluent English and strong conversational Hebrew\n\nIt’s a bonus if you have:\nExperience recruiting for R&D roles\nExperience from a Hitech or software company\nWorked with Comeet ATS\n\nTell them you heard about the position from Nefesh B’Nefesh. Please do not repost position.Report"}, {"company": "JobInfo", "job": "Technical Talent Acquisition Specialist", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "3.3", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=114&ao=1136043&s=58&guid=00000186e63db8868ae1ac31b3e65af8&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_ed69bcbc&cb=1678900214267&jobListingId=1007346702304&jrtk=3-1-1grj40edekcl9801-1grj3re8hi9he800-cb8bbad70f9dd959-", "description": "Job Description:\nTalent Acquisition Partner will\n\nBe responsible for Building and Managing the full life cycle of the hiring process,\nWork closely with and advise the leadership team on everything from profile the best candidates to design the hiring process.\nBe responsible for assessing the best talents by conducting an in-person interview.\nCreate top-notch talent pipelines by using innovative talent acquisition channels\nFind and engage passive candidates through the use of various sourcing techniques.\nCreate and maintain an excellent Candidate experience.\nAdditional Positions:\nCategory:\nHuman Resources\nJob Qualifications:\nPassion for recruiting!\n\nFrom sourcing to extending offers,\nAt least 2 years of talent acquisition experience in high-tech environment, with the ability to understand relevant tech skills, target companies, and be connected to the HR and Recruiting communities.\nExperience in sourcing including building new and creative sourcing strategies.\nExperience in conducting HR interviews and candidates assessment,\nMulti-tasking ability and desire to work in a dynamic and startup mentality.\nCreative, friendly, and outgoing personality, strong team player, positive, and can-do approach\nExperience in managing cross-functional projects and events\nHigh level of English - written and verbal.Show more Report"}, {"company": "ThriveDX (formerly Hacker U)", "job": "SEO Specialist", "city": "Ramat Gan", "date": "19d", "rating": "", "link": "", "description": "Are you an innovator in Search Engine Optimization? Are you looking for an opportunity to drive SEO with a world class marketing team? Do you prefer to work with like-minded people and cutting edge products?\n\nIf so, let us introduce you to ThriveDX.\n\nThriveDX (formally known as HackerU) is a Global leader - on the cutting edge of digital skills training and transformation. For more than a decade, we have trained thousands of industry experts as well as governments, military, intelligence, law enforcement agencies and top tier enterprises.\n\nOriginally founded within Israel's vibrant high-tech ecosystem, ThriveDX brings a depth of experience and knowledge to partner with continuing education programs, preparing learners and helping them gain employment in a rapidly growing digital workforce.\n\nFrom top universities like University of Miami, University of Michigan, New York University and California State University - we provide a turnkey solution that propels students into meaningful careers. Through these partnerships ThriveDX is working to uplift learners of all socio-economic backgrounds to close the global digital skills gap one student at a time.\n\nOverall Objective\n\nThe experienced and results-driven SEO Expert will join our awesome team and be responsible for setting up, implementing and managing the overall company's SEO strategy. This role will work closely with the Senior SEO Manager and cross functionally with each department to develop the strategy and implement execution of programs designed to support strategy. We are expecting you to have experience developing processes for high growth organizations with the ability to build and lead a team of proven marketing professionals. The ideal candidate will be an individual with a strong analytical mindset, who is knowledgeable and strategic.\n\nYour Role:\n\nWorking alongside the Senior SEO Manager, assist with the development and execution of organic optimization strategies to increase the company's search engine results ranking.\nWill be responsible for the on-site and off-site SEO, including link building.\nWorking closely with the content team on content needs, optimization and pillar pages creation. Owning and managing all of our websites.\nWork with the design, web development and content teams on a variety of projects and initiatives.\nExperience with landing pages, quick loading and working closely with the development team to achieve a successful user experience.\nWill conduct conversion rate optimization (CRO) and A/B testing.\nWork cross functionally with other members of the marketing team to achieve alignment across the department and manage SEO initiatives.\nWork closely with the content team to update websites for maximum optimization and search engine rankings.\n\nOur Ideal Candidate:\n\n3+ years working for a mid-sized company with a national or multi-state footprint\nIdeal candidate will have a data driven approach (ranking, traffic) and be able to create reports, dashboards and/or performance analysis\nFamiliarity with User Experience\nExperience with heatmaps software\nExperience in a management role a plus, must be willing to be hands on\nYouTube video optimization experience\nExperience with Quora & Reddit\nKnowledge of SEO industry tools (Google Analytics/Search Console, Ahrefs, SEMrush, Wordpress)\nComfortable analyzing high volumes of data on a daily basis\nExcellent written and verbal communications skills\n\nCore Values\n\nDifferent is Good - At ThriveDX, we are a diverse, global family of lifelong learners, innovators, and education advocates.\n\nCommunity is Everything - Passion, enthusiasm, and support is interwoven into the fabric of our growing community of lifelong learners.\n\nWe Courageously Make Change- We're not afraid to ask the big questions and then work to create the solutions.\n\nWe deliver on our Promises - We hold ourselves accountable for all that we do, for every partner we serve and every learner we support.\n\nExcellence is the only Option- Because we are passionate about education, technology, and advancement for our global community, we expect nothing but the very best from ourselves, our products, and the experiences we provide.\n\nHiring Process\n\nThe initial conversation will be a zoom interview with a member of our talent acquisition team for 30 minutes.\nFollowed up by a 30 minutes zoom interview with a team member from the Marketing\nA 30 minute zoom interview with the hiring manager for the role\nA 30 minute zoom interview with the CEO\n\nOur Offer\n\nCompetitive benefits package: Medical, Dental ,Vision, 401k (employer match), Paid-time off, Volunteer Time off, 100% remote\n\nYour Success is our Success\n\nIf you are an exceptional team player who is ready to break down walls and forge into uncharted territories, if you want to lead a team of ambitious, passionate and like-minded individuals, then this role and this company is for you!\n\nIf you are a Self-starter with a \"deploy on day one\" mindset who has the confidence and ability to bring substantial value to the organization on an immediate and continued basis, you are the perfect match for us.\n\nWe are a group, a family, dedicated to changing-lives with a \"Work hard – Play hard\" attitude, who value individual contributions towards the collective goal and we cannot wait to meet the next member of our team! (and YES, we mean you)Show more Report"}, {"company": "Boston Scientific Corporation", "job": "Engineer Student", "city": "Israel", "date": "9d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=116&ao=1136043&s=58&guid=00000186e63db8868ae1ac31b3e65af8&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_b63629d1&cb=1678900217057&jobListingId=1008511723206&jrtk=3-1-1grj40h3mkuie801-1grj3re8hi9he800-593e86a4e8e42549-", "description": "Engineer Student\nBoston Scientific's hybrid workplace includes remote and onsite roles. By applying to this position, you will have the opportunity to discuss your preferred working location with your Talent Acquisition Specialist.\nRemote Eligible:\nOnsite Location(s):\nYokneam, Z, IL\nAdditional Locations: Israel-Yokneam\nDiversity - Innovation - Caring - Global Collaboration - Winning Spirit - High Performance\nAt Boston Scientific, we’ll give you the opportunity to harness all that’s within you by working in teams of diverse and high-performing employees, tackling some of the most important health industry challenges. With access to the latest tools, information and training, we’ll help you in advancing your skills and career. Here, you’ll be supported in progressing – whatever your ambitions.\n\nJob description:\nSupport in the day-to-day activities of the company's engineering department:\nCharacterization of processes.\nWriting procedures.\nSupport in the various functions of the engineering department.\n\nJob requirement:\nA bachelor's degree student in a mechanical engineering with two years remaining before graduation.\nProficient in Microsoft Office\nHigh level English.\nWillingness to commit to a minimum of two working days per week during the study period.\n\nRequisition ID: 559906\n\nAs a leader in medical science for more than 40 years, we are committed to solving the challenges that matter most – united by a deep caring for human life. Our mission to advance science for life is about transforming lives through innovative medical solutions that improve patient lives, create value for our customers, and support our employees and the communities in which we operate. Now more than ever, we have a responsibility to apply those values to everything we do – as a global business and as a global corporate citizen.\n\nSo, choosing a career with Boston Scientific (NYSE: BSX) isn’t just business, it’s personal. And if you’re a natural problem-solver with the imagination, determination, and spirit to make a meaningful difference to people worldwide, we encourage you to apply and look forward to connecting with you!\n\nJob Segment: Mechanical Engineer, Engineer, Intern, Engineering, Entry LevelShow more Report"}, {"company": "Boston Scientific Corporation", "job": "Project Manager", "city": "Israel", "date": "1 day ago", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=117&ao=1136043&s=58&guid=00000186e63db8868ae1ac31b3e65af8&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_53fa169d&cb=1678900218223&jobListingId=1008526996118&jrtk=3-1-1grj40i97mfpq801-1grj3re8hi9he800-d127ff4cebee0494-", "description": "Project Manager\nBoston Scientific's hybrid workplace includes remote and onsite roles. By applying to this position, you will have the opportunity to discuss your preferred working location with your Talent Acquisition Specialist.\nRemote Eligible: Onsite\nOnsite Location(s):\nYokneam, IL\nAdditional Location(s): Israel-Yokneam; N/A\nDiversity - Innovation - Caring - Global Collaboration - Winning Spirit - High Performance\nAt Boston Scientific, we’ll give you the opportunity to harness all that’s within you by working in teams of diverse and high-performing employees, tackling some of the most important health industry challenges. With access to the latest tools, information and training, we’ll help you in advancing your skills and career. Here, you’ll be supported in progressing – whatever your ambitions.\n\nAbout the role:\nWe are looking for a talented business leader to join our UroPH PMO team. We have an exciting opportunity for a Program Manager I that will lead and facilitate integration and sustaining engineering activities within the Urology and Pelvic Health (UroPH) division tied to our new Lumenis acquisition. In this role, you will collaborate cross-functionally and across international sites to lead teams and projects that are critical to business goals. These projects will have high level organizational visibility. We are seeking an experienced candidate who has demonstrated project management experience and a technical background. Prior experience across multiple functional areas, prior integration experience or experience across multiple quality systems is beneficial to this role.\n\nYour Responsibilities Include\nLead cross-functional project team(s) comprised of R&D, Operations, Regulatory, and Quality organizations. Work includes ensuring scope of work, costs, schedules, and risks are properly planned, resourced, and managed.\nSupport development, implementation, and revision of detailed project plans, including deliverable lists, risk management, communication plans, etc.\nBuild team ownership and commitment to project plan and identify, manage, and communicate project risks.\nPrioritize, delegate, and manage tasks among team members, as appropriate, to drive execution of project deliverables and minimize risk.\nInteract with internal stakeholders, by meeting regularly, responding to requests and explaining procedures.\nReport out and up project progress and status including presenting to the Franchise Leadership Team.\nPotentially provide PM support for product-specific integration projects related to the Lumenis acquisition. If so, ensure the technical and regulatory integrity of the program and its verification and validation work and design reviews. Develop content that is in compliant with EU MDR, US FDA and global regulatory requirements, and all relevant BSC QS requirements.\nLeads team to the successful completion of project goals.\nMentorship of junior project managers\n\nRequisition ID: 558794\n\nAs a leader in medical science for more than 40 years, we are committed to solving the challenges that matter most – united by a deep caring for human life. Our mission to advance science for life is about transforming lives through innovative medical solutions that improve patient lives, create value for our customers, and support our employees and the communities in which we operate. Now more than ever, we have a responsibility to apply those values to everything we do – as a global business and as a global corporate citizen.\n\nSo, choosing a career with Boston Scientific (NYSE: BSX) isn’t just business, it’s personal. And if you’re a natural problem-solver with the imagination, determination, and spirit to make a meaningful difference to people worldwide, we encourage you to apply and look forward to connecting with you!\n\nAt Boston Scientific, we recognize that nurturing a diverse and inclusive workplace helps us be more innovative and it is important in our work of advancing science for life and improving patient health. That is why we stand for inclusion, equality, and opportunity for all. By embracing the richness of our unique backgrounds and perspectives, we create a better, more rewarding place for our employees to work and reflect the patients, customers, and communities we serve. Boston Scientific is proud to be an equal opportunity and affirmative action employer.\n\nBoston Scientific maintains a drug-free workplace. Pursuant to Va. Code § 2.2-4312 (2000), Boston Scientific is providing notification that the unlawful manufacture, sale, distribution, dispensation, possession, or use of a controlled substance or marijuana is prohibited in the workplace and that violations will result in disciplinary action up to and including termination.\n\nPlease be advised that certain US based positions, including without limitation field sales and service positions that call on hospitals and/or health care centers, require acceptable proof of COVID-19 vaccination status. Candidates will be notified during the interview and selection process if the role(s) for which they have applied require proof of vaccination as a condition of employment. Boston Scientific continues to evaluate its policies and protocols regarding the COVID-19 vaccine and will comply with all applicable state and federal law and healthcare credentialing requirements. As employees of the Company, you will be expected to meet the ongoing requirements for your roles, including any new requirements, should the Company’s policies or protocols change with regard to COVID-19 vaccination.\n\nJob Segment: R&D Engineer, Project Manager, R&D, Urology, Law, Engineering, Technology, Research, Healthcare, LegalShow more Report"}, {"company": "Boston Scientific Corporation", "job": "Associate Project Manager", "city": "Israel", "date": "16d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=118&ao=1136043&s=58&guid=00000186e63db8868ae1ac31b3e65af8&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_a1d37323&cb=1678900219410&jobListingId=1008495260330&jrtk=3-1-1grj40jdgk613801-1grj3re8hi9he800-a7d8220dcdc3fa5e-", "description": "Associate Project Manager\nBoston Scientific's hybrid workplace includes remote and onsite roles. By applying to this position, you will have the opportunity to discuss your preferred working location with your Talent Acquisition Specialist.\nRemote Eligible: Onsite\nOnsite Location(s):\nYokneam, IL\nAdditional Location(s): N/A\nDiversity - Innovation - Caring - Global Collaboration - Winning Spirit - High Performance\nAt Boston Scientific, we’ll give you the opportunity to harness all that’s within you by working in teams of diverse and high-performing employees, tackling some of the most important health industry challenges. With access to the latest tools, information and training, we’ll help you in advancing your skills and career. Here, you’ll be supported in progressing – whatever your ambitions.\n\nWe are looking for a talented Associate Project Manager to join our Urology PMO team. We have an exciting opportunity for an Associate Project Manager that will lead and facilitate sustaining engineering activities within the Urology division tied to our new Lumenis acquisition. In this role, you will collaborate cross-functionally and across international sites to lead teams and projects that are critical to business goals. These projects will have high level organizational visibility. We are seeking a candidate who has demonstrated project management experience and a technical background.\nYour Responsibilities Include\nLead cross-functional project team(s), ensuring scope of work, costs, schedules, and risks are properly planned, resourced, and managed.\nSupport development, implementation, and revision of detailed project plans.\nPrioritize, delegate, and manage tasks among team members, as appropriate, to drive execution of project deliverables and minimize risk.\nBuild team ownership and commitment to project plan and identify, manage, and communicate project risks.\nInteract with internal stakeholders, by meeting regularly, responding to requests and explaining procedures.\nReport out and up project progress and status including presenting to the Franchise Leadership Team.\n\nWhat we’re looking for:\nMinimum Qualifications\nBachelor’s Degree in business or related field\n3 – 5 years of relevant experience\nProject management experience leading cross functional teams and managing project scope, schedule, and budget\nStrong cross-functional communication, organization, influencing and problem-solving skills.\nResults-oriented, positive attitude focused on delivering timely, accurate and best in class execution\nProficiency in MS Office applications\nAbility to draw conclusions and make recommendations based on technical inputs from multiple and varied sources.\nExcellent time management, organizational and prioritization skills.\n\nPreferred Qualifications\nExperience in the medical device industry\nExperience with Laser Capital Equipment, hardware, and/or systems\nDemonstrated ability to lead small and medium cross-functional teams as a Project Manager.\nProficiency in MS Project\n\nRequisition ID: 558458\n\nAs a leader in medical science for more than 40 years, we are committed to solving the challenges that matter most – united by a deep caring for human life. Our mission to advance science for life is about transforming lives through innovative medical solutions that improve patient lives, create value for our customers, and support our employees and the communities in which we operate. Now more than ever, we have a responsibility to apply those values to everything we do – as a global business and as a global corporate citizen.\n\nSo, choosing a career with Boston Scientific (NYSE: BSX) isn’t just business, it’s personal. And if you’re a natural problem-solver with the imagination, determination, and spirit to make a meaningful difference to people worldwide, we encourage you to apply and look forward to connecting with you!\n\nAt Boston Scientific, we recognize that nurturing a diverse and inclusive workplace helps us be more innovative and it is important in our work of advancing science for life and improving patient health. That is why we stand for inclusion, equality, and opportunity for all. By embracing the richness of our unique backgrounds and perspectives, we create a better, more rewarding place for our employees to work and reflect the patients, customers, and communities we serve. Boston Scientific is proud to be an equal opportunity and affirmative action employer.\n\nBoston Scientific maintains a drug-free workplace. Pursuant to Va. Code § 2.2-4312 (2000), Boston Scientific is providing notification that the unlawful manufacture, sale, distribution, dispensation, possession, or use of a controlled substance or marijuana is prohibited in the workplace and that violations will result in disciplinary action up to and including termination.\n\nPlease be advised that certain US based positions, including without limitation field sales and service positions that call on hospitals and/or health care centers, require acceptable proof of COVID-19 vaccination status. Candidates will be notified during the interview and selection process if the role(s) for which they have applied require proof of vaccination as a condition of employment. Boston Scientific continues to evaluate its policies and protocols regarding the COVID-19 vaccine and will comply with all applicable state and federal law and healthcare credentialing requirements. As employees of the Company, you will be expected to meet the ongoing requirements for your roles, including any new requirements, should the Company’s policies or protocols change with regard to COVID-19 vaccination.\n\nJob Segment: Project Manager, R&D Engineer, R&D, Medical Device, Urology, Technology, Engineering, Research, HealthcareShow more Report"}, {"company": "Boston Scientific Corporation", "job": "Principal Regulatory Affairs Specialist", "city": "Israel", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=119&ao=1136043&s=58&guid=00000186e63db8868ae1ac31b3e65af8&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_282e9ae1&cb=1678900220563&jobListingId=1007959075834&jrtk=3-1-1grj40kia28ur001-1grj3re8hi9he800-fc8e5c52ca76b03a-", "description": "Principal Regulatory Affairs Specialist\nBoston Scientific's hybrid workplace includes remote and onsite roles. By applying to this position, you will have the opportunity to discuss your preferred working location with your Talent Acquisition Specialist.\nRemote Eligible: Hybrid\nOnsite Location(s):\nYokneam, IL\nDiversity - Innovation - Caring - Global Collaboration - Winning Spirit - High Performance\nAt Boston Scientific, we’ll give you the opportunity to harness all that’s within you by working in teams of diverse and high-performing employees, tackling some of the most important health industry challenges. With access to the latest tools, information and training, we’ll help you in advancing your skills and career. Here, you’ll be supported in progressing – whatever your ambitions.\n\nWe as Boston Scientific are expanding our Regulatory Affairs team in Israel ( Yokneam) due to our growth and the acquisition of Lumenis Israel- Medical Lasers.\nThat's why we are recruiting for a Principal Regulatory Affairs Specialist\n\nAbout this role as Principal Regulatory Affairs Specialist- Israel:\nResponsible for Regulatory Affairs support of submissions and on going regulatory compliance for product development process.\n\nYour key responsibilities will be:\nReviews and signs-off on product design control documentation for compliance with applicable regulations.\nProvides technical/regulatory guidance to cross-functional teams.\nActs as company representative, developing and maintaining positive relationships with device reviewers through oral and written communications regarding pre-submission strategy/regulatory pathway development, testing requirements, clarification and follow-up of submissions under review.\nDevelops and implements regulatory strategies for modified products.\nActs as a core member on manufacturing and remediation teams, providing regulatory feedback and guidance throughout the program, and coordinating team inputs for submissions.\nResponsible for preparation and submission of global regulatory applications, as well as internal regulatory file documentation.\nReviews and signs-off on product and manufacturing changes for compliance with applicable regulations.\nEstablish and support a work environment of continuous improvement that supports BSC’s Quality Policy, Quality System and the appropriate regulations for the area they support. Ensure employees are trained to do their work and their training is documented.\n\nWho are we looking for:\nBachelor’s degree or equivalent work experience, preferably in a scientific or technical discipline\n8+ years Regulatory Affairs experience, medical device experience required\nWorking knowledge of design control documentation/requirements required\nWorking knowledge of FDA and international regulations\nGeneral understanding of product development process\nWorking knowledge of regulatory requirements for implantable, capital equipment and single use disposable devices\nAbility to manage several projects\nProficiency with Microsoft Office\nEffective research and analytical skills\nEffective written and oral communication, technical writing and editing skills\nAbility to work independently with minimal supervision\nLanguage skills: English and Hebrew\n\nQuality System Requirements:\nIn all actions, demonstrates a primary commitment to patient safety and product quality by maintaining compliance to the Quality Policy and all other documented quality processes and procedures.\nAssures that appropriate resources (personnel, tools, etc.) are maintained in order to assure Quality System compliance and adherence to the BSC Quality Policy.\nEstablishes and promotes a work environment that supports the Quality Policy and Quality System.\nRequisition ID: 532619\n\nAs a leader in medical science for more than 40 years, we are committed to solving the challenges that matter most – united by a deep caring for human life. Our mission to advance science for life is about transforming lives through innovative medical solutions that improve patient lives, create value for our customers, and support our employees and the communities in which we operate. Now more than ever, we have a responsibility to apply those values to everything we do – as a global business and as a global corporate citizen.\n\nSo, choosing a career with Boston Scientific (NYSE: BSX) isn’t just business, it’s personal. And if you’re a natural problem-solver with the imagination, determination, and spirit to make a meaningful difference to people worldwide, we encourage you to apply and look forward to connecting with you!\n\nAt Boston Scientific, we recognize that nurturing a diverse and inclusive workplace helps us be more innovative and it is important in our work of advancing science for life and improving patient health. That is why we stand for inclusion, equality, and opportunity for all. By embracing the richness of our unique backgrounds and perspectives, we create a better, more rewarding place for our employees to work and reflect the patients, customers, and communities we serve. Boston Scientific is proud to be an equal opportunity and affirmative action employer.\n\nBoston Scientific maintains a drug-free workplace. Pursuant to Va. Code § 2.2-4312 (2000), Boston Scientific is providing notification that the unlawful manufacture, sale, distribution, dispensation, possession, or use of a controlled substance or marijuana is prohibited in the workplace and that violations will result in disciplinary action up to and including termination.\n\nPlease be advised that certain US based positions, including without limitation field sales and service positions that call on hospitals and/or health care centers, require acceptable proof of COVID-19 vaccination status. Candidates will be notified during the interview and selection process if the role(s) for which they have applied require proof of vaccination as a condition of employment. Boston Scientific continues to evaluate its policies and protocols regarding the COVID-19 vaccine and will comply with all applicable state and federal law and healthcare credentialing requirements. As employees of the Company, you will be expected to meet the ongoing requirements for your roles, including any new requirements, should the Company’s policies or protocols change with regard to COVID-19 vaccination.\n\nJob Segment: Regulatory Affairs, Compliance, Law, Medical Device, Technical Writer, Legal, Healthcare, TechnologyShow more Report"}, {"company": "AllStars-IT", "job": "Help Desk Specialist", "city": "Israel", "date": "30d+", "rating": "4.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=120&ao=1136043&s=58&guid=00000186e63db8868ae1ac31b3e65af8&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_c784f4ed&cb=1678900221737&jobListingId=1008292062754&jrtk=3-1-1grj40llvp2kq801-1grj3re8hi9he800-68f97fff1b82781a-", "description": "Help Desk Specialist\nLevel\nJunior\nDepartment\nOther IT Positions\nType\nFull Time\nProject\nRafael\nLocations:\nIsrael\nJob Details\nPosted on:\nSeptember 26, 2022\nJob ID:\n2687\nAbout the Company\nHeadquarters in Warsaw, Poland, AllSTARSIT operates development hubs across the whole CEE Region (Poland, Ukraine, Czech Republic, Romania, and Bulgaria), Israel, and Dubai. Additionally, AllSTARSIT has Tech Customer Support offices in the LATAM region, with an HQ in Colombia. The company has over 800+ talented Software Engineers and Tech Specialists spread across all locations.\n\nAllSTARSIT is an international Software R&D, Technical Support, and Talent Acquisition service provider established in 2004. The company specializes in software development services for clients across industries as diverse as cybersecurity, healthcare, fintech, telecommunications, media, and more.\nAbout the Project\nRafael Advanced Defense Systems Ltd. is synonymous with dynamic defense, daring innovation, and technological ingenuity. For over 70 years, the company has pioneered advances in defense solutions for air, land, sea, space, and cyber. Our innovations are based on extensive operational experience and understanding of evolving combat requirements. They enable the rapid development of effective solutions for complex challenges on a variety of fronts.\nAlways ahead ‒ we ensure ongoing advantages for our global client base. We are dedicated to continuously enhancing our customer service, as well as expanding our global industrial cooperation programs.\nSpecialization\nDefense Systems and Cyber Security\nHeadquarters\nIsrael\nRequired skills:\nAt least one year of experience in providing service and handling customers in a technical telephone support center (and/or relevant military experience)\nWillingness to work long term\nAbility to provide service and high motivation for the position\nScope of work:\nA little about the role:\nTelephone support representative at the service center and support for computing issues\nAnswering and handling end user faults and application support\nWorking hours 7:50-16:50, including overtime work\nWhy should you join us?\nAn opportunity to join a young and high-quality team, high-level training, good conditions and development opportunities!\nWhy AllSTARSIT?\nFlexible working model: work from anywhere or choose one of our offices in Warsaw, Kyiv, Lviv, Prague, Bogotá, or Dubai, or premium co-working spaces with luxury amenities in 23 cities around the world.\n\n\nLearning & Development program: we offer a team of senior developers, mentorship program, individual budget for self-education, free English, Spanish, and Polish courses, English for kids, regular tech & educational meetups, ability to become a meetup speaker, and online course subscriptions, among other perks and opportunities.\n\n\nWellness program: extended medical insurance, yoga & stretching, personal psychologist, sport/hobby compensation, Covid-19/flu vaccination, rewarding culture, and unique corporate gifts.\n\n\nBalanced lifestyle: workation programs, memorable corporate parties abroad, team building activities, Happy Fridays, family events, and charity events.Show more Report"}, {"company": "Boston Scientific Corporation", "job": "Therapy Development Manager", "city": "Israel", "date": "15d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=121&ao=1136043&s=58&guid=00000186e63db8868ae1ac31b3e65af8&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_9a7552a5&cb=1678900222946&jobListingId=1008497495243&jrtk=3-1-1grj40ms2kcmm801-1grj3re8hi9he800-1578af36b4a4137f-", "description": "Therapy Development Manager\nBoston Scientific's hybrid workplace includes remote and onsite roles. By applying to this position, you will have the opportunity to discuss your preferred working location with your Talent Acquisition Specialist.\nRemote Eligible: Onsite\nOnsite Location(s):\nYokneam, IL\nDiversity - Innovation - Caring - Global Collaboration - Winning Spirit - High Performance\nAt Boston Scientific, we’ll give you the opportunity to harness all that’s within you by working in teams of diverse and high-performing employees, tackling some of the most important health industry challenges. With access to the latest tools, information and training, we’ll help you in advancing your skills and career. Here, you’ll be supported in progressing – whatever your ambitions.\n\nThe Clinical Development Manager will be responsible for pre- and post-market activities of the Laser Urology portfolio. He will be responsible to execute various activities through the product lifecycle.\nThe Therapy Development Manager plays a critical role in bringing new solutions to the market, educating the Urology community on their value, and bringing feedback to R&D on future needs. This role requires forming and cultivating strong collaborative relationships between different stakeholders including R&D, Marketing, Clinical Sciences and Market Development, both in Israel and globally.\n\nResponsibilities:\nSupport all bench and pre-clinical trials of R&D projects (PDP and Research projects) including:\nPlan and execute lab, In vitro, and ex-vivo testing for product feasibility, POC, testing, and data generation\nPlan and execute state of the art bench models, tools, and techniques in an innovative lab to support all testing needs\nEstablish and execute pre-clinical, cadavers, and clinical testing plan required for each product, with the multidisciplinary team including coordination, physician engagement, protocol preparation.\nExecute validation planning, clinical user need validation in simulated environment\nPlan, promote or execute clinical activities (study grants, ISR and IST) following company SOPs to support global evidence generation of laser franchise products\nDevelop KOL engagement strategy in collaboration with the marketing team\nSupport marketing/commercial activities from the scientific/medical point of view in strategic thinking, planning and execution including:\nSupport the writing and review of marketing materials and white papers\nContact person for any communication with leading physicians, KOLs and consultants\nLiterature search and clinical publication supporting materials\nActive participation in scientific meetings / lectures / congresses.\nRequirements:\nPhD/MD (preferable) or Master’s degree in life sciences- required\n3+ years research experience in industry or academic environment (hands-on)\nOutstanding interpersonal skills including developing relationships inside and outside of the organization including cross-cultural relationships\nExcellent project management/execution and organizational skills\nFluent English (written and spoken)\nTravel (15%); Global\nRequisition ID: 559422\n\nAs a leader in medical science for more than 40 years, we are committed to solving the challenges that matter most – united by a deep caring for human life. Our mission to advance science for life is about transforming lives through innovative medical solutions that improve patient lives, create value for our customers, and support our employees and the communities in which we operate. Now more than ever, we have a responsibility to apply those values to everything we do – as a global business and as a global corporate citizen.\n\nSo, choosing a career with Boston Scientific (NYSE: BSX) isn’t just business, it’s personal. And if you’re a natural problem-solver with the imagination, determination, and spirit to make a meaningful difference to people worldwide, we encourage you to apply and look forward to connecting with you!\n\nJob Segment: Marketing Manager, PLM, Project Manager, Urology, Marketing, Technology, Management, Healthcare, ResearchShow more Report"}, {"company": "Boston Scientific Corporation", "job": "Labeling Specialist", "city": "Israel", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=122&ao=1136043&s=58&guid=00000186e63db8868ae1ac31b3e65af8&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_5e9e10a6&cb=1678900224381&jobListingId=1007818276009&jrtk=3-1-1grj40o8qjm61801-1grj3re8hi9he800-828ec9d1dc247c94-", "description": "Labeling Specialist\nBoston Scientific's hybrid workplace includes remote and onsite roles. By applying to this position, you will have the opportunity to discuss your preferred working location with your Talent Acquisition Specialist.\nRemote Eligible: Hybrid\nOnsite Location(s):\nYokneam, IL\nAdditional Locations: N/A\nDiversity - Innovation - Caring - Global Collaboration - Winning Spirit - Caring - High Performance\nAt Boston Scientific, we’ll give you the opportunity to harness all that’s within you by working in teams of diverse and high-performing employees, tackling some of the most important health industry challenges. With access to the latest tools, information and training, we’ll help you in advancing your skills and career. Here, you’ll be supported in progressing – whatever your ambitions.\n\nJob Title: Labeling Specialist\n\nAbout the role:\nThe primary mission for this Labeling Specialist is to plan, manage, and direct the creation/revision of product literature and labeling. The Labeling Specialist works closely with project teams to ensure labeling content is developed per all applicable procedures. They develop schedules and ensure labeling deliverables are executed accordingly while maintaining a high standard of quality. The Labeling Specialist is the resident expert and primary point of contact for all things related to product literature and labeling.\nYour responsibilities include:\nImplement product labeling.\nCoordinate implementation/release activities of labeling deliverables.\nResponsible for coordination of all product labeling deliverables (will vary by project), including labels, IFUs/DFUs, and carton and pouch artwork, etc.\nManage and coordinate creation/revision of deliverables from project initiation through completion.\nAssess the scope of each project and work with team members and project management to create labeling plans and secure necessary resources.\nDevelop deliverable schedules and establish milestones for tracking progress. Ensure on-time completion of deliverables, and communicate project status, challenges, and successes on a regular basis to project and functional management.\nUnderstand and coordinate/monitor completion of key dependencies from other functions.\nMonitor and, when necessary, work with functional and project management to address issues that could negatively impact schedule or quality.\nLead cross functional teams through content development for labeling deliverables by managing the drafts, collecting input and source data, making changes, tracking revisions, and keeping teams on schedule.\nFoster and improve content consistency across labeling.\nFacilitate team reviews of labeling deliverables to ensure content is accurate, complete, fully compliant to relevant regulations and requirements, and meets the needs of the customer.\nCoordinate desktop publishing and labeling artwork generation.\nManage content changes (and mitigate their impact on schedule and consistency) by pushing teams to focus on accuracy and completeness.\nLeverage expertise with labeling procedures, requirements, and quality system to ensure all deliverables are fully compliant and free of errors.\nIdentify and implement opportunities for continuous improvement and innovation.\n\nWhat we’re looking for in you\nAssociate’s Degree\n2+ years’ work experience in regulated industry\nMedical Device experience\n2+ years Labeling experience\nDirect labeling or technical writing experience desired\nBachelor’s degree\nMedical Electrical Equipment / Capital Equipment experience\nAdobe Suite Creative Suite experience strongly preferred\nMS Office and MS Project experience strongly preferred\nProject Management experience\nNiceLabel, Bartender or similar label design software and database experience preferred\n\nSkills required:\nProject management skills\nCollaborator with cross-functional team members\n\nRequisition ID: 531279\n\nAs a leader in medical science for more than 40 years, we are committed to solving the challenges that matter most – united by a deep caring for human life. Our mission to advance science for life is about transforming lives through innovative medical solutions that improve patient lives, create value for our customers, and support our employees and the communities in which we operate. Now more than ever, we have a responsibility to apply those values to everything we do – as a global business and as a global corporate citizen.\n\nSo, choosing a career with Boston Scientific (NYSE: BSX) isn’t just business, it’s personal. And if you’re a natural problem-solver with the imagination, determination, and spirit to make a meaningful difference to people worldwide, we encourage you to apply and look forward to connecting with you!\n\nJob Segment: Technical Writer, Project Manager, Medical Device, Database, Electrical, Technology, Healthcare, EngineeringShow more Report"}, {"company": "Boston Scientific Corporation", "job": "Service Development Engineer", "city": "Israel", "date": "29d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=123&ao=1136043&s=58&guid=00000186e63db8868ae1ac31b3e65af8&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_19d797cf&cb=1678900225395&jobListingId=1008470920687&jrtk=3-1-1grj40p9gghpo801-1grj3re8hi9he800-451d90965c78a97c-", "description": "Service Development Engineer\nBoston Scientific's hybrid workplace includes remote and onsite roles. By applying to this position, you will have the opportunity to discuss your preferred working location with your Talent Acquisition Specialist.\nRemote Eligible: Onsite\nOnsite Location(s):\nYokneam, IL\nAdditional Location(s): N/A\nDiversity - Innovation - Caring - Global Collaboration - Winning Spirit - High Performance\nAt Boston Scientific, we’ll give you the opportunity to harness all that’s within you by working in teams of diverse and high-performing employees, tackling some of the most important health industry challenges. With access to the latest tools, information and training, we’ll help you in advancing your skills and career. Here, you’ll be supported in progressing – whatever your ambitions.\nKey Responsibilities :\n\nProvide support to company subsidiaries, service department, distributors, and service Recondition Center\nImplement and integrate new products\nDefine service processes\nDefine spare parts, tools, testing criteria\nPrepare technical documentation: service manuals, Technical Notes\nTraining-lead a frontal classroom training course including theory and hands-on sessions\nImplement new products in the service field\nTrack faults and malfunctions, perform technical investigations and apply conclusions\nExecute global service and control policy\nInterface between the field and production, R&D, Engineering, QA, to implement product improvements\nMaintain compliance with company policies and procedures\n\nQuality Requirements:\n\nIn all actions, demonstrates a primary commitment to patient safety and product quality by maintaining compliance to the Quality Policy and all other documented quality processes and procedures.\nAssures that appropriate resources (personnel, tools, etc.) are maintained in order to assure Quality System compliance and adherence to the BSC Quality Policy.\nEstablishes and promotes a work environment that supports the Quality Policy and Quality System.\n\nEducation and Experience:\n\n3+ years’ technical experience with capital equipment\nExcellent interpersonal skills\nAbility to work both independently, as well as part of a team\nhigh level of English language\nHighly service-oriented\n\nRequisition ID: 558641\n\nAs a leader in medical science for more than 40 years, we are committed to solving the challenges that matter most – united by a deep caring for human life. Our mission to advance science for life is about transforming lives through innovative medical solutions that improve patient lives, create value for our customers, and support our employees and the communities in which we operate. Now more than ever, we have a responsibility to apply those values to everything we do – as a global business and as a global corporate citizen.\n\nSo, choosing a career with Boston Scientific (NYSE: BSX) isn’t just business, it’s personal. And if you’re a natural problem-solver with the imagination, determination, and spirit to make a meaningful difference to people worldwide, we encourage you to apply and look forward to connecting with you!\n\nAt Boston Scientific, we recognize that nurturing a diverse and inclusive workplace helps us be more innovative and it is important in our work of advancing science for life and improving patient health. That is why we stand for inclusion, equality, and opportunity for all. By embracing the richness of our unique backgrounds and perspectives, we create a better, more rewarding place for our employees to work and reflect the patients, customers, and communities we serve. Boston Scientific is proud to be an equal opportunity and affirmative action employer.\n\nBoston Scientific maintains a drug-free workplace. Pursuant to Va. Code § 2.2-4312 (2000), Boston Scientific is providing notification that the unlawful manufacture, sale, distribution, dispensation, possession, or use of a controlled substance or marijuana is prohibited in the workplace and that violations will result in disciplinary action up to and including termination.\n\nPlease be advised that certain US based positions, including without limitation field sales and service positions that call on hospitals and/or health care centers, require acceptable proof of COVID-19 vaccination status. Candidates will be notified during the interview and selection process if the role(s) for which they have applied require proof of vaccination as a condition of employment. Boston Scientific continues to evaluate its policies and protocols regarding the COVID-19 vaccine and will comply with all applicable state and federal law and healthcare credentialing requirements. As employees of the Company, you will be expected to meet the ongoing requirements for your roles, including any new requirements, should the Company’s policies or protocols change with regard to COVID-19 vaccination.\n\nJob Segment: Engineer, Compliance, QA, Quality Assurance, Engineering, Legal, Quality, TechnologyShow more Report"}, {"company": "Boston Scientific Corporation", "job": "Real-Time Embedded SW Engineer", "city": "Israel", "date": "7d", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=124&ao=1136043&s=58&guid=00000186e63db8868ae1ac31b3e65af8&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_47e42332&cb=1678900226642&jobListingId=1008516166595&jrtk=3-1-1grj40qffmfps801-1grj3re8hi9he800-d55195f77b51a276-", "description": "Real-Time Embedded SW Engineer\nBoston Scientific's hybrid workplace includes remote and onsite roles. By applying to this position, you will have the opportunity to discuss your preferred working location with your Talent Acquisition Specialist.\nRemote Eligible: Onsite\nOnsite Location(s):\nYokneam, IL\nDiversity - Innovation - Caring - Global Collaboration - Winning Spirit - High Performance\nAt Boston Scientific, we’ll give you the opportunity to harness all that’s within you by working in teams of diverse and high-performing employees, tackling some of the most important health industry challenges. With access to the latest tools, information and training, we’ll help you in advancing your skills and career. Here, you’ll be supported in progressing – whatever your ambitions.\nMain Duties:\nResponsible to design, develop and implement embedded software in multidisciplinary systems.\nResponsibility for products software engineering process while maintaining the required standards.\nAnalyzing and enhancing efficiency, stability and scalability of software resources\nA self-employed team player who works in a planned and motivated manner while supervising performance and meeting goals\nApplying mathematics and statistics to problem-solving initiatives.\n\nRequirements:\nM.Sc. /B.Sc. /BA in computer engineering or computer science or electrical engineering\nProven experience with embedded software development (driver and firmware development)\nExperience in development of embedded applications on top of a RTOS\nExperience in development of embedded applications without OS\nDevelopment of hard real time applications\nAt least 5 years of relevant work experience\nExcellent C/C++ programming skills\nMandatory- Knowledge and experience in development communication protocols: SPI, CAN BUS, I2C, RS232 (TCP IP advantage)\n(Advantage) Knowledge and some experience in development with .NET C#\nKnowledge and experience in developing multidisciplinary systems.\nExperience with integration in multidisciplinary systems\nExperience in writing technical documents: SRS, SDD\nExperience with TI multi controllers – preferred\nExperience with ARM and DSP development- preferred\n\nRequisition ID: 560143\n\nAs a leader in medical science for more than 40 years, we are committed to solving the challenges that matter most – united by a deep caring for human life. Our mission to advance science for life is about transforming lives through innovative medical solutions that improve patient lives, create value for our customers, and support our employees and the communities in which we operate. Now more than ever, we have a responsibility to apply those values to everything we do – as a global business and as a global corporate citizen.\n\nSo, choosing a career with Boston Scientific (NYSE: BSX) isn’t just business, it’s personal. And if you’re a natural problem-solver with the imagination, determination, and spirit to make a meaningful difference to people worldwide, we encourage you to apply and look forward to connecting with you!\n\nJob Segment: R&D Engineer, R&D, Software Engineer, Embedded, Electrical Engineering, Engineering, Research, TechnologyReport"}, {"company": "AllStars-IT", "job": "Information Security System Specialist", "city": "Israel", "date": "30d+", "rating": "4.8", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=125&ao=1136043&s=58&guid=00000186e63db8868ae1ac31b3e65af8&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_8a9e13c7&cb=1678900227735&jobListingId=1008078906280&jrtk=3-1-1grj40ri0kf29801-1grj3re8hi9he800-39317e50159412eb-", "description": "Information Security System Specialist\nLevel\nSenior\nDepartment\nOther IT Positions\nType\nFull Time\nProject\nAllSTARSIT\nLocations:\nIsrael\nOffice\nJob Details\nPosted on:\nAugust 18, 2022\nAbout the Company\nHeadquarters in Warsaw, Poland, AllSTARSIT operates development hubs across the whole CEE Region (Poland, Ukraine, Czech Republic, Romania, and Bulgaria), Israel, and Dubai. Additionally, AllSTARSIT has Tech Customer Support offices in the LATAM region, with an HQ in Colombia. The company has over 800+ talented Software Engineers and Tech Specialists spread across all locations.\n\nAllSTARSIT is an international Software R&D, Technical Support, and Talent Acquisition service provider established in 2004. The company specializes in software development services for clients across industries as diverse as cybersecurity, healthcare, fintech, telecommunications, media, and more.\nAbout the Project\nThe Bank offers a range of banking services and products to customers of all banks: loans, mortgages, long and short-term deposits, investments, and more.\nSpecialization\nBanking\nHeadquarters\nIsrael\nYears on the market\nsince 1963\nRequired skills:\nExperience of at least 5 years in the world of the system\nKnowledge of at least 3 years in an Ent organization\nExperience in Microsoft worlds such as:\nOperating systems Microsoft servers WIN 2012/2016/2019 - mandatory\nPractical experience in hardening server operating systems - mandatory\nExtensive experience in GPO worlds - a must\nExperience in IIS environments including hardware - mandatory\nExperience in Tomcat environments is a plus\nExperience in PKI worlds is an advantage\nExperience with antivirus systems - mandatory\nExperience with information security products in general - an advantage\nBackground in automation, scripts such as PS - an advantage\nBackground in Citrix worlds - an advantage\nExperience in writing procedures and work processes - a must\nBackground in VRA\\VROPS worlds - an advantage\nHigh service consciousness, responsibility, and excellent human relations work under pressure with customers and team members\nWhy AllSTARSIT?\nFlexible working model: work from anywhere or choose one of our offices in Warsaw, Kyiv, Lviv, Prague, Bogotá, or Dubai, or premium co-working spaces with luxury amenities in 23 cities around the world.\n\n\nLearning & Development program: we offer a team of senior developers, mentorship program, individual budget for self-education, free English, Spanish, and Polish courses, English for kids, regular tech & educational meetups, ability to become a meetup speaker, and online course subscriptions, among other perks and opportunities.\n\n\nWellness program: extended medical insurance, yoga & stretching, personal psychologist, sport/hobby compensation, Covid-19/flu vaccination, rewarding culture, and unique corporate gifts.\n\n\nBalanced lifestyle: workation programs, memorable corporate parties abroad, team building activities, Happy Fridays, family events, and charity events.Show more Report"}, {"company": "Boston Scientific Corporation", "job": "Verification and Project Engineer", "city": "Israel", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=126&ao=1136043&s=58&guid=00000186e63db8868ae1ac31b3e65af8&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_647f362a&cb=1678900228815&jobListingId=1008123922097&jrtk=3-1-1grj40skancft801-1grj3re8hi9he800-83db298787b6584c-", "description": "Verification and Project Engineer\nBoston Scientific's hybrid workplace includes remote and onsite roles. By applying to this position, you will have the opportunity to discuss your preferred working location with your Talent Acquisition Specialist.\nRemote Eligible: Onsite\nOnsite Location(s):\nYokneam, IL\nAdditional Locations: N/A\nDiversity - Innovation - Caring - Global Collaboration - Winning Spirit - Caring - High Performance\nAt Boston Scientific, we’ll give you the opportunity to harness all that’s within you by working in teams of diverse and high-performing employees, tackling some of the most important health industry challenges. With access to the latest tools, information and training, we’ll help you in advancing your skills and career. Here, you’ll be supported in progressing – whatever your ambitions.\n\n Verification and Project Engineer\n\nMain Duties:\nResponsible of writing Verification Test plan (STP), test protocols (STD) and reporting the results (STR) in accordance with the System Technical Specification.\nResponsible of executing Verification tests (HW, SW), according to Company Standard Operating Procedures.\nResponsible of leading and executing defect reviews committee (DCC), and report on detected defects in ALM system.\nResponsible to develop/update Requirements Traceability Matrix & Verification Summary documents at the end of testing.\nOverall responsibility of reporting the device’s safety and efficacy to the project team.\nResponsible of guiding and training the relevant staff on V&V activities.\nTake part and lead projects in Engineering department\nDesign transfer to production\nCost reduction activities with Procurement department\nLeading quality improvement activities (Design, processes)\nSupporting production (internal and subcontractors)\nECO initiation and management\n\nRequired Qualifications:\nB.Sc. in Electrical Engineering from known College/University - MUST\nExperienced with HW Integration Testing & System Verification in Medical Multidisciplinary Equipment - MUST\nProven Knowledge of testing methodologies and procedures.\nAbility to work on multiple projects simultaneously with tight deadlines.\nFamiliar with testing standards IEC60721, MIL-STD-781, IEC60601-1.\nKnowledge in Power supply design – Advantage\nFamiliar with safety and EMC – Advantage.\nStrong Hands-On, Problem Solver & technical capabilities.\nLeading skills, quick & self-learner and adaptively/agility abilities.\nHigh technical writing and word processing skills.\nTeam Player, highly motivated with ambitions to learn and develop.\nFluent English – both writing and oral.\n\n\nRequisition ID: 531182\n\nAs a leader in medical science for more than 40 years, we are committed to solving the challenges that matter most – united by a deep caring for human life. Our mission to advance science for life is about transforming lives through innovative medical solutions that improve patient lives, create value for our customers, and support our employees and the communities in which we operate. Now more than ever, we have a responsibility to apply those values to everything we do – as a global business and as a global corporate citizen.\n\nSo, choosing a career with Boston Scientific (NYSE: BSX) isn’t just business, it’s personal. And if you’re a natural problem-solver with the imagination, determination, and spirit to make a meaningful difference to people worldwide, we encourage you to apply and look forward to connecting with you!\n\nJob Segment: Project Engineer, Electrical Engineering, Engineer, Technical Writer, Procurement, Engineering, Technology, OperationsShow more Report"}, {"company": "Boston Scientific Corporation", "job": "Project Engineer", "city": "Israel", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=127&ao=1136043&s=58&guid=00000186e63db8868ae1ac31b3e65af8&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_fd7a026a&cb=1678900229951&jobListingId=1008336611939&jrtk=3-1-1grj40tngklt1801-1grj3re8hi9he800-f7d7e7c89b106cdb-", "description": "Project Engineer\nBoston Scientific's hybrid workplace includes remote and onsite roles. By applying to this position, you will have the opportunity to discuss your preferred working location with your Talent Acquisition Specialist.\nRemote Eligible: Onsite\nOnsite Location(s):\nYokneam, IL\nAdditional Locations: N/A\nDiversity - Innovation - Caring - Global Collaboration - Winning Spirit - High Performance\nAt Boston Scientific, we’ll give you the opportunity to harness all that’s within you by working in teams of diverse and high-performing employees, tackling some of the most important health industry challenges. With access to the latest tools, information and training, we’ll help you in advancing your skills and career. Here, you’ll be supported in progressing – whatever your ambitions.\n\n Project Engineer\n\nBasic Job Purpose: Lead engineering activities that support sustaining CO2 laser products\n\nMain Duties:\nECO initiation and management for product improvement or cost reduction\nSupport and implement engineering changes in production lines\nConduct root cause analysis of Electromechanical failures\nConduct testing of alternative sub systems according to verification protocols\nResponsible for implementing V&V procedures, according to the company Standard Operating Procedures\nDesign test tools and write work instructions\nManage process validation activities: IQ/OQ/PQ\n\nRequired Qualifications/skills:\nMechanical / Electrical Engineer\n3-5 years experience as product engineer supporting production lines – preferably electro-mechanical/electro-optical systems\nExperience in medical device companies – an advantage\nFamiliar with testing according to medical standards - advantage\nExperience in CAD tools – an advantage\nProblems solving orientation\nTeam player, Highly motivated with ambitions to learn and develop\nStrong project leadership capability\nMultitasking\nHigh communicational skills in English and Hebrew (written and interpersonal)\nOrganizational : capable working in dynamic & global environment\n\nRequisition ID: 554395\n\nAs a leader in medical science for more than 40 years, we are committed to solving the challenges that matter most – united by a deep caring for human life. Our mission to advance science for life is about transforming lives through innovative medical solutions that improve patient lives, create value for our customers, and support our employees and the communities in which we operate. Now more than ever, we have a responsibility to apply those values to everything we do – as a global business and as a global corporate citizen.\n\nSo, choosing a career with Boston Scientific (NYSE: BSX) isn’t just business, it’s personal. And if you’re a natural problem-solver with the imagination, determination, and spirit to make a meaningful difference to people worldwide, we encourage you to apply and look forward to connecting with you!\n\nJob Segment: Project Engineer, Medical Device Engineer, Electrical Engineering, Drafting, Electrical, EngineeringReport"}, {"company": "Boston Scientific Corporation", "job": "Sustain System Engineer", "city": "Israel", "date": "30d+", "rating": "4.2", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=128&ao=1136043&s=58&guid=00000186e63db8868ae1ac31b3e65af8&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_d2e36a22&cb=1678900231243&jobListingId=1008326148730&jrtk=3-1-1grj40v052hs6001-1grj3re8hi9he800-33c09f49cc9b6288-", "description": "Sustain System Engineer\nBoston Scientific's hybrid workplace includes remote and onsite roles. By applying to this position, you will have the opportunity to discuss your preferred working location with your Talent Acquisition Specialist.\nRemote Eligible: Onsite\nOnsite Location(s):\nYokneam, IL\nAdditional Location(s): N/A\nDiversity - Innovation - Caring - Global Collaboration - Winning Spirit - High Performance\nAt Boston Scientific, we’ll give you the opportunity to harness all that’s within you by working in teams of diverse and high-performing employees, tackling some of the most important health industry challenges. With access to the latest tools, information and training, we’ll help you in advancing your skills and career. Here, you’ll be supported in progressing – whatever your ambitions.\n\nMain Duties:\no Root cause analysis of in-service problems (including operational/safety hazards, parts obsolescence, reliability degradation, field issues, compliance issues, regulatory changes), development of required design changes (ECOs) to resolve those issues.\no Design improvements to improve product field performance or to improve product gross margin. Receive field and production feedback and drive ongoing product improvements, identify opportunities for performance and capability enhancement.\no Interact with New Product Development (NPD) teams to ensure appropriate design inputs/ outputs have been taken into account based on predicate product/field data.\no Support the integration of acquired assets within the laser franchise into the Boston Scientific quality system.\no Provide technical assistance for sales and marketing activities.\no Take major role in problem solving and escalations from customers and within the organization.\no Work in collaboration with Regulatory team to provide and maintain the regulatory design inputs and systems compliance. Own the transfer from regulation/standards to engineering derivatives (impact assessment and deployment).\no Support RA team with new markets registrations and regulatory submissions.\no Definition, writing and management of Design Inputs and flow down for the sustaining products.\no Work with program managers to create and manage project priorities and schedules.\n\nRequirements:\no BSc in Electrical Engineering, Electro-optical Engineering, Mechanical Engineering, Bio-medical Engineering or Computer Engineering from a leading university. Master degree - advantage.\no At least 3 years of experience in system engineering in multidisciplinary projects (HW, Mechanics, SW and Physics).\no Interpersonal skills and excellent teamwork - the ability to meet technical as well as human challenges\no Experience in medical devices' quality system, specifically is Risk management file and Design Inputs.\no Experience in resolving complex system issues and be “hands on” when needed.\no Fluent in Hebrew and English\no Good documentation skills\no Experience in EMC and Safety certifications\no Experience in Imaging / Electro-Optical systems - advantage.\no Experience in a global company – advantage\n\nRequisition ID: 555333\n\nAs a leader in medical science for more than 40 years, we are committed to solving the challenges that matter most – united by a deep caring for human life. Our mission to advance science for life is about transforming lives through innovative medical solutions that improve patient lives, create value for our customers, and support our employees and the communities in which we operate. Now more than ever, we have a responsibility to apply those values to everything we do – as a global business and as a global corporate citizen.\n\nSo, choosing a career with Boston Scientific (NYSE: BSX) isn’t just business, it’s personal. And if you’re a natural problem-solver with the imagination, determination, and spirit to make a meaningful difference to people worldwide, we encourage you to apply and look forward to connecting with you!\n\nAt Boston Scientific, we recognize that nurturing a diverse and inclusive workplace helps us be more innovative and it is important in our work of advancing science for life and improving patient health. That is why we stand for inclusion, equality, and opportunity for all. By embracing the richness of our unique backgrounds and perspectives, we create a better, more rewarding place for our employees to work and reflect the patients, customers, and communities we serve. Boston Scientific is proud to be an equal opportunity and affirmative action employer.\n\nBoston Scientific maintains a drug-free workplace. Pursuant to Va. Code § 2.2-4312 (2000), Boston Scientific is providing notification that the unlawful manufacture, sale, distribution, dispensation, possession, or use of a controlled substance or marijuana is prohibited in the workplace and that violations will result in disciplinary action up to and including termination.\n\nPlease be advised that certain US based positions, including without limitation field sales and service positions that call on hospitals and/or health care centers, require acceptable proof of COVID-19 vaccination status. Candidates will be notified during the interview and selection process if the role(s) for which they have applied require proof of vaccination as a condition of employment. Boston Scientific continues to evaluate its policies and protocols regarding the COVID-19 vaccine and will comply with all applicable state and federal law and healthcare credentialing requirements. As employees of the Company, you will be expected to meet the ongoing requirements for your roles, including any new requirements, should the Company’s policies or protocols change with regard to COVID-19 vaccination.\n\nJob Segment: Biomedical Engineering, Compliance, R&D Engineer, Systems Engineer, R&D, Engineering, Legal, ResearchShow more Report"}, {"company": "", "job": "HR & Office Manager 917631", "city": "Tel Aviv-Yafo", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=129&ao=1136043&s=58&guid=00000186e63db8868ae1ac31b3e65af8&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_3f4cea5f&cb=1678900232473&jobListingId=1007493569958&jrtk=3-1-1grj4106dk27c801-1grj3re8hi9he800-cd22bf1b12b0ab6d-", "description": "Fast growing startup that is revolutionizing the web hosting market is seeking and HR & Office Manager.\n\nThis role has a broad range of responsibilities which is typical of most start-up environments and keeps things interesting! You will be the go-to person for all office and HR matters and also be assigned side projects to support the overall business. Your responsibilities will include: purchasing, bookkeeping, payroll prep, end to end recruitment, employee onboarding, employee lifecycle, employee development, continue to build and support company culture and employee welfare activities, as well as ad-hoc projects.\n\nRequirements\n\nAt least 70% availability (option for full time)\n\nHighly organized\n\nExcellent English & Hebrew verbal and written communication skills\n\nBookkeeping and vendor management experience\n\nExperience navigating contracts and legalities\n\n2+ years of experience as a Talent Acquisition Specialist/HR specialist or similar role\n\nAdvantages\n\nPast experience working in a startup environment\n\nExperience managing startup operations\n\nExperience with hiring R&D positions\n\nHR Degree and/or certifications\n\nDesired Characteristics\n\nTaking ownership\n\nAttention to detail\n\nStrong collaboration skills\n\nPlease send CVs to jobs@rybtech.comShow more Report"}, {"company": "", "job": "Talent Acquisition Specialist - RECRUITER", "city": "Israel", "date": "30d+", "rating": "", "link": "https://www.glassdoor.com/partner/jobListing.htm?pos=130&ao=1136043&s=58&guid=00000186e63db8868ae1ac31b3e65af8&src=GD_JOB_VIEW&t=SR&vt=w&cs=1_62c7732e&cb=1678900233559&jobListingId=1007238400616&jrtk=3-1-1grj4118jncfv801-1grj3re8hi9he800-2cd124143abfa815-", "description": "Position: Talent Acquisition Specialist (1 year contract)\n\nLocation: REMOTE\n\nRequirements:\n\n  2+ years relevant experience, including 1 year as an in-house Recruiter\n\n  Experience in sourcing, qualifying candidates, building pipelines and managing the entire interview process\n\n  Creative recruitment marketing strategies and ideas, ways to build our brand and add value to our social media presence\n\n  Understanding of metrics and data\n\n  Excellent communication and negotiation skills\n\n  Fluent English and strong conversational Hebrew\n\nEmail: jobs@yonah.io\n\nSubject: RECRUITShow more Report"}]